; ModuleID = 'samples/1.bc'
source_filename = "../ngx_lua-0.10.15/src/ngx_http_lua_bodyfilterby.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_http_request_s = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct.ngx_http_headers_in_t, %struct.ngx_http_headers_out_t, ptr, i64, i64, i64, i64, i64, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, i64, ptr, i64, i64, i64, i64, i64, ptr, ptr, ptr, ptr, i112, i64, i64, i64, [32 x i8], ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct.ngx_http_headers_in_t = type { %struct.ngx_list_t, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct.ngx_array_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_array_t, %struct.ngx_str_t, i64, i64, i16 }
%struct.ngx_list_t = type { ptr, %struct.ngx_list_part_s, i64, i64, ptr }
%struct.ngx_list_part_s = type { ptr, i64, ptr }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }

!31 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !25, line: 207, baseType: !33)
!33 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !37, line: 16, baseType: !27)
!37 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6fc45f3cccbbf41b239dcfa9e2c5b7b1")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !39, line: 17, baseType: !34)
!39 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ad64fd7b9f2b4876e8c9dcdeeb2305ce")
!40 = !{!0, !7, !12, !41, !46, !51, !56, !17, !61}
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(scope: null, file: !2, line: 387, type: !43, isLocal: true, isDefinition: true)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 1)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !2, line: 450, type: !48, isLocal: true, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 14)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(scope: null, file: !2, line: 554, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 24)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(scope: null, file: !2, line: 586, type: !58, isLocal: true, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 10)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(scope: null, file: !63, line: 302, type: !64, isLocal: true, isDefinition: true)
!63 = !DIFile(filename: "../ngx_lua-0.10.15/src/ngx_http_lua_util.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "263bda79d27023d44c17ea175243cd3d")
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 28)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_output_body_filter_pt", file: !68, line: 513, baseType: !69)
!68 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "01bbc621c19214151ccc7d6928049534")
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!28, !72, !219}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !74, line: 16, baseType: !75)
!74 = !DIFile(filename: "src/http/ngx_http.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "936639e5730ac898b9486f4f53b5f2f5")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !76, line: 371, size: 11456, elements: !77)
!76 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1757f93ddb5cd3c545713a957f23192d")
!77 = !{!78, !83, !493, !495, !496, !497, !498, !503, !504, !730, !1468, !1469, !1470, !1471, !1513, !1545, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1591, !1602, !1609, !1610, !1612, !1613, !1626, !1627, !1628, !1629, !1630, !1631, !1816, !1820, !1825, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !75, file: !76, line: 372, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !80, line: 26, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !25, line: 42, baseType: !82)
!82 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !75, file: !76, line: 374, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !86, line: 26, baseType: !87)
!86 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1c4d8383f329aa1de050d17038ecb169")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !88, line: 124, size: 1920, elements: !89)
!88 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf513a87e959064e14502903e9282b0e")
!89 = !{!90, !91, !202, !203, !204, !212, !214, !302, !307, !382, !383, !384, !421, !422, !423, !424, !425, !426, !431, !469, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !88, line: 125, baseType: !27, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !87, file: !88, line: 126, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !86, line: 24, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !95, line: 30, size: 768, elements: !96)
!95 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c79f651cc4aca504d9d912404beb8bf3")
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !125, !130, !181, !194}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !95, line: 31, baseType: !27, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !94, file: !95, line: 33, baseType: !82, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !94, file: !95, line: 35, baseType: !82, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !94, file: !95, line: 38, baseType: !82, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !94, file: !95, line: 44, baseType: !82, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !94, file: !95, line: 46, baseType: !82, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !94, file: !95, line: 49, baseType: !82, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !94, file: !95, line: 51, baseType: !82, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !94, file: !95, line: 54, baseType: !82, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !94, file: !95, line: 56, baseType: !82, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !94, file: !95, line: 57, baseType: !82, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !94, file: !95, line: 59, baseType: !82, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !94, file: !95, line: 60, baseType: !82, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !94, file: !95, line: 62, baseType: !82, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !94, file: !95, line: 64, baseType: !82, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !94, file: !95, line: 67, baseType: !82, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !94, file: !95, line: 69, baseType: !82, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !94, file: !95, line: 71, baseType: !82, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !94, file: !95, line: 74, baseType: !82, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !94, file: !95, line: 75, baseType: !82, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "skip_socket_leak_check", scope: !94, file: !95, line: 77, baseType: !82, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !94, file: !95, line: 80, baseType: !82, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !94, file: !95, line: 110, baseType: !82, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !94, file: !95, line: 113, baseType: !121, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !86, line: 32, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !92}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !94, file: !95, line: 120, baseType: !126, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !29, line: 79, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !128, line: 90, baseType: !129)
!128 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!129 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !94, file: !95, line: 122, baseType: !131, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !86, line: 20, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !134, line: 50, size: 640, elements: !135)
!134 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f35895306f847777914ce99ffeccfabd")
!135 = !{!136, !137, !160, !163, !167, !172, !173, !178, !179, !180}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !133, file: !134, line: 51, baseType: !126, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !133, file: !134, line: 52, baseType: !138, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !86, line: 21, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !141, line: 89, size: 320, elements: !142)
!141 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6ae6b72e2fd6bbb6ecc9de2e6386072c")
!142 = !{!143, !146, !155, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !140, file: !141, line: 90, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !145, line: 16, baseType: !34)
!145 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "7b9a751e8c1ad1afef5467d60ed94e69")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 91, baseType: !147, size: 128, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !148, line: 19, baseType: !149)
!148 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "aecf67ab89c624000ba2e2684dbcfdc8")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 16, size: 128, elements: !150)
!150 = !{!151, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !149, file: !148, line: 17, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !153, line: 29, baseType: !129)
!153 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !149, file: !148, line: 18, baseType: !21, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !140, file: !141, line: 93, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !138, !131}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 94, baseType: !27, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !133, file: !134, line: 54, baseType: !161, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !162, line: 98, baseType: !129)
!162 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "eac8f0294f941da9268c3a72c9fca0e1")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !133, file: !134, line: 56, baseType: !164, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !165, line: 10, baseType: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !25, line: 160, baseType: !33)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !133, file: !134, line: 58, baseType: !168, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !134, line: 45, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!21, !131, !21, !152}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !134, line: 59, baseType: !27, size: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !133, file: !134, line: 61, baseType: !174, size: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !134, line: 46, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !131, !126, !21, !152}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !133, file: !134, line: 62, baseType: !27, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !133, file: !134, line: 70, baseType: !35, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !133, file: !134, line: 72, baseType: !131, size: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !94, file: !95, line: 124, baseType: !182, size: 320, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !183, line: 20, baseType: !184)
!183 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ee5b3151c1c48b156833d321f8e1946a")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !183, line: 22, size: 320, elements: !185)
!185 = !{!186, !188, !190, !191, !192, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !184, file: !183, line: 23, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !183, line: 16, baseType: !126)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !184, file: !183, line: 24, baseType: !189, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !184, file: !183, line: 25, baseType: !189, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !184, file: !183, line: 26, baseType: !189, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !184, file: !183, line: 27, baseType: !22, size: 8, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !183, line: 28, baseType: !22, size: 8, offset: 264)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !94, file: !95, line: 127, baseType: !195, size: 128, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !196, line: 16, baseType: !197)
!196 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !196, line: 18, size: 128, elements: !198)
!198 = !{!199, !201}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !197, file: !196, line: 19, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !196, line: 20, baseType: !200, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !87, file: !88, line: 127, baseType: !92, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !87, file: !88, line: 129, baseType: !38, size: 32, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !87, file: !88, line: 131, baseType: !205, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !206, line: 19, baseType: !207)
!206 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!210, !84, !21, !152}
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !23, line: 108, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !25, line: 194, baseType: !33)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !87, file: !88, line: 132, baseType: !213, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !206, line: 22, baseType: !207)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !87, file: !88, line: 133, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !206, line: 20, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!210, !84, !219, !231}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !86, line: 19, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !37, line: 59, size: 128, elements: !222)
!222 = !{!223, !301}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !221, file: !37, line: 60, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !37, line: 18, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !37, line: 20, size: 640, elements: !227)
!227 = !{!228, !229, !230, !233, !234, !235, !236, !237, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !226, file: !37, line: 21, baseType: !21, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !226, file: !37, line: 22, baseType: !21, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !226, file: !37, line: 23, baseType: !231, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !23, line: 87, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !25, line: 153, baseType: !33)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !226, file: !37, line: 24, baseType: !231, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !226, file: !37, line: 26, baseType: !21, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !226, file: !37, line: 27, baseType: !21, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !226, file: !37, line: 28, baseType: !36, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !226, file: !37, line: 29, baseType: !238, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !86, line: 23, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !241, line: 16, size: 1600, elements: !242)
!241 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!242 = !{!243, !244, !245, !283, !284, !285, !286, !287}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !240, file: !241, line: 17, baseType: !144, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !241, line: 18, baseType: !147, size: 128, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !240, file: !241, line: 19, baseType: !246, size: 1152, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !145, line: 17, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !248, line: 26, size: 1152, elements: !249)
!248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!249 = !{!250, !252, !254, !256, !258, !260, !262, !263, !264, !266, !268, !270, !277, !278, !279}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !247, file: !248, line: 31, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !25, line: 145, baseType: !129)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !247, file: !248, line: 36, baseType: !253, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !25, line: 148, baseType: !129)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !247, file: !248, line: 44, baseType: !255, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !25, line: 151, baseType: !129)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !247, file: !248, line: 45, baseType: !257, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !25, line: 150, baseType: !82)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !247, file: !248, line: 47, baseType: !259, size: 32, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !25, line: 146, baseType: !82)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !247, file: !248, line: 48, baseType: !261, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !25, line: 147, baseType: !82)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !247, file: !248, line: 50, baseType: !34, size: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !247, file: !248, line: 52, baseType: !251, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !247, file: !248, line: 57, baseType: !265, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !25, line: 152, baseType: !33)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !247, file: !248, line: 61, baseType: !267, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !25, line: 175, baseType: !33)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !247, file: !248, line: 63, baseType: !269, size: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !25, line: 180, baseType: !33)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !247, file: !248, line: 74, baseType: !271, size: 128, offset: 576)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !272, line: 11, size: 128, elements: !273)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !271, file: !272, line: 16, baseType: !166, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !271, file: !272, line: 21, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !25, line: 197, baseType: !33)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !247, file: !248, line: 75, baseType: !271, size: 128, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !247, file: !248, line: 76, baseType: !271, size: 128, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !247, file: !248, line: 89, baseType: !280, size: 192, offset: 960)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 192, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 3)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !240, file: !241, line: 21, baseType: !231, size: 64, offset: 1344)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !240, file: !241, line: 22, baseType: !231, size: 64, offset: 1408)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !240, file: !241, line: 24, baseType: !131, size: 64, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !240, file: !241, line: 37, baseType: !82, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !240, file: !241, line: 38, baseType: !82, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !226, file: !37, line: 30, baseType: !224, size: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !226, file: !37, line: 34, baseType: !82, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !226, file: !37, line: 40, baseType: !82, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !226, file: !37, line: 43, baseType: !82, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !226, file: !37, line: 45, baseType: !82, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !226, file: !37, line: 46, baseType: !82, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !226, file: !37, line: 47, baseType: !82, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !226, file: !37, line: 48, baseType: !82, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !226, file: !37, line: 49, baseType: !82, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !226, file: !37, line: 50, baseType: !82, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !226, file: !37, line: 52, baseType: !82, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !226, file: !37, line: 53, baseType: !82, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !226, file: !37, line: 55, baseType: !34, size: 32, offset: 608)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !37, line: 61, baseType: !219, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !87, file: !88, line: 134, baseType: !303, size: 64, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !206, line: 23, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!219, !84, !219, !231}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !87, file: !88, line: 136, baseType: !308, size: 64, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !88, line: 16, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !88, line: 18, size: 2432, elements: !311)
!311 = !{!312, !313, !323, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !340, !341, !342, !343, !344, !345, !348, !349, !350, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !310, file: !88, line: 19, baseType: !38, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !310, file: !88, line: 21, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !316, line: 180, size: 128, elements: !317)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!317 = !{!318, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !315, file: !316, line: 182, baseType: !319, size: 16)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !320, line: 28, baseType: !321)
!320 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!321 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !315, file: !316, line: 183, baseType: !48, size: 112, offset: 16)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !310, file: !88, line: 22, baseType: !324, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !31, line: 274, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !25, line: 210, baseType: !82)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !310, file: !88, line: 23, baseType: !152, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !310, file: !88, line: 24, baseType: !147, size: 128, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !310, file: !88, line: 26, baseType: !34, size: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !310, file: !88, line: 28, baseType: !34, size: 32, offset: 416)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !310, file: !88, line: 29, baseType: !34, size: 32, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !310, file: !88, line: 30, baseType: !34, size: 32, offset: 480)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !310, file: !88, line: 32, baseType: !34, size: 32, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !310, file: !88, line: 33, baseType: !34, size: 32, offset: 544)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !310, file: !88, line: 34, baseType: !34, size: 32, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !310, file: !88, line: 38, baseType: !336, size: 64, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !86, line: 33, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !84}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !310, file: !88, line: 40, baseType: !27, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !310, file: !88, line: 42, baseType: !132, size: 640, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !310, file: !88, line: 43, baseType: !131, size: 64, offset: 1408)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !310, file: !88, line: 45, baseType: !152, size: 64, offset: 1472)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !310, file: !88, line: 47, baseType: !152, size: 64, offset: 1536)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !310, file: !88, line: 49, baseType: !346, size: 64, offset: 1600)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !347, line: 16, baseType: !187)
!347 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!348 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !310, file: !88, line: 51, baseType: !308, size: 64, offset: 1664)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !310, file: !88, line: 52, baseType: !84, size: 64, offset: 1728)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !310, file: !88, line: 54, baseType: !351, size: 192, offset: 1792)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !183, line: 32, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !183, line: 37, size: 192, elements: !353)
!353 = !{!354, !355, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !352, file: !183, line: 38, baseType: !189, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !352, file: !183, line: 39, baseType: !189, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !352, file: !183, line: 40, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !183, line: 34, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !189, !189, !189}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !310, file: !88, line: 55, baseType: !182, size: 320, offset: 1984)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !310, file: !88, line: 57, baseType: !126, size: 64, offset: 2304)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !310, file: !88, line: 59, baseType: !82, size: 1, offset: 2368, flags: DIFlagBitField, extraData: i64 2368)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !310, file: !88, line: 60, baseType: !82, size: 1, offset: 2369, flags: DIFlagBitField, extraData: i64 2368)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !310, file: !88, line: 61, baseType: !82, size: 1, offset: 2370, flags: DIFlagBitField, extraData: i64 2368)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !310, file: !88, line: 63, baseType: !82, size: 1, offset: 2371, flags: DIFlagBitField, extraData: i64 2368)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !310, file: !88, line: 64, baseType: !82, size: 1, offset: 2372, flags: DIFlagBitField, extraData: i64 2368)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !310, file: !88, line: 65, baseType: !82, size: 1, offset: 2373, flags: DIFlagBitField, extraData: i64 2368)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !310, file: !88, line: 66, baseType: !82, size: 1, offset: 2374, flags: DIFlagBitField, extraData: i64 2368)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !310, file: !88, line: 67, baseType: !82, size: 1, offset: 2375, flags: DIFlagBitField, extraData: i64 2368)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !310, file: !88, line: 68, baseType: !82, size: 1, offset: 2376, flags: DIFlagBitField, extraData: i64 2368)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !310, file: !88, line: 69, baseType: !82, size: 1, offset: 2377, flags: DIFlagBitField, extraData: i64 2368)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !310, file: !88, line: 70, baseType: !82, size: 1, offset: 2378, flags: DIFlagBitField, extraData: i64 2368)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !310, file: !88, line: 73, baseType: !82, size: 1, offset: 2379, flags: DIFlagBitField, extraData: i64 2368)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !310, file: !88, line: 75, baseType: !82, size: 1, offset: 2380, flags: DIFlagBitField, extraData: i64 2368)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !310, file: !88, line: 76, baseType: !82, size: 1, offset: 2381, flags: DIFlagBitField, extraData: i64 2368)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !310, file: !88, line: 77, baseType: !82, size: 2, offset: 2382, flags: DIFlagBitField, extraData: i64 2368)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !310, file: !88, line: 79, baseType: !82, size: 1, offset: 2384, flags: DIFlagBitField, extraData: i64 2368)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !310, file: !88, line: 80, baseType: !82, size: 1, offset: 2385, flags: DIFlagBitField, extraData: i64 2368)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !310, file: !88, line: 81, baseType: !82, size: 1, offset: 2386, flags: DIFlagBitField, extraData: i64 2368)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !310, file: !88, line: 90, baseType: !34, size: 32, offset: 2400)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !87, file: !88, line: 138, baseType: !231, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !87, file: !88, line: 140, baseType: !131, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !87, file: !88, line: 142, baseType: !385, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !86, line: 18, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !388, line: 57, size: 640, elements: !389)
!388 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!389 = !{!390, !398, !399, !400, !401, !408, !420}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !387, file: !388, line: 58, baseType: !391, size: 256)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !388, line: 54, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 49, size: 256, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !392, file: !388, line: 50, baseType: !21, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !392, file: !388, line: 51, baseType: !21, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !392, file: !388, line: 52, baseType: !385, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !392, file: !388, line: 53, baseType: !126, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !387, file: !388, line: 59, baseType: !152, size: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !387, file: !388, line: 60, baseType: !385, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !387, file: !388, line: 61, baseType: !219, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !387, file: !388, line: 62, baseType: !402, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !388, line: 41, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !388, line: 43, size: 128, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !388, line: 44, baseType: !402, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !404, file: !388, line: 45, baseType: !27, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !387, file: !388, line: 63, baseType: !409, size: 64, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !388, line: 32, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !388, line: 34, size: 192, elements: !412)
!412 = !{!413, !418, !419}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !411, file: !388, line: 35, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !388, line: 30, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !27}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !411, file: !388, line: 36, baseType: !27, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !388, line: 37, baseType: !409, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !387, file: !388, line: 64, baseType: !131, size: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !88, line: 144, baseType: !34, size: 32, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !87, file: !88, line: 146, baseType: !314, size: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !87, file: !88, line: 147, baseType: !324, size: 32, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !87, file: !88, line: 148, baseType: !147, size: 128, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !87, file: !88, line: 150, baseType: !147, size: 128, offset: 1088)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !87, file: !88, line: 151, baseType: !427, size: 16, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !428, line: 123, baseType: !429)
!428 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !80, line: 25, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !25, line: 40, baseType: !321)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !87, file: !88, line: 154, baseType: !432, size: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !86, line: 29, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !435, line: 74, size: 704, elements: !436)
!435 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "51639b814b1b55c5b35047c033281672")
!436 = !{!437, !442, !446, !447, !448, !449, !450, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !434, file: !435, line: 75, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !440, line: 184, baseType: !441)
!440 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !440, line: 184, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !434, file: !435, line: 76, baseType: !443, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !440, line: 185, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !440, line: 185, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !434, file: !435, line: 78, baseType: !28, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !434, file: !435, line: 79, baseType: !224, size: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !434, file: !435, line: 80, baseType: !152, size: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !434, file: !435, line: 82, baseType: !336, size: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !434, file: !435, line: 84, baseType: !451, size: 64, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !453, line: 231, baseType: !454)
!453 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "848d42aedd0da44ffda19088217823c7")
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !453, line: 231, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !434, file: !435, line: 85, baseType: !336, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !434, file: !435, line: 87, baseType: !121, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !434, file: !435, line: 88, baseType: !121, size: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !434, file: !435, line: 90, baseType: !22, size: 8, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !434, file: !435, line: 92, baseType: !82, size: 1, offset: 648, flags: DIFlagBitField, extraData: i64 648)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !434, file: !435, line: 93, baseType: !82, size: 1, offset: 649, flags: DIFlagBitField, extraData: i64 648)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !434, file: !435, line: 94, baseType: !82, size: 1, offset: 650, flags: DIFlagBitField, extraData: i64 648)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !434, file: !435, line: 95, baseType: !82, size: 1, offset: 651, flags: DIFlagBitField, extraData: i64 648)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !434, file: !435, line: 96, baseType: !82, size: 1, offset: 652, flags: DIFlagBitField, extraData: i64 648)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !434, file: !435, line: 97, baseType: !82, size: 1, offset: 653, flags: DIFlagBitField, extraData: i64 648)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !434, file: !435, line: 98, baseType: !82, size: 1, offset: 654, flags: DIFlagBitField, extraData: i64 648)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !434, file: !435, line: 99, baseType: !82, size: 1, offset: 655, flags: DIFlagBitField, extraData: i64 648)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !434, file: !435, line: 100, baseType: !82, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 648)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !434, file: !435, line: 101, baseType: !82, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 648)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !87, file: !88, line: 157, baseType: !470, size: 64, offset: 1344)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !86, line: 30, baseType: !472)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !86, line: 30, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !87, file: !88, line: 159, baseType: !314, size: 64, offset: 1408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !87, file: !88, line: 160, baseType: !324, size: 32, offset: 1472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !87, file: !88, line: 162, baseType: !224, size: 64, offset: 1536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !87, file: !88, line: 164, baseType: !195, size: 128, offset: 1600)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !87, file: !88, line: 166, baseType: !161, size: 64, offset: 1728)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !87, file: !88, line: 168, baseType: !126, size: 64, offset: 1792)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !87, file: !88, line: 170, baseType: !82, size: 8, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !87, file: !88, line: 172, baseType: !82, size: 3, offset: 1864, flags: DIFlagBitField, extraData: i64 1856)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !87, file: !88, line: 174, baseType: !82, size: 1, offset: 1867, flags: DIFlagBitField, extraData: i64 1856)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !87, file: !88, line: 175, baseType: !82, size: 1, offset: 1868, flags: DIFlagBitField, extraData: i64 1856)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !87, file: !88, line: 176, baseType: !82, size: 1, offset: 1869, flags: DIFlagBitField, extraData: i64 1856)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !87, file: !88, line: 178, baseType: !82, size: 1, offset: 1870, flags: DIFlagBitField, extraData: i64 1856)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !87, file: !88, line: 179, baseType: !82, size: 1, offset: 1871, flags: DIFlagBitField, extraData: i64 1856)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !87, file: !88, line: 180, baseType: !82, size: 1, offset: 1872, flags: DIFlagBitField, extraData: i64 1856)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !87, file: !88, line: 181, baseType: !82, size: 1, offset: 1873, flags: DIFlagBitField, extraData: i64 1856)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !87, file: !88, line: 183, baseType: !82, size: 1, offset: 1874, flags: DIFlagBitField, extraData: i64 1856)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !87, file: !88, line: 184, baseType: !82, size: 1, offset: 1875, flags: DIFlagBitField, extraData: i64 1856)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !87, file: !88, line: 185, baseType: !82, size: 2, offset: 1876, flags: DIFlagBitField, extraData: i64 1856)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !87, file: !88, line: 186, baseType: !82, size: 2, offset: 1878, flags: DIFlagBitField, extraData: i64 1856)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !87, file: !88, line: 188, baseType: !82, size: 1, offset: 1880, flags: DIFlagBitField, extraData: i64 1856)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !75, file: !76, line: 376, baseType: !494, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !75, file: !76, line: 377, baseType: !494, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !75, file: !76, line: 378, baseType: !494, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !75, file: !76, line: 379, baseType: !494, size: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !75, file: !76, line: 381, baseType: !499, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !76, line: 368, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !72}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !75, file: !76, line: 382, baseType: !499, size: 64, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !75, file: !76, line: 385, baseType: !505, size: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !74, line: 18, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !508, line: 65, size: 4800, elements: !509)
!508 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "04ea2ebc84c597718a4782ab3cabf19d")
!509 = !{!510, !511, !521, !522, !526, !527, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !688, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !507, file: !508, line: 66, baseType: !239, size: 1600)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !507, file: !508, line: 67, baseType: !512, size: 320, offset: 1600)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !513, line: 22, baseType: !514)
!513 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 16, size: 320, elements: !515)
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !514, file: !513, line: 17, baseType: !27, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !514, file: !513, line: 18, baseType: !126, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !514, file: !513, line: 19, baseType: !152, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !514, file: !513, line: 20, baseType: !126, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !514, file: !513, line: 21, baseType: !385, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !507, file: !508, line: 68, baseType: !79, size: 32, offset: 1920)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !507, file: !508, line: 69, baseType: !523, size: 128, offset: 1952)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 16)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !507, file: !508, line: 70, baseType: !523, size: 128, offset: 2080)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !507, file: !508, line: 72, baseType: !528, size: 64, offset: 2240)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !145, line: 18, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !23, line: 49, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !25, line: 149, baseType: !129)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !507, file: !508, line: 73, baseType: !164, size: 64, offset: 2304)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !507, file: !508, line: 74, baseType: !164, size: 64, offset: 2368)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !507, file: !508, line: 75, baseType: !164, size: 64, offset: 2432)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !507, file: !508, line: 76, baseType: !164, size: 64, offset: 2496)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !507, file: !508, line: 77, baseType: !164, size: 64, offset: 2560)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !507, file: !508, line: 79, baseType: !147, size: 128, offset: 2624)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !507, file: !508, line: 80, baseType: !147, size: 128, offset: 2752)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !507, file: !508, line: 81, baseType: !523, size: 128, offset: 2880)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !507, file: !508, line: 83, baseType: !152, size: 64, offset: 3008)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !507, file: !508, line: 84, baseType: !152, size: 64, offset: 3072)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !507, file: !508, line: 85, baseType: !231, size: 64, offset: 3136)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !507, file: !508, line: 86, baseType: !231, size: 64, offset: 3200)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !507, file: !508, line: 88, baseType: !126, size: 64, offset: 3264)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !507, file: !508, line: 89, baseType: !126, size: 64, offset: 3328)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !507, file: !508, line: 90, baseType: !126, size: 64, offset: 3392)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !507, file: !508, line: 91, baseType: !126, size: 64, offset: 3456)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !507, file: !508, line: 93, baseType: !224, size: 64, offset: 3520)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !507, file: !508, line: 95, baseType: !549, size: 64, offset: 3584)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !74, line: 19, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !508, line: 157, size: 1088, elements: !552)
!552 = !{!553, !568, !629, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !687}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !551, file: !508, line: 158, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !508, line: 154, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 145, size: 960, elements: !557)
!557 = !{!558, !559, !560, !561, !564, !565, !566, !567}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !556, file: !508, line: 146, baseType: !351, size: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !556, file: !508, line: 147, baseType: !182, size: 320, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !556, file: !508, line: 148, baseType: !195, size: 128, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !556, file: !508, line: 149, baseType: !562, size: 64, offset: 640)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !162, line: 106, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !161)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !556, file: !508, line: 150, baseType: !562, size: 64, offset: 704)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !508, line: 151, baseType: !231, size: 64, offset: 768)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !556, file: !508, line: 152, baseType: !126, size: 64, offset: 832)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !556, file: !508, line: 153, baseType: !126, size: 64, offset: 896)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !551, file: !508, line: 159, baseType: !569, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !571, line: 59, baseType: !572)
!571 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6137611cd598fa2ecc498e6967a03177")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 34, size: 1600, elements: !573)
!573 = !{!574, !581, !582, !583, !591, !592, !593, !602, !603, !604, !605, !624, !625, !626, !627, !628}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !572, file: !571, line: 35, baseType: !575, size: 128)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !576, line: 21, baseType: !577)
!576 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "56a332e5761f46e2bb83cbdaf8b18a9f")
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !576, line: 16, size: 128, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !577, file: !576, line: 17, baseType: !562, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !577, file: !576, line: 19, baseType: !562, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !572, file: !571, line: 37, baseType: !152, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !572, file: !571, line: 38, baseType: !152, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !572, file: !571, line: 40, baseType: !584, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !571, line: 16, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !571, line: 18, size: 192, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !586, file: !571, line: 19, baseType: !127, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !586, file: !571, line: 20, baseType: !584, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !586, file: !571, line: 21, baseType: !127, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !572, file: !571, line: 41, baseType: !584, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !572, file: !571, line: 42, baseType: !585, size: 192, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !572, file: !571, line: 44, baseType: !594, size: 64, offset: 576)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !571, line: 31, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 25, size: 256, elements: !597)
!597 = !{!598, !599, !600, !601}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !596, file: !571, line: 26, baseType: !126, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !596, file: !571, line: 27, baseType: !126, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !596, file: !571, line: 29, baseType: !126, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !596, file: !571, line: 30, baseType: !126, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !572, file: !571, line: 45, baseType: !126, size: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !572, file: !571, line: 47, baseType: !21, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !572, file: !571, line: 48, baseType: !21, size: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !572, file: !571, line: 50, baseType: !606, size: 512, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !576, line: 37, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !576, line: 24, size: 512, elements: !608)
!608 = !{!609, !611, !612, !613, !623}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !607, file: !576, line: 26, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !607, file: !576, line: 28, baseType: !610, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !607, file: !576, line: 29, baseType: !126, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !607, file: !576, line: 30, baseType: !614, size: 256, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !615, line: 39, baseType: !616)
!615 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !615, line: 35, size: 256, elements: !617)
!617 = !{!618, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !616, file: !615, line: 37, baseType: !619, size: 256)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !616, file: !615, line: 38, baseType: !33, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !607, file: !576, line: 36, baseType: !126, size: 64, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !572, file: !571, line: 52, baseType: !21, size: 64, offset: 1344)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !572, file: !571, line: 53, baseType: !22, size: 8, offset: 1408)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !572, file: !571, line: 55, baseType: !82, size: 1, offset: 1416, flags: DIFlagBitField, extraData: i64 1416)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !572, file: !571, line: 57, baseType: !27, size: 64, offset: 1472)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !572, file: !571, line: 58, baseType: !27, size: 64, offset: 1536)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !551, file: !508, line: 161, baseType: !630, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !241, line: 62, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 50, size: 768, elements: !633)
!633 = !{!634, !635, !636, !638, !643, !645, !647, !648, !649}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !632, file: !241, line: 51, baseType: !147, size: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !632, file: !241, line: 52, baseType: !152, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !632, file: !241, line: 53, baseType: !637, size: 192, offset: 192)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 192, elements: !281)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !632, file: !241, line: 55, baseType: !639, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !241, line: 45, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!346, !27}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !632, file: !241, line: 56, baseType: !644, size: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !241, line: 46, baseType: !640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !632, file: !241, line: 57, baseType: !646, size: 64, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !241, line: 47, baseType: !415)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !632, file: !241, line: 58, baseType: !27, size: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !632, file: !241, line: 60, baseType: !21, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !632, file: !241, line: 61, baseType: !126, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !551, file: !508, line: 163, baseType: !231, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !551, file: !508, line: 164, baseType: !152, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !551, file: !508, line: 166, baseType: !164, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !551, file: !508, line: 168, baseType: !164, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !551, file: !508, line: 170, baseType: !126, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !551, file: !508, line: 171, baseType: !126, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !551, file: !508, line: 172, baseType: !346, size: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !551, file: !508, line: 173, baseType: !346, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !551, file: !508, line: 174, baseType: !346, size: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !551, file: !508, line: 176, baseType: !126, size: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !551, file: !508, line: 177, baseType: !346, size: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !551, file: !508, line: 178, baseType: !346, size: 64, offset: 896)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !551, file: !508, line: 180, baseType: !663, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !665, line: 31, baseType: !666)
!665 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "084646d0d3ecf791b89c14281fd46376")
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !665, line: 37, size: 704, elements: !667)
!667 = !{!668, !669, !679, !684, !685, !686}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !666, file: !665, line: 38, baseType: !27, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !666, file: !665, line: 39, baseType: !670, size: 384, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !671, line: 22, baseType: !672)
!671 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf27d4781f3b25ce5eb9a764f55ea2d4")
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !671, line: 16, size: 384, elements: !673)
!673 = !{!674, !675, !676, !677, !678}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !672, file: !671, line: 17, baseType: !21, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !672, file: !671, line: 18, baseType: !152, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !671, line: 19, baseType: !147, size: 128, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !672, file: !671, line: 20, baseType: !131, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !672, file: !671, line: 21, baseType: !126, size: 64, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !666, file: !665, line: 40, baseType: !680, size: 64, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !665, line: 33, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!28, !663, !27}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !666, file: !665, line: 41, baseType: !27, size: 64, offset: 512)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !666, file: !665, line: 42, baseType: !27, size: 64, offset: 576)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !666, file: !665, line: 43, baseType: !126, size: 64, offset: 640)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !551, file: !508, line: 182, baseType: !126, size: 64, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !507, file: !508, line: 96, baseType: !689, size: 64, offset: 3648)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !508, line: 62, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 39, size: 960, elements: !692)
!692 = !{!693, !694, !695, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !691, file: !508, line: 40, baseType: !182, size: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !691, file: !508, line: 41, baseType: !195, size: 128, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !691, file: !508, line: 43, baseType: !696, size: 64, offset: 448)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 8)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !691, file: !508, line: 46, baseType: !82, size: 20, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !691, file: !508, line: 47, baseType: !82, size: 10, offset: 532, flags: DIFlagBitField, extraData: i64 512)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !691, file: !508, line: 48, baseType: !82, size: 10, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !691, file: !508, line: 49, baseType: !82, size: 10, offset: 554, flags: DIFlagBitField, extraData: i64 544)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !691, file: !508, line: 50, baseType: !82, size: 1, offset: 564, flags: DIFlagBitField, extraData: i64 544)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !691, file: !508, line: 51, baseType: !82, size: 1, offset: 565, flags: DIFlagBitField, extraData: i64 544)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !691, file: !508, line: 52, baseType: !82, size: 1, offset: 566, flags: DIFlagBitField, extraData: i64 544)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !691, file: !508, line: 53, baseType: !82, size: 1, offset: 567, flags: DIFlagBitField, extraData: i64 544)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !691, file: !508, line: 56, baseType: !528, size: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !691, file: !508, line: 57, baseType: !164, size: 64, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !691, file: !508, line: 58, baseType: !164, size: 64, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !691, file: !508, line: 59, baseType: !152, size: 64, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !691, file: !508, line: 60, baseType: !231, size: 64, offset: 832)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !691, file: !508, line: 61, baseType: !346, size: 64, offset: 896)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !507, file: !508, line: 102, baseType: !346, size: 64, offset: 3712)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !507, file: !508, line: 103, baseType: !346, size: 64, offset: 3776)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !507, file: !508, line: 104, baseType: !346, size: 64, offset: 3840)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !507, file: !508, line: 105, baseType: !346, size: 64, offset: 3904)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !507, file: !508, line: 107, baseType: !93, size: 768, offset: 3968)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !507, file: !508, line: 109, baseType: !82, size: 1, offset: 4736, flags: DIFlagBitField, extraData: i64 4736)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !507, file: !508, line: 110, baseType: !82, size: 1, offset: 4737, flags: DIFlagBitField, extraData: i64 4736)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !507, file: !508, line: 112, baseType: !82, size: 1, offset: 4738, flags: DIFlagBitField, extraData: i64 4736)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !507, file: !508, line: 113, baseType: !82, size: 1, offset: 4739, flags: DIFlagBitField, extraData: i64 4736)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !507, file: !508, line: 114, baseType: !82, size: 1, offset: 4740, flags: DIFlagBitField, extraData: i64 4736)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !507, file: !508, line: 115, baseType: !82, size: 1, offset: 4741, flags: DIFlagBitField, extraData: i64 4736)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !507, file: !508, line: 116, baseType: !82, size: 1, offset: 4742, flags: DIFlagBitField, extraData: i64 4736)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !507, file: !508, line: 117, baseType: !82, size: 1, offset: 4743, flags: DIFlagBitField, extraData: i64 4736)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !507, file: !508, line: 118, baseType: !82, size: 1, offset: 4744, flags: DIFlagBitField, extraData: i64 4736)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !507, file: !508, line: 119, baseType: !82, size: 1, offset: 4745, flags: DIFlagBitField, extraData: i64 4736)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !507, file: !508, line: 121, baseType: !82, size: 1, offset: 4746, flags: DIFlagBitField, extraData: i64 4736)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !507, file: !508, line: 122, baseType: !82, size: 1, offset: 4747, flags: DIFlagBitField, extraData: i64 4736)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !75, file: !76, line: 388, baseType: !731, size: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !74, line: 17, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !734, line: 319, size: 8960, elements: !735)
!734 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c0fceda7aff0a351f062ef07edbc2de2")
!735 = !{!736, !741, !742, !791, !870, !871, !893, !902, !1183, !1184, !1185, !1186, !1187, !1188, !1228, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1409, !1413, !1414, !1418, !1419, !1420, !1421, !1422, !1426, !1430, !1434, !1435, !1449, !1450, !1451, !1452, !1453, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !733, file: !734, line: 320, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !734, line: 315, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !72, !731}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !733, file: !734, line: 321, baseType: !737, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !733, file: !734, line: 323, baseType: !743, size: 1024, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !744, line: 22, baseType: !745)
!744 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ac5aedde14d2cb26bc31b0019c79e36b")
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !744, line: 36, size: 1024, elements: !746)
!746 = !{!747, !748, !749, !750, !752, !753, !754, !760, !765, !767, !768, !770, !775, !784, !785, !786, !787, !788, !789, !790}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !745, file: !744, line: 37, baseType: !84, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !745, file: !744, line: 39, baseType: !314, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !745, file: !744, line: 40, baseType: !324, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !745, file: !744, line: 41, baseType: !751, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !745, file: !744, line: 43, baseType: !126, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !745, file: !744, line: 44, baseType: !346, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !745, file: !744, line: 46, baseType: !755, size: 64, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !744, line: 24, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!28, !759, !27}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !745, file: !744, line: 47, baseType: !761, size: 64, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !744, line: 26, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !759, !27, !126}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !745, file: !744, line: 48, baseType: !766, size: 64, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !744, line: 28, baseType: !762)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !745, file: !744, line: 49, baseType: !27, size: 64, offset: 576)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "set_session", scope: !745, file: !744, line: 52, baseType: !769, size: 64, offset: 640)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_set_peer_session_pt", file: !744, line: 30, baseType: !756)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !745, file: !744, line: 53, baseType: !771, size: 64, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_save_peer_session_pt", file: !744, line: 32, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !759, !27}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !745, file: !744, line: 56, baseType: !776, size: 64, offset: 768)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !778, line: 78, baseType: !779)
!778 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6d8b5de9d803e9eabdd54c00fd750bd0")
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !778, line: 74, size: 256, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !779, file: !778, line: 75, baseType: !314, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !779, file: !778, line: 76, baseType: !324, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !779, file: !778, line: 77, baseType: !147, size: 128, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !745, file: !744, line: 58, baseType: !34, size: 32, offset: 832)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !745, file: !744, line: 59, baseType: !34, size: 32, offset: 864)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !745, file: !744, line: 61, baseType: !131, size: 64, offset: 896)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !745, file: !744, line: 63, baseType: !82, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !745, file: !744, line: 64, baseType: !82, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "so_keepalive", scope: !745, file: !744, line: 65, baseType: !82, size: 1, offset: 962, flags: DIFlagBitField, extraData: i64 960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !745, file: !744, line: 68, baseType: !82, size: 2, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !733, file: !734, line: 325, baseType: !792, size: 64, offset: 1152)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !794, line: 17, baseType: !795)
!794 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "d3e71392e0da0dbb3c5c631f1da185c7")
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !794, line: 25, size: 2240, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !803, !804, !805, !806, !807, !812, !813, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !869}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !795, file: !794, line: 26, baseType: !84, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !795, file: !794, line: 27, baseType: !84, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !795, file: !794, line: 29, baseType: !219, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !795, file: !794, line: 30, baseType: !219, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !795, file: !794, line: 31, baseType: !802, size: 64, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !795, file: !794, line: 33, baseType: !219, size: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !795, file: !794, line: 35, baseType: !219, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !795, file: !794, line: 36, baseType: !219, size: 64, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !795, file: !794, line: 37, baseType: !219, size: 64, offset: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !795, file: !794, line: 44, baseType: !808, size: 64, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !794, line: 19, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!28, !792, !224}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !795, file: !794, line: 45, baseType: !27, size: 64, offset: 640)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !795, file: !794, line: 47, baseType: !814, size: 64, offset: 704)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !794, line: 21, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
