; ModuleID = 'samples/100.bc'
source_filename = "mod_proxy_scgi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.command_struct = type { ptr, %union.cmd_func, ptr, i32, i32, ptr }
%union.cmd_func = type { ptr }
%struct.module_struct = type { i32, i32, i32, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct.apr_bucket_type_t = type { ptr, i32, i32, ptr, ptr, ptr, ptr, ptr }
%struct.scgi_config = type { ptr, ptr }
%struct.request_rec = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i32, ptr, ptr, i64, ptr, i32, i32, ptr, i64, ptr, ptr, i64, i64, i64, ptr, i64, i32, i32, i32, i32, ptr, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, %struct.apr_uri_t, %struct.apr_finfo_t, ptr, ptr, ptr, ptr, ptr, i32, i64 }
%struct.apr_uri_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i16, i8 }
%struct.apr_finfo_t = type { ptr, i32, i32, i32, i32, i32, i64, i64, i32, i64, i64, i64, i64, i64, ptr, ptr, ptr }
%struct.conn_rec = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i8, i32, i32, i32, ptr, ptr, ptr, ptr, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "mod_proxy_scgi.c", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/proxy", checksumkind: CSK_MD5, checksum: "8c2ea6844e0fc6d1051cb7d0654061bb")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 4)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "scgi_sendfile_off", scope: !9, file: !2, line: 65, type: !33, isLocal: false, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !971, globals: !982, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !28, !86, !110, !119, !127, !139, !144, !149, !161, !247, !277, !923, !929, !960, !964}
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cmd_how", file: !12, line: 49, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "include/http_config.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "478a5811bd142d8034ca8ebc320f852f")
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!15 = !DIEnumerator(name: "RAW_ARGS", value: 0)
!16 = !DIEnumerator(name: "TAKE1", value: 1)
!17 = !DIEnumerator(name: "TAKE2", value: 2)
!18 = !DIEnumerator(name: "ITERATE", value: 3)
!19 = !DIEnumerator(name: "ITERATE2", value: 4)
!20 = !DIEnumerator(name: "FLAG", value: 5)
!21 = !DIEnumerator(name: "NO_ARGS", value: 6)
!22 = !DIEnumerator(name: "TAKE12", value: 7)
!23 = !DIEnumerator(name: "TAKE3", value: 8)
!24 = !DIEnumerator(name: "TAKE23", value: 9)
!25 = !DIEnumerator(name: "TAKE123", value: 10)
!26 = !DIEnumerator(name: "TAKE13", value: 11)
!27 = !DIEnumerator(name: "TAKE_ARGV", value: 12)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !30, file: !29, line: 151, baseType: !13, size: 32, elements: !107)
!29 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_buckets.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "afcd28b2e200d46cb3a438f3ad8fc6de")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_type_t", file: !29, line: 131, size: 448, elements: !31)
!31 = !{!32, !35, !37, !38, !43, !90, !98, !102}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !29, line: 135, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "num_func", scope: !30, file: !29, line: 140, baseType: !36, size: 32, offset: 64)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "is_metadata", scope: !30, file: !29, line: 156, baseType: !28, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !30, file: !29, line: 164, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !30, file: !29, line: 176, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !49, !83, !84, !85}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !48, line: 44, baseType: !36)
!48 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_errno.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "571a7b9d4a9f11f6d27db63c8ba4bc85")
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket", file: !29, line: 121, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket", file: !29, line: 224, size: 512, elements: !52)
!52 = !{!53, !60, !64, !70, !77, !78, !79}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !51, file: !29, line: 226, baseType: !54, size: 128)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !29, line: 226, size: 128, elements: !55)
!55 = !{!56, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !29, line: 226, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !54, file: !29, line: 226, baseType: !57, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !29, line: 228, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_type_t", file: !29, line: 126, baseType: !30)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !51, file: !29, line: 234, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !66, line: 379, baseType: !67)
!66 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "73077acfd8398d55139f48047843856b")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 70, baseType: !69)
!68 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!69 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !51, file: !29, line: 242, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !66, line: 381, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !73, line: 85, baseType: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 152, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!76 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !51, file: !29, line: 244, baseType: !42, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !51, file: !29, line: 252, baseType: !39, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !51, file: !29, line: 254, baseType: !80, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_alloc_t", file: !29, line: 123, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_alloc_t", file: !29, line: 123, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_read_type_e", file: !29, line: 60, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 57, baseType: !13, size: 32, elements: !87)
!87 = !{!88, !89}
!88 = !DIEnumerator(name: "APR_BLOCK_READ", value: 0)
!89 = !DIEnumerator(name: "APR_NONBLOCK_READ", value: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "setaside", scope: !30, file: !29, line: 192, baseType: !91, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!47, !49, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !96, line: 60, baseType: !97)
!96 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_pools.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "ca846d53df1698194c1a577ccf147813")
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !96, line: 60, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !30, file: !29, line: 203, baseType: !99, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!47, !49, !65}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !30, file: !29, line: 211, baseType: !103, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!47, !49, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!107 = !{!108, !109}
!108 = !DIEnumerator(name: "APR_BUCKET_DATA", value: 0)
!109 = !DIEnumerator(name: "APR_BUCKET_METADATA", value: 1)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 41, baseType: !13, size: 32, elements: !112)
!111 = !DIFile(filename: "include/util_filter.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "894e51124b630754ca6243e0c50426ad")
!112 = !{!113, !114, !115, !116, !117, !118}
!113 = !DIEnumerator(name: "AP_MODE_READBYTES", value: 0)
!114 = !DIEnumerator(name: "AP_MODE_GETLINE", value: 1)
!115 = !DIEnumerator(name: "AP_MODE_EATCRLF", value: 2)
!116 = !DIEnumerator(name: "AP_MODE_SPECULATIVE", value: 3)
!117 = !DIEnumerator(name: "AP_MODE_EXHAUSTIVE", value: 4)
!118 = !DIEnumerator(name: "AP_MODE_INIT", value: 5)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 158, baseType: !13, size: 32, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126}
!121 = !DIEnumerator(name: "AP_FTYPE_RESOURCE", value: 10)
!122 = !DIEnumerator(name: "AP_FTYPE_CONTENT_SET", value: 20)
!123 = !DIEnumerator(name: "AP_FTYPE_PROTOCOL", value: 30)
!124 = !DIEnumerator(name: "AP_FTYPE_TRANSCODE", value: 40)
!125 = !DIEnumerator(name: "AP_FTYPE_CONNECTION", value: 50)
!126 = !DIEnumerator(name: "AP_FTYPE_NETWORK", value: 60)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 1251, baseType: !13, size: 32, elements: !129)
!128 = !DIFile(filename: "include/httpd.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "13796706810e88ffd526cf3216ebbaab")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138}
!130 = !DIEnumerator(name: "CONN_STATE_CHECK_REQUEST_LINE_READABLE", value: 0)
!131 = !DIEnumerator(name: "CONN_STATE_READ_REQUEST_LINE", value: 1)
!132 = !DIEnumerator(name: "CONN_STATE_HANDLER", value: 2)
!133 = !DIEnumerator(name: "CONN_STATE_WRITE_COMPLETION", value: 3)
!134 = !DIEnumerator(name: "CONN_STATE_SUSPENDED", value: 4)
!135 = !DIEnumerator(name: "CONN_STATE_LINGER", value: 5)
!136 = !DIEnumerator(name: "CONN_STATE_LINGER_NORMAL", value: 6)
!137 = !DIEnumerator(name: "CONN_STATE_LINGER_SHORT", value: 7)
!138 = !DIEnumerator(name: "CONN_STATE_NUM", value: 8)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 1264, baseType: !13, size: 32, elements: !140)
!140 = !{!141, !142, !143}
!141 = !DIEnumerator(name: "CONN_SENSE_DEFAULT", value: 0)
!142 = !DIEnumerator(name: "CONN_SENSE_WANT_READ", value: 1)
!143 = !DIEnumerator(name: "CONN_SENSE_WANT_WRITE", value: 2)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 1136, baseType: !13, size: 32, elements: !145)
!145 = !{!146, !147, !148}
!146 = !DIEnumerator(name: "AP_CONN_UNKNOWN", value: 0)
!147 = !DIEnumerator(name: "AP_CONN_CLOSE", value: 1)
!148 = !DIEnumerator(name: "AP_CONN_KEEPALIVE", value: 2)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !150, line: 62, baseType: !13, size: 32, elements: !151)
!150 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_info.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "58895203e42ced4eaee1557b60315f00")
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160}
!152 = !DIEnumerator(name: "APR_NOFILE", value: 0)
!153 = !DIEnumerator(name: "APR_REG", value: 1)
!154 = !DIEnumerator(name: "APR_DIR", value: 2)
!155 = !DIEnumerator(name: "APR_CHR", value: 3)
!156 = !DIEnumerator(name: "APR_BLK", value: 4)
!157 = !DIEnumerator(name: "APR_PIPE", value: 5)
!158 = !DIEnumerator(name: "APR_LNK", value: 6)
!159 = !DIEnumerator(name: "APR_SOCK", value: 7)
!160 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !163, file: !162, line: 433, baseType: !13, size: 32, elements: !273)
!162 = !DIFile(filename: "./mod_proxy.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/proxy", checksumkind: CSK_MD5, checksum: "054a5ab46cf39a749e57e3d480c5bec4")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 414, size: 11584, elements: !164)
!164 = !{!165, !169, !173, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !196, !197, !198, !205, !206, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !260, !261, !262, !266, !267, !268, !269}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !162, line: 415, baseType: !166, size: 768)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 768, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !163, file: !162, line: 416, baseType: !170, size: 128, offset: 768)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !163, file: !162, line: 417, baseType: !174, size: 512, offset: 896)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "route", scope: !163, file: !162, line: 418, baseType: !174, size: 512, offset: 1408)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "redirect", scope: !163, file: !162, line: 419, baseType: !174, size: 512, offset: 1920)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flusher", scope: !163, file: !162, line: 420, baseType: !170, size: 128, offset: 2432)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "uds_path", scope: !163, file: !162, line: 421, baseType: !166, size: 768, offset: 2560)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "lbset", scope: !163, file: !162, line: 422, baseType: !36, size: 32, offset: 3328)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "retries", scope: !163, file: !162, line: 423, baseType: !36, size: 32, offset: 3360)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lbstatus", scope: !163, file: !162, line: 424, baseType: !36, size: 32, offset: 3392)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lbfactor", scope: !163, file: !162, line: 425, baseType: !36, size: 32, offset: 3424)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !163, file: !162, line: 426, baseType: !36, size: 32, offset: 3456)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "smax", scope: !163, file: !162, line: 427, baseType: !36, size: 32, offset: 3488)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "hmax", scope: !163, file: !162, line: 428, baseType: !36, size: 32, offset: 3520)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flush_wait", scope: !163, file: !162, line: 429, baseType: !36, size: 32, offset: 3552)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !163, file: !162, line: 430, baseType: !36, size: 32, offset: 3584)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !163, file: !162, line: 431, baseType: !191, size: 64, offset: 3616)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "proxy_hashes", file: !162, line: 410, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 407, size: 64, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !192, file: !162, line: 408, baseType: !13, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fnv", scope: !192, file: !162, line: 409, baseType: !13, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !163, file: !162, line: 432, baseType: !13, size: 32, offset: 3680)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flush_packets", scope: !163, file: !162, line: 437, baseType: !161, size: 32, offset: 3712)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !163, file: !162, line: 438, baseType: !199, size: 64, offset: 3776)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !200, line: 45, baseType: !201)
!200 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_time.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "1a8b9732d4ee010f71e3eb03e6e3a16e")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !66, line: 371, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !203, line: 27, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !75, line: 44, baseType: !76)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "error_time", scope: !163, file: !162, line: 439, baseType: !199, size: 64, offset: 3840)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !163, file: !162, line: 440, baseType: !207, size: 64, offset: 3904)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !200, line: 55, baseType: !201)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !163, file: !162, line: 442, baseType: !207, size: 64, offset: 3968)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !163, file: !162, line: 443, baseType: !207, size: 64, offset: 4032)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !163, file: !162, line: 444, baseType: !207, size: 64, offset: 4096)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ping_timeout", scope: !163, file: !162, line: 445, baseType: !207, size: 64, offset: 4160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "conn_timeout", scope: !163, file: !162, line: 446, baseType: !207, size: 64, offset: 4224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer_size", scope: !163, file: !162, line: 447, baseType: !65, size: 64, offset: 4288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "io_buffer_size", scope: !163, file: !162, line: 448, baseType: !65, size: 64, offset: 4352)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "elected", scope: !163, file: !162, line: 449, baseType: !65, size: 64, offset: 4416)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !163, file: !162, line: 450, baseType: !65, size: 64, offset: 4480)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !163, file: !162, line: 451, baseType: !218, size: 16, offset: 4544)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_port_t", file: !219, line: 230, baseType: !220)
!219 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_network_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "d28b53dbcb33f6acce926c2efb3f7365")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint16_t", file: !66, line: 331, baseType: !221)
!221 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "transferred", scope: !163, file: !162, line: 452, baseType: !71, size: 64, offset: 4608)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !163, file: !162, line: 453, baseType: !71, size: 64, offset: 4672)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !163, file: !162, line: 454, baseType: !42, size: 64, offset: 4736)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !163, file: !162, line: 455, baseType: !13, size: 1, offset: 4800, flags: DIFlagBitField, extraData: i64 4800)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "disablereuse", scope: !163, file: !162, line: 456, baseType: !13, size: 1, offset: 4801, flags: DIFlagBitField, extraData: i64 4800)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "is_address_reusable", scope: !163, file: !162, line: 457, baseType: !13, size: 1, offset: 4802, flags: DIFlagBitField, extraData: i64 4800)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "retry_set", scope: !163, file: !162, line: 458, baseType: !13, size: 1, offset: 4803, flags: DIFlagBitField, extraData: i64 4800)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_set", scope: !163, file: !162, line: 459, baseType: !13, size: 1, offset: 4804, flags: DIFlagBitField, extraData: i64 4800)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "acquire_set", scope: !163, file: !162, line: 460, baseType: !13, size: 1, offset: 4805, flags: DIFlagBitField, extraData: i64 4800)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ping_timeout_set", scope: !163, file: !162, line: 461, baseType: !13, size: 1, offset: 4806, flags: DIFlagBitField, extraData: i64 4800)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "conn_timeout_set", scope: !163, file: !162, line: 462, baseType: !13, size: 1, offset: 4807, flags: DIFlagBitField, extraData: i64 4800)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer_size_set", scope: !163, file: !162, line: 463, baseType: !13, size: 1, offset: 4808, flags: DIFlagBitField, extraData: i64 4800)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "io_buffer_size_set", scope: !163, file: !162, line: 464, baseType: !13, size: 1, offset: 4809, flags: DIFlagBitField, extraData: i64 4800)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive_set", scope: !163, file: !162, line: 465, baseType: !13, size: 1, offset: 4810, flags: DIFlagBitField, extraData: i64 4800)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "disablereuse_set", scope: !163, file: !162, line: 466, baseType: !13, size: 1, offset: 4811, flags: DIFlagBitField, extraData: i64 4800)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "was_malloced", scope: !163, file: !162, line: 467, baseType: !13, size: 1, offset: 4812, flags: DIFlagBitField, extraData: i64 4800)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "is_name_matchable", scope: !163, file: !162, line: 468, baseType: !13, size: 1, offset: 4813, flags: DIFlagBitField, extraData: i64 4800)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "hcuri", scope: !163, file: !162, line: 469, baseType: !174, size: 512, offset: 4816)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "hcexpr", scope: !163, file: !162, line: 470, baseType: !170, size: 128, offset: 5328)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !163, file: !162, line: 471, baseType: !36, size: 32, offset: 5472)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pcount", scope: !163, file: !162, line: 472, baseType: !36, size: 32, offset: 5504)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !163, file: !162, line: 473, baseType: !36, size: 32, offset: 5536)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fcount", scope: !163, file: !162, line: 474, baseType: !36, size: 32, offset: 5568)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !163, file: !162, line: 475, baseType: !246, size: 32, offset: 5600)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "hcmethod_t", file: !162, line: 81, baseType: !247)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !162, line: 79, baseType: !13, size: 32, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!249 = !DIEnumerator(name: "NONE", value: 0)
!250 = !DIEnumerator(name: "TCP", value: 1)
!251 = !DIEnumerator(name: "OPTIONS", value: 2)
!252 = !DIEnumerator(name: "HEAD", value: 3)
!253 = !DIEnumerator(name: "GET", value: 4)
!254 = !DIEnumerator(name: "CPING", value: 5)
!255 = !DIEnumerator(name: "PROVIDER", value: 6)
!256 = !DIEnumerator(name: "OPTIONS11", value: 7)
!257 = !DIEnumerator(name: "HEAD11", value: 8)
!258 = !DIEnumerator(name: "GET11", value: 9)
!259 = !DIEnumerator(name: "EOT", value: 10)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !163, file: !162, line: 476, baseType: !207, size: 64, offset: 5632)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade", scope: !163, file: !162, line: 477, baseType: !170, size: 128, offset: 5696)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hostname_ex", scope: !163, file: !162, line: 478, baseType: !263, size: 2048, offset: 5824)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "response_field_size", scope: !163, file: !162, line: 479, baseType: !65, size: 64, offset: 7872)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "response_field_size_set", scope: !163, file: !162, line: 480, baseType: !13, size: 1, offset: 7936, flags: DIFlagBitField, extraData: i64 7936)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "secret", scope: !163, file: !162, line: 481, baseType: !174, size: 512, offset: 7944)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name_ex", scope: !163, file: !162, line: 482, baseType: !270, size: 3072, offset: 8456)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3072, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 384)
!273 = !{!274, !275, !276}
!274 = !DIEnumerator(name: "flush_off", value: 0)
!275 = !DIEnumerator(name: "flush_on", value: 1)
!276 = !DIEnumerator(name: "flush_auto", value: 2)
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !278, file: !162, line: 165, baseType: !13, size: 32, elements: !955)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 149, size: 1536, elements: !279)
!279 = !{!280, !292, !293, !294, !295, !296, !297, !298, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !928, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "proxies", scope: !278, file: !162, line: 150, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_array_header_t", file: !283, line: 59, baseType: !284)
!283 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_tables.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "82dd315cfdbab9381cd05a1d2abe34a2")
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_array_header_t", file: !283, line: 62, size: 256, elements: !285)
!285 = !{!286, !287, !288, !289, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !284, file: !283, line: 64, baseType: !94, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !284, file: !283, line: 66, baseType: !36, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !284, file: !283, line: 68, baseType: !36, size: 32, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !284, file: !283, line: 70, baseType: !36, size: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !284, file: !283, line: 72, baseType: !291, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sec_proxy", scope: !278, file: !162, line: 151, baseType: !281, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !278, file: !162, line: 152, baseType: !281, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "noproxies", scope: !278, file: !162, line: 153, baseType: !281, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "dirconn", scope: !278, file: !162, line: 154, baseType: !281, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "workers", scope: !278, file: !162, line: 155, baseType: !281, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "balancers", scope: !278, file: !162, line: 156, baseType: !281, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !278, file: !162, line: 157, baseType: !299, size: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "proxy_worker", file: !162, line: 110, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proxy_worker", file: !162, line: 488, size: 512, elements: !302)
!302 = !{!303, !304, !305, !762, !765, !907, !908, !909}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !301, file: !162, line: 489, baseType: !191, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "local_status", scope: !301, file: !162, line: 490, baseType: !13, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cp", scope: !301, file: !162, line: 491, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "proxy_conn_pool", file: !162, line: 111, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proxy_conn_pool", file: !162, line: 295, size: 320, elements: !309)
!309 = !{!310, !311, !397, !402, !761}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !308, file: !162, line: 296, baseType: !94, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !308, file: !162, line: 297, baseType: !312, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_sockaddr_t", file: !219, line: 235, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_sockaddr_t", file: !219, line: 239, size: 1536, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !322, !327, !328, !329, !330, !331}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !314, file: !219, line: 241, baseType: !94, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !314, file: !219, line: 243, baseType: !291, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "servname", scope: !314, file: !219, line: 245, baseType: !291, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !314, file: !219, line: 247, baseType: !218, size: 16, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !314, file: !219, line: 249, baseType: !321, size: 32, offset: 224)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !66, line: 333, baseType: !36)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !314, file: !219, line: 251, baseType: !323, size: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_socklen_t", file: !66, line: 382, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !325, line: 33, baseType: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !75, line: 210, baseType: !13)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_len", scope: !314, file: !219, line: 253, baseType: !36, size: 32, offset: 288)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "addr_str_len", scope: !314, file: !219, line: 256, baseType: !36, size: 32, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_ptr", scope: !314, file: !219, line: 259, baseType: !42, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !219, line: 262, baseType: !312, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !314, file: !219, line: 280, baseType: !332, size: 1024, offset: 512)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !219, line: 264, size: 1024, elements: !333)
!333 = !{!334, !358, !379, !388}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !332, file: !219, line: 266, baseType: !335, size: 128)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !336, line: 245, size: 128, elements: !337)
!336 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!337 = !{!338, !341, !346, !353}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !335, file: !336, line: 247, baseType: !339, size: 16)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !340, line: 28, baseType: !221)
!340 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !335, file: !336, line: 248, baseType: !342, size: 16, offset: 16)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !336, line: 123, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !344, line: 25, baseType: !345)
!344 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !75, line: 40, baseType: !221)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !335, file: !336, line: 249, baseType: !347, size: 32, offset: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !336, line: 31, size: 32, elements: !348)
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !347, file: !336, line: 33, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !336, line: 30, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !344, line: 26, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !75, line: 42, baseType: !13)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !335, file: !336, line: 252, baseType: !354, size: 64, offset: 64)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 64, elements: !356)
!355 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!356 = !{!357}
!357 = !DISubrange(count: 8)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !332, file: !219, line: 269, baseType: !359, size: 224)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !336, line: 260, size: 224, elements: !360)
!360 = !{!361, !362, !363, !364, !378}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !359, file: !336, line: 262, baseType: !339, size: 16)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !359, file: !336, line: 263, baseType: !342, size: 16, offset: 16)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !359, file: !336, line: 264, baseType: !351, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !359, file: !336, line: 265, baseType: !365, size: 128, offset: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !336, line: 219, size: 128, elements: !366)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !365, file: !336, line: 226, baseType: !368, size: 128)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !336, line: 221, size: 128, elements: !369)
!369 = !{!370, !374, !376}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !368, file: !336, line: 223, baseType: !371, size: 128)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 128, elements: !171)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !344, line: 24, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !75, line: 38, baseType: !355)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !368, file: !336, line: 224, baseType: !375, size: 128)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 128, elements: !356)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !368, file: !336, line: 225, baseType: !377, size: 128)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 128, elements: !5)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !359, file: !336, line: 266, baseType: !351, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sas", scope: !332, file: !219, line: 274, baseType: !380, size: 1024)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !325, line: 193, size: 1024, elements: !381)
!381 = !{!382, !383, !387}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !380, file: !325, line: 195, baseType: !339, size: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !380, file: !325, line: 196, baseType: !384, size: 944, offset: 16)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 944, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 118)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !380, file: !325, line: 197, baseType: !69, size: 64, offset: 960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "unx", scope: !332, file: !219, line: 278, baseType: !389, size: 880)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !390, line: 29, size: 880, elements: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!391 = !{!392, !393}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !389, file: !390, line: 31, baseType: !339, size: 16)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !389, file: !390, line: 32, baseType: !394, size: 864, offset: 16)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 864, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 108)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "res", scope: !308, file: !162, line: 298, baseType: !398, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_reslist_t", file: !400, line: 42, baseType: !401)
!400 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_reslist.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "20701328b8ceeb9b569fc3b0d2300ce2")
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_reslist_t", file: !400, line: 42, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !308, file: !162, line: 299, baseType: !403, size: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "proxy_conn_rec", file: !162, line: 287, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 262, size: 896, elements: !406)
!406 = !{!407, !739, !740, !741, !742, !743, !744, !745, !749, !750, !751, !753, !754, !755, !756, !757, !758, !759, !760}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !405, file: !162, line: 263, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_rec", file: !128, line: 809, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_rec", file: !128, line: 1145, size: 1664, elements: !411)
!411 = !{!412, !413, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !491, !709, !710, !711, !713, !722, !723, !724, !725, !726, !727, !729, !730, !731, !732, !737, !738}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !410, file: !128, line: 1147, baseType: !94, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "base_server", scope: !410, file: !128, line: 1149, baseType: !414, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_rec", file: !128, line: 807, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_rec", file: !128, line: 1315, size: 1536, elements: !417)
!417 = !{!418, !430, !431, !432, !437, !444, !447, !448, !449, !450, !451, !452, !453, !454, !455, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !416, file: !128, line: 1317, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "process_rec", file: !128, line: 805, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "process_rec", file: !128, line: 822, size: 320, elements: !422)
!422 = !{!423, !424, !425, !426, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !421, file: !128, line: 824, baseType: !94, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pconf", scope: !421, file: !128, line: 826, baseType: !94, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !421, file: !128, line: 828, baseType: !33, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !421, file: !128, line: 830, baseType: !427, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !421, file: !128, line: 832, baseType: !36, size: 32, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !416, file: !128, line: 1319, baseType: !414, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "error_fname", scope: !416, file: !128, line: 1324, baseType: !291, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "error_log", scope: !416, file: !128, line: 1326, baseType: !433, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !435, line: 188, baseType: !436)
!435 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9f1a845f7255d07e28e3a10d24320b5d")
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !150, line: 212, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !416, file: !128, line: 1328, baseType: !438, size: 128, offset: 256)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_logconf", file: !128, line: 1305, size: 128, elements: !439)
!439 = !{!440, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "module_levels", scope: !438, file: !128, line: 1307, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !438, file: !128, line: 1310, baseType: !36, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "module_config", scope: !416, file: !128, line: 1334, baseType: !445, size: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_conf_vector_t", file: !128, line: 791, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_defaults", scope: !416, file: !128, line: 1336, baseType: !445, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "defn_name", scope: !416, file: !128, line: 1339, baseType: !33, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "defn_line_number", scope: !416, file: !128, line: 1341, baseType: !13, size: 32, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "is_virtual", scope: !416, file: !128, line: 1343, baseType: !4, size: 8, offset: 608)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !416, file: !128, line: 1349, baseType: !218, size: 16, offset: 624)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "server_scheme", scope: !416, file: !128, line: 1351, baseType: !33, size: 64, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "server_admin", scope: !416, file: !128, line: 1356, baseType: !291, size: 64, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "server_hostname", scope: !416, file: !128, line: 1358, baseType: !291, size: 64, offset: 768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !416, file: !128, line: 1363, baseType: !456, size: 64, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_addr_rec", file: !128, line: 1293, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_addr_rec", file: !128, line: 1294, size: 256, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !458, file: !128, line: 1296, baseType: !456, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "virthost", scope: !458, file: !128, line: 1298, baseType: !291, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !458, file: !128, line: 1300, baseType: !312, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "host_port", scope: !458, file: !128, line: 1302, baseType: !218, size: 16, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !416, file: !128, line: 1365, baseType: !207, size: 64, offset: 896)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !416, file: !128, line: 1367, baseType: !207, size: 64, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !416, file: !128, line: 1369, baseType: !36, size: 32, offset: 1024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !416, file: !128, line: 1371, baseType: !36, size: 32, offset: 1056)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !416, file: !128, line: 1374, baseType: !281, size: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "wild_names", scope: !416, file: !128, line: 1376, baseType: !281, size: 64, offset: 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !416, file: !128, line: 1379, baseType: !33, size: 64, offset: 1216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pathlen", scope: !416, file: !128, line: 1381, baseType: !36, size: 32, offset: 1280)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_line", scope: !416, file: !128, line: 1384, baseType: !36, size: 32, offset: 1312)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fieldsize", scope: !416, file: !128, line: 1386, baseType: !36, size: 32, offset: 1344)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fields", scope: !416, file: !128, line: 1388, baseType: !36, size: 32, offset: 1376)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !416, file: !128, line: 1391, baseType: !42, size: 64, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout_set", scope: !416, file: !128, line: 1396, baseType: !13, size: 1, offset: 1472, flags: DIFlagBitField, extraData: i64 1472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vhost_lookup_data", scope: !410, file: !128, line: 1151, baseType: !42, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !410, file: !128, line: 1155, baseType: !312, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "client_addr", scope: !410, file: !128, line: 1159, baseType: !312, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "client_ip", scope: !410, file: !128, line: 1164, baseType: !291, size: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "remote_host", scope: !410, file: !128, line: 1168, baseType: !291, size: 64, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "remote_logname", scope: !410, file: !128, line: 1171, baseType: !291, size: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !410, file: !128, line: 1174, baseType: !291, size: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "local_host", scope: !410, file: !128, line: 1177, baseType: !291, size: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !410, file: !128, line: 1180, baseType: !76, size: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "conn_config", scope: !410, file: !128, line: 1183, baseType: !445, size: 64, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !410, file: !128, line: 1186, baseType: !488, size: 64, offset: 768)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_table_t", file: !283, line: 56, baseType: !490)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_table_t", file: !283, line: 56, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "input_filters", scope: !410, file: !128, line: 1188, baseType: !492, size: 64, offset: 832)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_t", file: !111, line: 259, size: 320, elements: !494)
!494 = !{!495, !544, !545, !546, !708}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "frec", scope: !493, file: !111, line: 263, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_rec_t", file: !111, line: 199, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_rec_t", file: !111, line: 215, size: 448, elements: !499)
!499 = !{!500, !501, !529, !534, !536, !540, !542, !543}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !498, file: !111, line: 217, baseType: !33, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "filter_func", scope: !498, file: !111, line: 220, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_func", file: !111, line: 146, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ap_filter_func", file: !111, line: 143, size: 64, elements: !504)
!504 = !{!505, !523}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "out_func", scope: !503, file: !111, line: 144, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_out_filter_func", file: !111, line: 134, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!47, !510, !512}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_t", file: !111, line: 94, baseType: !493)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_brigade", file: !29, line: 119, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_brigade", file: !29, line: 258, size: 256, elements: !515)
!515 = !{!516, !517, !522}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !514, file: !29, line: 264, baseType: !94, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !514, file: !29, line: 273, baseType: !518, size: 128, offset: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_list", file: !29, line: 273, size: 128, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !518, file: !29, line: 273, baseType: !57, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !518, file: !29, line: 273, baseType: !57, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_alloc", scope: !514, file: !29, line: 275, baseType: !80, size: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "in_func", scope: !503, file: !111, line: 145, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_in_filter_func", file: !111, line: 136, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!47, !510, !512, !528, !85, !71}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_input_mode_t", file: !111, line: 63, baseType: !110)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "filter_init_func", scope: !498, file: !111, line: 230, baseType: !530, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_init_filter_func", file: !111, line: 141, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!36, !510}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !111, line: 233, baseType: !535, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "providers", scope: !498, file: !111, line: 236, baseType: !537, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_provider_t", file: !111, line: 200, baseType: !539)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_provider_t", file: !111, line: 200, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !498, file: !111, line: 243, baseType: !541, size: 32, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_type", file: !111, line: 184, baseType: !119)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !498, file: !111, line: 246, baseType: !36, size: 32, offset: 352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "proto_flags", scope: !498, file: !111, line: 249, baseType: !13, size: 32, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !493, file: !111, line: 266, baseType: !42, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !493, file: !111, line: 269, baseType: !510, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !493, file: !111, line: 275, baseType: !547, size: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_rec", file: !128, line: 811, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request_rec", file: !128, line: 838, size: 5888, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !616, !617, !628, !629, !630, !631, !632, !633, !634, !639, !660, !697, !698, !699, !700, !701, !702, !703}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !549, file: !128, line: 840, baseType: !94, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !549, file: !128, line: 842, baseType: !408, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !549, file: !128, line: 844, baseType: !414, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !549, file: !128, line: 847, baseType: !547, size: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !549, file: !128, line: 849, baseType: !547, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !549, file: !128, line: 853, baseType: !547, size: 64, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "the_request", scope: !549, file: !128, line: 859, baseType: !291, size: 64, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "assbackwards", scope: !549, file: !128, line: 861, baseType: !36, size: 32, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "proxyreq", scope: !549, file: !128, line: 866, baseType: !36, size: 32, offset: 480)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "header_only", scope: !549, file: !128, line: 868, baseType: !36, size: 32, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "proto_num", scope: !549, file: !128, line: 870, baseType: !36, size: 32, offset: 544)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !549, file: !128, line: 872, baseType: !291, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !549, file: !128, line: 876, baseType: !33, size: 64, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "request_time", scope: !549, file: !128, line: 879, baseType: !199, size: 64, offset: 704)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "status_line", scope: !549, file: !128, line: 882, baseType: !33, size: 64, offset: 768)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !549, file: !128, line: 884, baseType: !36, size: 32, offset: 832)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "method_number", scope: !549, file: !128, line: 891, baseType: !36, size: 32, offset: 864)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !549, file: !128, line: 893, baseType: !33, size: 64, offset: 896)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !549, file: !128, line: 915, baseType: !201, size: 64, offset: 960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_xmethods", scope: !549, file: !128, line: 917, baseType: !281, size: 64, offset: 1024)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_methods", scope: !549, file: !128, line: 919, baseType: !572, size: 64, offset: 1088)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_method_list_t", file: !128, line: 634, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_method_list_t", file: !128, line: 643, size: 128, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "method_mask", scope: !574, file: !128, line: 645, baseType: !201, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "method_list", scope: !574, file: !128, line: 647, baseType: !281, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bodyct", scope: !549, file: !128, line: 922, baseType: !71, size: 64, offset: 1152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_sent", scope: !549, file: !128, line: 924, baseType: !71, size: 64, offset: 1216)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !549, file: !128, line: 926, baseType: !199, size: 64, offset: 1280)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !549, file: !128, line: 931, baseType: !33, size: 64, offset: 1344)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "clength", scope: !549, file: !128, line: 933, baseType: !71, size: 64, offset: 1408)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "chunked", scope: !549, file: !128, line: 935, baseType: !36, size: 32, offset: 1472)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "read_body", scope: !549, file: !128, line: 940, baseType: !36, size: 32, offset: 1504)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "read_chunked", scope: !549, file: !128, line: 942, baseType: !36, size: 32, offset: 1536)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "expecting_100", scope: !549, file: !128, line: 944, baseType: !13, size: 32, offset: 1568)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "kept_body", scope: !549, file: !128, line: 946, baseType: !512, size: 64, offset: 1600)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "body_table", scope: !549, file: !128, line: 950, baseType: !488, size: 64, offset: 1664)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !549, file: !128, line: 952, baseType: !71, size: 64, offset: 1728)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !549, file: !128, line: 954, baseType: !71, size: 64, offset: 1792)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "headers_in", scope: !549, file: !128, line: 969, baseType: !488, size: 64, offset: 1856)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "headers_out", scope: !549, file: !128, line: 971, baseType: !488, size: 64, offset: 1920)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "err_headers_out", scope: !549, file: !128, line: 974, baseType: !488, size: 64, offset: 1984)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "subprocess_env", scope: !549, file: !128, line: 976, baseType: !488, size: 64, offset: 2048)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !549, file: !128, line: 978, baseType: !488, size: 64, offset: 2112)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !549, file: !128, line: 985, baseType: !33, size: 64, offset: 2176)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !549, file: !128, line: 987, baseType: !33, size: 64, offset: 2240)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "content_encoding", scope: !549, file: !128, line: 990, baseType: !33, size: 64, offset: 2304)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "content_languages", scope: !549, file: !128, line: 992, baseType: !281, size: 64, offset: 2368)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "vlist_validator", scope: !549, file: !128, line: 995, baseType: !291, size: 64, offset: 2432)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !549, file: !128, line: 998, baseType: !291, size: 64, offset: 2496)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ap_auth_type", scope: !549, file: !128, line: 1000, baseType: !291, size: 64, offset: 2560)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "unparsed_uri", scope: !549, file: !128, line: 1007, baseType: !291, size: 64, offset: 2624)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !549, file: !128, line: 1009, baseType: !291, size: 64, offset: 2688)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !549, file: !128, line: 1011, baseType: !291, size: 64, offset: 2752)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_filename", scope: !549, file: !128, line: 1015, baseType: !291, size: 64, offset: 2816)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "path_info", scope: !549, file: !128, line: 1017, baseType: !291, size: 64, offset: 2880)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !549, file: !128, line: 1019, baseType: !291, size: 64, offset: 2944)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "used_path_info", scope: !549, file: !128, line: 1029, baseType: !36, size: 32, offset: 3008)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "eos_sent", scope: !549, file: !128, line: 1032, baseType: !36, size: 32, offset: 3040)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "per_dir_config", scope: !549, file: !128, line: 1040, baseType: !445, size: 64, offset: 3072)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "request_config", scope: !549, file: !128, line: 1042, baseType: !445, size: 64, offset: 3136)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !549, file: !128, line: 1047, baseType: !614, size: 64, offset: 3200)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !438)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !549, file: !128, line: 1052, baseType: !33, size: 64, offset: 3264)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "htaccess", scope: !549, file: !128, line: 1060, baseType: !618, size: 64, offset: 3328)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htaccess_result", file: !128, line: 781, size: 320, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !620, file: !128, line: 783, baseType: !33, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !620, file: !128, line: 785, baseType: !36, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "override_opts", scope: !620, file: !128, line: 787, baseType: !36, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "override_list", scope: !620, file: !128, line: 789, baseType: !488, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "htaccess", scope: !620, file: !128, line: 791, baseType: !445, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !620, file: !128, line: 793, baseType: !618, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "output_filters", scope: !549, file: !128, line: 1063, baseType: !492, size: 64, offset: 3392)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "input_filters", scope: !549, file: !128, line: 1065, baseType: !492, size: 64, offset: 3456)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "proto_output_filters", scope: !549, file: !128, line: 1069, baseType: !492, size: 64, offset: 3520)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "proto_input_filters", scope: !549, file: !128, line: 1072, baseType: !492, size: 64, offset: 3584)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "no_cache", scope: !549, file: !128, line: 1075, baseType: !36, size: 32, offset: 3648)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "no_local_copy", scope: !549, file: !128, line: 1077, baseType: !36, size: 32, offset: 3680)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "invoke_mtx", scope: !549, file: !128, line: 1082, baseType: !635, size: 64, offset: 3712)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_thread_mutex_t", file: !637, line: 41, baseType: !638)
!637 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_thread_mutex.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "333d6b386ebd5ebf2a57c53b3ab4b684")
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !637, line: 41, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "parsed_uri", scope: !549, file: !128, line: 1085, baseType: !640, size: 704, offset: 3776)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uri_t", file: !641, line: 80, baseType: !642)
!641 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_uri.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9269047179f727bd075392a12871b578")
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_uri_t", file: !641, line: 85, size: 704, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !656, !657, !658, !659}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !642, file: !641, line: 87, baseType: !291, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "hostinfo", scope: !642, file: !641, line: 89, baseType: !291, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !642, file: !641, line: 91, baseType: !291, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !642, file: !641, line: 93, baseType: !291, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !642, file: !641, line: 95, baseType: !291, size: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "port_str", scope: !642, file: !641, line: 97, baseType: !291, size: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !642, file: !641, line: 99, baseType: !291, size: 64, offset: 384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !642, file: !641, line: 101, baseType: !291, size: 64, offset: 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !642, file: !641, line: 103, baseType: !291, size: 64, offset: 512)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "hostent", scope: !642, file: !641, line: 106, baseType: !654, size: 64, offset: 576)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", file: !641, line: 106, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !642, file: !641, line: 109, baseType: !218, size: 16, offset: 640)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !642, file: !641, line: 112, baseType: !13, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 656)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "dns_looked_up", scope: !642, file: !641, line: 115, baseType: !13, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 656)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dns_resolved", scope: !642, file: !641, line: 117, baseType: !13, size: 1, offset: 658, flags: DIFlagBitField, extraData: i64 656)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "finfo", scope: !549, file: !128, line: 1087, baseType: !661, size: 960, offset: 4480)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_finfo_t", file: !150, line: 143, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !150, line: 174, size: 960, elements: !663)
!663 = !{!664, !665, !666, !668, !670, !675, !679, !683, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !662, file: !150, line: 176, baseType: !94, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !662, file: !150, line: 179, baseType: !321, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !662, file: !150, line: 181, baseType: !667, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !150, line: 125, baseType: !321)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !662, file: !150, line: 186, baseType: !669, size: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !150, line: 72, baseType: !149)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !662, file: !150, line: 188, baseType: !671, size: 32, offset: 160)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !672, line: 45, baseType: !673)
!672 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_user.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "724f26fd838740b0ca4b55f59030741b")
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !73, line: 79, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !75, line: 146, baseType: !13)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !662, file: !150, line: 190, baseType: !676, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !672, line: 54, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !73, line: 64, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !75, line: 147, baseType: !13)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !662, file: !150, line: 192, baseType: !680, size: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !66, line: 383, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !73, line: 47, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !75, line: 148, baseType: !69)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !662, file: !150, line: 194, baseType: !684, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !150, line: 135, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !73, line: 59, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !75, line: 145, baseType: !69)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !662, file: !150, line: 196, baseType: !321, size: 32, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !662, file: !150, line: 198, baseType: !71, size: 64, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !662, file: !150, line: 200, baseType: !71, size: 64, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !662, file: !150, line: 202, baseType: !199, size: 64, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !662, file: !150, line: 204, baseType: !199, size: 64, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !662, file: !150, line: 206, baseType: !199, size: 64, offset: 704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !662, file: !150, line: 208, baseType: !33, size: 64, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !662, file: !150, line: 210, baseType: !33, size: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !662, file: !150, line: 212, baseType: !696, size: 64, offset: 896)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_addr", scope: !549, file: !128, line: 1093, baseType: !312, size: 64, offset: 5440)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_ip", scope: !549, file: !128, line: 1094, baseType: !291, size: 64, offset: 5504)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "trailers_in", scope: !549, file: !128, line: 1097, baseType: !488, size: 64, offset: 5568)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "trailers_out", scope: !549, file: !128, line: 1099, baseType: !488, size: 64, offset: 5632)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_host", scope: !549, file: !128, line: 1104, baseType: !291, size: 64, offset: 5696)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "double_reverse", scope: !549, file: !128, line: 1108, baseType: !36, size: 32, offset: 5760)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bnotes", scope: !549, file: !128, line: 1113, baseType: !704, size: 64, offset: 5824)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_request_bnotes_t", file: !128, line: 662, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint64_t", file: !66, line: 372, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !344, line: 27, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !75, line: 45, baseType: !69)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !493, file: !111, line: 280, baseType: !408, size: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "output_filters", scope: !410, file: !128, line: 1190, baseType: !492, size: 64, offset: 896)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sbh", scope: !410, file: !128, line: 1192, baseType: !42, size: 64, offset: 960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_alloc", scope: !410, file: !128, line: 1194, baseType: !712, size: 64, offset: 1024)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !410, file: !128, line: 1196, baseType: !714, size: 64, offset: 1088)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_state_t", file: !128, line: 813, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_state_t", file: !128, line: 1273, size: 64, elements: !717)
!717 = !{!718, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !716, file: !128, line: 1275, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_state_e", file: !128, line: 1262, baseType: !127)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sense", scope: !716, file: !128, line: 1277, baseType: !721, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_sense_e", file: !128, line: 1268, baseType: !139)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "data_in_input_filters", scope: !410, file: !128, line: 1198, baseType: !36, size: 32, offset: 1152)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "data_in_output_filters", scope: !410, file: !128, line: 1200, baseType: !36, size: 32, offset: 1184)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "clogging_input_filters", scope: !410, file: !128, line: 1205, baseType: !13, size: 1, offset: 1216, flags: DIFlagBitField, extraData: i64 1216)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "double_reverse", scope: !410, file: !128, line: 1209, baseType: !36, size: 2, offset: 1217, flags: DIFlagBitField, extraData: i64 1216)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", scope: !410, file: !128, line: 1212, baseType: !13, size: 32, offset: 1248)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !410, file: !128, line: 1216, baseType: !728, size: 32, offset: 1280)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_conn_keepalive_e", file: !128, line: 1140, baseType: !144)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "keepalives", scope: !410, file: !128, line: 1219, baseType: !36, size: 32, offset: 1312)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !410, file: !128, line: 1223, baseType: !614, size: 64, offset: 1344)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !410, file: !128, line: 1228, baseType: !33, size: 64, offset: 1408)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "current_thread", scope: !410, file: !128, line: 1237, baseType: !733, size: 64, offset: 1472)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_thread_t", file: !735, line: 178, baseType: !736)
!735 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_thread_proc.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "86521d0dbb7f1fbad577c4bb2abede6c")
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_t", file: !735, line: 178, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !410, file: !128, line: 1241, baseType: !408, size: 64, offset: 1536)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !410, file: !128, line: 1243, baseType: !36, size: 32, offset: 1600)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !405, file: !162, line: 264, baseType: !547, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !405, file: !162, line: 266, baseType: !299, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !405, file: !162, line: 267, baseType: !94, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !405, file: !162, line: 268, baseType: !33, size: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !405, file: !162, line: 269, baseType: !312, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "scpool", scope: !405, file: !162, line: 270, baseType: !94, size: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !405, file: !162, line: 271, baseType: !746, size: 64, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_socket_t", file: !219, line: 219, baseType: !748)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_socket_t", file: !219, line: 219, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !405, file: !162, line: 272, baseType: !42, size: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !405, file: !162, line: 273, baseType: !42, size: 64, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !405, file: !162, line: 274, baseType: !752, size: 32, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint32_t", file: !66, line: 334, baseType: !13)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !405, file: !162, line: 275, baseType: !218, size: 16, offset: 672)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "is_ssl", scope: !405, file: !162, line: 276, baseType: !13, size: 1, offset: 688, flags: DIFlagBitField, extraData: i64 688)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !405, file: !162, line: 277, baseType: !13, size: 1, offset: 689, flags: DIFlagBitField, extraData: i64 688)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "need_flush", scope: !405, file: !162, line: 278, baseType: !13, size: 1, offset: 690, flags: DIFlagBitField, extraData: i64 688)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "inreslist", scope: !405, file: !162, line: 280, baseType: !13, size: 1, offset: 691, flags: DIFlagBitField, extraData: i64 688)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "uds_path", scope: !405, file: !162, line: 281, baseType: !33, size: 64, offset: 704)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_hostname", scope: !405, file: !162, line: 282, baseType: !33, size: 64, offset: 768)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_bb", scope: !405, file: !162, line: 283, baseType: !512, size: 64, offset: 832)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "dns_pool", scope: !308, file: !162, line: 300, baseType: !94, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !301, file: !162, line: 492, baseType: !763, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "proxy_worker_shared", file: !162, line: 483, baseType: !163)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "balancer", scope: !301, file: !162, line: 493, baseType: !766, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "proxy_balancer", file: !162, line: 109, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proxy_balancer", file: !162, line: 544, size: 960, elements: !769)
!769 = !{!770, !771, !772, !777, !831, !832, !833, !834, !835, !855, !860, !861, !864, !865, !900, !901, !902, !903, !904}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "workers", scope: !768, file: !162, line: 545, baseType: !281, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "errstatuses", scope: !768, file: !162, line: 546, baseType: !281, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "wslot", scope: !768, file: !162, line: 547, baseType: !773, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_slotmem_instance_t", file: !775, line: 75, baseType: !776)
!775 = !DIFile(filename: "include/ap_slotmem.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "6ee60fa7abb26ba4349a0486e09ea431")
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_slotmem_instance_t", file: !775, line: 75, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !768, file: !162, line: 548, baseType: !778, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_slotmem_provider_t", file: !775, line: 192, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_slotmem_provider_t", file: !775, line: 86, size: 832, elements: !781)
!781 = !{!782, !783, !791, !797, !802, !807, !812, !813, !817, !818, !822, !826, !830}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !780, file: !775, line: 90, baseType: !33, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "doall", scope: !780, file: !775, line: 99, baseType: !784, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!47, !773, !787, !42, !94}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_slotmem_callback_fn_t", file: !775, line: 84, baseType: !789)
!789 = !DISubroutineType(types: !790)
!790 = !{!47, !42, !42, !94}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !780, file: !775, line: 111, baseType: !792, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!47, !795, !33, !65, !13, !796, !94}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_slotmem_type_t", file: !775, line: 55, baseType: !13)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "attach", scope: !780, file: !775, line: 122, baseType: !798, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!47, !795, !33, !84, !801, !94}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "dptr", scope: !780, file: !775, line: 130, baseType: !803, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!47, !773, !13, !806}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !780, file: !775, line: 139, baseType: !808, size: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!47, !773, !13, !811, !65}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !780, file: !775, line: 148, baseType: !808, size: 64, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "num_slots", scope: !780, file: !775, line: 154, baseType: !814, size: 64, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!13, !773}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "num_free_slots", scope: !780, file: !775, line: 162, baseType: !814, size: 64, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "slot_size", scope: !780, file: !775, line: 168, baseType: !819, size: 64, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!65, !773}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "grab", scope: !780, file: !775, line: 175, baseType: !823, size: 64, offset: 640)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!47, !773, !801}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !780, file: !775, line: 182, baseType: !827, size: 64, offset: 704)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!47, !773, !13}
