; ModuleID = 'samples/102.bc'
source_filename = "ecdb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.dns_dbmethods = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.dns_rdatasetitermethods = type { ptr, ptr, ptr, ptr }
%struct.dns_rdatasetmethods = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.dns_ecdb = type { %struct.dns_db, %union.pthread_mutex_t, i32, %struct.anon.7 }
%struct.dns_db = type { i32, i32, ptr, i16, i16, %struct.dns_name, ptr, %struct.anon.6 }
%struct.dns_name = type { i32, ptr, i32, i32, i32, ptr, ptr, %struct.anon.4, %struct.anon.5 }
%struct.anon.4 = type { ptr, ptr }
%struct.anon.5 = type { ptr, ptr }
%struct.anon.6 = type { ptr, ptr }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.anon.7 = type { ptr, ptr }
%struct.dns_ecdbnode = type { i32, %union.pthread_mutex_t, ptr, %struct.dns_name, %struct.anon.8, %struct.anon.9, i32 }
%struct.anon.8 = type { ptr, ptr }
%struct.anon.9 = type { ptr, ptr }

!70 = !DIEnumerator(name: "dns_rdatatype_none", value: 0)
!71 = !DIEnumerator(name: "dns_rdatatype_a", value: 1)
!72 = !DIEnumerator(name: "dns_rdatatype_ns", value: 2)
!73 = !DIEnumerator(name: "dns_rdatatype_md", value: 3)
!74 = !DIEnumerator(name: "dns_rdatatype_mf", value: 4)
!75 = !DIEnumerator(name: "dns_rdatatype_cname", value: 5)
!76 = !DIEnumerator(name: "dns_rdatatype_soa", value: 6)
!77 = !DIEnumerator(name: "dns_rdatatype_mb", value: 7)
!78 = !DIEnumerator(name: "dns_rdatatype_mg", value: 8)
!79 = !DIEnumerator(name: "dns_rdatatype_mr", value: 9)
!80 = !DIEnumerator(name: "dns_rdatatype_null", value: 10)
!81 = !DIEnumerator(name: "dns_rdatatype_wks", value: 11)
!82 = !DIEnumerator(name: "dns_rdatatype_ptr", value: 12)
!83 = !DIEnumerator(name: "dns_rdatatype_hinfo", value: 13)
!84 = !DIEnumerator(name: "dns_rdatatype_minfo", value: 14)
!85 = !DIEnumerator(name: "dns_rdatatype_mx", value: 15)
!86 = !DIEnumerator(name: "dns_rdatatype_txt", value: 16)
!87 = !DIEnumerator(name: "dns_rdatatype_rp", value: 17)
!88 = !DIEnumerator(name: "dns_rdatatype_afsdb", value: 18)
!89 = !DIEnumerator(name: "dns_rdatatype_x25", value: 19)
!90 = !DIEnumerator(name: "dns_rdatatype_isdn", value: 20)
!91 = !DIEnumerator(name: "dns_rdatatype_rt", value: 21)
!92 = !DIEnumerator(name: "dns_rdatatype_nsap", value: 22)
!93 = !DIEnumerator(name: "dns_rdatatype_nsap_ptr", value: 23)
!94 = !DIEnumerator(name: "dns_rdatatype_sig", value: 24)
!95 = !DIEnumerator(name: "dns_rdatatype_key", value: 25)
!96 = !DIEnumerator(name: "dns_rdatatype_px", value: 26)
!97 = !DIEnumerator(name: "dns_rdatatype_gpos", value: 27)
!98 = !DIEnumerator(name: "dns_rdatatype_aaaa", value: 28)
!99 = !DIEnumerator(name: "dns_rdatatype_loc", value: 29)
!100 = !DIEnumerator(name: "dns_rdatatype_nxt", value: 30)
!101 = !DIEnumerator(name: "dns_rdatatype_eid", value: 31)
!102 = !DIEnumerator(name: "dns_rdatatype_nimloc", value: 32)
!103 = !DIEnumerator(name: "dns_rdatatype_srv", value: 33)
!104 = !DIEnumerator(name: "dns_rdatatype_atma", value: 34)
!105 = !DIEnumerator(name: "dns_rdatatype_naptr", value: 35)
!106 = !DIEnumerator(name: "dns_rdatatype_kx", value: 36)
!107 = !DIEnumerator(name: "dns_rdatatype_cert", value: 37)
!108 = !DIEnumerator(name: "dns_rdatatype_a6", value: 38)
!109 = !DIEnumerator(name: "dns_rdatatype_dname", value: 39)
!110 = !DIEnumerator(name: "dns_rdatatype_sink", value: 40)
!111 = !DIEnumerator(name: "dns_rdatatype_opt", value: 41)
!112 = !DIEnumerator(name: "dns_rdatatype_apl", value: 42)
!113 = !DIEnumerator(name: "dns_rdatatype_ds", value: 43)
!114 = !DIEnumerator(name: "dns_rdatatype_sshfp", value: 44)
!115 = !DIEnumerator(name: "dns_rdatatype_ipseckey", value: 45)
!116 = !DIEnumerator(name: "dns_rdatatype_rrsig", value: 46)
!117 = !DIEnumerator(name: "dns_rdatatype_nsec", value: 47)
!118 = !DIEnumerator(name: "dns_rdatatype_dnskey", value: 48)
!119 = !DIEnumerator(name: "dns_rdatatype_dhcid", value: 49)
!120 = !DIEnumerator(name: "dns_rdatatype_nsec3", value: 50)
!121 = !DIEnumerator(name: "dns_rdatatype_nsec3param", value: 51)
!122 = !DIEnumerator(name: "dns_rdatatype_tlsa", value: 52)
!123 = !DIEnumerator(name: "dns_rdatatype_smimea", value: 53)
!124 = !DIEnumerator(name: "dns_rdatatype_hip", value: 55)
!125 = !DIEnumerator(name: "dns_rdatatype_ninfo", value: 56)
!126 = !DIEnumerator(name: "dns_rdatatype_rkey", value: 57)
!127 = !DIEnumerator(name: "dns_rdatatype_talink", value: 58)
!128 = !DIEnumerator(name: "dns_rdatatype_cds", value: 59)
!129 = !DIEnumerator(name: "dns_rdatatype_cdnskey", value: 60)
!130 = !DIEnumerator(name: "dns_rdatatype_openpgpkey", value: 61)
!131 = !DIEnumerator(name: "dns_rdatatype_csync", value: 62)
!132 = !DIEnumerator(name: "dns_rdatatype_zonemd", value: 63)
!133 = !DIEnumerator(name: "dns_rdatatype_spf", value: 99)
!134 = !DIEnumerator(name: "dns_rdatatype_nid", value: 104)
!135 = !DIEnumerator(name: "dns_rdatatype_l32", value: 105)
!136 = !DIEnumerator(name: "dns_rdatatype_l64", value: 106)
!137 = !DIEnumerator(name: "dns_rdatatype_lp", value: 107)
!138 = !DIEnumerator(name: "dns_rdatatype_eui48", value: 108)
!139 = !DIEnumerator(name: "dns_rdatatype_eui64", value: 109)
!140 = !DIEnumerator(name: "dns_rdatatype_tkey", value: 249)
!141 = !DIEnumerator(name: "dns_rdatatype_tsig", value: 250)
!142 = !DIEnumerator(name: "dns_rdatatype_uri", value: 256)
!143 = !DIEnumerator(name: "dns_rdatatype_caa", value: 257)
!144 = !DIEnumerator(name: "dns_rdatatype_avc", value: 258)
!145 = !DIEnumerator(name: "dns_rdatatype_doa", value: 259)
!146 = !DIEnumerator(name: "dns_rdatatype_amtrelay", value: 260)
!147 = !DIEnumerator(name: "dns_rdatatype_ta", value: 32768)
!148 = !DIEnumerator(name: "dns_rdatatype_dlv", value: 32769)
!149 = !DIEnumerator(name: "dns_rdatatype_keydata", value: 65533)
!150 = !DIEnumerator(name: "dns_rdatatype_ixfr", value: 251)
!151 = !DIEnumerator(name: "dns_rdatatype_axfr", value: 252)
!152 = !DIEnumerator(name: "dns_rdatatype_mailb", value: 253)
!153 = !DIEnumerator(name: "dns_rdatatype_maila", value: 254)
!154 = !DIEnumerator(name: "dns_rdatatype_any", value: 255)
!155 = !{!156, !157, !969, !1041, !1043, !291, !698, !1050, !401, !1056}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_db_t", file: !53, line: 54, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_db", file: !160, line: 223, size: 1024, elements: !161)
!160 = !DIFile(filename: "include/dns/db.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "f7341a6445a0da00d6edbc7f74bf2ce5")
!161 = !{!162, !163, !164, !945, !946, !947, !948, !949}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !159, file: !160, line: 224, baseType: !46, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !159, file: !160, line: 225, baseType: !46, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !159, file: !160, line: 226, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbmethods_t", file: !160, line: 200, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_dbmethods", file: !160, line: 71, size: 3072, elements: !168)
!168 = !{!169, !174, !178, !187, !188, !255, !261, !266, !270, !274, !279, !657, !661, !665, !669, !673, !677, !681, !689, !693, !726, !730, !734, !738, !742, !746, !747, !751, !758, !762, !766, !777, !778, !782, !786, !790, !791, !798, !802, !806, !909, !913, !920, !924, !928, !935, !939, !944}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "attach", scope: !167, file: !160, line: 72, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !157, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !167, file: !160, line: 73, baseType: !175, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !173}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "beginload", scope: !167, file: !160, line: 74, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !157, !184}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_result_t", file: !183, line: 67, baseType: !46)
!183 = !DIFile(filename: "isc/include/isc/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "6a355582c4f962c465b18bab43b68c96")
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatacallbacks_t", file: !53, line: 120, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatacallbacks", file: !53, line: 120, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "endload", scope: !167, file: !160, line: 76, baseType: !179, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "serialize", scope: !167, file: !160, line: 78, baseType: !189, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!182, !157, !192, !194}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbversion_t", file: !53, line: 61, baseType: null)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !196, line: 7, baseType: !197)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !198, line: 49, size: 1728, elements: !199)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!199 = !{!200, !202, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !217, !219, !220, !221, !225, !227, !229, !233, !236, !238, !241, !244, !245, !246, !250, !251}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !197, file: !198, line: 51, baseType: !201, size: 32)
!201 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !197, file: !198, line: 54, baseType: !203, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !197, file: !198, line: 55, baseType: !203, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !197, file: !198, line: 56, baseType: !203, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !197, file: !198, line: 57, baseType: !203, size: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !197, file: !198, line: 58, baseType: !203, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !197, file: !198, line: 59, baseType: !203, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !197, file: !198, line: 60, baseType: !203, size: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !197, file: !198, line: 61, baseType: !203, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !197, file: !198, line: 64, baseType: !203, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !197, file: !198, line: 65, baseType: !203, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !197, file: !198, line: 66, baseType: !203, size: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !197, file: !198, line: 68, baseType: !215, size: 64, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !198, line: 36, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !197, file: !198, line: 70, baseType: !218, size: 64, offset: 832)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !197, file: !198, line: 72, baseType: !201, size: 32, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !197, file: !198, line: 73, baseType: !201, size: 32, offset: 928)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !197, file: !198, line: 74, baseType: !222, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !223, line: 152, baseType: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!224 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !197, file: !198, line: 77, baseType: !226, size: 16, offset: 1024)
!226 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !197, file: !198, line: 78, baseType: !228, size: 8, offset: 1040)
!228 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !197, file: !198, line: 79, baseType: !230, size: 8, offset: 1048)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 1)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !197, file: !198, line: 81, baseType: !234, size: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !198, line: 43, baseType: null)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !197, file: !198, line: 89, baseType: !237, size: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !223, line: 153, baseType: !224)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !197, file: !198, line: 91, baseType: !239, size: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !198, line: 37, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !197, file: !198, line: 92, baseType: !242, size: 64, offset: 1280)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !198, line: 38, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !197, file: !198, line: 93, baseType: !218, size: 64, offset: 1344)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !197, file: !198, line: 94, baseType: !156, size: 64, offset: 1408)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !197, file: !198, line: 95, baseType: !247, size: 64, offset: 1472)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !248, line: 70, baseType: !249)
!248 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!249 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !197, file: !198, line: 96, baseType: !201, size: 32, offset: 1536)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !197, file: !198, line: 98, baseType: !252, size: 160, offset: 1568)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 20)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !167, file: !160, line: 80, baseType: !256, size: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!182, !157, !192, !259, !260}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_masterformat_t", file: !53, line: 218, baseType: !58)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "currentversion", scope: !167, file: !160, line: 83, baseType: !262, size: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !157, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "newversion", scope: !167, file: !160, line: 85, baseType: !267, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!182, !157, !265}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "attachversion", scope: !167, file: !160, line: 87, baseType: !271, size: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !157, !192, !265}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "closeversion", scope: !167, file: !160, line: 89, baseType: !275, size: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !157, !265, !278}
!278 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "findnode", scope: !167, file: !160, line: 92, baseType: !280, size: 64, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!182, !157, !283, !278, !654}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_name_t", file: !53, line: 107, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_name", file: !287, line: 104, size: 640, elements: !288)
!287 = !DIFile(filename: "include/dns/name.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "ec64c9a43875cd86cb4b0e37c1191a89")
!288 = !{!289, !290, !293, !294, !295, !296, !297, !354, !360}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !286, file: !287, line: 105, baseType: !46, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ndata", scope: !286, file: !287, line: 106, baseType: !291, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !286, file: !287, line: 107, baseType: !46, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !286, file: !287, line: 108, baseType: !46, size: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !286, file: !287, line: 109, baseType: !46, size: 32, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !286, file: !287, line: 110, baseType: !291, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !286, file: !287, line: 111, baseType: !298, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_buffer_t", file: !183, line: 35, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_buffer", file: !301, line: 173, size: 512, elements: !302)
!301 = !DIFile(filename: "isc/include/isc/buffer.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "feec9784066f3891a27281dd5bdccd55")
!302 = !{!303, !304, !305, !306, !307, !308, !309, !314, !353}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !300, file: !301, line: 174, baseType: !46, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !300, file: !301, line: 175, baseType: !156, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !300, file: !301, line: 178, baseType: !46, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !300, file: !301, line: 179, baseType: !46, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !300, file: !301, line: 180, baseType: !46, size: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !300, file: !301, line: 181, baseType: !46, size: 32, offset: 224)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !300, file: !301, line: 184, baseType: !310, size: 128, offset: 256)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !301, line: 184, size: 128, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !310, file: !301, line: 184, baseType: !298, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !301, line: 184, baseType: !298, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !300, file: !301, line: 186, baseType: !315, size: 64, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mem_t", file: !183, line: 59, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mem", file: !318, line: 191, size: 128, elements: !319)
!318 = !DIFile(filename: "isc/include/isc/mem.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "587a841195795b087519b89f298822b2")
!319 = !{!320, !321, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !317, file: !318, line: 192, baseType: !46, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !317, file: !318, line: 193, baseType: !46, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !317, file: !318, line: 194, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_memmethods_t", file: !318, line: 180, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_memmethods", file: !318, line: 170, size: 448, elements: !326)
!326 = !{!327, !331, !335, !340, !341, !345, !349}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "memget", scope: !325, file: !318, line: 171, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!156, !315, !247, !259, !46}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "memput", scope: !325, file: !318, line: 172, baseType: !332, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !315, !156, !247, !259, !46}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "memputanddetach", scope: !325, file: !318, line: 173, baseType: !336, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !339, !156, !247, !259, !46}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "memallocate", scope: !325, file: !318, line: 175, baseType: !328, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "memreallocate", scope: !325, file: !318, line: 176, baseType: !342, size: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!156, !315, !156, !247, !259, !46}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "memstrdup", scope: !325, file: !318, line: 178, baseType: !346, size: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!203, !315, !259, !259, !46}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "memfree", scope: !325, file: !318, line: 179, baseType: !350, size: 64, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !315, !156, !259, !46}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "autore", scope: !300, file: !301, line: 188, baseType: !278, size: 8, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !286, file: !287, line: 112, baseType: !355, size: 128, offset: 384)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !287, line: 112, size: 128, elements: !356)
!356 = !{!357, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !355, file: !287, line: 112, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !287, line: 112, baseType: !358, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !286, file: !287, line: 113, baseType: !361, size: 128, offset: 512)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !287, line: 113, size: 128, elements: !362)
!362 = !{!363, !653}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !361, file: !287, line: 113, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataset_t", file: !53, line: 123, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdataset", file: !367, line: 107, size: 960, elements: !368)
!367 = !DIFile(filename: "include/dns/rdataset.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "a2414fd23f718a363582354673aed6a8")
!368 = !{!369, !370, !627, !632, !633, !634, !638, !639, !640, !641, !642, !643, !646, !647, !648, !649, !650, !651, !652}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !366, file: !367, line: 108, baseType: !46, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !366, file: !367, line: 109, baseType: !371, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetmethods_t", file: !367, line: 96, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetmethods", file: !367, line: 64, size: 1024, elements: !374)
!374 = !{!375, !379, !383, !384, !408, !412, !416, !420, !424, !425, !426, !431, !432, !433, !437, !443}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "disassociate", scope: !373, file: !367, line: 65, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !364}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !373, file: !367, line: 66, baseType: !380, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!182, !364}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !373, file: !367, line: 67, baseType: !380, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !373, file: !367, line: 68, baseType: !385, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !364, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdata_t", file: !53, line: 119, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdata", file: !391, line: 112, size: 320, elements: !392)
!391 = !DIFile(filename: "include/dns/rdata.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "e790fb4f336bc4fdcd566550403b32a6")
!392 = !{!393, !394, !395, !400, !402, !403}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !391, line: 113, baseType: !291, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !390, file: !391, line: 114, baseType: !46, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !390, file: !391, line: 115, baseType: !396, size: 16, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataclass_t", file: !53, line: 121, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !398, line: 25, baseType: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !223, line: 40, baseType: !226)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !391, line: 116, baseType: !401, size: 16, offset: 112)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatatype_t", file: !53, line: 126, baseType: !397)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !390, file: !391, line: 117, baseType: !46, size: 32, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !390, file: !391, line: 118, baseType: !404, size: 128, offset: 192)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !391, line: 118, size: 128, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !404, file: !391, line: 118, baseType: !388, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !391, line: 118, baseType: !388, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !373, file: !367, line: 70, baseType: !409, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !364, !364}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !373, file: !367, line: 72, baseType: !413, size: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!46, !364}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "addnoqname", scope: !373, file: !367, line: 73, baseType: !417, size: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!182, !364, !283}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "getnoqname", scope: !373, file: !367, line: 75, baseType: !421, size: 64, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!182, !364, !358, !364, !364}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "addclosest", scope: !373, file: !367, line: 79, baseType: !417, size: 64, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "getclosest", scope: !373, file: !367, line: 81, baseType: !421, size: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "settrust", scope: !373, file: !367, line: 85, baseType: !427, size: 64, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !364, !430}
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_trust_t", file: !53, line: 140, baseType: !397)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !373, file: !367, line: 87, baseType: !376, size: 64, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "clearprefetch", scope: !373, file: !367, line: 88, baseType: !376, size: 64, offset: 768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "setownercase", scope: !373, file: !367, line: 89, baseType: !434, size: 64, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !364, !283}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "getownercase", scope: !373, file: !367, line: 91, baseType: !438, size: 64, offset: 896)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !441, !358}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "addglue", scope: !373, file: !367, line: 93, baseType: !444, size: 64, offset: 960)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!182, !364, !192, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_message_t", file: !53, line: 103, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_message", file: !450, line: 197, size: 3840, elements: !451)
!450 = !DIFile(filename: "include/dns/message.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "6416f0e57c4314c86bb1ccbb29bdbc0d")
!451 = !{!452, !453, !455, !456, !458, !460, !461, !465, !472, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !530, !531, !538, !539, !545, !546, !554, !559, !564, !569, !577, !578, !579, !580, !581, !585, !590, !591, !592, !593, !597, !598, !599, !600, !609}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !449, file: !450, line: 199, baseType: !46, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !449, file: !450, line: 201, baseType: !454, size: 16, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_messageid_t", file: !53, line: 104, baseType: !397)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !449, file: !450, line: 202, baseType: !46, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !449, file: !450, line: 203, baseType: !457, size: 16, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rcode_t", file: !53, line: 118, baseType: !397)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !449, file: !450, line: 204, baseType: !459, size: 16, offset: 112)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_opcode_t", file: !53, line: 111, baseType: !397)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !449, file: !450, line: 205, baseType: !396, size: 16, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !449, file: !450, line: 208, baseType: !462, size: 128, offset: 160)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 4)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sections", scope: !449, file: !450, line: 211, baseType: !466, size: 512, offset: 320)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 512, elements: !463)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_namelist_t", file: !53, line: 108, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 108, size: 128, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !468, file: !53, line: 108, baseType: !358, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !468, file: !53, line: 108, baseType: !358, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cursors", scope: !449, file: !450, line: 212, baseType: !473, size: 256, offset: 832)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 256, elements: !463)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !449, file: !450, line: 213, baseType: !364, size: 64, offset: 1088)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sig0", scope: !449, file: !450, line: 214, baseType: !364, size: 64, offset: 1152)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tsig", scope: !449, file: !450, line: 215, baseType: !364, size: 64, offset: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !449, file: !450, line: 217, baseType: !201, size: 32, offset: 1280)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "from_to_wire", scope: !449, file: !450, line: 218, baseType: !46, size: 2, offset: 1312, flags: DIFlagBitField, extraData: i64 1312)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "header_ok", scope: !449, file: !450, line: 219, baseType: !46, size: 1, offset: 1314, flags: DIFlagBitField, extraData: i64 1312)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "question_ok", scope: !449, file: !450, line: 220, baseType: !46, size: 1, offset: 1315, flags: DIFlagBitField, extraData: i64 1312)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_continuation", scope: !449, file: !450, line: 221, baseType: !46, size: 1, offset: 1316, flags: DIFlagBitField, extraData: i64 1312)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "verified_sig", scope: !449, file: !450, line: 222, baseType: !46, size: 1, offset: 1317, flags: DIFlagBitField, extraData: i64 1312)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "verify_attempted", scope: !449, file: !450, line: 223, baseType: !46, size: 1, offset: 1318, flags: DIFlagBitField, extraData: i64 1312)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "free_query", scope: !449, file: !450, line: 224, baseType: !46, size: 1, offset: 1319, flags: DIFlagBitField, extraData: i64 1312)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "free_saved", scope: !449, file: !450, line: 225, baseType: !46, size: 1, offset: 1320, flags: DIFlagBitField, extraData: i64 1312)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cc_ok", scope: !449, file: !450, line: 226, baseType: !46, size: 1, offset: 1321, flags: DIFlagBitField, extraData: i64 1312)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cc_bad", scope: !449, file: !450, line: 227, baseType: !46, size: 1, offset: 1322, flags: DIFlagBitField, extraData: i64 1312)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tkey", scope: !449, file: !450, line: 228, baseType: !46, size: 1, offset: 1323, flags: DIFlagBitField, extraData: i64 1312)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass_set", scope: !449, file: !450, line: 229, baseType: !46, size: 1, offset: 1324, flags: DIFlagBitField, extraData: i64 1312)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "opt_reserved", scope: !449, file: !450, line: 231, baseType: !46, size: 32, offset: 1344)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sig_reserved", scope: !449, file: !450, line: 232, baseType: !46, size: 32, offset: 1376)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !449, file: !450, line: 233, baseType: !46, size: 32, offset: 1408)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !449, file: !450, line: 235, baseType: !397, size: 16, offset: 1440)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "padding_off", scope: !449, file: !450, line: 236, baseType: !46, size: 32, offset: 1472)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !449, file: !450, line: 238, baseType: !298, size: 64, offset: 1536)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "cctx", scope: !449, file: !450, line: 239, baseType: !497, size: 64, offset: 1600)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compress_t", file: !53, line: 53, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compress", file: !500, line: 66, size: 18688, elements: !501)
!500 = !DIFile(filename: "include/dns/compress.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "ae360072e6dd15c4fe76c4efa2dcea4c")
!501 = !{!502, !503, !504, !505, !524, !528, !529}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !499, file: !500, line: 67, baseType: !46, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !499, file: !500, line: 68, baseType: !46, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "edns", scope: !499, file: !500, line: 69, baseType: !201, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !499, file: !500, line: 71, baseType: !506, size: 4096, offset: 128)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 4096, elements: !522)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compressnode_t", file: !500, line: 56, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compressnode", file: !500, line: 58, size: 896, elements: !510)
!510 = !{!511, !512, !513, !514, !521}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !500, line: 59, baseType: !507, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !509, file: !500, line: 60, baseType: !397, size: 16, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !509, file: !500, line: 61, baseType: !397, size: 16, offset: 80)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !509, file: !500, line: 62, baseType: !515, size: 128, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_region_t", file: !183, line: 65, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_region", file: !517, line: 21, size: 128, elements: !518)
!517 = !DIFile(filename: "isc/include/isc/region.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "2ed4a07dc05ddbd48f51e2dc9be9f317")
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !516, file: !517, line: 22, baseType: !291, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !516, file: !517, line: 23, baseType: !46, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !509, file: !500, line: 63, baseType: !285, size: 640, offset: 256)
!522 = !{!523}
!523 = !DISubrange(count: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "initialnodes", scope: !499, file: !500, line: 73, baseType: !525, size: 14336, offset: 4224)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 14336, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 16)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !499, file: !500, line: 74, baseType: !397, size: 16, offset: 18560)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !499, file: !500, line: 75, baseType: !315, size: 64, offset: 18624)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !449, file: !450, line: 241, baseType: !315, size: 64, offset: 1664)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "namepool", scope: !449, file: !450, line: 242, baseType: !532, size: 64, offset: 1728)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mempool_t", file: !183, line: 60, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mempool", file: !318, line: 205, size: 64, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !534, file: !318, line: 206, baseType: !46, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !534, file: !318, line: 207, baseType: !46, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rdspool", scope: !449, file: !450, line: 243, baseType: !532, size: 64, offset: 1792)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "scratchpad", scope: !449, file: !450, line: 245, baseType: !540, size: 128, offset: 1856)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_bufferlist_t", file: !183, line: 36, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 36, size: 128, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !541, file: !183, line: 36, baseType: !298, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !541, file: !183, line: 36, baseType: !298, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !449, file: !450, line: 246, baseType: !540, size: 128, offset: 1984)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rdatas", scope: !449, file: !450, line: 248, baseType: !547, size: 128, offset: 2112)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !450, line: 248, size: 128, elements: !548)
!548 = !{!549, !553}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !547, file: !450, line: 248, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_msgblock_t", file: !450, line: 189, baseType: !552)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_msgblock", file: !450, line: 189, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !547, file: !450, line: 248, baseType: !550, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rdatalists", scope: !449, file: !450, line: 249, baseType: !555, size: 128, offset: 2240)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !450, line: 249, size: 128, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !555, file: !450, line: 249, baseType: !550, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !555, file: !450, line: 249, baseType: !550, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !449, file: !450, line: 250, baseType: !560, size: 128, offset: 2368)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !450, line: 250, size: 128, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !560, file: !450, line: 250, baseType: !550, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !560, file: !450, line: 250, baseType: !550, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "freerdata", scope: !449, file: !450, line: 252, baseType: !565, size: 128, offset: 2496)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !450, line: 252, size: 128, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !565, file: !450, line: 252, baseType: !388, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !565, file: !450, line: 252, baseType: !388, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "freerdatalist", scope: !449, file: !450, line: 253, baseType: !570, size: 128, offset: 2624)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !450, line: 253, size: 128, elements: !571)
!571 = !{!572, !576}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !570, file: !450, line: 253, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatalist_t", file: !53, line: 122, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatalist", file: !53, line: 122, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !570, file: !450, line: 253, baseType: !573, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tsigstatus", scope: !449, file: !450, line: 255, baseType: !457, size: 16, offset: 2752)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "querytsigstatus", scope: !449, file: !450, line: 256, baseType: !457, size: 16, offset: 2768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tsigname", scope: !449, file: !450, line: 257, baseType: !358, size: 64, offset: 2816)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "querytsig", scope: !449, file: !450, line: 258, baseType: !364, size: 64, offset: 2880)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tsigkey", scope: !449, file: !450, line: 259, baseType: !582, size: 64, offset: 2944)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_tsigkey_t", file: !53, line: 143, baseType: !584)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_tsigkey", file: !53, line: 143, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tsigctx", scope: !449, file: !450, line: 260, baseType: !586, size: 64, offset: 3008)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_context_t", file: !588, line: 45, baseType: !589)
!588 = !DIFile(filename: "include/dst/dst.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "10e76bcacbe005e6cc7dee2ac6ffac9a")
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_context", file: !588, line: 45, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sigstart", scope: !449, file: !450, line: 261, baseType: !201, size: 32, offset: 3072)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "timeadjust", scope: !449, file: !450, line: 262, baseType: !201, size: 32, offset: 3104)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sig0name", scope: !449, file: !450, line: 264, baseType: !358, size: 64, offset: 3136)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "sig0key", scope: !449, file: !450, line: 265, baseType: !594, size: 64, offset: 3200)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_key_t", file: !588, line: 44, baseType: !596)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_key", file: !588, line: 44, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sig0status", scope: !449, file: !450, line: 266, baseType: !457, size: 16, offset: 3264)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !449, file: !450, line: 267, baseType: !515, size: 128, offset: 3328)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !449, file: !450, line: 268, baseType: !515, size: 128, offset: 3456)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !449, file: !450, line: 270, baseType: !601, size: 64, offset: 3584)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetorderfunc_t", file: !53, line: 415, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!201, !605, !607}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "order_arg", scope: !449, file: !450, line: 271, baseType: !610, size: 192, offset: 3648)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_sortlist_arg_t", file: !53, line: 134, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_sortlist_arg", file: !450, line: 191, size: 192, elements: !612)
!612 = !{!613, !617, !622}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !611, file: !450, line: 192, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclenv_t", file: !53, line: 32, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclenv", file: !53, line: 32, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !611, file: !450, line: 193, baseType: !618, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_acl_t", file: !53, line: 30, baseType: !621)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_acl", file: !53, line: 30, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !611, file: !450, line: 194, baseType: !623, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclelement_t", file: !53, line: 31, baseType: !626)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclelement", file: !53, line: 31, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !366, file: !367, line: 110, baseType: !628, size: 128, offset: 128)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !366, file: !367, line: 110, size: 128, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !628, file: !367, line: 110, baseType: !364, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !628, file: !367, line: 110, baseType: !364, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !366, file: !367, line: 117, baseType: !396, size: 16, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !367, line: 118, baseType: !401, size: 16, offset: 272)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !366, file: !367, line: 119, baseType: !635, size: 32, offset: 288)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_ttl_t", file: !53, line: 144, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !398, line: 26, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !223, line: 42, baseType: !46)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "stale_ttl", scope: !366, file: !367, line: 124, baseType: !635, size: 32, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !366, file: !367, line: 125, baseType: !430, size: 16, offset: 352)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "covers", scope: !366, file: !367, line: 126, baseType: !401, size: 16, offset: 368)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !366, file: !367, line: 131, baseType: !46, size: 32, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !366, file: !367, line: 139, baseType: !636, size: 32, offset: 416)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "resign", scope: !366, file: !367, line: 145, baseType: !644, size: 32, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_stdtime_t", file: !645, line: 26, baseType: !636)
!645 = !DIFile(filename: "../../lib/isc/unix/include/isc/stdtime.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "b8868fded6c0eb282ad50986c628a693")
!646 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !366, file: !367, line: 152, baseType: !156, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !366, file: !367, line: 153, baseType: !156, size: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !366, file: !367, line: 154, baseType: !156, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "privateuint4", scope: !366, file: !367, line: 155, baseType: !46, size: 32, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !366, file: !367, line: 156, baseType: !156, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !366, file: !367, line: 157, baseType: !607, size: 64, offset: 832)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "private7", scope: !366, file: !367, line: 158, baseType: !607, size: 64, offset: 896)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !361, file: !287, line: 113, baseType: !364, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbnode_t", file: !53, line: 58, baseType: null)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !167, file: !160, line: 95, baseType: !658, size: 64, offset: 704)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!182, !157, !283, !192, !401, !46, !644, !654, !358, !364, !364}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "findzonecut", scope: !167, file: !160, line: 102, baseType: !662, size: 64, offset: 768)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!182, !157, !283, !46, !644, !654, !358, !358, !364, !364}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "attachnode", scope: !167, file: !160, line: 109, baseType: !666, size: 64, offset: 832)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !157, !655, !654}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "detachnode", scope: !167, file: !160, line: 112, baseType: !670, size: 64, offset: 896)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !157, !654}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "expirenode", scope: !167, file: !160, line: 114, baseType: !674, size: 64, offset: 960)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!182, !157, !655, !644}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "printnode", scope: !167, file: !160, line: 116, baseType: !678, size: 64, offset: 1024)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !157, !655, !194}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "createiterator", scope: !167, file: !160, line: 118, baseType: !682, size: 64, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!182, !157, !46, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbiterator_t", file: !53, line: 56, baseType: !688)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_dbiterator", file: !53, line: 56, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "findrdataset", scope: !167, file: !160, line: 120, baseType: !690, size: 64, offset: 1152)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!182, !157, !655, !192, !401, !401, !644, !364, !364}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "allrdatasets", scope: !167, file: !160, line: 127, baseType: !694, size: 64, offset: 1216)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!182, !157, !655, !192, !644, !697}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetiter_t", file: !53, line: 125, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetiter", file: !701, line: 89, size: 384, elements: !702)
!701 = !DIFile(filename: "include/dns/rdatasetiter.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "9746ed7a00ac2faebfbf0cffc47d675f")
!702 = !{!703, !704, !722, !723, !724, !725}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !700, file: !701, line: 91, baseType: !46, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !700, file: !701, line: 92, baseType: !705, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetitermethods_t", file: !701, line: 75, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetitermethods", file: !701, line: 69, size: 256, elements: !708)
!708 = !{!709, !713, !717, !718}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !707, file: !701, line: 70, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !697}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !707, file: !701, line: 71, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!182, !698}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !707, file: !701, line: 72, baseType: !714, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !707, file: !701, line: 73, baseType: !719, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !698, !364}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !700, file: !701, line: 93, baseType: !157, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !700, file: !701, line: 94, baseType: !655, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !700, file: !701, line: 95, baseType: !192, size: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "now", scope: !700, file: !701, line: 96, baseType: !644, size: 32, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "addrdataset", scope: !167, file: !160, line: 131, baseType: !727, size: 64, offset: 1280)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!182, !157, !655, !192, !644, !364, !46, !364}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "subtractrdataset", scope: !167, file: !160, line: 137, baseType: !731, size: 64, offset: 1344)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!182, !157, !655, !192, !364, !46, !364}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "deleterdataset", scope: !167, file: !160, line: 142, baseType: !735, size: 64, offset: 1408)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!182, !157, !655, !192, !401, !401}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "issecure", scope: !167, file: !160, line: 146, baseType: !739, size: 64, offset: 1472)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!278, !157}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nodecount", scope: !167, file: !160, line: 147, baseType: !743, size: 64, offset: 1536)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!46, !157}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ispersistent", scope: !167, file: !160, line: 148, baseType: !739, size: 64, offset: 1600)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "overmem", scope: !167, file: !160, line: 149, baseType: !748, size: 64, offset: 1664)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !157, !278}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "settask", scope: !167, file: !160, line: 150, baseType: !752, size: 64, offset: 1728)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !157, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_task_t", file: !183, line: 77, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_task", file: !183, line: 77, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "getoriginnode", scope: !167, file: !160, line: 151, baseType: !759, size: 64, offset: 1792)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!182, !157, !654}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "transfernode", scope: !167, file: !160, line: 152, baseType: !763, size: 64, offset: 1856)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !157, !654, !654}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getnsec3parameters", scope: !167, file: !160, line: 154, baseType: !767, size: 64, offset: 1920)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!182, !157, !192, !770, !772, !775, !291, !776}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_hash_t", file: !53, line: 166, baseType: !64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !398, line: 24, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !223, line: 38, baseType: !292)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "findnsec3node", scope: !167, file: !160, line: 161, baseType: !280, size: 64, offset: 1984)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "setsigningtime", scope: !167, file: !160, line: 164, baseType: !779, size: 64, offset: 2048)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!182, !157, !364, !644}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getsigningtime", scope: !167, file: !160, line: 167, baseType: !783, size: 64, offset: 2112)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!182, !157, !364, !358}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "resigned", scope: !167, file: !160, line: 170, baseType: !787, size: 64, offset: 2176)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !157, !364, !192}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "isdnssec", scope: !167, file: !160, line: 172, baseType: !739, size: 64, offset: 2240)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "getrrsetstats", scope: !167, file: !160, line: 173, baseType: !792, size: 64, offset: 2304)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!795, !157}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_stats_t", file: !53, line: 137, baseType: !797)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_stats", file: !53, line: 137, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rpz_attach", scope: !167, file: !160, line: 174, baseType: !799, size: 64, offset: 2368)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !157, !156, !773}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rpz_ready", scope: !167, file: !160, line: 176, baseType: !803, size: 64, offset: 2432)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!182, !157}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "findnodeext", scope: !167, file: !160, line: 177, baseType: !807, size: 64, offset: 2496)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!182, !157, !283, !278, !810, !822, !654}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_clientinfomethods_t", file: !812, line: 68, baseType: !813)
!812 = !DIFile(filename: "include/dns/clientinfo.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "f273dbbef534c5352c6d152e1993b2e9")
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_clientinfomethods", file: !812, line: 64, size: 128, elements: !814)
!814 = !{!815, !816, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !813, file: !812, line: 65, baseType: !397, size: 16)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !813, file: !812, line: 66, baseType: !397, size: 16, offset: 16)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sourceip", scope: !813, file: !812, line: 67, baseType: !818, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_clientinfo_sourceip_t", file: !812, line: 58, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!182, !822, !829}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_clientinfo_t", file: !812, line: 56, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_clientinfo", file: !812, line: 52, size: 192, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !824, file: !812, line: 53, baseType: !397, size: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !824, file: !812, line: 54, baseType: !156, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "dbversion", scope: !824, file: !812, line: 55, baseType: !156, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_sockaddr_t", file: !183, line: 69, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_sockaddr", file: !833, line: 27, size: 1216, elements: !834)
!833 = !DIFile(filename: "isc/include/isc/sockaddr.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "b46a0f057942d922d0824c5621821d46")
!834 = !{!835, !902, !903}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !832, file: !833, line: 36, baseType: !836, size: 1024)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !832, file: !833, line: 28, size: 1024, elements: !837)
!837 = !{!838, !849, !865, !884, !893}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !836, file: !833, line: 29, baseType: !839, size: 128)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !840, line: 180, size: 128, elements: !841)
!840 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!841 = !{!842, !845}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !839, file: !840, line: 182, baseType: !843, size: 16)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !844, line: 28, baseType: !226)
!844 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!845 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !839, file: !840, line: 183, baseType: !846, size: 112, offset: 16)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 112, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 14)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !836, file: !833, line: 30, baseType: !850, size: 128)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !851, line: 245, size: 128, elements: !852)
!851 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!852 = !{!853, !854, !856, !861}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !850, file: !851, line: 247, baseType: !843, size: 16)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !850, file: !851, line: 248, baseType: !855, size: 16, offset: 16)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !851, line: 123, baseType: !397)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !850, file: !851, line: 249, baseType: !857, size: 32, offset: 32)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !851, line: 31, size: 32, elements: !858)
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !857, file: !851, line: 33, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !851, line: 30, baseType: !636)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !850, file: !851, line: 252, baseType: !862, size: 64, offset: 64)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 64, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 8)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !836, file: !833, line: 31, baseType: !866, size: 224)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !851, line: 260, size: 224, elements: !867)
!867 = !{!868, !869, !870, !871, !883}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !866, file: !851, line: 262, baseType: !843, size: 16)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !866, file: !851, line: 263, baseType: !855, size: 16, offset: 16)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !866, file: !851, line: 264, baseType: !636, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !866, file: !851, line: 265, baseType: !872, size: 128, offset: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !851, line: 219, size: 128, elements: !873)
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !872, file: !851, line: 226, baseType: !875, size: 128)
!875 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !872, file: !851, line: 221, size: 128, elements: !876)
!876 = !{!877, !879, !881}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !875, file: !851, line: 223, baseType: !878, size: 128)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 128, elements: !526)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !875, file: !851, line: 224, baseType: !880, size: 128)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 128, elements: !863)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !875, file: !851, line: 225, baseType: !882, size: 128)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 128, elements: !463)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !866, file: !851, line: 266, baseType: !636, size: 32, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !836, file: !833, line: 32, baseType: !885, size: 1024)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !840, line: 193, size: 1024, elements: !886)
!886 = !{!887, !888, !892}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !885, file: !840, line: 195, baseType: !843, size: 16)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !885, file: !840, line: 196, baseType: !889, size: 944, offset: 16)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 944, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 118)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !885, file: !840, line: 197, baseType: !249, size: 64, offset: 960)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "sunix", scope: !836, file: !833, line: 34, baseType: !894, size: 880)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !895, line: 29, size: 880, elements: !896)
!895 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !894, file: !895, line: 31, baseType: !843, size: 16)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !894, file: !895, line: 32, baseType: !899, size: 864, offset: 16)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 864, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 108)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !832, file: !833, line: 37, baseType: !46, size: 32, offset: 1024)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !832, file: !833, line: 38, baseType: !904, size: 128, offset: 1088)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !832, file: !833, line: 38, size: 128, elements: !905)
!905 = !{!906, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !904, file: !833, line: 38, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !904, file: !833, line: 38, baseType: !907, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "findext", scope: !167, file: !160, line: 182, baseType: !910, size: 64, offset: 2560)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!182, !157, !283, !192, !401, !46, !644, !654, !358, !810, !822, !364, !364}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "setcachestats", scope: !167, file: !160, line: 191, baseType: !914, size: 64, offset: 2624)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!182, !157, !917}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_stats_t", file: !183, line: 74, baseType: !919)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_stats", file: !183, line: 74, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "hashsize", scope: !167, file: !160, line: 192, baseType: !921, size: 64, offset: 2688)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!247, !157}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "nodefullname", scope: !167, file: !160, line: 193, baseType: !925, size: 64, offset: 2752)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!182, !157, !655, !358}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !167, file: !160, line: 195, baseType: !929, size: 64, offset: 2816)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!182, !157, !192, !932, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !398, line: 27, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !223, line: 45, baseType: !249)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "setservestalettl", scope: !167, file: !160, line: 197, baseType: !936, size: 64, offset: 2880)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!182, !157, !635}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "getservestalettl", scope: !167, file: !160, line: 198, baseType: !940, size: 64, offset: 2944)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!182, !157, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "setgluecachestats", scope: !167, file: !160, line: 199, baseType: !914, size: 64, offset: 3008)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !159, file: !160, line: 227, baseType: !397, size: 16, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !159, file: !160, line: 228, baseType: !396, size: 16, offset: 144)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !159, file: !160, line: 229, baseType: !285, size: 640, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !159, file: !160, line: 230, baseType: !315, size: 64, offset: 832)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "update_listeners", scope: !159, file: !160, line: 231, baseType: !950, size: 128, offset: 896)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !159, file: !160, line: 231, size: 128, elements: !951)
!951 = !{!952, !968}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !950, file: !160, line: 231, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbonupdatelistener_t", file: !53, line: 59, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_dbonupdatelistener", file: !160, line: 237, size: 256, elements: !956)
!956 = !{!957, !962, !963}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "onupdate", scope: !955, file: !160, line: 238, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbupdate_callback_t", file: !160, line: 209, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!182, !157, !156}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "onupdate_arg", scope: !955, file: !160, line: 239, baseType: !156, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !955, file: !160, line: 240, baseType: !964, size: 128, offset: 128)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !955, file: !160, line: 240, size: 128, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !964, file: !160, line: 240, baseType: !953, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !964, file: !160, line: 240, baseType: !953, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !950, file: !160, line: 231, baseType: !953, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_ecdb_t", file: !2, line: 51, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_ecdb", file: !2, line: 43, size: 1536, elements: !972)
!972 = !{!973, !974, !1004, !1005}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !2, line: 45, baseType: !158, size: 1024)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !971, file: !2, line: 46, baseType: !975, size: 320, offset: 1024)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mutex_t", file: !976, line: 58, baseType: !977)
!976 = !DIFile(filename: "../../lib/isc/pthreads/include/isc/mutex.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "6b7e8979b3639d755e3f6ba516d0d52d")
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !978, line: 72, baseType: !979)
!978 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!979 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !978, line: 67, size: 320, elements: !980)
!980 = !{!981, !1001, !1003}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !979, file: !978, line: 69, baseType: !982, size: 320)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !983, line: 22, size: 320, elements: !984)
!983 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!984 = !{!985, !986, !987, !988, !989, !990, !992, !993}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !982, file: !983, line: 24, baseType: !201, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !982, file: !983, line: 25, baseType: !46, size: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !982, file: !983, line: 26, baseType: !201, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !982, file: !983, line: 28, baseType: !46, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !982, file: !983, line: 32, baseType: !201, size: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !982, file: !983, line: 34, baseType: !991, size: 16, offset: 160)
!991 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !982, file: !983, line: 35, baseType: !991, size: 16, offset: 176)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !982, file: !983, line: 36, baseType: !994, size: 128, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !995, line: 55, baseType: !996)
!995 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !995, line: 51, size: 128, elements: !997)
!997 = !{!998, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !996, file: !995, line: 53, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !996, file: !995, line: 54, baseType: !999, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !979, file: !978, line: 70, baseType: !1002, size: 320)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 320, elements: !38)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !979, file: !978, line: 71, baseType: !224, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !971, file: !2, line: 49, baseType: !46, size: 32, offset: 1344)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !971, file: !2, line: 50, baseType: !1006, size: 128, offset: 1408)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !971, file: !2, line: 50, size: 128, elements: !1007)
!1007 = !{!1008, !1040}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1006, file: !2, line: 50, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_ecdbnode", file: !2, line: 53, size: 1408, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1021, !1039}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1010, file: !2, line: 55, baseType: !46, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1010, file: !2, line: 56, baseType: !975, size: 320, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ecdb", scope: !1010, file: !2, line: 57, baseType: !969, size: 64, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1010, file: !2, line: 58, baseType: !285, size: 640, offset: 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1010, file: !2, line: 59, baseType: !1017, size: 128, offset: 1088)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1010, file: !2, line: 59, size: 128, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1017, file: !2, line: 59, baseType: !1009, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1017, file: !2, line: 59, baseType: !1009, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rdatasets", scope: !1010, file: !2, line: 62, baseType: !1022, size: 128, offset: 1216)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1010, file: !2, line: 62, size: 128, elements: !1023)
!1023 = !{!1024, !1038}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1022, file: !2, line: 62, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rdatasetheader", file: !2, line: 66, size: 256, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1026, file: !2, line: 67, baseType: !401, size: 16)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !1026, file: !2, line: 68, baseType: !635, size: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !1026, file: !2, line: 69, baseType: !430, size: 16, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "covers", scope: !1026, file: !2, line: 70, baseType: !401, size: 16, offset: 80)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1026, file: !2, line: 71, baseType: !46, size: 32, offset: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1026, file: !2, line: 73, baseType: !1034, size: 128, offset: 128)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1026, file: !2, line: 73, size: 128, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1034, file: !2, line: 73, baseType: !1025, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1034, file: !2, line: 73, baseType: !1025, size: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1022, file: !2, line: 62, baseType: !1025, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !1010, file: !2, line: 63, baseType: !46, size: 32, offset: 1344)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1006, file: !2, line: 50, baseType: !1009, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_ecdbnode_t", file: !2, line: 64, baseType: !1010)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc__magic_t", file: !1046, line: 22, baseType: !1047)
!1046 = !DIFile(filename: "isc/include/isc/magic.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "8ece3f29379e72c0b49c17feca828350")
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1046, line: 20, size: 32, elements: !1048)
!1048 = !{!1049}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1047, file: !1046, line: 21, baseType: !46, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "ecdb_rdatasetiter_t", file: !2, line: 120, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ecdb_rdatasetiter", file: !2, line: 117, size: 448, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1052, file: !2, line: 118, baseType: !699, size: 384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1052, file: !2, line: 119, baseType: !1056, size: 64, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "rdatasetheader_t", file: !2, line: 74, baseType: !1026)
!1058 = !{!0, !8, !13, !18, !23, !25, !30, !35, !40, !1059, !1064, !1069, !1074, !1079, !1084, !1089, !1091, !1093, !1098, !1100, !1105, !1110, !1112, !1115, !1120, !1122, !1124, !1126, !1131, !1133, !1135, !1137, !1142, !1144, !1149, !1154, !1156, !1161, !1163, !1165, !1170, !1175}
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !1061, isLocal: true, isDefinition: true)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 816, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 102)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !1066, isLocal: true, isDefinition: true)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1067)
!1067 = !{!1068}
!1068 = !DISubrange(count: 48)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !2, line: 161, type: !1071, isLocal: true, isDefinition: true)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !1072)
!1072 = !{!1073}
!1073 = !DISubrange(count: 59)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !1076, isLocal: true, isDefinition: true)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !1077)
!1077 = !{!1078}
!1078 = !DISubrange(count: 61)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !1081, isLocal: true, isDefinition: true)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 18)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !2, line: 176, type: !1086, isLocal: true, isDefinition: true)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !1087)
!1087 = !{!1088}
!1088 = !DISubrange(count: 42)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !2, line: 343, type: !15, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !2, line: 362, type: !1086, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
