; ModuleID = 'samples/120.bc'
source_filename = "lsystem.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [2 x i8] c"!\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"SHELL\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [9 x i8] c"%s %s %s\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [3 x i8] c"sh\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [17 x i8] c"  (press RETURN)\00", align 1, !dbg !24
@screen_trashed = external global i32, align 4
@.str.6 = private unnamed_addr constant [30 x i8] c"Cannot seek to start position\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [2 x i8] c"w\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [19 x i8] c"Cannot create pipe\00", align 1, !dbg !36

; Function Attrs: nounwind uwtable
define dso_local void @lsystem(ptr noundef %cmd, ptr noundef %donemsg) #0 !dbg !75 {
entry:
  %cmd.addr = alloca ptr, align 8
  %donemsg.addr = alloca ptr, align 8
  %inp = alloca i32, align 4
  %shell = alloca ptr, align 8
  %p = alloca ptr, align 8
  %save_ifile = alloca ptr, align 8
  %esccmd = alloca ptr, align 8
  %len = alloca i32, align 4
  store ptr %cmd, ptr %cmd.addr, align 8, !tbaa !93

!294 = !DISubroutineType(types: !295)
!295 = !{!44, !44, !45}
!296 = !{!297, !298, !299, !300, !301}
!297 = !DILocalVariable(name: "c", arg: 1, scope: !293, file: !2, line: 251, type: !44)
!298 = !DILocalVariable(name: "cmd", arg: 2, scope: !293, file: !2, line: 251, type: !45)
!299 = !DILocalVariable(name: "mpos", scope: !293, file: !2, line: 253, type: !46)
!300 = !DILocalVariable(name: "tpos", scope: !293, file: !2, line: 253, type: !46)
!301 = !DILocalVariable(name: "bpos", scope: !293, file: !2, line: 253, type: !46)
!302 = !DILocation(line: 251, column: 26, scope: !293)
!303 = !DILocation(line: 251, column: 35, scope: !293)
!304 = !DILocation(line: 253, column: 2, scope: !293)
!305 = !DILocation(line: 253, column: 11, scope: !293)
!306 = !DILocation(line: 253, column: 17, scope: !293)
!307 = !DILocation(line: 253, column: 23, scope: !293)
!308 = !DILocation(line: 260, column: 17, scope: !293)
!309 = !DILocation(line: 260, column: 9, scope: !293)
!310 = !DILocation(line: 260, column: 7, scope: !293)
!311 = !{!312, !312, i64 0}
!312 = !{!"long", !95, i64 0}
!313 = !DILocation(line: 261, column: 6, scope: !314)
!314 = distinct !DILexicalBlock(scope: !293, file: !2, line: 261, column: 6)
!315 = !DILocation(line: 261, column: 11, scope: !314)
!316 = !DILocation(line: 261, column: 6, scope: !293)
!317 = !DILocation(line: 262, column: 3, scope: !314)
!318 = !DILocation(line: 263, column: 9, scope: !293)
!319 = !DILocation(line: 263, column: 7, scope: !293)
!320 = !DILocation(line: 264, column: 6, scope: !321)
!321 = distinct !DILexicalBlock(scope: !293, file: !2, line: 264, column: 6)
!322 = !DILocation(line: 264, column: 11, scope: !321)
!323 = !DILocation(line: 264, column: 6, scope: !293)
!324 = !DILocation(line: 265, column: 8, scope: !321)
!325 = !DILocation(line: 265, column: 3, scope: !321)
!326 = !DILocation(line: 266, column: 9, scope: !293)
!327 = !DILocation(line: 266, column: 7, scope: !293)
!328 = !DILocation(line: 268, column: 6, scope: !329)
!329 = distinct !DILexicalBlock(scope: !293, file: !2, line: 268, column: 6)
!330 = !DILocation(line: 268, column: 8, scope: !329)
!331 = !DILocation(line: 268, column: 6, scope: !293)
!332 = !DILocation(line: 269, column: 21, scope: !329)
!333 = !DILocation(line: 269, column: 26, scope: !329)
!334 = !DILocation(line: 269, column: 32, scope: !329)
!335 = !DILocation(line: 269, column: 11, scope: !329)
!336 = !DILocation(line: 269, column: 3, scope: !329)
!337 = !DILocation(line: 270, column: 11, scope: !338)
!338 = distinct !DILexicalBlock(scope: !329, file: !2, line: 270, column: 11)
!339 = !DILocation(line: 270, column: 19, scope: !338)
!340 = !DILocation(line: 270, column: 16, scope: !338)
!341 = !DILocation(line: 270, column: 11, scope: !329)
!342 = !DILocation(line: 271, column: 21, scope: !338)
!343 = !DILocation(line: 271, column: 26, scope: !338)
!344 = !DILocation(line: 271, column: 32, scope: !338)
!345 = !DILocation(line: 271, column: 11, scope: !338)
!346 = !DILocation(line: 271, column: 3, scope: !338)
!347 = !DILocation(line: 272, column: 11, scope: !348)
!348 = distinct !DILexicalBlock(scope: !338, file: !2, line: 272, column: 11)
!349 = !DILocation(line: 272, column: 16, scope: !348)
!350 = !DILocation(line: 272, column: 11, scope: !338)
!351 = !DILocation(line: 273, column: 21, scope: !348)
!352 = !DILocation(line: 273, column: 26, scope: !348)
!353 = !DILocation(line: 273, column: 32, scope: !348)
!354 = !DILocation(line: 273, column: 11, scope: !348)
!355 = !DILocation(line: 273, column: 3, scope: !348)
!356 = !DILocation(line: 275, column: 21, scope: !348)
!357 = !DILocation(line: 275, column: 26, scope: !348)
!358 = !DILocation(line: 275, column: 32, scope: !348)
!359 = !DILocation(line: 275, column: 11, scope: !348)
!360 = !DILocation(line: 275, column: 3, scope: !348)
!361 = !DILocation(line: 276, column: 1, scope: !293)
!362 = !DISubprogram(name: "markpos", scope: !228, file: !228, line: 244, type: !363, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!363 = !DISubroutineType(types: !364)
!364 = !{!46, !365}
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "LWCHAR", file: !47, line: 238, baseType: !265)
!366 = !DISubprogram(name: "position", scope: !228, file: !228, line: 326, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!367 = !DISubroutineType(types: !368)
!368 = !{!46, !44}
!369 = distinct !DISubprogram(name: "pipe_data", scope: !2, file: !2, line: 282, type: !370, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !41, retainedNodes: !372)
!370 = !DISubroutineType(types: !371)
!371 = !{!44, !45, !46, !46}
!372 = !{!373, !374, !375, !376, !430}
!373 = !DILocalVariable(name: "cmd", arg: 1, scope: !369, file: !2, line: 282, type: !45)
!374 = !DILocalVariable(name: "spos", arg: 2, scope: !369, file: !2, line: 282, type: !46)
!375 = !DILocalVariable(name: "epos", arg: 3, scope: !369, file: !2, line: 282, type: !46)
!376 = !DILocalVariable(name: "f", scope: !369, file: !2, line: 284, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !379, line: 7, baseType: !380)
!379 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !381, line: 49, size: 1728, elements: !382)
!381 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !398, !400, !401, !402, !403, !405, !407, !411, !414, !416, !419, !422, !423, !424, !425, !426}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !380, file: !381, line: 51, baseType: !44, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !380, file: !381, line: 54, baseType: !45, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !380, file: !381, line: 55, baseType: !45, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !380, file: !381, line: 56, baseType: !45, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !380, file: !381, line: 57, baseType: !45, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !380, file: !381, line: 58, baseType: !45, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !380, file: !381, line: 59, baseType: !45, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !380, file: !381, line: 60, baseType: !45, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !380, file: !381, line: 61, baseType: !45, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !380, file: !381, line: 64, baseType: !45, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !380, file: !381, line: 65, baseType: !45, size: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !380, file: !381, line: 66, baseType: !45, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !380, file: !381, line: 68, baseType: !396, size: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !381, line: 36, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !380, file: !381, line: 70, baseType: !399, size: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !380, file: !381, line: 72, baseType: !44, size: 32, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !380, file: !381, line: 73, baseType: !44, size: 32, offset: 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !380, file: !381, line: 74, baseType: !50, size: 64, offset: 960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !380, file: !381, line: 77, baseType: !404, size: 16, offset: 1024)
!404 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !380, file: !381, line: 78, baseType: !406, size: 8, offset: 1040)
!406 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !380, file: !381, line: 79, baseType: !408, size: 8, offset: 1048)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 1)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !380, file: !381, line: 81, baseType: !412, size: 64, offset: 1088)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !381, line: 43, baseType: null)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !380, file: !381, line: 89, baseType: !415, size: 64, offset: 1152)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !51, line: 153, baseType: !52)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !380, file: !381, line: 91, baseType: !417, size: 64, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !381, line: 37, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !380, file: !381, line: 92, baseType: !420, size: 64, offset: 1280)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !381, line: 38, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !380, file: !381, line: 93, baseType: !399, size: 64, offset: 1344)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !380, file: !381, line: 94, baseType: !43, size: 64, offset: 1408)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !380, file: !381, line: 95, baseType: !275, size: 64, offset: 1472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !380, file: !381, line: 96, baseType: !44, size: 32, offset: 1536)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !380, file: !381, line: 98, baseType: !427, size: 160, offset: 1568)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 20)
!430 = !DILocalVariable(name: "c", scope: !369, file: !2, line: 285, type: !44)
!431 = !DILocation(line: 282, column: 28, scope: !369)
!432 = !DILocation(line: 282, column: 42, scope: !369)
!433 = !DILocation(line: 282, column: 57, scope: !369)
!434 = !DILocation(line: 284, column: 2, scope: !369)
!435 = !DILocation(line: 284, column: 8, scope: !369)
!436 = !DILocation(line: 285, column: 2, scope: !369)
!437 = !DILocation(line: 285, column: 6, scope: !369)
!438 = !DILocation(line: 293, column: 14, scope: !439)
!439 = distinct !DILexicalBlock(scope: !369, file: !2, line: 293, column: 6)
!440 = !DILocation(line: 293, column: 6, scope: !439)
!441 = !DILocation(line: 293, column: 20, scope: !439)
!442 = !DILocation(line: 293, column: 6, scope: !369)
!443 = !DILocation(line: 295, column: 3, scope: !444)
!444 = distinct !DILexicalBlock(scope: !439, file: !2, line: 294, column: 2)
!445 = !DILocation(line: 296, column: 3, scope: !444)
!446 = !DILocation(line: 299, column: 17, scope: !447)
!447 = distinct !DILexicalBlock(scope: !369, file: !2, line: 299, column: 6)
!448 = !DILocation(line: 299, column: 11, scope: !447)
!449 = !DILocation(line: 299, column: 9, scope: !447)
!450 = !DILocation(line: 299, column: 28, scope: !447)
!451 = !DILocation(line: 299, column: 6, scope: !369)
!452 = !DILocation(line: 301, column: 3, scope: !453)
!453 = distinct !DILexicalBlock(scope: !447, file: !2, line: 300, column: 2)
!454 = !DILocation(line: 302, column: 3, scope: !453)
!455 = !DILocation(line: 304, column: 2, scope: !369)
!456 = !DILocation(line: 305, column: 2, scope: !369)
!457 = !DILocation(line: 306, column: 9, scope: !369)
!458 = !DILocation(line: 306, column: 2, scope: !369)
!459 = !DILocation(line: 307, column: 2, scope: !369)
!460 = !DILocation(line: 309, column: 2, scope: !369)
!461 = !DILocation(line: 310, column: 2, scope: !369)
!462 = !DILocation(line: 311, column: 2, scope: !369)
!463 = !DILocation(line: 312, column: 2, scope: !369)
!464 = !DILocation(line: 317, column: 2, scope: !369)
!465 = !DILocation(line: 320, column: 4, scope: !369)
!466 = !DILocation(line: 321, column: 2, scope: !369)
!467 = !DILocation(line: 321, column: 9, scope: !369)
!468 = !DILocation(line: 321, column: 14, scope: !369)
!469 = !DILocation(line: 321, column: 31, scope: !369)
!470 = !DILocation(line: 321, column: 38, scope: !369)
!471 = !DILocation(line: 321, column: 44, scope: !369)
!472 = !DILocation(line: 321, column: 41, scope: !369)
!473 = !DILocation(line: 326, column: 7, scope: !474)
!474 = distinct !DILexicalBlock(scope: !369, file: !2, line: 322, column: 2)
!475 = !DILocation(line: 326, column: 5, scope: !474)
!476 = !DILocation(line: 327, column: 7, scope: !477)
!477 = distinct !DILexicalBlock(scope: !474, file: !2, line: 327, column: 7)
!478 = !DILocation(line: 327, column: 9, scope: !477)
!479 = !DILocation(line: 327, column: 7, scope: !474)
!480 = !DILocation(line: 328, column: 4, scope: !477)
!481 = !DILocation(line: 329, column: 12, scope: !482)
!482 = distinct !DILexicalBlock(scope: !474, file: !2, line: 329, column: 7)
!483 = !DILocation(line: 329, column: 15, scope: !482)
!484 = !DILocation(line: 329, column: 7, scope: !482)
!485 = !DILocation(line: 329, column: 18, scope: !482)
!486 = !DILocation(line: 329, column: 7, scope: !474)
!487 = !DILocation(line: 330, column: 4, scope: !482)
!488 = distinct !{!488, !466, !489, !490}
!489 = !DILocation(line: 331, column: 2, scope: !369)
!490 = !{!"llvm.loop.mustprogress"}
!491 = !DILocation(line: 336, column: 2, scope: !369)
!492 = !DILocation(line: 336, column: 9, scope: !369)
!493 = !DILocation(line: 336, column: 11, scope: !369)
!494 = !DILocation(line: 336, column: 19, scope: !369)
!495 = !DILocation(line: 336, column: 22, scope: !369)
