; ModuleID = 'samples/122.bc'
source_filename = "alpha_processing.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

@WebPMultARGBRow = hidden global ptr null, align 8, !dbg !0
@WebPMultRow = hidden global ptr null, align 8, !dbg !72
@WebPInitAlphaProcessing.WebPInitAlphaProcessing_body_last_cpuinfo_used = internal global ptr @WebPInitAlphaProcessing.WebPInitAlphaProcessing_body_last_cpuinfo_used, align 8, !dbg !33
@WebPInitAlphaProcessing.WebPInitAlphaProcessing_body_lock = internal global %union.pthread_mutex_t zeroinitializer, align 8, !dbg !39
@VP8GetCPUInfo = external global ptr, align 8
@WebPApplyAlphaMultiply = hidden global ptr null, align 8, !dbg !87
@WebPApplyAlphaMultiply4444 = hidden global ptr null, align 8, !dbg !92
@WebPDispatchAlpha = hidden global ptr null, align 8, !dbg !97
@WebPDispatchAlphaToGreen = hidden global ptr null, align 8, !dbg !102
@WebPExtractAlpha = hidden global ptr null, align 8, !dbg !108
@WebPExtractGreen = hidden global ptr null, align 8, !dbg !110
@WebPPackRGB = hidden global ptr null, align 8, !dbg !118
@WebPHasAlpha8b = hidden global ptr null, align 8, !dbg !123
@WebPHasAlpha32b = hidden global ptr null, align 8, !dbg !128

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "WebPMultARGBRow", scope: !2, file: !3, line: 181, type: !135, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !32, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "alpha_processing.c", directory: "/local-ssd/libwebp-ogk6inqjmrnmtyq4i2sug432zt64ty5a-build/aidengro/spack-stage-libwebp-1.2.4-ogk6inqjmrnmtyq4i2sug432zt64ty5a/spack-src/src/dsp", checksumkind: CSK_MD5, checksum: "fbaf231e62b9c27d5c41dc1c79dd43d2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 229, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../src/dsp/cpu.h", directory: "/local-ssd/libwebp-ogk6inqjmrnmtyq4i2sug432zt64ty5a-build/aidengro/spack-stage-libwebp-1.2.4-ogk6inqjmrnmtyq4i2sug432zt64ty5a/spack-src/src/dsp", checksumkind: CSK_MD5, checksum: "fac006d6da3a848ac2e3ccd8a8414620")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "kSSE2", value: 0)
!10 = !DIEnumerator(name: "kSSE3", value: 1)
!11 = !DIEnumerator(name: "kSlowSSSE3", value: 2)
!12 = !DIEnumerator(name: "kSSE4_1", value: 3)
!13 = !DIEnumerator(name: "kAVX", value: 4)
!14 = !DIEnumerator(name: "kAVX2", value: 5)
!15 = !DIEnumerator(name: "kNEON", value: 6)
!16 = !DIEnumerator(name: "kMIPS32", value: 7)
!17 = !DIEnumerator(name: "kMIPSdspR2", value: 8)
!18 = !DIEnumerator(name: "kMSA", value: 9)
!19 = !{!20, !25, !31, !21}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 26, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !24, line: 42, baseType: !7)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP8CPUInfo", file: !6, line: 247, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !30}
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPUFeature", file: !6, line: 240, baseType: !5)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !{!33, !39, !0, !72, !87, !92, !97, !102, !108, !110, !118, !123, !128, !130}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "WebPInitAlphaProcessing_body_last_cpuinfo_used", scope: !35, file: !3, line: 433, type: !38, isLocal: true, isDefinition: true)
!35 = distinct !DISubprogram(name: "WebPInitAlphaProcessing", scope: !3, file: !3, line: 433, type: !36, scopeLine: 433, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!36 = !DISubroutineType(types: !37)
!37 = !{null}
!38 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "WebPInitAlphaProcessing_body_lock", scope: !35, file: !3, line: 433, type: !41, isLocal: true, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !42, line: 72, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!43 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !42, line: 67, size: 320, elements: !44)
!44 = !{!45, !65, !70}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !43, file: !42, line: 69, baseType: !46, size: 320)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !47, line: 22, size: 320, elements: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!48 = !{!49, !50, !51, !52, !53, !54, !56, !57}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !46, file: !47, line: 24, baseType: !29, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !46, file: !47, line: 25, baseType: !7, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !46, file: !47, line: 26, baseType: !29, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !46, file: !47, line: 28, baseType: !7, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !46, file: !47, line: 32, baseType: !29, size: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !46, file: !47, line: 34, baseType: !55, size: 16, offset: 160)
!55 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !46, file: !47, line: 35, baseType: !55, size: 16, offset: 176)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !46, file: !47, line: 36, baseType: !58, size: 128, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !59, line: 55, baseType: !60)
!59 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !59, line: 51, size: 128, elements: !61)
!61 = !{!62, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !60, file: !59, line: 53, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !60, file: !59, line: 54, baseType: !63, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !43, file: !42, line: 70, baseType: !66, size: 320)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 320, elements: !68)
!67 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!68 = !{!69}
!69 = !DISubrange(count: 40)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !43, file: !42, line: 71, baseType: !71, size: 64)
!71 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "WebPMultRow", scope: !2, file: !3, line: 182, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77, !83, !29, !29}
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 24, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !24, line: 38, baseType: !82)
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "WebPApplyAlphaMultiply", scope: !2, file: !3, line: 402, type: !89, isLocal: false, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !79, !29, !29, !29, !29}
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "WebPApplyAlphaMultiply4444", scope: !2, file: !3, line: 403, type: !94, isLocal: false, isDefinition: true)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !79, !29, !29, !29}
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "WebPDispatchAlpha", scope: !2, file: !3, line: 404, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!29, !84, !29, !29, !29, !78, !29}
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "WebPDispatchAlphaToGreen", scope: !2, file: !3, line: 406, type: !104, isLocal: false, isDefinition: true)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !84, !29, !29, !29, !107, !29}
!107 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !20)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "WebPExtractAlpha", scope: !2, file: !3, line: 408, type: !99, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "WebPExtractGreen", scope: !2, file: !3, line: 410, type: !112, isLocal: false, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115, !78, !29}
!115 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
