; ModuleID = 'samples/123.bc'
source_filename = "/local-ssd/quo-vadis-ngd6cwnjru4wgycspwlythoi77wb76u5-build/aidengro/spack-stage-quo-vadis-master-ngd6cwnjru4wgycspwlythoi77wb76u5/spack-build-ngd6cwn/hwloc/src/libhwloc/utils/lstopo/lstopo-svg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.draw_methods = type { ptr, ptr, ptr, ptr, ptr, ptr }
%struct.lstopo_output = type { ptr, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, i32, i32, i64, i64, i64, i32, [3 x [128 x i8]], i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], i32, i32, i32, i32, i32, float, [20 x i32], i32, [20 x i32], i32, [20 x i32], i32, [20 x i32], i32, i32, i32, i32, [20 x i32], [20 x i32], [20 x i32], ptr, ptr, i32, i32, i32 }
%struct.quo_vadis_internal_hwloc_obj = type { i32, ptr, i32, ptr, i64, ptr, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, i32, ptr, ptr, ptr, i32, i32, ptr, i32, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, i64 }
%struct.lstopo_color = type { i32, i32, i32, i32, %union.lstopo_color_private_u, ptr }
%union.lstopo_color_private_u = type { %struct.lstopo_color_private_ascii_s }
%struct.lstopo_color_private_ascii_s = type { i32 }

!85 = distinct !DIGlobalVariable(scope: null, file: !2, line: 143, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1200, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 150)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(scope: null, file: !2, line: 151, type: !91, isLocal: true, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 8)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(scope: null, file: !2, line: 32, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 4)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(scope: null, file: !2, line: 37, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 19)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(scope: null, file: !2, line: 38, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 12)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 18)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 23)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !121, isLocal: true, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 896, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 112)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !101, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !111, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 696, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 87)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !135, isLocal: true, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 102, type: !101, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !111, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 20)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 800, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 100)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "draw_methods", file: !13, line: 227, size: 384, elements: !153)
!153 = !{!154, !323, !327, !450, !451, !457}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "declare_color", scope: !152, file: !13, line: 228, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !159, !304}
!158 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lstopo_output", file: !13, line: 47, size: 11712, elements: !161)
!161 = !{!162, !166, !167, !168, !169, !224, !225, !226, !227, !228, !229, !230, !231, !235, !240, !241, !242, !243, !244, !245, !249, !250, !255, !256, !257, !259, !260, !261, !262, !263, !264, !265, !267, !268, !269, !270, !274, !275, !276, !277, !278, !279, !281, !283, !284, !286, !287, !288, !289, !290, !291, !292, !293, !294, !296, !297, !298, !299, !301, !302, !303}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "topology", scope: !160, file: !13, line: 48, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_vadis_internal_hwloc_topology_t", file: !26, line: 691, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_topology", file: !26, line: 686, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !160, file: !13, line: 49, baseType: !14, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "needs_topology_refresh", scope: !160, file: !13, line: 52, baseType: !158, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "refreshing", scope: !160, file: !13, line: 54, baseType: !158, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !160, file: !13, line: 57, baseType: !170, size: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !172, line: 7, baseType: !173)
!172 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !174, line: 49, size: 1728, elements: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!175 = !{!176, !177, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !192, !194, !195, !196, !200, !202, !204, !205, !208, !210, !213, !216, !217, !218, !222, !223}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !173, file: !174, line: 51, baseType: !158, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !173, file: !174, line: 54, baseType: !178, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !173, file: !174, line: 55, baseType: !178, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !173, file: !174, line: 56, baseType: !178, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !173, file: !174, line: 57, baseType: !178, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !173, file: !174, line: 58, baseType: !178, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !173, file: !174, line: 59, baseType: !178, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !173, file: !174, line: 60, baseType: !178, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !173, file: !174, line: 61, baseType: !178, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !173, file: !174, line: 64, baseType: !178, size: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !173, file: !174, line: 65, baseType: !178, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !173, file: !174, line: 66, baseType: !178, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !173, file: !174, line: 68, baseType: !190, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !174, line: 36, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !173, file: !174, line: 70, baseType: !193, size: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !173, file: !174, line: 72, baseType: !158, size: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !173, file: !174, line: 73, baseType: !158, size: 32, offset: 928)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !173, file: !174, line: 74, baseType: !197, size: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !198, line: 152, baseType: !199)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!199 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !173, file: !174, line: 77, baseType: !201, size: 16, offset: 1024)
!201 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !173, file: !174, line: 78, baseType: !203, size: 8, offset: 1040)
!203 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !173, file: !174, line: 79, baseType: !135, size: 8, offset: 1048)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !173, file: !174, line: 81, baseType: !206, size: 64, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !174, line: 43, baseType: null)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !173, file: !174, line: 89, baseType: !209, size: 64, offset: 1152)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !198, line: 153, baseType: !199)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !173, file: !174, line: 91, baseType: !211, size: 64, offset: 1216)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !174, line: 37, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !173, file: !174, line: 92, baseType: !214, size: 64, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !174, line: 38, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !173, file: !174, line: 93, baseType: !193, size: 64, offset: 1344)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !173, file: !174, line: 94, baseType: !77, size: 64, offset: 1408)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !173, file: !174, line: 95, baseType: !219, size: 64, offset: 1472)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 70, baseType: !221)
!220 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!221 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !173, file: !174, line: 96, baseType: !158, size: 32, offset: 1536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !173, file: !174, line: 98, baseType: !144, size: 160, offset: 1568)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "overwrite", scope: !160, file: !13, line: 58, baseType: !158, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "index_type", scope: !160, file: !13, line: 61, baseType: !12, size: 32, offset: 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "verbose_mode", scope: !160, file: !13, line: 62, baseType: !158, size: 32, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_pus", scope: !160, file: !13, line: 63, baseType: !158, size: 32, offset: 352)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_numanodes", scope: !160, file: !13, line: 64, baseType: !158, size: 32, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pci_collapse_enabled", scope: !160, file: !13, line: 65, baseType: !158, size: 32, offset: 416)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pid_number", scope: !160, file: !13, line: 66, baseType: !158, size: 32, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !160, file: !13, line: 67, baseType: !232, size: 32, offset: 480)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !233, line: 38, baseType: !234)
!233 = !DIFile(filename: "/usr/include/sched.h", directory: "", checksumkind: CSK_MD5, checksum: "52ea601aba54a9937a50019367077a72")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !198, line: 154, baseType: !158)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "cpubind_set", scope: !160, file: !13, line: 68, baseType: !236, size: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_vadis_internal_hwloc_bitmap_t", file: !237, line: 68, baseType: !238)
!237 = !DIFile(filename: "libhwloc/include/hwloc/bitmap.h", directory: "/local-ssd/quo-vadis-ngd6cwnjru4wgycspwlythoi77wb76u5-build/aidengro/spack-stage-quo-vadis-master-ngd6cwnjru4wgycspwlythoi77wb76u5/spack-build-ngd6cwn/hwloc/src", checksumkind: CSK_MD5, checksum: "55cb5e1523cb3128acaffd24ad6debbe")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_bitmap_s", file: !237, line: 68, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "membind_set", scope: !160, file: !13, line: 68, baseType: !236, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "need_pci_domain", scope: !160, file: !13, line: 71, baseType: !158, size: 32, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpukind_styles", scope: !160, file: !13, line: 72, baseType: !14, size: 32, offset: 672)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "export_synthetic_flags", scope: !160, file: !13, line: 75, baseType: !221, size: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "export_xml_flags", scope: !160, file: !13, line: 76, baseType: !221, size: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "shmem_output_addr", scope: !160, file: !13, line: 77, baseType: !246, size: 64, offset: 832)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !247, line: 27, baseType: !248)
!247 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !198, line: 45, baseType: !221)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "show_legend", scope: !160, file: !13, line: 80, baseType: !20, size: 32, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "legend_default_lines", scope: !160, file: !13, line: 82, baseType: !251, size: 3072, offset: 928)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3072, elements: !252)
!252 = !{!253, !254}
!253 = !DISubrange(count: 3)
!254 = !DISubrange(count: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "legend_default_lines_nr", scope: !160, file: !13, line: 83, baseType: !14, size: 32, offset: 4000)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "legend_info_lines_nr", scope: !160, file: !13, line: 84, baseType: !14, size: 32, offset: 4032)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "legend_append", scope: !160, file: !13, line: 85, baseType: !258, size: 64, offset: 4096)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "legend_append_nr", scope: !160, file: !13, line: 86, baseType: !14, size: 32, offset: 4160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "legend_maxtextwidth", scope: !160, file: !13, line: 87, baseType: !14, size: 32, offset: 4192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "show_distances_only", scope: !160, file: !13, line: 90, baseType: !158, size: 32, offset: 4224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "show_memattrs_only", scope: !160, file: !13, line: 91, baseType: !158, size: 32, offset: 4256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "show_cpukinds_only", scope: !160, file: !13, line: 92, baseType: !158, size: 32, offset: 4288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "show_windows_processor_groups_only", scope: !160, file: !13, line: 93, baseType: !158, size: 32, offset: 4320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "show_only", scope: !160, file: !13, line: 94, baseType: !266, size: 32, offset: 4352)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_vadis_internal_hwloc_obj_type_t", file: !26, line: 323, baseType: !25)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "show_cpuset", scope: !160, file: !13, line: 95, baseType: !158, size: 32, offset: 4384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "show_taskset", scope: !160, file: !13, line: 96, baseType: !158, size: 32, offset: 4416)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "transform_distances", scope: !160, file: !13, line: 97, baseType: !158, size: 32, offset: 4448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !160, file: !13, line: 100, baseType: !271, size: 2048, offset: 4480)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "plain_children_order", scope: !160, file: !13, line: 101, baseType: !14, size: 32, offset: 6528)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "gridsize", scope: !160, file: !13, line: 102, baseType: !14, size: 32, offset: 6560)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize", scope: !160, file: !13, line: 102, baseType: !14, size: 32, offset: 6592)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "linespacing", scope: !160, file: !13, line: 102, baseType: !14, size: 32, offset: 6624)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "thickness", scope: !160, file: !13, line: 102, baseType: !14, size: 32, offset: 6656)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "text_xscale", scope: !160, file: !13, line: 103, baseType: !280, size: 32, offset: 6688)
!280 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "force_orient", scope: !160, file: !13, line: 104, baseType: !282, size: 640, offset: 6720)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 640, elements: !145)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "no_half_lines", scope: !160, file: !13, line: 105, baseType: !14, size: 32, offset: 7360)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "show_indexes", scope: !160, file: !13, line: 106, baseType: !285, size: 640, offset: 7392)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 640, elements: !145)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "show_text_enabled", scope: !160, file: !13, line: 107, baseType: !158, size: 32, offset: 8032)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "show_text", scope: !160, file: !13, line: 108, baseType: !285, size: 640, offset: 8064)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "show_attrs_enabled", scope: !160, file: !13, line: 109, baseType: !158, size: 32, offset: 8704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "show_attrs", scope: !160, file: !13, line: 110, baseType: !285, size: 640, offset: 8736)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "show_binding", scope: !160, file: !13, line: 111, baseType: !158, size: 32, offset: 9376)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "show_disallowed", scope: !160, file: !13, line: 112, baseType: !158, size: 32, offset: 9408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "show_cpukinds", scope: !160, file: !13, line: 113, baseType: !158, size: 32, offset: 9440)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "factorize_enabled", scope: !160, file: !13, line: 114, baseType: !158, size: 32, offset: 9472)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "factorize_min", scope: !160, file: !13, line: 115, baseType: !295, size: 640, offset: 9504)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 640, elements: !145)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "factorize_first", scope: !160, file: !13, line: 118, baseType: !295, size: 640, offset: 10144)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "factorize_last", scope: !160, file: !13, line: 119, baseType: !295, size: 640, offset: 10784)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "backend_data", scope: !160, file: !13, line: 122, baseType: !77, size: 64, offset: 11456)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !160, file: !13, line: 123, baseType: !300, size: 64, offset: 11520)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "drawing", scope: !160, file: !13, line: 124, baseType: !72, size: 32, offset: 11584)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !160, file: !13, line: 125, baseType: !14, size: 32, offset: 11616)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !160, file: !13, line: 125, baseType: !14, size: 32, offset: 11648)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lstopo_color", file: !13, line: 128, size: 256, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !322}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !305, file: !13, line: 130, baseType: !158, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !305, file: !13, line: 130, baseType: !158, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !305, file: !13, line: 130, baseType: !158, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !305, file: !13, line: 131, baseType: !158, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !305, file: !13, line: 148, baseType: !312, size: 32, offset: 128)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lstopo_color_private_u", file: !13, line: 135, size: 32, elements: !313)
!313 = !{!314, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !312, file: !13, line: 138, baseType: !315, size: 32)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lstopo_color_private_ascii_s", file: !13, line: 136, size: 32, elements: !316)
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !315, file: !13, line: 137, baseType: !158, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fig", scope: !312, file: !13, line: 141, baseType: !319, size: 32)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lstopo_color_private_fig_s", file: !13, line: 139, size: 32, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !319, file: !13, line: 140, baseType: !158, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !13, line: 150, baseType: !304, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_color", scope: !152, file: !13, line: 229, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !159, !304}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !152, file: !13, line: 231, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !159, !331, !14, !14, !14, !14, !14, !333, !14}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_vadis_internal_hwloc_obj_t", file: !26, line: 595, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_obj", file: !26, line: 395, size: 1984, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !344, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !437, !438, !440, !441, !447, !448, !449}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !335, file: !26, line: 397, baseType: !266, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !335, file: !26, line: 398, baseType: !178, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "os_index", scope: !335, file: !26, line: 400, baseType: !14, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !335, file: !26, line: 407, baseType: !178, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "total_memory", scope: !335, file: !26, line: 412, baseType: !342, size: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_uint64_t", file: !343, line: 217, baseType: !246)
!343 = !DIFile(filename: "include/hwloc/autogen/config.h", directory: "/local-ssd/quo-vadis-ngd6cwnjru4wgycspwlythoi77wb76u5-build/aidengro/spack-stage-quo-vadis-master-ngd6cwnjru4wgycspwlythoi77wb76u5/spack-build-ngd6cwn/hwloc/src/libhwloc-build", checksumkind: CSK_MD5, checksum: "f8cc096ea8bdbe5a6802fabd84472707")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !335, file: !26, line: 414, baseType: !345, size: 64, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "quo_vadis_internal_hwloc_obj_attr_u", file: !26, line: 598, size: 320, elements: !347)
!347 = !{!348, !359, !368, !376, !390, !410}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "numanode", scope: !346, file: !26, line: 612, baseType: !349, size: 192)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_numanode_attr_s", file: !26, line: 600, size: 192, elements: !350)
!350 = !{!351, !352, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", scope: !349, file: !26, line: 601, baseType: !342, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "page_types_len", scope: !349, file: !26, line: 602, baseType: !14, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "page_types", scope: !349, file: !26, line: 611, baseType: !354, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_memory_page_type_s", file: !26, line: 608, size: 128, elements: !356)
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !355, file: !26, line: 609, baseType: !342, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !355, file: !26, line: 610, baseType: !342, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !346, file: !26, line: 622, baseType: !360, size: 192)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_cache_attr_s", file: !26, line: 615, size: 192, elements: !361)
!361 = !{!362, !363, !364, !365, !366}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !360, file: !26, line: 616, baseType: !342, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !360, file: !26, line: 617, baseType: !14, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !360, file: !26, line: 618, baseType: !14, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "associativity", scope: !360, file: !26, line: 619, baseType: !158, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !360, file: !26, line: 621, baseType: !367, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_vadis_internal_hwloc_obj_cache_type_t", file: !26, line: 330, baseType: !55)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !346, file: !26, line: 630, baseType: !369, size: 128)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_group_attr_s", file: !26, line: 624, size: 128, elements: !370)
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !369, file: !26, line: 625, baseType: !14, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !369, file: !26, line: 627, baseType: !14, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "subkind", scope: !369, file: !26, line: 628, baseType: !14, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dont_merge", scope: !369, file: !26, line: 629, baseType: !375, size: 8, offset: 96)
!375 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pcidev", scope: !346, file: !26, line: 643, baseType: !377, size: 192)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_pcidev_attr_s", file: !26, line: 632, size: 192, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !377, file: !26, line: 634, baseType: !201, size: 16)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !377, file: !26, line: 638, baseType: !375, size: 8, offset: 16)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !377, file: !26, line: 638, baseType: !375, size: 8, offset: 24)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !377, file: !26, line: 638, baseType: !375, size: 8, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "class_id", scope: !377, file: !26, line: 639, baseType: !201, size: 16, offset: 48)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_id", scope: !377, file: !26, line: 640, baseType: !201, size: 16, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "device_id", scope: !377, file: !26, line: 640, baseType: !201, size: 16, offset: 80)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "subvendor_id", scope: !377, file: !26, line: 640, baseType: !201, size: 16, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "subdevice_id", scope: !377, file: !26, line: 640, baseType: !201, size: 16, offset: 112)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !377, file: !26, line: 641, baseType: !375, size: 8, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "linkspeed", scope: !377, file: !26, line: 642, baseType: !280, size: 32, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bridge", scope: !346, file: !26, line: 662, baseType: !391, size: 320)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_bridge_attr_s", file: !26, line: 645, size: 320, elements: !392)
!392 = !{!393, !397, !399, !408, !409}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !391, file: !26, line: 648, baseType: !394, size: 192)
!394 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !391, file: !26, line: 646, size: 192, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !394, file: !26, line: 647, baseType: !377, size: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_type", scope: !391, file: !26, line: 649, baseType: !398, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_vadis_internal_hwloc_obj_bridge_type_t", file: !26, line: 336, baseType: !60)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !391, file: !26, line: 659, baseType: !400, size: 32, offset: 224)
!400 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !391, file: !26, line: 650, size: 32, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !400, file: !26, line: 658, baseType: !403, size: 32)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !26, line: 651, size: 32, elements: !404)
!404 = !{!405, !406, !407}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !403, file: !26, line: 653, baseType: !201, size: 16)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_bus", scope: !403, file: !26, line: 657, baseType: !375, size: 8, offset: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "subordinate_bus", scope: !403, file: !26, line: 657, baseType: !375, size: 8, offset: 24)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_type", scope: !391, file: !26, line: 660, baseType: !398, size: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !391, file: !26, line: 661, baseType: !14, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "osdev", scope: !346, file: !26, line: 666, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_osdev_attr_s", file: !26, line: 664, size: 32, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !411, file: !26, line: 665, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_vadis_internal_hwloc_obj_osdev_type_t", file: !26, line: 355, baseType: !64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !335, file: !26, line: 418, baseType: !158, size: 32, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "logical_index", scope: !335, file: !26, line: 433, baseType: !14, size: 32, offset: 416)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "next_cousin", scope: !335, file: !26, line: 441, baseType: !334, size: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cousin", scope: !335, file: !26, line: 442, baseType: !334, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !335, file: !26, line: 445, baseType: !334, size: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_rank", scope: !335, file: !26, line: 446, baseType: !14, size: 32, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next_sibling", scope: !335, file: !26, line: 447, baseType: !334, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sibling", scope: !335, file: !26, line: 448, baseType: !334, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !335, file: !26, line: 451, baseType: !14, size: 32, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !335, file: !26, line: 455, baseType: !425, size: 64, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "first_child", scope: !335, file: !26, line: 456, baseType: !334, size: 64, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "last_child", scope: !335, file: !26, line: 457, baseType: !334, size: 64, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_subtree", scope: !335, file: !26, line: 460, baseType: !158, size: 32, offset: 1088)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "memory_arity", scope: !335, file: !26, line: 471, baseType: !14, size: 32, offset: 1120)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "memory_first_child", scope: !335, file: !26, line: 474, baseType: !334, size: 64, offset: 1152)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "io_arity", scope: !335, file: !26, line: 489, baseType: !14, size: 32, offset: 1216)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "io_first_child", scope: !335, file: !26, line: 492, baseType: !334, size: 64, offset: 1280)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "misc_arity", scope: !335, file: !26, line: 501, baseType: !14, size: 32, offset: 1344)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "misc_first_child", scope: !335, file: !26, line: 504, baseType: !334, size: 64, offset: 1408)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !335, file: !26, line: 511, baseType: !436, size: 64, offset: 1472)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_vadis_internal_hwloc_cpuset_t", file: !26, line: 140, baseType: !236)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cpuset", scope: !335, file: !26, line: 526, baseType: !436, size: 64, offset: 1536)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nodeset", scope: !335, file: !26, line: 539, baseType: !439, size: 64, offset: 1600)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_vadis_internal_hwloc_nodeset_t", file: !26, line: 157, baseType: !236)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "complete_nodeset", scope: !335, file: !26, line: 561, baseType: !439, size: 64, offset: 1664)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "infos", scope: !335, file: !26, line: 577, baseType: !442, size: 64, offset: 1728)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_vadis_internal_hwloc_info_s", file: !26, line: 673, size: 128, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !443, file: !26, line: 674, baseType: !178, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !443, file: !26, line: 675, baseType: !178, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "infos_count", scope: !335, file: !26, line: 578, baseType: !14, size: 32, offset: 1792)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !335, file: !26, line: 581, baseType: !77, size: 64, offset: 1856)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gp_index", scope: !335, file: !26, line: 586, baseType: !342, size: 64, offset: 1920)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !152, file: !13, line: 232, baseType: !328, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !152, file: !13, line: 233, baseType: !452, size: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !159, !331, !158, !14, !14, !14, !455, !333, !14}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "textsize", scope: !152, file: !13, line: 235, baseType: !458, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !159, !455, !14, !14, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!462 = !{i32 7, !"Dwarf Version", i32 5}
!463 = !{i32 2, !"Debug Info Version", i32 3}
!464 = !{i32 1, !"wchar_size", i32 4}
!465 = !{i32 8, !"PIC Level", i32 2}
!466 = !{i32 7, !"PIE Level", i32 2}
!467 = !{i32 7, !"uwtable", i32 2}
!468 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!469 = distinct !DISubprogram(name: "output_nativesvg", scope: !2, file: !2, line: 126, type: !470, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !472)
!470 = !DISubroutineType(types: !471)
!471 = !{!158, !159, !455}
!472 = !{!473, !474, !475}
!473 = !DILocalVariable(name: "loutput", arg: 1, scope: !469, file: !2, line: 126, type: !159)
!474 = !DILocalVariable(name: "filename", arg: 2, scope: !469, file: !2, line: 126, type: !455)
!475 = !DILocalVariable(name: "output", scope: !469, file: !2, line: 128, type: !170)
!476 = !{!477, !477, i64 0}
!477 = !{!"any pointer", !478, i64 0}
!478 = !{!"omnipotent char", !479, i64 0}
!479 = !{!"Simple C/C++ TBAA"}
!480 = !DILocation(line: 126, column: 45, scope: !469)
!481 = !DILocation(line: 126, column: 66, scope: !469)
!482 = !DILocation(line: 128, column: 3, scope: !469)
!483 = !DILocation(line: 128, column: 9, scope: !469)
!484 = !DILocation(line: 128, column: 30, scope: !469)
!485 = !DILocation(line: 128, column: 40, scope: !469)
!486 = !DILocation(line: 128, column: 49, scope: !469)
!487 = !{!488, !489, i64 32}
!488 = !{!"lstopo_output", !477, i64 0, !489, i64 8, !489, i64 12, !489, i64 16, !477, i64 24, !489, i64 32, !478, i64 36, !489, i64 40, !489, i64 44, !489, i64 48, !489, i64 52, !489, i64 56, !489, i64 60, !477, i64 64, !477, i64 72, !489, i64 80, !489, i64 84, !490, i64 88, !490, i64 96, !490, i64 104, !478, i64 112, !478, i64 116, !489, i64 500, !489, i64 504, !477, i64 512, !489, i64 520, !489, i64 524, !489, i64 528, !489, i64 532, !489, i64 536, !489, i64 540, !478, i64 544, !489, i64 548, !489, i64 552, !489, i64 556, !478, i64 560, !489, i64 816, !489, i64 820, !489, i64 824, !489, i64 828, !489, i64 832, !491, i64 836, !478, i64 840, !489, i64 920, !478, i64 924, !489, i64 1004, !478, i64 1008, !489, i64 1088, !478, i64 1092, !489, i64 1172, !489, i64 1176, !489, i64 1180, !489, i64 1184, !478, i64 1188, !478, i64 1268, !478, i64 1348, !477, i64 1432, !477, i64 1440, !478, i64 1448, !489, i64 1452, !489, i64 1456}
!489 = !{!"int", !478, i64 0}
!490 = !{!"long", !478, i64 0}
!491 = !{!"float", !478, i64 0}
!492 = !DILocation(line: 128, column: 18, scope: !469)
!493 = !DILocation(line: 129, column: 8, scope: !494)
!494 = distinct !DILexicalBlock(scope: !469, file: !2, line: 129, column: 7)
!495 = !DILocation(line: 129, column: 7, scope: !469)
!496 = !DILocation(line: 130, column: 13, scope: !497)
!497 = distinct !DILexicalBlock(scope: !494, file: !2, line: 129, column: 16)
!498 = !DILocation(line: 130, column: 61, scope: !497)
!499 = !DILocation(line: 130, column: 80, scope: !497)
!500 = !{!489, !489, i64 0}
!501 = !DILocation(line: 130, column: 71, scope: !497)
!502 = !DILocation(line: 130, column: 5, scope: !497)
!503 = !DILocation(line: 131, column: 5, scope: !497)
!504 = !DILocation(line: 134, column: 19, scope: !469)
!505 = !DILocation(line: 134, column: 3, scope: !469)
!506 = !DILocation(line: 134, column: 12, scope: !469)
!507 = !DILocation(line: 134, column: 17, scope: !469)
!508 = !{!488, !477, i64 24}
!509 = !DILocation(line: 135, column: 3, scope: !469)
!510 = !DILocation(line: 135, column: 12, scope: !469)
!511 = !DILocation(line: 135, column: 20, scope: !469)
!512 = !{!488, !477, i64 1440}
!513 = !DILocation(line: 138, column: 3, scope: !469)
!514 = !DILocation(line: 138, column: 12, scope: !469)
!515 = !DILocation(line: 138, column: 20, scope: !469)
!516 = !{!488, !478, i64 1448}
!517 = !DILocation(line: 139, column: 15, scope: !469)
!518 = !DILocation(line: 139, column: 3, scope: !469)
!519 = !DILocation(line: 140, column: 3, scope: !469)
!520 = !DILocation(line: 140, column: 12, scope: !469)
!521 = !DILocation(line: 140, column: 20, scope: !469)
!522 = !DILocation(line: 142, column: 11, scope: !469)
!523 = !DILocation(line: 142, column: 3, scope: !469)
!524 = !DILocation(line: 143, column: 11, scope: !469)
!525 = !DILocation(line: 144, column: 4, scope: !469)
!526 = !DILocation(line: 144, column: 13, scope: !469)
!527 = !{!488, !489, i64 1452}
!528 = !DILocation(line: 144, column: 20, scope: !469)
!529 = !DILocation(line: 144, column: 29, scope: !469)
!530 = !{!488, !489, i64 1456}
!531 = !DILocation(line: 144, column: 37, scope: !469)
!532 = !DILocation(line: 144, column: 46, scope: !469)
!533 = !DILocation(line: 144, column: 53, scope: !469)
!534 = !DILocation(line: 144, column: 62, scope: !469)
!535 = !DILocation(line: 143, column: 3, scope: !469)
!536 = !DILocation(line: 147, column: 18, scope: !469)
!537 = !DILocation(line: 147, column: 3, scope: !469)
!538 = !DILocation(line: 148, column: 32, scope: !469)
!539 = !DILocation(line: 148, column: 3, scope: !469)
!540 = !DILocation(line: 150, column: 15, scope: !469)
!541 = !DILocation(line: 150, column: 3, scope: !469)
!542 = !DILocation(line: 151, column: 11, scope: !469)
!543 = !DILocation(line: 151, column: 3, scope: !469)
!544 = !DILocation(line: 153, column: 7, scope: !545)
!545 = distinct !DILexicalBlock(scope: !469, file: !2, line: 153, column: 7)
!546 = !DILocation(line: 153, column: 17, scope: !545)
!547 = !DILocation(line: 153, column: 14, scope: !545)
!548 = !DILocation(line: 153, column: 7, scope: !469)
!549 = !DILocation(line: 154, column: 12, scope: !545)
!550 = !DILocation(line: 154, column: 5, scope: !545)
!551 = !DILocation(line: 156, column: 18, scope: !469)
!552 = !DILocation(line: 156, column: 3, scope: !469)
!553 = !DILocation(line: 157, column: 3, scope: !469)
!554 = !DILocation(line: 158, column: 1, scope: !469)
!555 = !DISubprogram(name: "open_output", scope: !13, file: !13, line: 42, type: !556, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!556 = !DISubroutineType(types: !557)
!557 = !{!170, !455, !158}
!558 = !DISubprogram(name: "fprintf", scope: !559, file: !559, line: 350, type: !560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!559 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!560 = !DISubroutineType(types: !561)
!561 = !{!158, !562, !563, null}
!562 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !170)
!563 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !455)
!564 = !DISubprogram(name: "strerror", scope: !565, file: !565, line: 419, type: !566, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!565 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!566 = !DISubroutineType(types: !567)
!567 = !{!178, !158}
!568 = !DISubprogram(name: "__errno_location", scope: !569, file: !569, line: 37, type: !570, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!569 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!570 = !DISubroutineType(types: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!573 = !DISubprogram(name: "output_draw", scope: !13, file: !13, line: 238, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !159}
!576 = !DISubprogram(name: "declare_colors", scope: !13, file: !13, line: 241, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!577 = !DISubprogram(name: "lstopo_prepare_custom_styles", scope: !13, file: !13, line: 240, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!578 = !DISubprogram(name: "fclose", scope: !559, file: !559, line: 178, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DISubroutineType(types: !580)
!580 = !{!158, !170}
!581 = !DISubprogram(name: "destroy_colors", scope: !13, file: !13, line: 242, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!582 = distinct !DISubprogram(name: "native_svg_box", scope: !2, file: !2, line: 20, type: !329, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !644, !645, !646, !647, !648, !649, !650, !651, !655}
!584 = !DILocalVariable(name: "loutput", arg: 1, scope: !582, file: !2, line: 20, type: !159)
!585 = !DILocalVariable(name: "lcolor", arg: 2, scope: !582, file: !2, line: 20, type: !331)
!586 = !DILocalVariable(name: "depth", arg: 3, scope: !582, file: !2, line: 20, type: !14)
!587 = !DILocalVariable(name: "x", arg: 4, scope: !582, file: !2, line: 20, type: !14)
!588 = !DILocalVariable(name: "width", arg: 5, scope: !582, file: !2, line: 20, type: !14)
!589 = !DILocalVariable(name: "y", arg: 6, scope: !582, file: !2, line: 20, type: !14)
!590 = !DILocalVariable(name: "height", arg: 7, scope: !582, file: !2, line: 20, type: !14)
!591 = !DILocalVariable(name: "obj", arg: 8, scope: !582, file: !2, line: 20, type: !333)
!592 = !DILocalVariable(name: "box_id", arg: 9, scope: !582, file: !2, line: 20, type: !14)
!593 = !DILocalVariable(name: "file", scope: !582, file: !2, line: 22, type: !170)
!594 = !DILocalVariable(name: "ou", scope: !582, file: !2, line: 23, type: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lstopo_obj_userdata", file: !13, line: 166, size: 5696, elements: !597)
!597 = !{!598, !607, !608, !609, !615, !616, !617, !618, !619, !629, !630, !631, !632, !633, !642, !643}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !596, file: !13, line: 168, baseType: !599, size: 256)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_utils_userdata", file: !600, line: 474, size: 256, elements: !601)
!600 = !DIFile(filename: "libhwloc/utils/hwloc/misc.h", directory: "/local-ssd/quo-vadis-ngd6cwnjru4wgycspwlythoi77wb76u5-build/aidengro/spack-stage-quo-vadis-master-ngd6cwnjru4wgycspwlythoi77wb76u5/spack-build-ngd6cwn/hwloc/src", checksumkind: CSK_MD5, checksum: "bc5a109a7c7905229969db564920d724")
!601 = !{!602, !603, !604, !605}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !600, line: 475, baseType: !178, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !599, file: !600, line: 476, baseType: !219, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !599, file: !600, line: 477, baseType: !178, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !599, file: !600, line: 478, baseType: !606, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pci_collapsed", scope: !596, file: !13, line: 171, baseType: !158, size: 32, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "factorized", scope: !596, file: !13, line: 172, baseType: !158, size: 32, offset: 288)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !596, file: !13, line: 175, baseType: !610, size: 192, offset: 320)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lstopo_style", file: !13, line: 153, size: 192, elements: !611)
!611 = !{!612, !613, !614}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !610, file: !13, line: 155, baseType: !304, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !610, file: !13, line: 156, baseType: !304, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !610, file: !13, line: 157, baseType: !304, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "style_set", scope: !596, file: !13, line: 179, baseType: !14, size: 32, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cpukind_style", scope: !596, file: !13, line: 182, baseType: !14, size: 32, offset: 544)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !596, file: !13, line: 185, baseType: !14, size: 32, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !596, file: !13, line: 186, baseType: !14, size: 32, offset: 608)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !596, file: !13, line: 198, baseType: !620, size: 256, offset: 640)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lstopo_children_position", file: !13, line: 190, size: 256, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "kinds", scope: !620, file: !13, line: 191, baseType: !14, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !620, file: !13, line: 192, baseType: !14, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !620, file: !13, line: 193, baseType: !14, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "xrel", scope: !620, file: !13, line: 194, baseType: !14, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "yrel", scope: !620, file: !13, line: 195, baseType: !14, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !620, file: !13, line: 196, baseType: !14, size: 32, offset: 160)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "boxcolor", scope: !620, file: !13, line: 197, baseType: !304, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "above_children", scope: !596, file: !13, line: 200, baseType: !620, size: 256, offset: 896)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "xrel", scope: !596, file: !13, line: 203, baseType: !14, size: 32, offset: 1152)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "yrel", scope: !596, file: !13, line: 204, baseType: !14, size: 32, offset: 1184)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "orient", scope: !596, file: !13, line: 207, baseType: !49, size: 32, offset: 1216)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !596, file: !13, line: 215, baseType: !634, size: 4352, offset: 1248)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 4352, elements: !97)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lstopo_text_line", file: !13, line: 211, size: 1088, elements: !636)
!636 = !{!637, !640, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !635, file: !13, line: 212, baseType: !638, size: 1024)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !639)
!639 = !{!254}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !635, file: !13, line: 213, baseType: !14, size: 32, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "xoffset", scope: !635, file: !13, line: 214, baseType: !14, size: 32, offset: 1056)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ntext", scope: !596, file: !13, line: 216, baseType: !14, size: 32, offset: 5600)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "textwidth", scope: !596, file: !13, line: 217, baseType: !14, size: 32, offset: 5632)
!644 = !DILocalVariable(name: "thickness", scope: !582, file: !2, line: 24, type: !14)
!645 = !DILocalVariable(name: "r", scope: !582, file: !2, line: 25, type: !158)
!646 = !DILocalVariable(name: "g", scope: !582, file: !2, line: 25, type: !158)
!647 = !DILocalVariable(name: "b", scope: !582, file: !2, line: 25, type: !158)
!648 = !DILocalVariable(name: "id", scope: !582, file: !2, line: 26, type: !638)
!649 = !DILocalVariable(name: "class", scope: !582, file: !2, line: 27, type: !638)
!650 = !DILocalVariable(name: "complement", scope: !582, file: !2, line: 28, type: !106)
!651 = !DILocalVariable(name: "dash", scope: !582, file: !2, line: 29, type: !652)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 32)
!655 = !DILocalVariable(name: "type", scope: !656, file: !2, line: 35, type: !658)
!656 = distinct !DILexicalBlock(scope: !657, file: !2, line: 34, column: 12)
!657 = distinct !DILexicalBlock(scope: !582, file: !2, line: 34, column: 7)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 64)
!661 = !DILocation(line: 20, column: 38, scope: !582)
!662 = !DILocation(line: 20, column: 74, scope: !582)
!663 = !DILocation(line: 20, column: 91, scope: !582)
!664 = !DILocation(line: 20, column: 132, scope: !582)
!665 = !DILocation(line: 20, column: 144, scope: !582)
!666 = !DILocation(line: 20, column: 160, scope: !582)
!667 = !DILocation(line: 20, column: 172, scope: !582)
!668 = !DILocation(line: 20, column: 192, scope: !582)
!669 = !DILocation(line: 20, column: 206, scope: !582)
!670 = !DILocation(line: 22, column: 3, scope: !582)
!671 = !DILocation(line: 22, column: 9, scope: !582)
!672 = !DILocation(line: 22, column: 16, scope: !582)
!673 = !DILocation(line: 22, column: 25, scope: !582)
!674 = !DILocation(line: 23, column: 3, scope: !582)
!675 = !DILocation(line: 23, column: 31, scope: !582)
!676 = !DILocation(line: 23, column: 36, scope: !582)
!677 = !DILocation(line: 23, column: 42, scope: !582)
!678 = !DILocation(line: 23, column: 47, scope: !582)
!679 = !{!680, !477, i64 232}
!680 = !{!"quo_vadis_internal_hwloc_obj", !478, i64 0, !477, i64 8, !489, i64 16, !477, i64 24, !490, i64 32, !477, i64 40, !489, i64 48, !489, i64 52, !477, i64 56, !477, i64 64, !477, i64 72, !489, i64 80, !477, i64 88, !477, i64 96, !489, i64 104, !477, i64 112, !477, i64 120, !477, i64 128, !489, i64 136, !489, i64 140, !477, i64 144, !489, i64 152, !477, i64 160, !489, i64 168, !477, i64 176, !477, i64 184, !477, i64 192, !477, i64 200, !477, i64 208, !477, i64 216, !489, i64 224, !477, i64 232, !490, i64 240}
!681 = !DILocation(line: 24, column: 3, scope: !582)
!682 = !DILocation(line: 24, column: 12, scope: !582)
!683 = !DILocation(line: 24, column: 24, scope: !582)
!684 = !DILocation(line: 24, column: 33, scope: !582)
!685 = !{!488, !489, i64 832}
!686 = !DILocation(line: 25, column: 3, scope: !582)
!687 = !DILocation(line: 25, column: 7, scope: !582)
!688 = !DILocation(line: 25, column: 11, scope: !582)
!689 = !DILocation(line: 25, column: 19, scope: !582)
!690 = !{!691, !489, i64 0}
!691 = !{!"lstopo_color", !489, i64 0, !489, i64 4, !489, i64 8, !489, i64 12, !478, i64 16, !477, i64 24}
!692 = !DILocation(line: 25, column: 22, scope: !582)
!693 = !DILocation(line: 25, column: 26, scope: !582)
!694 = !DILocation(line: 25, column: 34, scope: !582)
!695 = !{!691, !489, i64 4}
!696 = !DILocation(line: 25, column: 37, scope: !582)
!697 = !DILocation(line: 25, column: 41, scope: !582)
!698 = !DILocation(line: 25, column: 49, scope: !582)
!699 = !{!691, !489, i64 8}
!700 = !DILocation(line: 26, column: 3, scope: !582)
!701 = !DILocation(line: 26, column: 8, scope: !582)
!702 = !DILocation(line: 27, column: 3, scope: !582)
!703 = !DILocation(line: 27, column: 8, scope: !582)
