; ModuleID = 'samples/139.bc'
source_filename = "src/core/grep.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.regex_t = type { i64, ptr }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [12 x i8] c"dest && str\00", align 1, !dbg !7
@__func__.gt_grep_escape_extended = private unnamed_addr constant [24 x i8] c"gt_grep_escape_extended\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [16 x i8] c"src/core/grep.c\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [2 x i8] c"\\\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [30 x i8] c"!err || !gt_error_is_set(err)\00", align 1, !dbg !28
@__func__.gt_grep_nt = private unnamed_addr constant [11 x i8] c"gt_grep_nt\00", align 1, !dbg !33
@.str.5 = private unnamed_addr constant [16 x i8] c"pattern && line\00", align 1, !dbg !38
@__func__.gt_grep_unit_test = private unnamed_addr constant [18 x i8] c"gt_grep_unit_test\00", align 1, !dbg !40

!137 = !{i32 7, !"Dwarf Version", i32 5}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{i32 1, !"wchar_size", i32 4}
!140 = !{i32 8, !"PIC Level", i32 2}
!141 = !{i32 7, !"uwtable", i32 2}
!142 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!143 = distinct !DISubprogram(name: "gt_grep_escape_extended", scope: !2, file: !2, line: 41, type: !144, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !116, retainedNodes: !154)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !146, !150, !151}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStr", file: !148, line: 27, baseType: !149)
!148 = !DIFile(filename: "src/core/str_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "654ceffd2f9ff17a42a8522fe21401e1")
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStr", file: !148, line: 27, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 70, baseType: !153)
!152 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!153 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!154 = !{!155, !156, !157, !158}
!155 = !DILocalVariable(name: "dest", arg: 1, scope: !143, file: !2, line: 41, type: !146)
!156 = !DILocalVariable(name: "str", arg: 2, scope: !143, file: !2, line: 41, type: !150)
!157 = !DILocalVariable(name: "len", arg: 3, scope: !143, file: !2, line: 41, type: !151)
!158 = !DILocalVariable(name: "i", scope: !143, file: !2, line: 43, type: !151)
!159 = !{!160, !160, i64 0}
!160 = !{!"any pointer", !161, i64 0}
!161 = !{!"omnipotent char", !162, i64 0}
!162 = !{!"Simple C/C++ TBAA"}
!163 = !DILocation(line: 41, column: 37, scope: !143)
!164 = !DILocation(line: 41, column: 55, scope: !143)
!165 = !{!166, !166, i64 0}
!166 = !{!"long", !161, i64 0}
!167 = !DILocation(line: 41, column: 67, scope: !143)
!168 = !DILocation(line: 43, column: 3, scope: !143)
!169 = !DILocation(line: 43, column: 10, scope: !143)
!170 = !DILocation(line: 44, column: 3, scope: !143)
!171 = !DILocation(line: 44, column: 3, scope: !172)
!172 = distinct !DILexicalBlock(scope: !173, file: !2, line: 44, column: 3)
!173 = distinct !DILexicalBlock(scope: !143, file: !2, line: 44, column: 3)
!174 = !DILocation(line: 44, column: 3, scope: !173)
!175 = !DILocation(line: 44, column: 3, scope: !176)
!176 = distinct !DILexicalBlock(scope: !172, file: !2, line: 44, column: 3)
!177 = !DILocation(line: 45, column: 16, scope: !143)
!178 = !DILocation(line: 45, column: 3, scope: !143)
!179 = !DILocation(line: 46, column: 9, scope: !180)
!180 = distinct !DILexicalBlock(scope: !143, file: !2, line: 46, column: 3)
!181 = !DILocation(line: 46, column: 8, scope: !180)
!182 = !DILocation(line: 46, column: 14, scope: !183)
!183 = distinct !DILexicalBlock(scope: !180, file: !2, line: 46, column: 3)
!184 = !DILocation(line: 46, column: 18, scope: !183)
!185 = !DILocation(line: 46, column: 16, scope: !183)
!186 = !DILocation(line: 46, column: 3, scope: !180)
!187 = !DILocation(line: 47, column: 13, scope: !188)
!188 = distinct !DILexicalBlock(scope: !183, file: !2, line: 46, column: 28)
!189 = !DILocation(line: 47, column: 17, scope: !188)
!190 = !{!161, !161, i64 0}
!191 = !DILocation(line: 47, column: 5, scope: !188)
!192 = !DILocation(line: 60, column: 28, scope: !193)
!193 = distinct !DILexicalBlock(scope: !188, file: !2, line: 47, column: 21)
!194 = !DILocation(line: 60, column: 9, scope: !193)
!195 = !DILocation(line: 61, column: 9, scope: !193)
!196 = !DILocation(line: 63, column: 9, scope: !193)
!197 = !DILocation(line: 65, column: 24, scope: !188)
!198 = !DILocation(line: 65, column: 30, scope: !188)
!199 = !DILocation(line: 65, column: 34, scope: !188)
!200 = !DILocation(line: 65, column: 5, scope: !188)
!201 = !DILocation(line: 66, column: 3, scope: !188)
!202 = !DILocation(line: 46, column: 24, scope: !183)
!203 = !DILocation(line: 46, column: 3, scope: !183)
!204 = distinct !{!204, !186, !205, !206}
!205 = !DILocation(line: 66, column: 3, scope: !180)
!206 = !{!"llvm.loop.mustprogress"}
!207 = !DILocation(line: 67, column: 1, scope: !143)
!208 = !DISubprogram(name: "fprintf", scope: !209, file: !209, line: 350, type: !210, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!209 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!210 = !DISubroutineType(types: !211)
!211 = !{!212, !213, !272, null}
!212 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !216, line: 7, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !218, line: 49, size: 1728, elements: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!219 = !{!220, !221, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !236, !238, !239, !240, !244, !246, !248, !252, !255, !257, !260, !263, !264, !266, !267, !268}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !217, file: !218, line: 51, baseType: !212, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !217, file: !218, line: 54, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !217, file: !218, line: 55, baseType: !222, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !217, file: !218, line: 56, baseType: !222, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !217, file: !218, line: 57, baseType: !222, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !217, file: !218, line: 58, baseType: !222, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !217, file: !218, line: 59, baseType: !222, size: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !217, file: !218, line: 60, baseType: !222, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !217, file: !218, line: 61, baseType: !222, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !217, file: !218, line: 64, baseType: !222, size: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !217, file: !218, line: 65, baseType: !222, size: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !217, file: !218, line: 66, baseType: !222, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !217, file: !218, line: 68, baseType: !234, size: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !218, line: 36, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !217, file: !218, line: 70, baseType: !237, size: 64, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !217, file: !218, line: 72, baseType: !212, size: 32, offset: 896)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !217, file: !218, line: 73, baseType: !212, size: 32, offset: 928)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !217, file: !218, line: 74, baseType: !241, size: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !242, line: 152, baseType: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!243 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !217, file: !218, line: 77, baseType: !245, size: 16, offset: 1024)
!245 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !217, file: !218, line: 78, baseType: !247, size: 8, offset: 1040)
!247 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !217, file: !218, line: 79, baseType: !249, size: 8, offset: 1048)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 1)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !217, file: !218, line: 81, baseType: !253, size: 64, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !218, line: 43, baseType: null)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !217, file: !218, line: 89, baseType: !256, size: 64, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !242, line: 153, baseType: !243)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !217, file: !218, line: 91, baseType: !258, size: 64, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !218, line: 37, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !217, file: !218, line: 92, baseType: !261, size: 64, offset: 1280)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !218, line: 38, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !217, file: !218, line: 93, baseType: !237, size: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !217, file: !218, line: 94, baseType: !265, size: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !217, file: !218, line: 95, baseType: !151, size: 64, offset: 1472)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !217, file: !218, line: 96, baseType: !212, size: 32, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !217, file: !218, line: 98, baseType: !269, size: 160, offset: 1568)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 20)
!272 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !150)
!273 = !DISubprogram(name: "abort", scope: !274, file: !274, line: 598, type: !275, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!274 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!275 = !DISubroutineType(types: !276)
!276 = !{null}
!277 = !DISubprogram(name: "gt_str_reset", scope: !148, file: !148, line: 70, type: !278, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !146}
!280 = !DISubprogram(name: "gt_str_append_cstr", scope: !148, file: !148, line: 46, type: !281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !146, !150}
!283 = !DISubprogram(name: "gt_str_append_char", scope: !148, file: !148, line: 51, type: !284, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !146, !4}
!286 = distinct !DISubprogram(name: "gt_grep_nt", scope: !2, file: !2, line: 69, type: !287, scopeLine: 71, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !116, retainedNodes: !295)
!287 = !DISubroutineType(types: !288)
!288 = !{!212, !289, !150, !150, !151, !291}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !293, line: 44, baseType: !294)
!293 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !293, line: 44, flags: DIFlagFwdDecl)
!295 = !{!296, !297, !298, !299, !300, !301, !307, !308}
!296 = !DILocalVariable(name: "match", arg: 1, scope: !286, file: !2, line: 69, type: !289)
!297 = !DILocalVariable(name: "pattern", arg: 2, scope: !286, file: !2, line: 69, type: !150)
!298 = !DILocalVariable(name: "line", arg: 3, scope: !286, file: !2, line: 70, type: !150)
!299 = !DILocalVariable(name: "len", arg: 4, scope: !286, file: !2, line: 70, type: !151)
!300 = !DILocalVariable(name: "err", arg: 5, scope: !286, file: !2, line: 70, type: !291)
!301 = !DILocalVariable(name: "matcher", scope: !286, file: !2, line: 72, type: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !119, line: 70, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 67, size: 128, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !303, file: !119, line: 68, baseType: !151, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !303, file: !119, line: 69, baseType: !265, size: 64, offset: 64)
!307 = !DILocalVariable(name: "rval", scope: !286, file: !2, line: 73, type: !212)
!308 = !DILocalVariable(name: "had_err", scope: !286, file: !2, line: 73, type: !212)
!309 = !DILocation(line: 69, column: 32, scope: !286)
!310 = !DILocation(line: 69, column: 61, scope: !286)
!311 = !DILocation(line: 70, column: 38, scope: !286)
!312 = !DILocation(line: 70, column: 51, scope: !286)
!313 = !DILocation(line: 70, column: 65, scope: !286)
!314 = !DILocation(line: 72, column: 3, scope: !286)
!315 = !DILocation(line: 72, column: 11, scope: !286)
!316 = !DILocation(line: 73, column: 3, scope: !286)
!317 = !DILocation(line: 73, column: 7, scope: !286)
!318 = !DILocation(line: 73, column: 13, scope: !286)
!319 = !{!320, !320, i64 0}
!320 = !{!"int", !161, i64 0}
!321 = !DILocation(line: 74, column: 3, scope: !286)
!322 = !DILocation(line: 74, column: 3, scope: !323)
!323 = distinct !DILexicalBlock(scope: !324, file: !2, line: 74, column: 3)
!324 = distinct !DILexicalBlock(scope: !286, file: !2, line: 74, column: 3)
!325 = !DILocation(line: 74, column: 3, scope: !324)
!326 = !DILocation(line: 74, column: 3, scope: !327)
!327 = distinct !DILexicalBlock(scope: !323, file: !2, line: 74, column: 3)
!328 = !DILocation(line: 75, column: 3, scope: !286)
!329 = !DILocation(line: 75, column: 3, scope: !330)
!330 = distinct !DILexicalBlock(scope: !331, file: !2, line: 75, column: 3)
!331 = distinct !DILexicalBlock(scope: !286, file: !2, line: 75, column: 3)
!332 = !DILocation(line: 75, column: 3, scope: !331)
!333 = !DILocation(line: 75, column: 3, scope: !334)
!334 = distinct !DILexicalBlock(scope: !330, file: !2, line: 75, column: 3)
!335 = !DILocation(line: 76, column: 37, scope: !336)
!336 = distinct !DILexicalBlock(scope: !286, file: !2, line: 76, column: 7)
!337 = !DILocation(line: 76, column: 15, scope: !336)
!338 = !DILocation(line: 76, column: 13, scope: !336)
!339 = !DILocation(line: 76, column: 7, scope: !286)
!340 = !DILocation(line: 77, column: 16, scope: !341)
!341 = distinct !DILexicalBlock(scope: !336, file: !2, line: 76, column: 74)
!342 = !DILocation(line: 77, column: 32, scope: !341)
!343 = !DILocation(line: 77, column: 5, scope: !341)
!344 = !DILocation(line: 78, column: 13, scope: !341)
!345 = !DILocation(line: 79, column: 3, scope: !341)
!346 = !DILocation(line: 80, column: 8, scope: !347)
!347 = distinct !DILexicalBlock(scope: !286, file: !2, line: 80, column: 7)
!348 = !DILocation(line: 80, column: 7, scope: !286)
!349 = !DILocation(line: 81, column: 35, scope: !350)
!350 = distinct !DILexicalBlock(scope: !347, file: !2, line: 80, column: 17)
!351 = !DILocation(line: 81, column: 41, scope: !350)
!352 = !DILocation(line: 81, column: 12, scope: !350)
!353 = !DILocation(line: 81, column: 10, scope: !350)
!354 = !DILocation(line: 82, column: 9, scope: !355)
!355 = distinct !DILexicalBlock(scope: !350, file: !2, line: 82, column: 9)
!356 = !DILocation(line: 82, column: 14, scope: !355)
!357 = !DILocation(line: 82, column: 17, scope: !355)
!358 = !DILocation(line: 82, column: 22, scope: !355)
!359 = !DILocation(line: 82, column: 9, scope: !350)
!360 = !DILocation(line: 83, column: 18, scope: !361)
!361 = distinct !DILexicalBlock(scope: !355, file: !2, line: 82, column: 38)
!362 = !DILocation(line: 83, column: 34, scope: !361)
!363 = !DILocation(line: 83, column: 7, scope: !361)
!364 = !DILocation(line: 84, column: 15, scope: !361)
!365 = !DILocation(line: 85, column: 5, scope: !361)
!366 = !DILocation(line: 86, column: 3, scope: !350)
!367 = !DILocation(line: 87, column: 3, scope: !286)
!368 = !DILocation(line: 88, column: 8, scope: !369)
!369 = distinct !DILexicalBlock(scope: !286, file: !2, line: 88, column: 7)
!370 = !DILocation(line: 88, column: 7, scope: !286)
!371 = !DILocation(line: 89, column: 9, scope: !372)
!372 = distinct !DILexicalBlock(scope: !373, file: !2, line: 89, column: 9)
!373 = distinct !DILexicalBlock(scope: !369, file: !2, line: 88, column: 17)
!374 = !DILocation(line: 89, column: 9, scope: !373)
!375 = !DILocation(line: 90, column: 8, scope: !372)
!376 = !DILocation(line: 90, column: 14, scope: !372)
!377 = !{!378, !378, i64 0}
!378 = !{!"_Bool", !161, i64 0}
!379 = !DILocation(line: 90, column: 7, scope: !372)
!380 = !DILocation(line: 92, column: 8, scope: !372)
!381 = !DILocation(line: 92, column: 14, scope: !372)
!382 = !DILocation(line: 93, column: 3, scope: !373)
!383 = !DILocation(line: 94, column: 10, scope: !286)
!384 = !DILocation(line: 95, column: 1, scope: !286)
!385 = !DILocation(line: 94, column: 3, scope: !286)
!386 = !DISubprogram(name: "gt_error_is_set", scope: !293, file: !293, line: 64, type: !387, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!387 = !DISubroutineType(types: !388)
!388 = !{!290, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!391 = !DISubprogram(name: "tre_regcomp", scope: !119, file: !119, line: 132, type: !392, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!392 = !DISubroutineType(types: !393)
!393 = !{!212, !394, !150, !212}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!395 = distinct !DISubprogram(name: "grep_error", scope: !2, file: !2, line: 28, type: !396, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, retainedNodes: !398)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !212, !394, !291}
!398 = !{!399, !400, !401, !402, !406, !407}
!399 = !DILocalVariable(name: "errcode", arg: 1, scope: !395, file: !2, line: 28, type: !212)
!400 = !DILocalVariable(name: "matcher", arg: 2, scope: !395, file: !2, line: 28, type: !394)
!401 = !DILocalVariable(name: "err", arg: 3, scope: !395, file: !2, line: 28, type: !291)
!402 = !DILocalVariable(name: "sbuf", scope: !395, file: !2, line: 30, type: !403)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 8192)
!406 = !DILocalVariable(name: "buf", scope: !395, file: !2, line: 30, type: !222)
!407 = !DILocalVariable(name: "bufsize", scope: !395, file: !2, line: 31, type: !151)
!408 = !DILocation(line: 28, column: 28, scope: !395)
!409 = !DILocation(line: 28, column: 46, scope: !395)
!410 = !DILocation(line: 28, column: 64, scope: !395)
!411 = !DILocation(line: 30, column: 3, scope: !395)
!412 = !DILocation(line: 30, column: 8, scope: !395)
!413 = !DILocation(line: 30, column: 23, scope: !395)
!414 = !DILocation(line: 31, column: 3, scope: !395)
!415 = !DILocation(line: 31, column: 10, scope: !395)
!416 = !DILocation(line: 32, column: 3, scope: !395)
!417 = !DILocation(line: 32, column: 3, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !2, line: 32, column: 3)
!419 = distinct !DILexicalBlock(scope: !395, file: !2, line: 32, column: 3)
!420 = !DILocation(line: 32, column: 3, scope: !419)
!421 = !DILocation(line: 32, column: 3, scope: !422)
!422 = distinct !DILexicalBlock(scope: !418, file: !2, line: 32, column: 3)
!423 = !DILocation(line: 33, column: 26, scope: !395)
!424 = !DILocation(line: 33, column: 35, scope: !395)
!425 = !DILocation(line: 33, column: 13, scope: !395)
!426 = !DILocation(line: 33, column: 11, scope: !395)
!427 = !DILocation(line: 34, column: 9, scope: !395)
!428 = !DILocation(line: 34, column: 7, scope: !395)
!429 = !DILocation(line: 35, column: 23, scope: !395)
!430 = !DILocation(line: 35, column: 32, scope: !395)
!431 = !DILocation(line: 35, column: 41, scope: !395)
!432 = !DILocation(line: 35, column: 47, scope: !395)
!433 = !DILocation(line: 35, column: 53, scope: !395)
!434 = !DILocation(line: 36, column: 23, scope: !395)
!435 = !DILocation(line: 36, column: 29, scope: !395)
!436 = !DILocation(line: 35, column: 10, scope: !395)
!437 = !DILocation(line: 37, column: 16, scope: !395)
!438 = !DILocation(line: 37, column: 35, scope: !395)
!439 = !DILocation(line: 37, column: 41, scope: !395)
!440 = !DILocation(line: 37, column: 47, scope: !395)
!441 = !DILocation(line: 37, column: 3, scope: !395)
!442 = !DILocation(line: 38, column: 3, scope: !395)
!443 = !DILocation(line: 39, column: 1, scope: !395)
!444 = !DISubprogram(name: "tre_regnexec", scope: !119, file: !119, line: 165, type: !445, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!445 = !DISubroutineType(types: !446)
!446 = !{!212, !447, !150, !151, !151, !449, !212}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_t", file: !119, line: 75, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 72, size: 64, elements: !452)
!452 = !{!453, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rm_so", scope: !451, file: !119, line: 73, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !119, line: 66, baseType: !212)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rm_eo", scope: !451, file: !119, line: 74, baseType: !454, size: 32, offset: 32)
!456 = !DISubprogram(name: "tre_regfree", scope: !119, file: !119, line: 143, type: !457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !394}
!459 = distinct !DISubprogram(name: "gt_grep", scope: !2, file: !2, line: 97, type: !460, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !116, retainedNodes: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{!212, !289, !150, !150, !291}
!462 = !{!463, !464, !465, !466}
!463 = !DILocalVariable(name: "match", arg: 1, scope: !459, file: !2, line: 97, type: !289)
!464 = !DILocalVariable(name: "pattern", arg: 2, scope: !459, file: !2, line: 97, type: !150)
!465 = !DILocalVariable(name: "line", arg: 3, scope: !459, file: !2, line: 98, type: !150)
!466 = !DILocalVariable(name: "err", arg: 4, scope: !459, file: !2, line: 98, type: !291)
!467 = !DILocation(line: 97, column: 29, scope: !459)
!468 = !DILocation(line: 97, column: 58, scope: !459)
!469 = !DILocation(line: 98, column: 35, scope: !459)
!470 = !DILocation(line: 98, column: 50, scope: !459)
!471 = !DILocation(line: 100, column: 21, scope: !459)
!472 = !DILocation(line: 100, column: 28, scope: !459)
!473 = !DILocation(line: 100, column: 37, scope: !459)
!474 = !DILocation(line: 100, column: 50, scope: !459)
!475 = !DILocation(line: 100, column: 43, scope: !459)
!476 = !DILocation(line: 100, column: 57, scope: !459)
!477 = !DILocation(line: 100, column: 10, scope: !459)
!478 = !DILocation(line: 100, column: 3, scope: !459)
!479 = !DISubprogram(name: "strlen", scope: !480, file: !480, line: 407, type: !481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!480 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!481 = !DISubroutineType(types: !482)
!482 = !{!153, !150}
!483 = distinct !DISubprogram(name: "gt_grep_unit_test", scope: !2, file: !2, line: 103, type: !484, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !116, retainedNodes: !486)
!484 = !DISubroutineType(types: !485)
!485 = !{!212, !291}
!486 = !{!487, !488, !489, !490, !491}
!487 = !DILocalVariable(name: "err", arg: 1, scope: !483, file: !2, line: 103, type: !291)
!488 = !DILocalVariable(name: "match", scope: !483, file: !2, line: 105, type: !290)
!489 = !DILocalVariable(name: "escbuf", scope: !483, file: !2, line: 106, type: !146)
!490 = !DILocalVariable(name: "grep_err", scope: !483, file: !2, line: 107, type: !212)
!491 = !DILocalVariable(name: "had_err", scope: !483, file: !2, line: 107, type: !212)
!492 = !DILocation(line: 103, column: 32, scope: !483)
!493 = !DILocation(line: 105, column: 3, scope: !483)
!494 = !DILocation(line: 105, column: 8, scope: !483)
!495 = !DILocation(line: 106, column: 3, scope: !483)
!496 = !DILocation(line: 106, column: 10, scope: !483)
!497 = !DILocation(line: 107, column: 3, scope: !483)
!498 = !DILocation(line: 107, column: 7, scope: !483)
!499 = !DILocation(line: 107, column: 17, scope: !483)
!500 = !DILocation(line: 108, column: 3, scope: !483)
!501 = !DILocation(line: 108, column: 3, scope: !502)
!502 = distinct !DILexicalBlock(scope: !503, file: !2, line: 108, column: 3)
!503 = distinct !DILexicalBlock(scope: !483, file: !2, line: 108, column: 3)
!504 = !DILocation(line: 108, column: 3, scope: !503)
!505 = !DILocation(line: 108, column: 3, scope: !506)
!506 = distinct !DILexicalBlock(scope: !502, file: !2, line: 108, column: 3)
!507 = !DILocation(line: 110, column: 14, scope: !483)
!508 = !DILocation(line: 110, column: 12, scope: !483)
!509 = !DILocation(line: 111, column: 3, scope: !483)
!510 = !DILocation(line: 111, column: 3, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !2, line: 111, column: 3)
