; ModuleID = 'samples/150.bc'
source_filename = "src/core/checkbitpackstring64.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [24 x i8] c"offset=%lu, numRnd=%lu\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [32 x i8] c"src/core/checkbitpackstring64.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [34 x i8] c"gt_bsStoreUInt64/gt_bsGetUInt64: \00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [145 x i8] c"gt_ensure(%s) failed: function %s, file %s, line %d.\0AThis is probably a bug, please report at https://github.com/genometools/genometools/issues.\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [7 x i8] c"r == v\00", align 1, !dbg !22
@__func__.gt_bitPackStringInt64_unit_test = private unnamed_addr constant [32 x i8] c"gt_bitPackStringInt64_unit_test\00", align 1, !dbg !27
@.str.5 = private unnamed_addr constant [32 x i8] c"Expected %lu, got %lu, i = %lu\0A\00", align 1, !dbg !31
@.str.6 = private unnamed_addr constant [8 x i8] c"passed\0A\00", align 1, !dbg !33
@.str.7 = private unnamed_addr constant [52 x i8] c"bsSetBit, gt_bsClearBit, bsToggleBit, gt_bsGetBit: \00", align 1, !dbg !38
@.str.8 = private unnamed_addr constant [43 x i8] c"lowBit == (r = gt_bsGetBit(bitStore, --i))\00", align 1, !dbg !43

!2692 = !DILocation(line: 350, column: 30, scope: !2650)
!2693 = !DILocation(line: 350, column: 21, scope: !2650)
!2694 = !DILocation(line: 350, column: 19, scope: !2650)
!2695 = !DILocation(line: 352, column: 32, scope: !2696)
!2696 = distinct !DILexicalBlock(scope: !2650, file: !214, line: 351, column: 3)
!2697 = !DILocation(line: 352, column: 37, scope: !2696)
!2698 = !DILocation(line: 352, column: 49, scope: !2696)
!2699 = !DILocation(line: 353, column: 32, scope: !2696)
!2700 = !DILocation(line: 353, column: 55, scope: !2696)
!2701 = !DILocation(line: 352, column: 5, scope: !2696)
!2702 = !DILocation(line: 354, column: 25, scope: !2696)
!2703 = !DILocation(line: 354, column: 35, scope: !2696)
!2704 = !DILocation(line: 354, column: 46, scope: !2696)
!2705 = !DILocation(line: 354, column: 5, scope: !2696)
!2706 = !DILocation(line: 355, column: 17, scope: !2696)
!2707 = !DILocation(line: 355, column: 14, scope: !2696)
!2708 = !DILocation(line: 356, column: 17, scope: !2696)
!2709 = !DILocation(line: 356, column: 14, scope: !2696)
!2710 = !DILocation(line: 357, column: 19, scope: !2696)
!2711 = !DILocation(line: 357, column: 31, scope: !2696)
!2712 = !DILocation(line: 357, column: 29, scope: !2696)
!2713 = !DILocation(line: 357, column: 16, scope: !2696)
!2714 = distinct !{!2714, !2690, !2715, !580}
!2715 = !DILocation(line: 358, column: 3, scope: !2650)
!2716 = !DILocation(line: 359, column: 30, scope: !2650)
!2717 = !DILocation(line: 359, column: 35, scope: !2650)
!2718 = !DILocation(line: 359, column: 47, scope: !2650)
!2719 = !DILocation(line: 360, column: 30, scope: !2650)
!2720 = !DILocation(line: 360, column: 52, scope: !2650)
!2721 = !DILocation(line: 359, column: 3, scope: !2650)
!2722 = !DILocation(line: 361, column: 23, scope: !2650)
!2723 = !DILocation(line: 361, column: 33, scope: !2650)
!2724 = !DILocation(line: 361, column: 43, scope: !2650)
!2725 = !DILocation(line: 361, column: 3, scope: !2650)
!2726 = !DILocation(line: 362, column: 1, scope: !2650)
!2727 = !DISubprogram(name: "gt_bsStoreNonUniformUInt64Array", scope: !250, file: !250, line: 487, type: !2728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2728 = !DISubroutineType(types: !2729)
!2729 = !{null, !294, !270, !274, !270, !302, !272}
!2730 = !DISubprogram(name: "gt_bsGetNonUniformUInt64Array", scope: !250, file: !250, line: 699, type: !2731, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2731 = !DISubroutineType(types: !2732)
!2732 = !{null, !2389, !270, !274, !270, !302, !276}
!2733 = distinct !DISubprogram(name: "gt_bsStoreNonUniformInt64Array", scope: !214, file: !214, line: 220, type: !2734, scopeLine: 223, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !243, retainedNodes: !2736)
!2734 = !DISubroutineType(types: !2735)
!2735 = !{null, !294, !270, !274, !270, !302, !2630}
!2736 = !{!2737, !2738, !2739, !2740, !2741, !2742}
!2737 = !DILocalVariable(name: "str", arg: 1, scope: !2733, file: !214, line: 220, type: !294)
!2738 = !DILocalVariable(name: "offset", arg: 2, scope: !2733, file: !214, line: 220, type: !270)
!2739 = !DILocalVariable(name: "numValues", arg: 3, scope: !2733, file: !214, line: 221, type: !274)
!2740 = !DILocalVariable(name: "totalBits", arg: 4, scope: !2733, file: !214, line: 221, type: !270)
!2741 = !DILocalVariable(name: "numBitsList", arg: 5, scope: !2733, file: !214, line: 222, type: !302)
!2742 = !DILocalVariable(name: "val", arg: 6, scope: !2733, file: !214, line: 222, type: !2630)
!2743 = !DILocation(line: 220, column: 42, scope: !2733)
!2744 = !DILocation(line: 220, column: 57, scope: !2733)
!2745 = !DILocation(line: 221, column: 39, scope: !2733)
!2746 = !DILocation(line: 221, column: 60, scope: !2733)
!2747 = !DILocation(line: 222, column: 42, scope: !2733)
!2748 = !DILocation(line: 222, column: 69, scope: !2733)
!2749 = !DILocation(line: 224, column: 35, scope: !2733)
!2750 = !DILocation(line: 224, column: 40, scope: !2733)
!2751 = !DILocation(line: 224, column: 48, scope: !2733)
!2752 = !DILocation(line: 224, column: 59, scope: !2733)
!2753 = !DILocation(line: 225, column: 35, scope: !2733)
!2754 = !DILocation(line: 225, column: 66, scope: !2733)
!2755 = !DILocation(line: 224, column: 3, scope: !2733)
!2756 = !DILocation(line: 226, column: 1, scope: !2733)
!2757 = !DISubprogram(name: "gt_bsGetNonUniformInt64Array", scope: !250, file: !250, line: 760, type: !2758, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2758 = !DISubroutineType(types: !2759)
!2759 = !{null, !2389, !270, !274, !270, !302, !269}
!2760 = !DISubprogram(name: "fprintf", scope: !2761, file: !2761, line: 350, type: !2762, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2761 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!2762 = !DISubroutineType(types: !2763)
!2763 = !{!263, !2764, !2820, null}
!2764 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !2765)
!2765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2766, size: 64)
!2766 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2767, line: 7, baseType: !2768)
!2767 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!2768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !2769, line: 49, size: 1728, elements: !2770)
!2769 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!2770 = !{!2771, !2772, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782, !2783, !2784, !2787, !2789, !2790, !2791, !2793, !2795, !2797, !2801, !2804, !2806, !2809, !2812, !2813, !2814, !2815, !2816}
!2771 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !2768, file: !2769, line: 51, baseType: !263, size: 32)
!2772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !2768, file: !2769, line: 54, baseType: !2773, size: 64, offset: 64)
!2773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!2774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !2768, file: !2769, line: 55, baseType: !2773, size: 64, offset: 128)
!2775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !2768, file: !2769, line: 56, baseType: !2773, size: 64, offset: 192)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !2768, file: !2769, line: 57, baseType: !2773, size: 64, offset: 256)
!2777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !2768, file: !2769, line: 58, baseType: !2773, size: 64, offset: 320)
!2778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !2768, file: !2769, line: 59, baseType: !2773, size: 64, offset: 384)
!2779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !2768, file: !2769, line: 60, baseType: !2773, size: 64, offset: 448)
!2780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !2768, file: !2769, line: 61, baseType: !2773, size: 64, offset: 512)
!2781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !2768, file: !2769, line: 64, baseType: !2773, size: 64, offset: 576)
!2782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !2768, file: !2769, line: 65, baseType: !2773, size: 64, offset: 640)
!2783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !2768, file: !2769, line: 66, baseType: !2773, size: 64, offset: 704)
!2784 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !2768, file: !2769, line: 68, baseType: !2785, size: 64, offset: 768)
!2785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2786, size: 64)
!2786 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !2769, line: 36, flags: DIFlagFwdDecl)
!2787 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !2768, file: !2769, line: 70, baseType: !2788, size: 64, offset: 832)
!2788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2768, size: 64)
!2789 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !2768, file: !2769, line: 72, baseType: !263, size: 32, offset: 896)
!2790 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !2768, file: !2769, line: 73, baseType: !263, size: 32, offset: 928)
!2791 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !2768, file: !2769, line: 74, baseType: !2792, size: 64, offset: 960)
!2792 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !262, line: 152, baseType: !256)
!2793 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !2768, file: !2769, line: 77, baseType: !2794, size: 16, offset: 1024)
!2794 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!2795 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !2768, file: !2769, line: 78, baseType: !2796, size: 8, offset: 1040)
!2796 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!2797 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !2768, file: !2769, line: 79, baseType: !2798, size: 8, offset: 1048)
!2798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !2799)
!2799 = !{!2800}
!2800 = !DISubrange(count: 1)
!2801 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !2768, file: !2769, line: 81, baseType: !2802, size: 64, offset: 1088)
!2802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2803, size: 64)
!2803 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !2769, line: 43, baseType: null)
!2804 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !2768, file: !2769, line: 89, baseType: !2805, size: 64, offset: 1152)
!2805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !262, line: 153, baseType: !256)
!2806 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !2768, file: !2769, line: 91, baseType: !2807, size: 64, offset: 1216)
!2807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2808, size: 64)
!2808 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !2769, line: 37, flags: DIFlagFwdDecl)
!2809 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !2768, file: !2769, line: 92, baseType: !2810, size: 64, offset: 1280)
!2810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2811, size: 64)
!2811 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !2769, line: 38, flags: DIFlagFwdDecl)
!2812 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !2768, file: !2769, line: 93, baseType: !2788, size: 64, offset: 1344)
!2813 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !2768, file: !2769, line: 94, baseType: !271, size: 64, offset: 1408)
!2814 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !2768, file: !2769, line: 95, baseType: !274, size: 64, offset: 1472)
!2815 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !2768, file: !2769, line: 96, baseType: !263, size: 32, offset: 1536)
!2816 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !2768, file: !2769, line: 98, baseType: !2817, size: 160, offset: 1568)
!2817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !2818)
!2818 = !{!2819}
!2819 = !DISubrange(count: 20)
!2820 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !2349)
!2821 = !DISubprogram(name: "abort", scope: !2822, file: !2822, line: 598, type: !2823, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!2822 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!2823 = !DISubroutineType(types: !2824)
!2824 = !{null}
!2825 = !DISubprogram(name: "gt_bsCopy", scope: !250, file: !250, line: 981, type: !2826, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2826 = !DISubroutineType(types: !2827)
!2827 = !{null, !2389, !270, !294, !270, !270}
!2828 = !DISubprogram(name: "gt_bs1BitsCount", scope: !250, file: !250, line: 1029, type: !2829, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2829 = !DISubroutineType(types: !2830)
!2830 = !{!270, !2389, !270, !270}
!2831 = distinct !DISubprogram(name: "genBitCount_uint64_t", scope: !2, file: !2, line: 57, type: !2381, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !243, retainedNodes: !2832)
!2832 = !{!2833, !2834}
!2833 = !DILocalVariable(name: "v", arg: 1, scope: !2831, file: !2, line: 57, type: !259)
!2834 = !DILocalVariable(name: "c", scope: !2831, file: !2, line: 59, type: !246)
!2835 = !DILocation(line: 57, column: 31, scope: !2831)
!2836 = !DILocation(line: 59, column: 3, scope: !2831)
!2837 = !DILocation(line: 59, column: 12, scope: !2831)
!2838 = !DILocation(line: 60, column: 10, scope: !2839)
!2839 = distinct !DILexicalBlock(scope: !2831, file: !2, line: 60, column: 3)
!2840 = !DILocation(line: 60, column: 8, scope: !2839)
!2841 = !DILocation(line: 60, column: 15, scope: !2842)
!2842 = distinct !DILexicalBlock(scope: !2839, file: !2, line: 60, column: 3)
!2843 = !DILocation(line: 60, column: 3, scope: !2839)
!2844 = !DILocation(line: 61, column: 10, scope: !2842)
!2845 = !DILocation(line: 61, column: 12, scope: !2842)
!2846 = !DILocation(line: 61, column: 7, scope: !2842)
!2847 = !DILocation(line: 61, column: 5, scope: !2842)
!2848 = !DILocation(line: 60, column: 19, scope: !2842)
!2849 = !DILocation(line: 60, column: 3, scope: !2842)
!2850 = distinct !{!2850, !2843, !2851, !580}
!2851 = !DILocation(line: 61, column: 14, scope: !2839)
!2852 = !DILocation(line: 62, column: 10, scope: !2831)
!2853 = !DILocation(line: 63, column: 1, scope: !2831)
!2854 = !DILocation(line: 62, column: 3, scope: !2831)
!2855 = !DISubprogram(name: "gt_safe_llabs_check_func", scope: !2856, file: !2856, line: 142, type: !2857, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2856 = !DIFile(filename: "src/core/safearith_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "295291fd070ff3b784ce844ceee9de22")
!2857 = !DISubroutineType(types: !2858)
!2858 = !{!2859, !2859, !2349, !263, !2861, !271}
!2859 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtInt64", file: !255, line: 99, baseType: !2860)
!2860 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!2861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2862, size: 64)
!2862 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOverflowHandlerFunc", file: !2856, line: 119, baseType: !2863)
!2863 = !DISubroutineType(types: !2864)
!2864 = !{null, !2349, !263, !271}
!2865 = !DISubprogram(name: "gt_pagesize", scope: !2866, file: !2866, line: 43, type: !2867, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
