; ModuleID = 'samples/160.bc'
source_filename = "quo-time.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.experiment_t = type { ptr, ptr, ptr, i32, i32, ptr }
%struct.context_t = type { i32, i32, i8, ptr }

@.str = private unnamed_addr constant [5 x i8] c"init\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [34 x i8] c"### Starting QUO Timing Tests...\0A\00", align 1, !dbg !7
@stdout = external global ptr, align 8
@main.n_trials = internal constant i32 100, align 4, !dbg !12
@.str.2 = private unnamed_addr constant [11 x i8] c"QUO_create\00", align 1, !dbg !59
@.str.3 = private unnamed_addr constant [9 x i8] c"QUO_free\00", align 1, !dbg !64
@.str.4 = private unnamed_addr constant [9 x i8] c"QUO_npus\00", align 1, !dbg !69
@.str.5 = private unnamed_addr constant [17 x i8] c"QUO_qids_in_type\00", align 1, !dbg !71
@.str.6 = private unnamed_addr constant [14 x i8] c"QUO_bind_push\00", align 1, !dbg !76
@.str.7 = private unnamed_addr constant [13 x i8] c"QUO_bind_pop\00", align 1, !dbg !81
@.str.8 = private unnamed_addr constant [17 x i8] c"QUO_auto_distrib\00", align 1, !dbg !86
@.str.9 = private unnamed_addr constant [12 x i8] c"QUO_barrier\00", align 1, !dbg !88
@stderr = external global ptr, align 8

!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !2, line: 388, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 11)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !2, line: 389, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 9)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !2, line: 390, type: !66, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 17)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(scope: null, file: !2, line: 392, type: !78, isLocal: true, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 14)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(scope: null, file: !2, line: 393, type: !83, isLocal: true, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 13)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !73, isLocal: true, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(scope: null, file: !2, line: 395, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 12)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !95, isLocal: true, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 23)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !61, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !78, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 185, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !61, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 354, type: !90, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 328, type: !90, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !2, line: 329, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 16)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !2, line: 330, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 24)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 331, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 28)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 332, type: !9, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 333, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 39)
!135 = !{!136, !137, !139, !153, !170, !172}
!136 = !DILocalVariable(name: "erc", scope: !14, file: !2, line: 364, type: !17)
!137 = !DILocalVariable(name: "bad_func", scope: !14, file: !2, line: 365, type: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!139 = !DILocalVariable(name: "context", scope: !14, file: !2, line: 366, type: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "context_t", file: !2, line: 33, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "context_t", file: !2, line: 24, size: 192, elements: !143)
!143 = !{!144, !145, !146, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !142, file: !2, line: 26, baseType: !17, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !142, file: !2, line: 28, baseType: !17, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mpi_inited", scope: !142, file: !2, line: 30, baseType: !147, size: 8, offset: 64)
!147 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "quo", scope: !142, file: !2, line: 32, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUO_context", file: !21, line: 35, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUO_t", file: !21, line: 33, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "QUO_t", file: !21, line: 31, flags: DIFlagFwdDecl)
!153 = !DILocalVariable(name: "experiments", scope: !14, file: !2, line: 386, type: !154)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 2560, elements: !168)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "experiment_t", file: !2, line: 42, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "experiment_t", file: !2, line: 35, size: 320, elements: !157)
!157 = !{!158, !159, !160, !165, !166, !167}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !156, file: !2, line: 36, baseType: !140, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !2, line: 37, baseType: !138, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !156, file: !2, line: 38, baseType: !161, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!17, !140, !17, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "n_trials", scope: !156, file: !2, line: 39, baseType: !17, size: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "res_len", scope: !156, file: !2, line: 40, baseType: !17, size: 32, offset: 224)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !156, file: !2, line: 41, baseType: !164, size: 64, offset: 256)
!168 = !{!169}
!169 = !DISubrange(count: 8)
!170 = !DILocalVariable(name: "i", scope: !171, file: !2, line: 398, type: !22)
!171 = distinct !DILexicalBlock(scope: !14, file: !2, line: 398, column: 5)
!172 = !DILabel(scope: !14, name: "out", file: !2, line: 401)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!174 = !{i32 7, !"Dwarf Version", i32 5}
!175 = !{i32 2, !"Debug Info Version", i32 3}
!176 = !{i32 1, !"wchar_size", i32 4}
!177 = !{i32 8, !"PIC Level", i32 2}
!178 = !{i32 7, !"PIE Level", i32 2}
!179 = !{i32 7, !"uwtable", i32 2}
!180 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!181 = !DILocation(line: 364, column: 5, scope: !14)
!182 = !DILocation(line: 364, column: 9, scope: !14)
!183 = !{!184, !184, i64 0}
!184 = !{!"int", !185, i64 0}
!185 = !{!"omnipotent char", !186, i64 0}
!186 = !{!"Simple C/C++ TBAA"}
!187 = !DILocation(line: 365, column: 5, scope: !14)
!188 = !DILocation(line: 365, column: 11, scope: !14)
!189 = !{!190, !190, i64 0}
!190 = !{!"any pointer", !185, i64 0}
!191 = !DILocation(line: 366, column: 5, scope: !14)
!192 = !DILocation(line: 366, column: 16, scope: !14)
!193 = !DILocation(line: 371, column: 9, scope: !194)
!194 = distinct !DILexicalBlock(scope: !14, file: !2, line: 371, column: 9)
!195 = !DILocation(line: 371, column: 9, scope: !14)
!196 = !DILocation(line: 372, column: 18, scope: !197)
!197 = distinct !DILexicalBlock(scope: !194, file: !2, line: 371, column: 25)
!198 = !DILocation(line: 373, column: 9, scope: !197)
!199 = !DILocation(line: 376, column: 14, scope: !200)
!200 = distinct !DILexicalBlock(scope: !14, file: !2, line: 376, column: 9)
!201 = !DILocation(line: 376, column: 23, scope: !200)
!202 = !{!203, !184, i64 0}
!203 = !{!"context_t", !184, i64 0, !184, i64 4, !204, i64 8, !190, i64 16}
!204 = !{!"_Bool", !185, i64 0}
!205 = !DILocation(line: 376, column: 11, scope: !200)
!206 = !DILocation(line: 376, column: 9, scope: !14)
!207 = !DILocation(line: 377, column: 9, scope: !208)
!208 = distinct !DILexicalBlock(scope: !200, file: !2, line: 376, column: 29)
!209 = !DILocation(line: 378, column: 16, scope: !208)
!210 = !DILocation(line: 378, column: 9, scope: !208)
!211 = !DILocation(line: 379, column: 5, scope: !208)
!212 = !DILocation(line: 380, column: 20, scope: !14)
!213 = !DILocation(line: 380, column: 5, scope: !14)
!214 = !DILocation(line: 386, column: 18, scope: !14)
!215 = !DILocation(line: 387, column: 5, scope: !14)
!216 = !DILocation(line: 388, column: 9, scope: !14)
!217 = !DILocation(line: 388, column: 10, scope: !14)
!218 = !{!219, !190, i64 0}
!219 = !{!"experiment_t", !190, i64 0, !190, i64 8, !190, i64 16, !184, i64 24, !184, i64 28, !190, i64 32}
!220 = !{!219, !190, i64 8}
!221 = !{!219, !190, i64 16}
!222 = !{!219, !184, i64 24}
!223 = !{!219, !184, i64 28}
!224 = !{!219, !190, i64 32}
!225 = !DILocation(line: 389, column: 9, scope: !14)
!226 = !DILocation(line: 389, column: 10, scope: !14)
!227 = !DILocation(line: 390, column: 9, scope: !14)
!228 = !DILocation(line: 390, column: 10, scope: !14)
!229 = !DILocation(line: 391, column: 9, scope: !14)
!230 = !DILocation(line: 391, column: 10, scope: !14)
!231 = !DILocation(line: 392, column: 9, scope: !14)
!232 = !DILocation(line: 392, column: 10, scope: !14)
!233 = !DILocation(line: 393, column: 9, scope: !14)
!234 = !DILocation(line: 393, column: 10, scope: !14)
!235 = !DILocation(line: 394, column: 9, scope: !14)
!236 = !DILocation(line: 394, column: 10, scope: !14)
!237 = !DILocation(line: 395, column: 9, scope: !14)
!238 = !DILocation(line: 395, column: 10, scope: !14)
!239 = !DILocation(line: 398, column: 10, scope: !171)
!240 = !DILocation(line: 398, column: 19, scope: !171)
!241 = !DILocation(line: 398, column: 26, scope: !242)
!242 = distinct !DILexicalBlock(scope: !171, file: !2, line: 398, column: 5)
!243 = !DILocation(line: 398, column: 28, scope: !242)
!244 = !DILocation(line: 398, column: 5, scope: !171)
!245 = !DILocation(line: 398, column: 5, scope: !242)
!246 = !DILocation(line: 399, column: 37, scope: !247)
!247 = distinct !DILexicalBlock(scope: !242, file: !2, line: 398, column: 77)
!248 = !DILocation(line: 399, column: 25, scope: !247)
!249 = !DILocation(line: 399, column: 9, scope: !247)
!250 = !DILocation(line: 400, column: 5, scope: !247)
!251 = !DILocation(line: 398, column: 72, scope: !242)
!252 = distinct !{!252, !244, !253, !254}
!253 = !DILocation(line: 400, column: 5, scope: !171)
!254 = !{!"llvm.loop.mustprogress"}
!255 = !DILocation(line: 401, column: 1, scope: !14)
!256 = !DILocation(line: 402, column: 17, scope: !257)
!257 = distinct !DILexicalBlock(scope: !14, file: !2, line: 402, column: 9)
!258 = !DILocation(line: 402, column: 14, scope: !257)
!259 = !DILocation(line: 402, column: 9, scope: !14)
!260 = !DILocation(line: 403, column: 17, scope: !261)
!261 = distinct !DILexicalBlock(scope: !257, file: !2, line: 402, column: 27)
!262 = !DILocation(line: 403, column: 62, scope: !261)
!263 = !DILocation(line: 403, column: 9, scope: !261)
!264 = !DILocation(line: 404, column: 13, scope: !261)
!265 = !DILocation(line: 405, column: 5, scope: !261)
!266 = !DILocation(line: 406, column: 16, scope: !14)
!267 = !DILocation(line: 406, column: 11, scope: !14)
!268 = !DILocation(line: 407, column: 12, scope: !14)
!269 = !DILocation(line: 408, column: 1, scope: !14)
!270 = !DILocation(line: 407, column: 5, scope: !14)
!271 = distinct !DISubprogram(name: "init", scope: !2, file: !2, line: 77, type: !272, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !18, retainedNodes: !275)
!272 = !DISubroutineType(types: !273)
!273 = !{!17, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!275 = !{!276, !277, !278}
!276 = !DILocalVariable(name: "c", arg: 1, scope: !271, file: !2, line: 77, type: !274)
!277 = !DILocalVariable(name: "newc", scope: !271, file: !2, line: 79, type: !140)
!278 = !DILabel(scope: !271, name: "err", file: !2, line: 95)
!279 = !DILocation(line: 77, column: 18, scope: !271)
!280 = !DILocation(line: 79, column: 5, scope: !271)
!281 = !DILocation(line: 79, column: 16, scope: !271)
!282 = !DILocation(line: 81, column: 25, scope: !283)
!283 = distinct !DILexicalBlock(scope: !271, file: !2, line: 81, column: 9)
!284 = !DILocation(line: 81, column: 23, scope: !283)
!285 = !DILocation(line: 81, column: 14, scope: !283)
!286 = !DILocation(line: 81, column: 9, scope: !271)
!287 = !DILocation(line: 81, column: 52, scope: !283)
!288 = !DILocation(line: 83, column: 24, scope: !289)
!289 = distinct !DILexicalBlock(scope: !271, file: !2, line: 83, column: 9)
!290 = !DILocation(line: 83, column: 21, scope: !289)
!291 = !DILocation(line: 83, column: 9, scope: !271)
!292 = !DILocation(line: 83, column: 46, scope: !289)
!293 = !DILocation(line: 85, column: 56, scope: !294)
!294 = distinct !DILexicalBlock(scope: !271, file: !2, line: 85, column: 9)
!295 = !DILocation(line: 85, column: 62, scope: !294)
!296 = !DILocation(line: 85, column: 24, scope: !294)
!297 = !DILocation(line: 85, column: 21, scope: !294)
!298 = !DILocation(line: 85, column: 9, scope: !271)
!299 = !DILocation(line: 85, column: 72, scope: !294)
!300 = !DILocation(line: 87, column: 56, scope: !301)
!301 = distinct !DILexicalBlock(scope: !271, file: !2, line: 87, column: 9)
!302 = !DILocation(line: 87, column: 62, scope: !301)
!303 = !DILocation(line: 87, column: 24, scope: !301)
!304 = !DILocation(line: 87, column: 21, scope: !301)
!305 = !DILocation(line: 87, column: 9, scope: !271)
!306 = !DILocation(line: 87, column: 70, scope: !301)
!307 = !DILocation(line: 91, column: 36, scope: !308)
!308 = distinct !DILexicalBlock(scope: !271, file: !2, line: 91, column: 9)
!309 = !DILocation(line: 91, column: 42, scope: !308)
!310 = !DILocation(line: 91, column: 24, scope: !308)
!311 = !DILocation(line: 91, column: 21, scope: !308)
!312 = !DILocation(line: 91, column: 9, scope: !271)
!313 = !DILocation(line: 91, column: 64, scope: !308)
!314 = !DILocation(line: 92, column: 5, scope: !271)
!315 = !DILocation(line: 92, column: 11, scope: !271)
!316 = !DILocation(line: 92, column: 22, scope: !271)
!317 = !{!203, !204, i64 8}
!318 = !DILocation(line: 93, column: 10, scope: !271)
!319 = !DILocation(line: 93, column: 6, scope: !271)
!320 = !DILocation(line: 93, column: 8, scope: !271)
!321 = !DILocation(line: 94, column: 5, scope: !271)
!322 = !DILocation(line: 95, column: 1, scope: !271)
!323 = !DILocation(line: 96, column: 16, scope: !271)
!324 = !DILocation(line: 96, column: 11, scope: !271)
!325 = !DILocation(line: 97, column: 5, scope: !271)
!326 = !DILocation(line: 98, column: 1, scope: !271)
!327 = !DISubprogram(name: "printf", scope: !328, file: !328, line: 356, type: !329, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!328 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!329 = !DISubroutineType(types: !330)
!330 = !{!17, !331, null}
!331 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!334 = !DISubprogram(name: "fflush", scope: !328, file: !328, line: 230, type: !335, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!335 = !DISubroutineType(types: !336)
!336 = !{!17, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !339, line: 7, baseType: !340)
!339 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !341, line: 49, size: 1728, elements: !342)
!341 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !358, !360, !361, !362, !366, !368, !370, !374, !377, !379, !382, !385, !386, !387, !391, !392}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !340, file: !341, line: 51, baseType: !17, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !340, file: !341, line: 54, baseType: !138, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !340, file: !341, line: 55, baseType: !138, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !340, file: !341, line: 56, baseType: !138, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !340, file: !341, line: 57, baseType: !138, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !340, file: !341, line: 58, baseType: !138, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !340, file: !341, line: 59, baseType: !138, size: 64, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !340, file: !341, line: 60, baseType: !138, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !340, file: !341, line: 61, baseType: !138, size: 64, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !340, file: !341, line: 64, baseType: !138, size: 64, offset: 576)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !340, file: !341, line: 65, baseType: !138, size: 64, offset: 640)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !340, file: !341, line: 66, baseType: !138, size: 64, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !340, file: !341, line: 68, baseType: !356, size: 64, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !341, line: 36, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !340, file: !341, line: 70, baseType: !359, size: 64, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !340, file: !341, line: 72, baseType: !17, size: 32, offset: 896)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !340, file: !341, line: 73, baseType: !17, size: 32, offset: 928)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !340, file: !341, line: 74, baseType: !363, size: 64, offset: 960)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !364, line: 152, baseType: !365)
!364 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!365 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !340, file: !341, line: 77, baseType: !367, size: 16, offset: 1024)
!367 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !340, file: !341, line: 78, baseType: !369, size: 8, offset: 1040)
!369 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !340, file: !341, line: 79, baseType: !371, size: 8, offset: 1048)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 1)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !340, file: !341, line: 81, baseType: !375, size: 64, offset: 1088)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !341, line: 43, baseType: null)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !340, file: !341, line: 89, baseType: !378, size: 64, offset: 1152)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !364, line: 153, baseType: !365)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !340, file: !341, line: 91, baseType: !380, size: 64, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !341, line: 37, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !340, file: !341, line: 92, baseType: !383, size: 64, offset: 1280)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !341, line: 38, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !340, file: !341, line: 93, baseType: !359, size: 64, offset: 1344)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !340, file: !341, line: 94, baseType: !49, size: 64, offset: 1408)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !340, file: !341, line: 95, baseType: !388, size: 64, offset: 1472)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !389, line: 70, baseType: !390)
!389 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!390 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !340, file: !341, line: 96, baseType: !17, size: 32, offset: 1536)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !340, file: !341, line: 98, baseType: !393, size: 160, offset: 1568)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 20)
!396 = distinct !DISubprogram(name: "demo_emit_sync", scope: !2, file: !2, line: 48, type: !397, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !18, retainedNodes: !401)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!401 = !{!402}
!402 = !DILocalVariable(name: "c", arg: 1, scope: !396, file: !2, line: 48, type: !399)
!403 = !DILocation(line: 48, column: 33, scope: !396)
!404 = !DILocation(line: 50, column: 5, scope: !396)
!405 = !DILocation(line: 51, column: 13, scope: !396)
!406 = !DILocation(line: 51, column: 16, scope: !396)
!407 = !DILocation(line: 51, column: 22, scope: !396)
!408 = !DILocation(line: 51, column: 5, scope: !396)
!409 = !DILocation(line: 52, column: 1, scope: !396)
!410 = distinct !DISubprogram(name: "qcreate", scope: !2, file: !2, line: 101, type: !162, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !18, retainedNodes: !411)
!411 = !{!412, !413, !414, !415, !417, !419, !422, !423}
!412 = !DILocalVariable(name: "c", arg: 1, scope: !410, file: !2, line: 102, type: !140)
!413 = !DILocalVariable(name: "n_trials", arg: 2, scope: !410, file: !2, line: 103, type: !17)
!414 = !DILocalVariable(name: "res", arg: 3, scope: !410, file: !2, line: 104, type: !164)
!415 = !DILocalVariable(name: "ctx", scope: !410, file: !2, line: 108, type: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!417 = !DILocalVariable(name: "i", scope: !418, file: !2, line: 111, type: !17)
!418 = distinct !DILexicalBlock(scope: !410, file: !2, line: 111, column: 5)
!419 = !DILocalVariable(name: "start", scope: !420, file: !2, line: 112, type: !57)
!420 = distinct !DILexicalBlock(scope: !421, file: !2, line: 111, column: 40)
!421 = distinct !DILexicalBlock(scope: !418, file: !2, line: 111, column: 5)
!422 = !DILocalVariable(name: "end", scope: !420, file: !2, line: 114, type: !57)
!423 = !DILocalVariable(name: "i", scope: !424, file: !2, line: 117, type: !17)
!424 = distinct !DILexicalBlock(scope: !410, file: !2, line: 117, column: 5)
!425 = !DILocation(line: 102, column: 16, scope: !410)
!426 = !DILocation(line: 103, column: 9, scope: !410)
!427 = !DILocation(line: 104, column: 13, scope: !410)
!428 = !DILocation(line: 106, column: 11, scope: !410)
!429 = !DILocation(line: 108, column: 5, scope: !410)
!430 = !DILocation(line: 108, column: 18, scope: !410)
!431 = !DILocation(line: 108, column: 31, scope: !410)
!432 = !DILocation(line: 108, column: 24, scope: !410)
!433 = !DILocation(line: 109, column: 10, scope: !434)
!434 = distinct !DILexicalBlock(scope: !410, file: !2, line: 109, column: 9)
!435 = !DILocation(line: 109, column: 9, scope: !410)
!436 = !DILocation(line: 109, column: 15, scope: !434)
!437 = !DILocation(line: 111, column: 10, scope: !418)
!438 = !DILocation(line: 111, column: 14, scope: !418)
!439 = !DILocation(line: 111, column: 21, scope: !421)
!440 = !DILocation(line: 111, column: 25, scope: !421)
!441 = !DILocation(line: 111, column: 23, scope: !421)
!442 = !DILocation(line: 111, column: 5, scope: !418)
!443 = !DILocation(line: 112, column: 9, scope: !420)
!444 = !DILocation(line: 112, column: 16, scope: !420)
!445 = !DILocation(line: 112, column: 24, scope: !420)
!446 = !{!447, !447, i64 0}
!447 = !{!"double", !185, i64 0}
!448 = !DILocation(line: 113, column: 41, scope: !449)
!449 = distinct !DILexicalBlock(scope: !420, file: !2, line: 113, column: 13)
!450 = !DILocation(line: 113, column: 45, scope: !449)
