; ModuleID = 'samples/163.bc'
source_filename = "src/ctl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ctl_named_node_s = type { %struct.ctl_node_s, ptr, i64, ptr, ptr }
%struct.ctl_node_s = type { i8 }
%struct.malloc_mutex_s = type { %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { %struct.mutex_prof_data_t, %union.pthread_mutex_t, %struct.atomic_b_t }
%struct.mutex_prof_data_t = type { %struct.nstime_t, %struct.nstime_t, i64, i64, i32, %struct.atomic_u32_t, i64, ptr, i64 }
%struct.nstime_t = type { i64 }
%struct.atomic_u32_t = type { i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.atomic_b_t = type { i8 }
%struct.tsd_s = type { %struct.atomic_u8_t, i8, i8, i8, i32, i64, i64, i64, i64, ptr, %struct.rtree_ctx_s, ptr, ptr, ptr, %struct.tsd_binshards_s, %struct.tcache_s, %struct.witness_tsd_s }
%struct.atomic_u8_t = type { i8 }
%struct.rtree_ctx_s = type { [16 x %struct.rtree_ctx_cache_elm_s], [8 x %struct.rtree_ctx_cache_elm_s] }
%struct.rtree_ctx_cache_elm_s = type { i64, ptr }
%struct.tsd_binshards_s = type { [39 x i8] }

!49 = !DIEnumerator(name: "tsd_state_reincarnated", value: 5)
!50 = !DIEnumerator(name: "tsd_state_uninitialized", value: 6)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 31, baseType: !7, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!53 = !DIEnumerator(name: "arena_prof_mutex_large", value: 0)
!54 = !DIEnumerator(name: "arena_prof_mutex_extent_avail", value: 1)
!55 = !DIEnumerator(name: "arena_prof_mutex_extents_dirty", value: 2)
!56 = !DIEnumerator(name: "arena_prof_mutex_extents_muzzy", value: 3)
!57 = !DIEnumerator(name: "arena_prof_mutex_extents_retained", value: 4)
!58 = !DIEnumerator(name: "arena_prof_mutex_decay_dirty", value: 5)
!59 = !DIEnumerator(name: "arena_prof_mutex_decay_muzzy", value: 6)
!60 = !DIEnumerator(name: "arena_prof_mutex_base", value: 7)
!61 = !DIEnumerator(name: "arena_prof_mutex_tcache_list", value: 8)
!62 = !DIEnumerator(name: "mutex_prof_num_arena_mutexes", value: 9)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 22, baseType: !7, size: 32, elements: !65)
!64 = !DIFile(filename: "include/jemalloc/internal/arena_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "1e2faaf6aaaed7809a70484596be6198")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73}
!66 = !DIEnumerator(name: "percpu_arena_mode_names_base", value: 0)
!67 = !DIEnumerator(name: "percpu_arena_uninit", value: 0)
!68 = !DIEnumerator(name: "per_phycpu_arena_uninit", value: 1)
!69 = !DIEnumerator(name: "percpu_arena_disabled", value: 2)
!70 = !DIEnumerator(name: "percpu_arena_mode_names_limit", value: 3)
!71 = !DIEnumerator(name: "percpu_arena_mode_enabled_base", value: 3)
!72 = !DIEnumerator(name: "percpu_arena", value: 3)
!73 = !DIEnumerator(name: "per_phycpu_arena", value: 4)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 14, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "include/jemalloc/internal/background_thread_structs.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "04fac53a1a226f26b0e98793266dbd88")
!76 = !{!77, !78, !79}
!77 = !DIEnumerator(name: "background_thread_stopped", value: 0)
!78 = !DIEnumerator(name: "background_thread_started", value: 1)
!79 = !DIEnumerator(name: "background_thread_paused", value: 2)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hook_alloc_e", file: !81, line: 51, baseType: !7, size: 32, elements: !82)
!81 = !DIFile(filename: "include/jemalloc/internal/hook.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "cba63ef3cb81715a9e481d9adc3b20e5")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91}
!83 = !DIEnumerator(name: "hook_alloc_malloc", value: 0)
!84 = !DIEnumerator(name: "hook_alloc_posix_memalign", value: 1)
!85 = !DIEnumerator(name: "hook_alloc_aligned_alloc", value: 2)
!86 = !DIEnumerator(name: "hook_alloc_calloc", value: 3)
!87 = !DIEnumerator(name: "hook_alloc_memalign", value: 4)
!88 = !DIEnumerator(name: "hook_alloc_valloc", value: 5)
!89 = !DIEnumerator(name: "hook_alloc_mallocx", value: 6)
!90 = !DIEnumerator(name: "hook_alloc_realloc", value: 7)
!91 = !DIEnumerator(name: "hook_alloc_rallocx", value: 8)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hook_dalloc_e", file: !81, line: 70, baseType: !7, size: 32, elements: !93)
!93 = !{!94, !95, !96, !97, !98}
!94 = !DIEnumerator(name: "hook_dalloc_free", value: 0)
!95 = !DIEnumerator(name: "hook_dalloc_dallocx", value: 1)
!96 = !DIEnumerator(name: "hook_dalloc_sdallocx", value: 2)
!97 = !DIEnumerator(name: "hook_dalloc_realloc", value: 3)
!98 = !DIEnumerator(name: "hook_dalloc_rallocx", value: 4)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hook_expand_e", file: !81, line: 85, baseType: !7, size: 32, elements: !100)
!100 = !{!101, !102, !103}
!101 = !DIEnumerator(name: "hook_expand_realloc", value: 0)
!102 = !DIEnumerator(name: "hook_expand_rallocx", value: 1)
!103 = !DIEnumerator(name: "hook_expand_xallocx", value: 2)
!104 = !{!105, !106, !146, !752, !774, !779, !780, !7, !417, !799, !397, !842, !217, !848, !863, !864, !865, !809, !355, !866, !867, !868, !869, !870, !871, !498, !468, !525, !872, !112, !875, !899, !909, !916, !917}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctl_arenas_t", file: !108, line: 94, baseType: !109)
!108 = !DIFile(filename: "include/jemalloc/internal/ctl.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "73e00d9badde2bbaff03532bb2dc45e9")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_arenas_s", file: !108, line: 82, size: 262400, elements: !110)
!110 = !{!111, !117, !118, !748}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !109, file: !108, line: 83, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !113, line: 27, baseType: !114)
!113 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !115, line: 45, baseType: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!116 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "narenas", scope: !109, file: !108, line: 84, baseType: !7, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !109, file: !108, line: 85, baseType: !119, size: 64, offset: 128)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !109, file: !108, line: 85, size: 64, elements: !120)
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !119, file: !108, line: 85, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctl_arena_t", file: !108, line: 63, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_arena_s", file: !108, line: 64, size: 704, elements: !125)
!125 = !{!126, !127, !129, !134, !135, !139, !144, !145, !148, !149, !150}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "arena_ind", scope: !124, file: !108, line: 65, baseType: !7, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !124, file: !108, line: 66, baseType: !128, size: 8, offset: 32)
!128 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed_link", scope: !124, file: !108, line: 67, baseType: !130, size: 128, offset: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !108, line: 67, size: 128, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !130, file: !108, line: 67, baseType: !122, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !130, file: !108, line: 67, baseType: !122, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !124, file: !108, line: 70, baseType: !7, size: 32, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dss", scope: !124, file: !108, line: 71, baseType: !136, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_decay_ms", scope: !124, file: !108, line: 72, baseType: !140, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !141, line: 108, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !115, line: 194, baseType: !143)
!143 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "muzzy_decay_ms", scope: !124, file: !108, line: 73, baseType: !140, size: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pactive", scope: !124, file: !108, line: 74, baseType: !146, size: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !147, line: 70, baseType: !116)
!147 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pdirty", scope: !124, file: !108, line: 75, baseType: !146, size: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "pmuzzy", scope: !124, file: !108, line: 76, baseType: !146, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "astats", scope: !124, file: !108, line: 79, baseType: !151, size: 64, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctl_arena_stats_t", file: !108, line: 48, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_arena_stats_s", file: !108, line: 34, size: 278272, elements: !154)
!154 = !{!155, !726, !727, !728, !729, !730, !731, !732, !734, !735}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "astats", scope: !153, file: !108, line: 35, baseType: !156, size: 81280)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_t", file: !157, line: 81, baseType: !158)
!157 = !DIFile(filename: "include/jemalloc/internal/arena_stats.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "797d71161d3430446f16b1c8dd4487de")
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_s", file: !157, line: 82, size: 81280, elements: !159)
!159 = !{!160, !166, !167, !168, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !714, !725}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !158, file: !157, line: 88, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zu_t", file: !162, line: 72, baseType: !163)
!162 = !DIFile(filename: "include/jemalloc/internal/atomic.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "f4ec326d3284c13a241314e27e68ccae")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 72, size: 64, elements: !164)
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !163, file: !162, line: 72, baseType: !146, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "retained", scope: !158, file: !157, line: 95, baseType: !161, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail", scope: !158, file: !157, line: 98, baseType: !161, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "decay_dirty", scope: !158, file: !157, line: 100, baseType: !169, size: 192, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_decay_t", file: !157, line: 50, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_decay_s", file: !157, line: 51, size: 192, elements: !171)
!171 = !{!172, !178, !179}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "npurge", scope: !170, file: !157, line: 53, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_u64_t", file: !157, line: 17, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u64_t", file: !162, line: 81, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 81, size: 64, elements: !176)
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !175, file: !162, line: 81, baseType: !112, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nmadvise", scope: !170, file: !157, line: 55, baseType: !173, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !170, file: !157, line: 57, baseType: !173, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "decay_muzzy", scope: !158, file: !157, line: 101, baseType: !169, size: 192, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !158, file: !157, line: 103, baseType: !161, size: 64, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !158, file: !157, line: 104, baseType: !161, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !158, file: !157, line: 105, baseType: !161, size: 64, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_thp", scope: !158, file: !157, line: 106, baseType: !161, size: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_large", scope: !158, file: !157, line: 108, baseType: !161, size: 64, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc_large", scope: !158, file: !157, line: 109, baseType: !173, size: 64, offset: 896)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc_large", scope: !158, file: !157, line: 110, baseType: !173, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nfills_large", scope: !158, file: !157, line: 111, baseType: !173, size: 64, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes_large", scope: !158, file: !157, line: 112, baseType: !173, size: 64, offset: 1088)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests_large", scope: !158, file: !157, line: 113, baseType: !173, size: 64, offset: 1152)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "abandoned_vm", scope: !158, file: !157, line: 116, baseType: !161, size: 64, offset: 1216)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_bytes", scope: !158, file: !157, line: 119, baseType: !161, size: 64, offset: 1280)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_prof_data", scope: !158, file: !157, line: 121, baseType: !194, size: 4608, offset: 1344)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 4608, elements: !712)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_prof_data_t", file: !34, line: 106, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 76, size: 512, elements: !197)
!197 = !{!198, !204, !205, !206, !207, !210, !215, !216, !711}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tot_wait_time", scope: !196, file: !34, line: 82, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "nstime_t", file: !200, line: 10, baseType: !201)
!200 = !DIFile(filename: "include/jemalloc/internal/nstime.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "3b54840f5e61842f175755b038667aab")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 8, size: 64, elements: !202)
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !201, file: !200, line: 9, baseType: !112, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "max_wait_time", scope: !196, file: !34, line: 84, baseType: !199, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "n_wait_times", scope: !196, file: !34, line: 86, baseType: !112, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "n_spin_acquired", scope: !196, file: !34, line: 88, baseType: !112, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "max_n_thds", scope: !196, file: !34, line: 90, baseType: !208, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !113, line: 26, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !115, line: 42, baseType: !7)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "n_waiting_thds", scope: !196, file: !34, line: 92, baseType: !211, size: 32, offset: 288)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u32_t", file: !162, line: 78, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 78, size: 32, elements: !213)
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !212, file: !162, line: 78, baseType: !208, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "n_owner_switches", scope: !196, file: !34, line: 101, baseType: !112, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prev_owner", scope: !196, file: !34, line: 103, baseType: !217, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsdn_t", file: !219, line: 7, baseType: !220)
!219 = !DIFile(filename: "include/jemalloc/internal/tsd_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "d541d97bbf6e4823e1bac63f2add6f7d")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsdn_s", file: !41, line: 219, size: 50368, elements: !221)
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tsd", scope: !220, file: !41, line: 220, baseType: !223, size: 50368)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_t", file: !219, line: 6, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsd_s", file: !41, line: 185, size: 50368, elements: !225)
!225 = !{!226, !234, !235, !236, !241, !242, !243, !244, !245, !248, !386, !416, !687, !688, !694, !700, !701}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !224, file: !41, line: 196, baseType: !227, size: 8)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u8_t", file: !162, line: 76, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 76, size: 8, elements: !229)
!229 = !{!230}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !228, file: !162, line: 76, baseType: !231, size: 8)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !113, line: 24, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !115, line: 38, baseType: !233)
!233 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache_enabled", scope: !224, file: !41, line: 199, baseType: !128, size: 8, offset: 8)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arenas_tdata_bypass", scope: !224, file: !41, line: 199, baseType: !128, size: 8, offset: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_reentrancy_level", scope: !224, file: !41, line: 199, baseType: !237, size: 8, offset: 24)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !238, line: 24, baseType: !239)
!238 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !115, line: 37, baseType: !240)
!240 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_narenas_tdata", scope: !224, file: !41, line: 199, baseType: !208, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_offset_state", scope: !224, file: !41, line: 199, baseType: !112, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_allocated", scope: !224, file: !41, line: 199, baseType: !112, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_deallocated", scope: !224, file: !41, line: 199, baseType: !112, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_bytes_until_sample", scope: !224, file: !41, line: 199, baseType: !246, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !238, line: 27, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !115, line: 44, baseType: !143)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prof_tdata", scope: !224, file: !41, line: 199, baseType: !249, size: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_tdata_t", file: !251, line: 9, baseType: !252)
!251 = !DIFile(filename: "include/jemalloc/internal/prof_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "893bb7e5be32d3ed1d6a52ee080689bf")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_tdata_s", file: !253, line: 135, size: 9472, elements: !254)
!253 = !DIFile(filename: "include/jemalloc/internal/prof_structs.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "d36bd8a0b03505e79f5871fe1b41e8be")
!254 = !{!255, !327, !328, !329, !331, !332, !333, !338, !339, !368, !369, !370, !371, !372, !373, !374, !382}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !252, file: !253, line: 136, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_t", file: !6, line: 19, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "malloc_mutex_s", file: !6, line: 20, size: 896, elements: !259)
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, scope: !258, file: !6, line: 21, baseType: !261, size: 896)
!261 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !258, file: !6, line: 21, size: 896, elements: !262)
!262 = !{!263, !303, !325}
!263 = !DIDerivedType(tag: DW_TAG_member, scope: !261, file: !6, line: 22, baseType: !264, size: 896)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !261, file: !6, line: 22, size: 896, elements: !265)
!265 = !{!266, !267, !298}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "prof_data", scope: !264, file: !6, line: 31, baseType: !195, size: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !264, file: !6, line: 44, baseType: !268, size: 320, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !269, line: 72, baseType: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!270 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !269, line: 67, size: 320, elements: !271)
!271 = !{!272, !293, !297}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !270, file: !269, line: 69, baseType: !273, size: 320)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !274, line: 22, size: 320, elements: !275)
!274 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!275 = !{!276, !278, !279, !280, !281, !282, !284, !285}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !273, file: !274, line: 24, baseType: !277, size: 32)
!277 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !273, file: !274, line: 25, baseType: !7, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !273, file: !274, line: 26, baseType: !277, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !273, file: !274, line: 28, baseType: !7, size: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !273, file: !274, line: 32, baseType: !277, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !273, file: !274, line: 34, baseType: !283, size: 16, offset: 160)
!283 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !273, file: !274, line: 35, baseType: !283, size: 16, offset: 176)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !273, file: !274, line: 36, baseType: !286, size: 128, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !287, line: 55, baseType: !288)
!287 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !287, line: 51, size: 128, elements: !289)
!289 = !{!290, !292}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !288, file: !287, line: 53, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !288, file: !287, line: 54, baseType: !291, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !270, file: !269, line: 70, baseType: !294, size: 320)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 320, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 40)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !270, file: !269, line: 71, baseType: !143, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !264, file: !6, line: 50, baseType: !299, size: 8, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_b_t", file: !162, line: 68, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 68, size: 8, elements: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !300, file: !162, line: 68, baseType: !128, size: 8)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "witness", scope: !261, file: !6, line: 59, baseType: !304, size: 384)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_t", file: !305, line: 74, baseType: !306)
!305 = !DIFile(filename: "include/jemalloc/internal/witness.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "fb8675f0725894e4a6abb6181efc1d0a")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_s", file: !305, line: 80, size: 384, elements: !307)
!307 = !{!308, !309, !311, !318, !319}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !305, line: 82, baseType: !136, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !306, file: !305, line: 88, baseType: !310, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_rank_t", file: !305, line: 75, baseType: !7)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !306, file: !305, line: 95, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_comp_t", file: !305, line: 77, baseType: !314)
!314 = !DISubroutineType(types: !315)
!315 = !{!277, !316, !105, !316, !105}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !306, file: !305, line: 98, baseType: !105, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !306, file: !305, line: 101, baseType: !320, size: 128, offset: 256)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !306, file: !305, line: 101, size: 128, elements: !321)
!321 = !{!322, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !320, file: !305, line: 101, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !320, file: !305, line: 101, baseType: !323, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lock_order", scope: !261, file: !6, line: 60, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_lock_order_t", file: !6, line: 17, baseType: !5)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "thr_uid", scope: !252, file: !253, line: 139, baseType: !112, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "thr_discrim", scope: !252, file: !253, line: 145, baseType: !112, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "thread_name", scope: !252, file: !253, line: 148, baseType: !330, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "attached", scope: !252, file: !253, line: 150, baseType: !128, size: 8, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "expired", scope: !252, file: !253, line: 151, baseType: !128, size: 8, offset: 264)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tdata_link", scope: !252, file: !253, line: 153, baseType: !334, size: 128, offset: 320)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !252, file: !253, line: 153, size: 128, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rbn_left", scope: !334, file: !253, line: 153, baseType: !249, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rbn_right_red", scope: !334, file: !253, line: 153, baseType: !249, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tctx_uid_next", scope: !252, file: !253, line: 160, baseType: !112, size: 64, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bt2tctx", scope: !252, file: !253, line: 168, baseType: !340, size: 384, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_t", file: !341, line: 63, baseType: !342)
!341 = !DIFile(filename: "include/jemalloc/internal/ckh.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "764fcd222e751d77d1875da9f00741d3")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 34, size: 384, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !356, !361}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prng_state", scope: !342, file: !341, line: 45, baseType: !112, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !342, file: !341, line: 48, baseType: !146, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lg_minbuckets", scope: !342, file: !341, line: 54, baseType: !7, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "lg_curbuckets", scope: !342, file: !341, line: 55, baseType: !7, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !342, file: !341, line: 58, baseType: !349, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_hash_t", file: !341, line: 24, baseType: !351)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !353, !355}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "keycomp", scope: !342, file: !341, line: 59, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_keycomp_t", file: !341, line: 25, baseType: !359)
!359 = !DISubroutineType(types: !360)
!360 = !{!128, !353, !353}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !342, file: !341, line: 62, baseType: !362, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckhc_t", file: !341, line: 31, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 28, size: 128, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !364, file: !341, line: 29, baseType: !353, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !341, line: 30, baseType: !353, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "prng_state", scope: !252, file: !253, line: 171, baseType: !112, size: 64, offset: 896)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "enq", scope: !252, file: !253, line: 174, baseType: !128, size: 8, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "enq_idump", scope: !252, file: !253, line: 175, baseType: !128, size: 8, offset: 968)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "enq_gdump", scope: !252, file: !253, line: 176, baseType: !128, size: 8, offset: 976)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dumping", scope: !252, file: !253, line: 184, baseType: !128, size: 8, offset: 984)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !252, file: !253, line: 190, baseType: !128, size: 8, offset: 992)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "cnt_summed", scope: !252, file: !253, line: 193, baseType: !375, size: 256, offset: 1024)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_cnt_t", file: !251, line: 6, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_cnt_s", file: !253, line: 32, size: 256, elements: !377)
!377 = !{!378, !379, !380, !381}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "curobjs", scope: !376, file: !253, line: 34, baseType: !112, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "curbytes", scope: !376, file: !253, line: 35, baseType: !112, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "accumobjs", scope: !376, file: !253, line: 36, baseType: !112, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "accumbytes", scope: !376, file: !253, line: 37, baseType: !112, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !252, file: !253, line: 196, baseType: !383, size: 8192, offset: 1280)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 8192, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_rtree_ctx", scope: !224, file: !41, line: 199, baseType: !387, size: 3072, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_ctx_t", file: !388, line: 40, baseType: !389)
!388 = !DIFile(filename: "include/jemalloc/internal/rtree_tsd.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "e327e8ed7b8fd5299eed4833d6c507b8")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_ctx_s", file: !388, line: 41, size: 3072, elements: !390)
!390 = !{!391, !412}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !389, file: !388, line: 43, baseType: !392, size: 2048)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 2048, elements: !410)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_ctx_cache_elm_t", file: !388, line: 34, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_ctx_cache_elm_s", file: !388, line: 35, size: 128, elements: !395)
!395 = !{!396, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "leafkey", scope: !394, file: !388, line: 36, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !398, line: 90, baseType: !116)
!398 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !394, file: !388, line: 37, baseType: !400, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_leaf_elm_t", file: !388, line: 32, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_leaf_elm_s", file: !403, line: 46, size: 64, elements: !404)
!403 = !DIFile(filename: "include/jemalloc/internal/rtree.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "82bfd1f58142b0639c309a4aeac9c506")
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "le_bits", scope: !402, file: !403, line: 60, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_p_t", file: !162, line: 62, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 62, size: 64, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !407, file: !162, line: 62, baseType: !105, size: 64)
!410 = !{!411}
!411 = !DISubrange(count: 16)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "l2_cache", scope: !389, file: !388, line: 45, baseType: !413, size: 1024, offset: 2048)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 1024, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_iarena", scope: !224, file: !41, line: 199, baseType: !417, size: 64, offset: 3456)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_t", file: !64, line: 18, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_s", file: !420, line: 77, size: 236160, elements: !421)
!420 = !DIFile(filename: "include/jemalloc/internal/arena_structs_b.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "3e62069c856b92d645a4c13996ca2396")
!421 = !{!422, !430, !431, !432, !433, !506, !510, !511, !516, !517, !518, !519, !520, !565, !566, !591, !592, !593, !614, !615, !617, !618, !619, !624, !625, !626, !657, !686}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !419, file: !420, line: 91, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 64, elements: !428)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u_t", file: !162, line: 70, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 70, size: 32, elements: !426)
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !425, file: !162, line: 70, baseType: !7, size: 32)
!428 = !{!429}
!429 = !DISubrange(count: 2)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "binshard_next", scope: !419, file: !420, line: 94, baseType: !424, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "last_thd", scope: !419, file: !420, line: 101, baseType: !217, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !419, file: !420, line: 104, baseType: !156, size: 81280, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_ql", scope: !419, file: !420, line: 113, baseType: !434, size: 64, offset: 81472)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !419, file: !420, line: 113, size: 64, elements: !435)
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !434, file: !420, line: 113, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcache_t", file: !439, line: 6, baseType: !440)
!439 = !DIFile(filename: "include/jemalloc/internal/tcache_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9b2852fa8ffe77d9fa097e3d9e569fb0")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcache_s", file: !441, line: 13, size: 46272, elements: !442)
!441 = !DIFile(filename: "include/jemalloc/internal/tcache_structs.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "639b312cb1f4b9dc92d248ca33e2878d")
!442 = !{!443, !444, !453, !471, !476, !482, !483, !496, !497, !500, !502}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prof_accumbytes", scope: !440, file: !441, line: 20, baseType: !112, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gc_ticker", scope: !440, file: !441, line: 22, baseType: !445, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ticker_t", file: !446, line: 17, baseType: !447)
!446 = !DIFile(filename: "include/jemalloc/internal/ticker.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "2982b928838e20f58cc0968805d8a2fd")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 14, size: 64, elements: !448)
!448 = !{!449, !452}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tick", scope: !447, file: !446, line: 15, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !238, line: 26, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !115, line: 41, baseType: !277)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "nticks", scope: !447, file: !446, line: 16, baseType: !450, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "bins_small", scope: !440, file: !441, line: 28, baseType: !454, size: 7488, offset: 128)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 7488, elements: !469)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_t", file: !456, line: 43, baseType: !457)
!456 = !DIFile(filename: "include/jemalloc/internal/cache_bin.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9d448b7baf024f90644dd6d3180d79e7")
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_s", file: !456, line: 44, size: 192, elements: !458)
!458 = !{!459, !461, !462, !467}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "low_water", scope: !457, file: !456, line: 46, baseType: !460, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_sz_t", file: !456, line: 22, baseType: !450)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ncached", scope: !457, file: !456, line: 48, baseType: !460, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tstats", scope: !457, file: !456, line: 54, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_stats_t", file: !456, line: 24, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_stats_s", file: !456, line: 25, size: 64, elements: !465)
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !464, file: !456, line: 30, baseType: !112, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !457, file: !456, line: 64, baseType: !468, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!469 = !{!470}
!470 = !DISubrange(count: 39)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !440, file: !441, line: 35, baseType: !472, size: 128, offset: 7616)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !441, line: 35, size: 128, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !472, file: !441, line: 35, baseType: !437, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !472, file: !441, line: 35, baseType: !437, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tsd_link", scope: !440, file: !441, line: 38, baseType: !477, size: 128, offset: 7744)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !441, line: 38, size: 128, elements: !478)
!478 = !{!479, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !477, file: !441, line: 38, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !477, file: !441, line: 38, baseType: !480, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "in_hook", scope: !440, file: !441, line: 39, baseType: !128, size: 8, offset: 7872)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor", scope: !440, file: !441, line: 46, baseType: !484, size: 256, offset: 7936)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_array_descriptor_t", file: !456, line: 67, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_array_descriptor_s", file: !456, line: 68, size: 256, elements: !486)
!486 = !{!487, !493, !495}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !485, file: !456, line: 73, baseType: !488, size: 128)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !485, file: !456, line: 73, size: 128, elements: !489)
!489 = !{!490, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !488, file: !456, line: 73, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !488, file: !456, line: 73, baseType: !491, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "bins_small", scope: !485, file: !456, line: 75, baseType: !494, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "bins_large", scope: !485, file: !456, line: 76, baseType: !494, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !440, file: !441, line: 49, baseType: !417, size: 64, offset: 8192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next_gc_bin", scope: !440, file: !441, line: 51, baseType: !498, size: 32, offset: 8256)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "szind_t", file: !499, line: 10, baseType: !7)
!499 = !DIFile(filename: "include/jemalloc/internal/jemalloc_internal_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9fabb1c7fca697e7a645839e73a4d9d5")
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lg_fill_div", scope: !440, file: !441, line: 53, baseType: !501, size: 312, offset: 8288)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 312, elements: !469)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "bins_large", scope: !440, file: !441, line: 59, baseType: !503, size: 37632, offset: 8640)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 37632, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 196)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor_ql", scope: !419, file: !420, line: 114, baseType: !507, size: 64, offset: 81536)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !419, file: !420, line: 114, size: 64, elements: !508)
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !507, file: !420, line: 114, baseType: !491, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_ql_mtx", scope: !419, file: !420, line: 115, baseType: !257, size: 896, offset: 81600)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prof_accum", scope: !419, file: !420, line: 118, baseType: !512, size: 64, offset: 82496)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_accum_t", file: !251, line: 5, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_accum_s", file: !253, line: 23, size: 64, elements: !514)
!514 = !{!515}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "accumbytes", scope: !513, file: !253, line: 28, baseType: !174, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "offset_state", scope: !419, file: !420, line: 126, baseType: !161, size: 64, offset: 82560)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "extent_sn_next", scope: !419, file: !420, line: 133, baseType: !161, size: 64, offset: 82624)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dss_prec", scope: !419, file: !420, line: 140, baseType: !424, size: 32, offset: 82688)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !419, file: !420, line: 147, baseType: !161, size: 64, offset: 82752)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !419, file: !420, line: 154, baseType: !521, size: 64, offset: 82816)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_list_t", file: !12, line: 184, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 184, size: 64, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !522, file: !12, line: 184, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_t", file: !527, line: 4, baseType: !528)
!527 = !DIFile(filename: "include/jemalloc/internal/extent_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "feed1f2f8b22932a2312223b59645f74")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_s", file: !12, line: 20, size: 1024, elements: !529)
!529 = !{!530, !531, !532, !537, !542, !548}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "e_bits", scope: !528, file: !12, line: 92, baseType: !112, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "e_addr", scope: !528, file: !12, line: 139, baseType: !105, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, scope: !528, file: !12, line: 141, baseType: !533, size: 64, offset: 128)
!533 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !12, line: 141, size: 64, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "e_size_esn", scope: !533, file: !12, line: 149, baseType: !146, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "e_bsize", scope: !533, file: !12, line: 153, baseType: !146, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link", scope: !528, file: !12, line: 163, baseType: !538, size: 128, offset: 192)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !528, file: !12, line: 163, size: 128, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !538, file: !12, line: 163, baseType: !525, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !538, file: !12, line: 163, baseType: !525, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ph_link", scope: !528, file: !12, line: 169, baseType: !543, size: 192, offset: 320)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !528, file: !12, line: 169, size: 192, elements: !544)
!544 = !{!545, !546, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "phn_prev", scope: !543, file: !12, line: 169, baseType: !525, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "phn_next", scope: !543, file: !12, line: 169, baseType: !525, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "phn_lchild", scope: !543, file: !12, line: 169, baseType: !525, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, scope: !528, file: !12, line: 171, baseType: !549, size: 512, offset: 512)
!549 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !12, line: 171, size: 512, elements: !550)
!550 = !{!551, !560}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "e_slab_data", scope: !549, file: !12, line: 173, baseType: !552, size: 512)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_slab_data_t", file: !64, line: 16, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_slab_data_s", file: !554, line: 6, size: 512, elements: !555)
!554 = !DIFile(filename: "include/jemalloc/internal/arena_structs_a.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "7b5b961b3d2ed5fcaf6c26f10c066bf6")
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !553, file: !554, line: 8, baseType: !557, size: 512)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 512, elements: !414)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_t", file: !559, line: 8, baseType: !116)
!559 = !DIFile(filename: "include/jemalloc/internal/bitmap.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "58e1c4ef6d1ba9c779b287089e4d138b")
!560 = !DIDerivedType(tag: DW_TAG_member, scope: !549, file: !12, line: 176, baseType: !561, size: 128)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !549, file: !12, line: 176, size: 128, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "e_alloc_time", scope: !561, file: !12, line: 178, baseType: !199, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_tctx", scope: !561, file: !12, line: 180, baseType: !406, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "large_mtx", scope: !419, file: !420, line: 156, baseType: !257, size: 896, offset: 82880)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "extents_dirty", scope: !419, file: !420, line: 164, baseType: !567, size: 39744, offset: 83776)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "extents_t", file: !527, line: 5, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extents_s", file: !12, line: 189, size: 39744, elements: !569)
!569 = !{!570, !571, !579, !581, !582, !586, !587, !588, !590}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !568, file: !12, line: 190, baseType: !257, size: 896)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "heaps", scope: !568, file: !12, line: 197, baseType: !572, size: 12800, offset: 896)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 12800, elements: !577)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_heap_t", file: !12, line: 186, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 186, size: 64, elements: !575)
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ph_root", scope: !574, file: !12, line: 186, baseType: !525, size: 64)
!577 = !{!578}
!578 = !DISubrange(count: 200)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nextents", scope: !568, file: !12, line: 198, baseType: !580, size: 12800, offset: 13696)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 12800, elements: !577)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !568, file: !12, line: 199, baseType: !580, size: 12800, offset: 26496)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !568, file: !12, line: 206, baseType: !583, size: 256, offset: 39296)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 256, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 4)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !568, file: !12, line: 213, baseType: !521, size: 64, offset: 39552)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "npages", scope: !568, file: !12, line: 223, baseType: !161, size: 64, offset: 39616)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !568, file: !12, line: 226, baseType: !589, size: 32, offset: 39680)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_state_t", file: !12, line: 17, baseType: !11)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "delay_coalesce", scope: !568, file: !12, line: 232, baseType: !128, size: 8, offset: 39712)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "extents_muzzy", scope: !419, file: !420, line: 165, baseType: !567, size: 39744, offset: 123520)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "extents_retained", scope: !419, file: !420, line: 166, baseType: !567, size: 39744, offset: 163264)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "decay_dirty", scope: !419, file: !420, line: 174, baseType: !594, size: 14272, offset: 203008)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_decay_t", file: !64, line: 17, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_decay_s", file: !420, line: 17, size: 14272, elements: !596)
!596 = !{!597, !598, !599, !604, !605, !606, !607, !608, !609, !611, !613}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !595, file: !420, line: 19, baseType: !257, size: 896)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "purging", scope: !595, file: !420, line: 24, baseType: !128, size: 8, offset: 896)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "time_ms", scope: !595, file: !420, line: 30, baseType: !600, size: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zd_t", file: !162, line: 74, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 74, size: 64, elements: !602)
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !601, file: !162, line: 74, baseType: !140, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !595, file: !420, line: 32, baseType: !199, size: 64, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !595, file: !420, line: 40, baseType: !199, size: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "jitter_state", scope: !595, file: !420, line: 42, baseType: !112, size: 64, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !595, file: !420, line: 50, baseType: !199, size: 64, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "nunpurged", scope: !595, file: !420, line: 57, baseType: !146, size: 64, offset: 1280)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !595, file: !420, line: 64, baseType: !610, size: 12800, offset: 1344)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 12800, elements: !577)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !595, file: !420, line: 72, baseType: !612, size: 64, offset: 14144)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ceil_npages", scope: !595, file: !420, line: 74, baseType: !112, size: 64, offset: 14208)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "decay_muzzy", scope: !419, file: !420, line: 175, baseType: !594, size: 14272, offset: 217280)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "extent_grow_next", scope: !419, file: !420, line: 190, baseType: !616, size: 32, offset: 231552)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "pszind_t", file: !499, line: 7, baseType: !7)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "retain_grow_limit", scope: !419, file: !420, line: 191, baseType: !616, size: 32, offset: 231584)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "extent_grow_mtx", scope: !419, file: !420, line: 192, baseType: !257, size: 896, offset: 231616)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail", scope: !419, file: !420, line: 200, baseType: !620, size: 64, offset: 232512)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_tree_t", file: !12, line: 185, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 185, size: 64, elements: !622)
!622 = !{!623}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ph_root", scope: !621, file: !12, line: 185, baseType: !525, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail_cnt", scope: !419, file: !420, line: 201, baseType: !161, size: 64, offset: 232576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail_mtx", scope: !419, file: !420, line: 202, baseType: !257, size: 896, offset: 232640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !419, file: !420, line: 209, baseType: !627, size: 2496, offset: 233536)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 2496, elements: !469)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "bins_t", file: !629, line: 86, baseType: !630)
!629 = !DIFile(filename: "include/jemalloc/internal/bin.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "498400e4bc130e370fcaa245db662b71")
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bins_s", file: !629, line: 87, size: 64, elements: !631)
!631 = !{!632}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bin_shards", scope: !630, file: !629, line: 89, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_t", file: !629, line: 58, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_s", file: !629, line: 59, size: 2240, elements: !636)
!636 = !{!637, !638, !639, !640, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !635, file: !629, line: 61, baseType: !257, size: 896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "slabcur", scope: !635, file: !629, line: 69, baseType: !525, size: 64, offset: 896)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_nonfull", scope: !635, file: !629, line: 76, baseType: !573, size: 64, offset: 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_full", scope: !635, file: !629, line: 79, baseType: !521, size: 64, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !635, file: !629, line: 82, baseType: !642, size: 1152, offset: 1088)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_stats_t", file: !643, line: 6, baseType: !644)
!643 = !DIFile(filename: "include/jemalloc/internal/bin_stats.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "4968efeedc9165ec9a1d6102ebef1b3c")
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_stats_s", file: !643, line: 7, size: 1152, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc", scope: !644, file: !643, line: 14, baseType: !112, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc", scope: !644, file: !643, line: 15, baseType: !112, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !644, file: !643, line: 22, baseType: !112, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "curregs", scope: !644, file: !643, line: 28, baseType: !146, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nfills", scope: !644, file: !643, line: 31, baseType: !112, size: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes", scope: !644, file: !643, line: 34, baseType: !112, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nslabs", scope: !644, file: !643, line: 37, baseType: !112, size: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reslabs", scope: !644, file: !643, line: 43, baseType: !112, size: 64, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "curslabs", scope: !644, file: !643, line: 46, baseType: !146, size: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nonfull_slabs", scope: !644, file: !643, line: 49, baseType: !146, size: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_data", scope: !644, file: !643, line: 51, baseType: !195, size: 512, offset: 640)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !419, file: !420, line: 216, baseType: !658, size: 64, offset: 236032)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "base_t", file: !660, line: 5, baseType: !661)
!660 = !DIFile(filename: "include/jemalloc/internal/base_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "7f7034d6fa75fa649e18edc6668e90f4")
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_s", file: !662, line: 20, size: 16512, elements: !663)
!662 = !DIFile(filename: "include/jemalloc/internal/base_structs.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "336d77d7a7b3192aa2dbcb6782483f7a")
!663 = !{!664, !665, !666, !667, !668, !669, !670, !678, !682, !683, !684, !685}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !661, file: !662, line: 22, baseType: !7, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "extent_hooks", scope: !661, file: !662, line: 28, baseType: !406, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !661, file: !662, line: 31, baseType: !257, size: 896, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "auto_thp_switched", scope: !661, file: !662, line: 34, baseType: !128, size: 8, offset: 1024)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pind_last", scope: !661, file: !662, line: 40, baseType: !616, size: 32, offset: 1056)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "extent_sn_next", scope: !661, file: !662, line: 43, baseType: !146, size: 64, offset: 1088)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !661, file: !662, line: 46, baseType: !671, size: 64, offset: 1152)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "base_block_t", file: !660, line: 4, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_block_s", file: !662, line: 9, size: 1152, elements: !674)
!674 = !{!675, !676, !677}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !673, file: !662, line: 11, baseType: !146, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !673, file: !662, line: 14, baseType: !671, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !673, file: !662, line: 17, baseType: !526, size: 1024, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !661, file: !662, line: 49, baseType: !679, size: 15040, offset: 1216)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 15040, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 235)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !661, file: !662, line: 52, baseType: !146, size: 64, offset: 16256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !661, file: !662, line: 53, baseType: !146, size: 64, offset: 16320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !661, file: !662, line: 54, baseType: !146, size: 64, offset: 16384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "n_thp", scope: !661, file: !662, line: 56, baseType: !146, size: 64, offset: 16448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "create_time", scope: !419, file: !420, line: 218, baseType: !199, size: 64, offset: 236096)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arena", scope: !224, file: !41, line: 199, baseType: !417, size: 64, offset: 3520)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arenas_tdata", scope: !224, file: !41, line: 199, baseType: !689, size: 64, offset: 3584)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_tdata_t", file: !64, line: 19, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_tdata_s", file: !420, line: 222, size: 64, elements: !692)
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "decay_ticker", scope: !691, file: !420, line: 223, baseType: !445, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_binshards", scope: !224, file: !41, line: 199, baseType: !695, size: 312, offset: 3648)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_binshards_t", file: !696, line: 12, baseType: !697)
!696 = !DIFile(filename: "include/jemalloc/internal/bin_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "900f45601acc6d8c9838905f3ff9fe5c")
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsd_binshards_s", file: !696, line: 13, size: 312, elements: !698)
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "binshard", scope: !697, file: !696, line: 14, baseType: !501, size: 312)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache", scope: !224, file: !41, line: 199, baseType: !438, size: 46272, offset: 3968)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_witness_tsd", scope: !224, file: !41, line: 199, baseType: !702, size: 128, offset: 50240)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_tsd_t", file: !305, line: 107, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_tsd_s", file: !305, line: 108, size: 128, elements: !704)
!704 = !{!705, !710}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "witnesses", scope: !703, file: !305, line: 109, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_list_t", file: !305, line: 76, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !305, line: 76, size: 64, elements: !708)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !707, file: !305, line: 76, baseType: !323, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "forking", scope: !703, file: !305, line: 110, baseType: !128, size: 8, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "n_lock_ops", scope: !196, file: !34, line: 105, baseType: !112, size: 64, offset: 448)
!712 = !{!713}
!713 = !DISubrange(count: 9)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lstats", scope: !158, file: !157, line: 124, baseType: !715, size: 75264, offset: 5952)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 75264, elements: !504)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_large_t", file: !157, line: 23, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_large_s", file: !157, line: 24, size: 384, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc", scope: !717, file: !157, line: 29, baseType: !173, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc", scope: !717, file: !157, line: 30, baseType: !173, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !717, file: !157, line: 37, baseType: !173, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "nfills", scope: !717, file: !157, line: 43, baseType: !173, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes", scope: !717, file: !157, line: 44, baseType: !173, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "curlextents", scope: !717, file: !157, line: 47, baseType: !146, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "uptime", scope: !158, file: !157, line: 127, baseType: !199, size: 64, offset: 81216)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_small", scope: !153, file: !108, line: 38, baseType: !146, size: 64, offset: 81280)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc_small", scope: !153, file: !108, line: 39, baseType: !112, size: 64, offset: 81344)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc_small", scope: !153, file: !108, line: 40, baseType: !112, size: 64, offset: 81408)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests_small", scope: !153, file: !108, line: 41, baseType: !112, size: 64, offset: 81472)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nfills_small", scope: !153, file: !108, line: 42, baseType: !112, size: 64, offset: 81536)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes_small", scope: !153, file: !108, line: 43, baseType: !112, size: 64, offset: 81600)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bstats", scope: !153, file: !108, line: 45, baseType: !733, size: 44928, offset: 81664)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 44928, elements: !469)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lstats", scope: !153, file: !108, line: 46, baseType: !715, size: 75264, offset: 126592)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "estats", scope: !153, file: !108, line: 47, baseType: !736, size: 76416, offset: 201856)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 76416, elements: !746)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_extents_t", file: !157, line: 60, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_extents_s", file: !157, line: 61, size: 384, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ndirty", scope: !738, file: !157, line: 68, baseType: !161, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_bytes", scope: !738, file: !157, line: 69, baseType: !161, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nmuzzy", scope: !738, file: !157, line: 70, baseType: !161, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "muzzy_bytes", scope: !738, file: !157, line: 71, baseType: !161, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nretained", scope: !738, file: !157, line: 72, baseType: !161, size: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "retained_bytes", scope: !738, file: !157, line: 73, baseType: !161, size: 64, offset: 320)
!746 = !{!747}
!747 = !DISubrange(count: 199)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "je_arenas", scope: !109, file: !108, line: 93, baseType: !749, size: 262208, offset: 192)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 262208, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 4097)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctl_stats_t", file: !108, line: 61, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_stats_s", file: !108, line: 50, size: 2176, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !770}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !754, file: !108, line: 51, baseType: !146, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !754, file: !108, line: 52, baseType: !146, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !754, file: !108, line: 53, baseType: !146, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_thp", scope: !754, file: !108, line: 54, baseType: !146, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !754, file: !108, line: 55, baseType: !146, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !754, file: !108, line: 56, baseType: !146, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "retained", scope: !754, file: !108, line: 57, baseType: !146, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "background_thread", scope: !754, file: !108, line: 59, baseType: !764, size: 192, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "background_thread_stats_t", file: !75, line: 52, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "background_thread_stats_s", file: !75, line: 47, size: 192, elements: !766)
!766 = !{!767, !768, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !765, file: !75, line: 48, baseType: !146, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "num_runs", scope: !765, file: !75, line: 49, baseType: !112, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "run_interval", scope: !765, file: !75, line: 50, baseType: !199, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_prof_data", scope: !754, file: !108, line: 60, baseType: !771, size: 1536, offset: 640)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 1536, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 3)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_tsdn_t", file: !305, line: 119, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_tsdn_s", file: !305, line: 120, size: 128, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "witness_tsd", scope: !776, file: !305, line: 121, baseType: !702, size: 128)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "container_s", scope: !782, file: !3, line: 734, size: 278976, elements: !796)
!782 = distinct !DISubprogram(name: "arenas_i_impl", scope: !3, file: !3, line: 726, type: !783, scopeLine: 726, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !785)
!783 = !DISubroutineType(types: !784)
!784 = !{!122, !480, !146, !128, !128}
!785 = !{!786, !787, !788, !789, !790, !791}
!786 = !DILocalVariable(name: "tsd", arg: 1, scope: !782, file: !3, line: 726, type: !480)
!787 = !DILocalVariable(name: "i", arg: 2, scope: !782, file: !3, line: 726, type: !146)
!788 = !DILocalVariable(name: "compat", arg: 3, scope: !782, file: !3, line: 726, type: !128)
!789 = !DILocalVariable(name: "init", arg: 4, scope: !782, file: !3, line: 726, type: !128)
!790 = !DILocalVariable(name: "ret", scope: !782, file: !3, line: 727, type: !122)
!791 = !DILocalVariable(name: "cont", scope: !792, file: !3, line: 738, type: !780)
!792 = distinct !DILexicalBlock(scope: !793, file: !3, line: 733, column: 21)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 733, column: 7)
!794 = distinct !DILexicalBlock(scope: !795, file: !3, line: 732, column: 27)
!795 = distinct !DILexicalBlock(scope: !782, file: !3, line: 732, column: 6)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ctl_arena", scope: !781, file: !3, line: 735, baseType: !123, size: 704)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "astats", scope: !781, file: !3, line: 736, baseType: !152, size: 278272, offset: 704)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_hooks_t", file: !801, line: 288, baseType: !802)
!801 = !DIFile(filename: "include/jemalloc/internal/../jemalloc.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "d181e8f693d53034cc8701ff0bf81715")
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_hooks_s", file: !801, line: 354, size: 576, elements: !803)
!803 = !{!804, !810, !815, !820, !825, !828, !831, !832, !837}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !802, file: !801, line: 355, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_alloc_t", file: !801, line: 295, baseType: !807)
!807 = !DISubroutineType(types: !808)
!808 = !{!105, !799, !105, !146, !146, !809, !809, !7}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dalloc", scope: !802, file: !801, line: 356, baseType: !811, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_dalloc_t", file: !801, line: 303, baseType: !813)
!813 = !DISubroutineType(types: !814)
!814 = !{!128, !799, !105, !146, !128, !7}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !802, file: !801, line: 357, baseType: !816, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_destroy_t", file: !801, line: 311, baseType: !818)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !799, !105, !146, !128, !7}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "commit", scope: !802, file: !801, line: 358, baseType: !821, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_commit_t", file: !801, line: 319, baseType: !823)
!823 = !DISubroutineType(types: !824)
!824 = !{!128, !799, !105, !146, !146, !146, !7}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "decommit", scope: !802, file: !801, line: 359, baseType: !826, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_decommit_t", file: !801, line: 327, baseType: !823)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "purge_lazy", scope: !802, file: !801, line: 360, baseType: !829, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_purge_t", file: !801, line: 335, baseType: !823)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "purge_forced", scope: !802, file: !801, line: 361, baseType: !829, size: 64, offset: 384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !802, file: !801, line: 362, baseType: !833, size: 64, offset: 448)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_split_t", file: !801, line: 343, baseType: !835)
!835 = !DISubroutineType(types: !836)
!836 = !{!128, !799, !105, !146, !146, !146, !128, !7}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "merge", scope: !802, file: !801, line: 363, baseType: !838, size: 64, offset: 512)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_merge_t", file: !801, line: 351, baseType: !840)
!840 = !DISubroutineType(types: !841)
!841 = !{!128, !799, !105, !146, !105, !146, !128, !7}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctl_node_t", file: !108, line: 16, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_node_s", file: !108, line: 14, size: 8, elements: !846)
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !845, file: !108, line: 15, baseType: !128, size: 8)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctl_named_node_t", file: !108, line: 26, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_named_node_s", file: !108, line: 18, size: 320, elements: !852)
!852 = !{!853, !854, !855, !856, !857}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !851, file: !108, line: 19, baseType: !844, size: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !851, file: !108, line: 20, baseType: !136, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "nchildren", scope: !851, file: !108, line: 22, baseType: !146, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !851, file: !108, line: 23, baseType: !842, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ctl", scope: !851, file: !108, line: 24, baseType: !858, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!277, !480, !861, !146, !105, !355, !105, !146}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_cpuid_t", file: !499, line: 13, baseType: !277)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !873, line: 267, baseType: !874)
!873 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !115, line: 207, baseType: !143)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "hooks_t", file: !81, line: 103, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hooks_s", file: !81, line: 104, size: 256, elements: !878)
!878 = !{!879, !886, !892, !898}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_hook", scope: !877, file: !81, line: 105, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_alloc", file: !81, line: 92, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !105, !884, !105, !397, !885}
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_alloc_t", file: !81, line: 68, baseType: !80)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dalloc_hook", scope: !877, file: !81, line: 106, baseType: !887, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_dalloc", file: !81, line: 96, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !105, !891, !105, !885}
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_dalloc_t", file: !81, line: 82, baseType: !92)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "expand_hook", scope: !877, file: !81, line: 107, baseType: !893, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_expand", file: !81, line: 99, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !105, !897, !105, !146, !146, !397, !885}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_expand_t", file: !81, line: 90, baseType: !99)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !877, file: !81, line: 108, baseType: !105, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_util_stats_verbose_t", file: !527, line: 8, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_util_stats_verbose_s", file: !12, line: 247, size: 384, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !908}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "slabcur_addr", scope: !901, file: !12, line: 248, baseType: !105, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "nfree", scope: !901, file: !12, line: 249, baseType: !146, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "nregs", scope: !901, file: !12, line: 250, baseType: !146, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !901, file: !12, line: 251, baseType: !146, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "bin_nfree", scope: !901, file: !12, line: 252, baseType: !146, size: 64, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "bin_nregs", scope: !901, file: !12, line: 253, baseType: !146, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_util_stats_t", file: !527, line: 7, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_util_stats_s", file: !12, line: 241, size: 192, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "nfree", scope: !911, file: !12, line: 242, baseType: !146, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "nregs", scope: !911, file: !12, line: 243, baseType: !146, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !911, file: !12, line: 244, baseType: !146, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctl_indexed_node_t", file: !108, line: 32, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_indexed_node_s", file: !108, line: 28, size: 128, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !920, file: !108, line: 29, baseType: !845, size: 8)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !920, file: !108, line: 30, baseType: !924, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!848, !217, !861, !146, !146}
!927 = !{!928, !931, !0, !933, !935, !937, !942, !945, !948, !953, !958, !963, !968, !970, !972, !974, !976, !978, !983, !985, !990, !993, !998, !1003, !1005, !1010, !1012, !1015, !1017, !1019, !1022, !1024, !1026, !1028, !1031, !1033, !1035, !1037, !1039, !1041, !1043, !1048, !1050, !1052, !1055, !1059, !1061, !1063, !1065, !1068, !1070, !1072, !1074, !1076, !1078, !1080, !1082, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1098, !1103, !1105, !1107, !1109, !1114, !1116, !1118, !1120, !1125, !1130, !1132, !1134, !1139, !1141, !1143, !1145, !1147, !1149, !1151, !1156, !1158, !1160, !1163, !1166, !1168, !1170, !1172, !1174, !1176, !1178, !1180, !1183, !1185, !1187, !1189, !1191, !1193, !1195, !1197, !1199, !1201, !1203, !1205, !1207, !1209, !1211, !1213, !1215, !1218, !1220, !1222, !1224, !1233, !1235, !1237, !1239, !1242, !1244, !1246, !1248, !1251, !1253, !1255, !1257, !1259, !1261, !1263, !1265, !1267, !1269, !1271, !1273, !1275, !1277, !1279, !1281, !1283, !1285, !1287, !1289, !1291, !1293, !1295, !1297, !1299, !1301, !1303, !1305, !1307, !1309, !1311, !1313, !1315, !1317, !1319, !1321, !1323, !1325, !1327, !1329, !1331, !1333, !1335, !1337, !1339, !1344, !1346, !1348, !1350, !1352, !1354, !1357, !1359, !1361, !1363, !1365, !1367, !1369, !1371, !1373, !1375, !1378, !1380, !1382, !1384, !1386, !1388, !1390, !1392, !1394, !1396, !1398, !1400, !1402, !1404, !1406, !1408, !1410, !1412, !1414, !1416, !1418, !1420, !1422, !1424, !1426, !1428, !1430, !1432, !1434, !1436, !1438, !1440, !1442, !1444, !1446, !1448, !1450, !1452, !1454, !1456, !1458, !1460, !1462}
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1388, type: !930, isLocal: true, isDefinition: true)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 32, elements: !584)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "ctl_mtx", scope: !2, file: !3, line: 21, type: !257, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "ctl_arenas", scope: !2, file: !3, line: 24, type: !106, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "ctl_stats", scope: !2, file: !3, line: 23, type: !752, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !3, line: 638, type: !939, isLocal: true, isDefinition: true)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 8, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 1)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "super_root_node", scope: !2, file: !3, line: 637, type: !944, isLocal: true, isDefinition: true)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 320, elements: !940)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !3, line: 623, type: !947, isLocal: true, isDefinition: true)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !414)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !3, line: 624, type: !950, isLocal: true, isDefinition: true)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 48, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 6)
