; ModuleID = 'samples/18.bc'
source_filename = "libyasm/section.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.yasm_directive = type { ptr, ptr, ptr, i32 }
%struct.yasm_object = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct.yasm_sectionhead, ptr, ptr, ptr }
%struct.yasm_sectionhead = type { ptr, ptr }
%struct.yasm_objfmt_module = type { ptr, ptr, ptr, i8, i8, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.yasm_arch_base = type { ptr }
%struct.yasm_arch_module = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32 }
%struct.yasm_objfmt_base = type { ptr }
%struct.yasm_dbgfmt_module = type { ptr, ptr, ptr, ptr, ptr, ptr }
%struct.yasm_dbgfmt_base = type { ptr }
%struct.yasm_directive_wrap = type { ptr }
%struct.yasm_section = type { %struct.anon, ptr, ptr, ptr, i64, i64, i32, i32, i32, %struct.yasm_bytecodehead, %struct.yasm_relochead, ptr }
%struct.anon = type { ptr }
%struct.yasm_bytecodehead = type { ptr, ptr }
%struct.yasm_relochead = type { ptr, ptr }
%struct.yasm_bytecode = type { %struct.anon.0, ptr, ptr, ptr, i64, i64, i64, i64, i64, ptr, ptr }
%struct.anon.0 = type { ptr }
%struct.yasm_reloc = type { %struct.anon.1, ptr, ptr }
%struct.anon.1 = type { ptr }

!74 = !DIEnumerator(name: "YASM_BC_SPECIAL_NONE", value: 0)
!75 = !DIEnumerator(name: "YASM_BC_SPECIAL_RESERVE", value: 1)
!76 = !DIEnumerator(name: "YASM_BC_SPECIAL_OFFSET", value: 2)
!77 = !DIEnumerator(name: "YASM_BC_SPECIAL_INSN", value: 3)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yasm_param_type", file: !79, line: 43, baseType: !25, size: 32, elements: !80)
!79 = !DIFile(filename: "libyasm/valparam.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "345460cb5d2689afdbce8a9a43dd6428")
!80 = !{!81, !82, !83}
!81 = !DIEnumerator(name: "YASM_PARAM_ID", value: 0)
!82 = !DIEnumerator(name: "YASM_PARAM_STRING", value: 1)
!83 = !DIEnumerator(name: "YASM_PARAM_EXPR", value: 2)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yasm_directive_flags", file: !79, line: 88, baseType: !25, size: 32, elements: !85)
!85 = !{!86, !87, !88}
!86 = !DIEnumerator(name: "YASM_DIR_ANY", value: 0)
!87 = !DIEnumerator(name: "YASM_DIR_ARG_REQUIRED", value: 1)
!88 = !DIEnumerator(name: "YASM_DIR_ID_REQUIRED", value: 2)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yasm_error_class", file: !90, line: 50, baseType: !25, size: 32, elements: !91)
!90 = !DIFile(filename: "libyasm/errwarn.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "e8ddf1933c5e2c4fd74d90f9312311d9")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!92 = !DIEnumerator(name: "YASM_ERROR_NONE", value: 0)
!93 = !DIEnumerator(name: "YASM_ERROR_GENERAL", value: 65535)
!94 = !DIEnumerator(name: "YASM_ERROR_ARITHMETIC", value: 1)
!95 = !DIEnumerator(name: "YASM_ERROR_OVERFLOW", value: 32769)
!96 = !DIEnumerator(name: "YASM_ERROR_FLOATING_POINT", value: 16385)
!97 = !DIEnumerator(name: "YASM_ERROR_ZERO_DIVISION", value: 8193)
!98 = !DIEnumerator(name: "YASM_ERROR_ASSERTION", value: 2)
!99 = !DIEnumerator(name: "YASM_ERROR_VALUE", value: 4)
!100 = !DIEnumerator(name: "YASM_ERROR_NOT_ABSOLUTE", value: 32772)
!101 = !DIEnumerator(name: "YASM_ERROR_TOO_COMPLEX", value: 16388)
!102 = !DIEnumerator(name: "YASM_ERROR_NOT_CONSTANT", value: 8196)
!103 = !DIEnumerator(name: "YASM_ERROR_IO", value: 8)
!104 = !DIEnumerator(name: "YASM_ERROR_NOT_IMPLEMENTED", value: 16)
!105 = !DIEnumerator(name: "YASM_ERROR_TYPE", value: 32)
!106 = !DIEnumerator(name: "YASM_ERROR_SYNTAX", value: 64)
!107 = !DIEnumerator(name: "YASM_ERROR_PARSE", value: 32832)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yasm_arch_create_error", file: !109, line: 34, baseType: !25, size: 32, elements: !110)
!109 = !DIFile(filename: "libyasm/arch.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "77f71bc1a4e496e53cd435f5de451074")
!110 = !{!111, !112, !113}
!111 = !DIEnumerator(name: "YASM_ARCH_CREATE_OK", value: 0)
!112 = !DIEnumerator(name: "YASM_ARCH_CREATE_BAD_MACHINE", value: 1)
!113 = !DIEnumerator(name: "YASM_ARCH_CREATE_BAD_PARSER", value: 2)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yasm_arch_insnprefix", file: !109, line: 41, baseType: !25, size: 32, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIEnumerator(name: "YASM_ARCH_NOTINSNPREFIX", value: 0)
!117 = !DIEnumerator(name: "YASM_ARCH_INSN", value: 1)
!118 = !DIEnumerator(name: "YASM_ARCH_PREFIX", value: 2)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yasm_arch_regtmod", file: !109, line: 50, baseType: !25, size: 32, elements: !120)
!120 = !{!121, !122, !123, !124, !125}
!121 = !DIEnumerator(name: "YASM_ARCH_NOTREGTMOD", value: 0)
!122 = !DIEnumerator(name: "YASM_ARCH_REG", value: 1)
!123 = !DIEnumerator(name: "YASM_ARCH_REGGROUP", value: 2)
!124 = !DIEnumerator(name: "YASM_ARCH_SEGREG", value: 3)
!125 = !DIEnumerator(name: "YASM_ARCH_TARGETMOD", value: 4)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yasm_sym_vis", file: !127, line: 52, baseType: !25, size: 32, elements: !128)
!127 = !DIFile(filename: "libyasm/symrec.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "dfb116438a620dd87f0db3310d44d920")
!128 = !{!129, !130, !131, !132, !133}
!129 = !DIEnumerator(name: "YASM_SYM_LOCAL", value: 0)
!130 = !DIEnumerator(name: "YASM_SYM_GLOBAL", value: 1)
!131 = !DIEnumerator(name: "YASM_SYM_COMMON", value: 2)
!132 = !DIEnumerator(name: "YASM_SYM_EXTERN", value: 4)
!133 = !DIEnumerator(name: "YASM_SYM_DLOCAL", value: 8)
!134 = !{!135, !552, !611, !229, !212, !166, !295, !264, !202, !368, !639}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch_base", file: !109, line: 65, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_arch_base", file: !109, line: 62, size: 64, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !137, file: !109, line: 64, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_arch_module", file: !109, line: 88, size: 1536, elements: !143)
!143 = !{!144, !147, !148, !450, !456, !460, !466, !470, !474, !481, !486, !493, !499, !507, !511, !515, !519, !520, !527, !531, !537, !541, !549, !550, !551}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !109, line: 92, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "keyword", scope: !142, file: !109, line: 97, baseType: !145, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "directives", scope: !142, file: !109, line: 100, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_directive", file: !24, line: 205, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_directive", file: !79, line: 69, size: 256, elements: !153)
!153 = !{!154, !155, !156, !449}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !79, line: 74, baseType: !145, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !152, file: !79, line: 76, baseType: !145, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !152, file: !79, line: 84, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !160, !426, !426, !202}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_object", file: !24, line: 96, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_object", file: !163, line: 49, size: 768, elements: !164)
!163 = !DIFile(filename: "libyasm/section.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "ba239fc7317ff7164be158d14b67c691")
!164 = !{!165, !167, !168, !172, !176, !180, !184, !414, !420, !424, !425}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "src_filename", scope: !162, file: !163, line: 50, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "obj_filename", scope: !162, file: !163, line: 51, baseType: !166, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !162, file: !163, line: 53, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_symtab", file: !24, line: 102, baseType: !171)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_symtab", file: !24, line: 102, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !162, file: !163, line: 54, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch", file: !24, line: 38, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_arch", file: !24, line: 38, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "objfmt", scope: !162, file: !163, line: 55, baseType: !177, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_objfmt", file: !24, line: 44, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_objfmt", file: !24, line: 44, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "dbgfmt", scope: !162, file: !163, line: 56, baseType: !181, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_dbgfmt", file: !24, line: 46, baseType: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_dbgfmt", file: !24, line: 46, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cur_section", scope: !162, file: !163, line: 61, baseType: !185, size: 64, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_section", file: !24, line: 99, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_section", file: !2, line: 54, size: 832, elements: !188)
!188 = !{!189, !194, !195, !196, !201, !203, !204, !206, !207, !208, !398, !413}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !187, file: !2, line: 55, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !187, file: !2, line: 55, size: 64, elements: !191)
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !190, file: !2, line: 55, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !187, file: !2, line: 57, baseType: !160, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !2, line: 59, baseType: !166, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "assoc_data", scope: !187, file: !2, line: 62, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm__assoc_data", file: !199, line: 38, baseType: !200)
!199 = !DIFile(filename: "libyasm/assocdat.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "4cef246b4ffb4d8adbd050c0415d069f")
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm__assoc_data", file: !199, line: 38, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !187, file: !2, line: 64, baseType: !202, size: 64, offset: 256)
!202 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "opt_flags", scope: !187, file: !2, line: 66, baseType: !202, size: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !187, file: !2, line: 68, baseType: !205, size: 32, offset: 384)
!205 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "res_only", scope: !187, file: !2, line: 69, baseType: !205, size: 32, offset: 416)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !187, file: !2, line: 70, baseType: !205, size: 32, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "bcs", scope: !187, file: !2, line: 74, baseType: !209, size: 128, offset: 512)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_bytecodehead", file: !2, line: 74, size: 128, elements: !210)
!210 = !{!211, !396}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !209, file: !2, line: 74, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_bytecode", file: !72, line: 183, size: 704, elements: !214)
!214 = !{!215, !219, !386, !387, !388, !389, !390, !391, !392, !393, !395}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !213, file: !72, line: 187, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !213, file: !72, line: 187, size: 64, elements: !217)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !216, file: !72, line: 187, baseType: !212, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !213, file: !72, line: 192, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_bytecode_callback", file: !72, line: 180, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_bytecode_callback", file: !72, line: 63, size: 512, elements: !224)
!224 = !{!225, !230, !291, !297, !301, !364, !369, !385}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !223, file: !72, line: 68, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !223, file: !72, line: 76, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !234, !236, !205}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !238, line: 7, baseType: !239)
!238 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !240, line: 49, size: 1728, elements: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !257, !259, !260, !261, !265, !267, !269, !270, !273, !275, !278, !281, !282, !283, !286, !287}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !239, file: !240, line: 51, baseType: !205, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !239, file: !240, line: 54, baseType: !166, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !239, file: !240, line: 55, baseType: !166, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !239, file: !240, line: 56, baseType: !166, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !239, file: !240, line: 57, baseType: !166, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !239, file: !240, line: 58, baseType: !166, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !239, file: !240, line: 59, baseType: !166, size: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !239, file: !240, line: 60, baseType: !166, size: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !239, file: !240, line: 61, baseType: !166, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !239, file: !240, line: 64, baseType: !166, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !239, file: !240, line: 65, baseType: !166, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !239, file: !240, line: 66, baseType: !166, size: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !239, file: !240, line: 68, baseType: !255, size: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !240, line: 36, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !239, file: !240, line: 70, baseType: !258, size: 64, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !239, file: !240, line: 72, baseType: !205, size: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !239, file: !240, line: 73, baseType: !205, size: 32, offset: 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !239, file: !240, line: 74, baseType: !262, size: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !263, line: 152, baseType: !264)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!264 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !239, file: !240, line: 77, baseType: !266, size: 16, offset: 1024)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !239, file: !240, line: 78, baseType: !268, size: 8, offset: 1040)
!268 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !239, file: !240, line: 79, baseType: !3, size: 8, offset: 1048)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !239, file: !240, line: 81, baseType: !271, size: 64, offset: 1088)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !240, line: 43, baseType: null)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !239, file: !240, line: 89, baseType: !274, size: 64, offset: 1152)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !263, line: 153, baseType: !264)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !239, file: !240, line: 91, baseType: !276, size: 64, offset: 1216)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !240, line: 37, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !239, file: !240, line: 92, baseType: !279, size: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !240, line: 38, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !239, file: !240, line: 93, baseType: !258, size: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !239, file: !240, line: 94, baseType: !229, size: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !239, file: !240, line: 95, baseType: !284, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !285, line: 70, baseType: !202)
!285 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !239, file: !240, line: 96, baseType: !205, size: 32, offset: 1536)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !239, file: !240, line: 98, baseType: !288, size: 160, offset: 1568)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 20)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !223, file: !72, line: 83, baseType: !292, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !295, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_bytecode", file: !24, line: 93, baseType: !213)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !223, file: !72, line: 91, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!205, !295}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "calc_len", scope: !223, file: !72, line: 108, baseType: !302, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!205, !295, !305, !229}
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_bc_add_span_func", file: !72, line: 55, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !229, !295, !205, !309, !264, !264}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_value", file: !24, line: 184, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_value", file: !24, line: 121, size: 256, elements: !313)
!313 = !{!314, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !312, file: !24, line: 126, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_expr", file: !24, line: 108, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_expr", file: !61, line: 70, size: 448, elements: !318)
!318 = !{!319, !321, !322, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !317, file: !61, line: 71, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_expr_op", file: !24, line: 253, baseType: !23)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !317, file: !61, line: 72, baseType: !202, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "numterms", scope: !317, file: !61, line: 73, baseType: !205, size: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "terms", scope: !317, file: !61, line: 79, baseType: !324, size: 256, offset: 192)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 256, elements: !351)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_expr__item", file: !61, line: 67, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_expr__item", file: !61, line: 54, size: 128, elements: !327)
!327 = !{!328, !330}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !326, file: !61, line: 55, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_expr__type", file: !61, line: 51, baseType: !60)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !326, file: !61, line: 66, baseType: !331, size: 64, offset: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !326, file: !61, line: 58, size: 64, elements: !332)
!332 = !{!333, !334, !338, !339, !343, !347, !350}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "precbc", scope: !331, file: !61, line: 59, baseType: !295, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !331, file: !61, line: 60, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_symrec", file: !24, line: 105, baseType: !337)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_symrec", file: !24, line: 105, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "expn", scope: !331, file: !61, line: 61, baseType: !315, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "intn", scope: !331, file: !61, line: 62, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_intnum", file: !24, line: 110, baseType: !342)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_intnum", file: !24, line: 110, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flt", scope: !331, file: !61, line: 63, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_floatnum", file: !24, line: 114, baseType: !346)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_floatnum", file: !24, line: 114, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !331, file: !61, line: 64, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !349, line: 90, baseType: !202)
!349 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!350 = !DIDerivedType(tag: DW_TAG_member, name: "subst", scope: !331, file: !61, line: 65, baseType: !25, size: 32)
!351 = !{!352}
!352 = !DISubrange(count: 2)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !312, file: !24, line: 131, baseType: !335, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "wrt", scope: !312, file: !24, line: 134, baseType: !335, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "seg_of", scope: !312, file: !24, line: 139, baseType: !25, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rshift", scope: !312, file: !24, line: 145, baseType: !25, size: 7, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "curpos_rel", scope: !312, file: !24, line: 152, baseType: !25, size: 1, offset: 200, flags: DIFlagBitField, extraData: i64 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ip_rel", scope: !312, file: !24, line: 158, baseType: !25, size: 1, offset: 201, flags: DIFlagBitField, extraData: i64 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "jump_target", scope: !312, file: !24, line: 164, baseType: !25, size: 1, offset: 202, flags: DIFlagBitField, extraData: i64 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "section_rel", scope: !312, file: !24, line: 172, baseType: !25, size: 1, offset: 203, flags: DIFlagBitField, extraData: i64 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "no_warn", scope: !312, file: !24, line: 175, baseType: !25, size: 1, offset: 204, flags: DIFlagBitField, extraData: i64 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !312, file: !24, line: 180, baseType: !25, size: 1, offset: 205, flags: DIFlagBitField, extraData: i64 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !312, file: !24, line: 183, baseType: !25, size: 8, offset: 206, flags: DIFlagBitField, extraData: i64 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "expand", scope: !223, file: !72, line: 132, baseType: !365, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!205, !295, !205, !264, !264, !368, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tobytes", scope: !223, file: !72, line: 159, baseType: !370, size: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!205, !295, !373, !374, !229, !376, !381}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_output_value_func", file: !24, line: 273, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!205, !380, !374, !25, !202, !295, !205, !229}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_output_reloc_func", file: !24, line: 294, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!205, !335, !295, !374, !25, !25, !205, !229}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "special", scope: !223, file: !72, line: 179, baseType: !71, size: 32, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !213, file: !72, line: 197, baseType: !185, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "multiple", scope: !213, file: !72, line: 202, baseType: !315, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !213, file: !72, line: 205, baseType: !202, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mult_int", scope: !213, file: !72, line: 208, baseType: !264, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !213, file: !72, line: 211, baseType: !202, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !213, file: !72, line: 216, baseType: !202, size: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bc_index", scope: !213, file: !72, line: 219, baseType: !202, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "symrecs", scope: !213, file: !72, line: 224, baseType: !394, size: 64, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !213, file: !72, line: 227, baseType: !229, size: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !209, file: !2, line: 74, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "relocs", scope: !187, file: !2, line: 77, baseType: !399, size: 128, offset: 640)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_relochead", file: !2, line: 77, size: 128, elements: !400)
!400 = !{!401, !411}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !399, file: !2, line: 77, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_reloc", file: !163, line: 42, size: 192, elements: !404)
!404 = !{!405, !409, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !403, file: !163, line: 43, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !403, file: !163, line: 43, size: 64, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !406, file: !163, line: 43, baseType: !402, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !403, file: !163, line: 44, baseType: !340, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !403, file: !163, line: 45, baseType: !335, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !399, file: !2, line: 77, baseType: !412, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_reloc", scope: !187, file: !2, line: 79, baseType: !226, size: 64, offset: 768)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sections", scope: !162, file: !163, line: 64, baseType: !415, size: 128, offset: 448)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_sectionhead", file: !163, line: 64, size: 128, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !415, file: !163, line: 64, baseType: !193, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !415, file: !163, line: 64, baseType: !419, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "directives", scope: !162, file: !163, line: 69, baseType: !421, size: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "HAMT", file: !423, line: 38, flags: DIFlagFwdDecl)
!423 = !DIFile(filename: "libyasm/hamt.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "ee0aefbcc035f779a3961203e3690615")
!424 = !DIDerivedType(tag: DW_TAG_member, name: "global_prefix", scope: !162, file: !163, line: 72, baseType: !166, size: 64, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "global_suffix", scope: !162, file: !163, line: 75, baseType: !166, size: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_valparamhead", file: !24, line: 201, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_valparamhead", file: !79, line: 66, size: 128, elements: !429)
!429 = !{!430, !447}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !428, file: !79, line: 66, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_valparam", file: !79, line: 38, size: 320, elements: !433)
!433 = !{!434, !438, !439, !440, !446}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !432, file: !79, line: 39, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !79, line: 39, size: 64, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !435, file: !79, line: 39, baseType: !431, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !432, file: !79, line: 40, baseType: !166, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !79, line: 47, baseType: !78, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !432, file: !79, line: 54, baseType: !441, size: 64, offset: 192)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yasm_param", file: !79, line: 50, size: 64, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !441, file: !79, line: 51, baseType: !166, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !441, file: !79, line: 52, baseType: !166, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !441, file: !79, line: 53, baseType: !315, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "id_prefix", scope: !432, file: !79, line: 62, baseType: !4, size: 8, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !428, file: !79, line: 66, baseType: !448, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !152, file: !79, line: 92, baseType: !84, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !142, file: !109, line: 106, baseType: !451, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!173, !145, !145, !454}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch_create_error", file: !109, line: 38, baseType: !108)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !142, file: !109, line: 112, baseType: !457, size: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !173}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "get_machine", scope: !142, file: !109, line: 117, baseType: !461, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!145, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "get_address_size", scope: !142, file: !109, line: 122, baseType: !467, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!25, !464}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "set_var", scope: !142, file: !109, line: 127, baseType: !471, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!205, !173, !145, !202}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "parse_check_insnprefix", scope: !142, file: !109, line: 132, baseType: !475, size: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !173, !145, !284, !202, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch_insnprefix", file: !109, line: 45, baseType: !114)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "parse_check_regtmod", scope: !142, file: !109, line: 139, baseType: !482, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !173, !145, !284, !480}
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch_regtmod", file: !109, line: 56, baseType: !119)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "get_fill", scope: !142, file: !109, line: 146, baseType: !487, size: 64, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !464}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "floatnum_tobytes", scope: !142, file: !109, line: 151, baseType: !494, size: 64, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!205, !173, !497, !374, !284, !284, !284, !205}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "intnum_tobytes", scope: !142, file: !109, line: 158, baseType: !500, size: 64, offset: 768)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!205, !173, !503, !374, !284, !284, !205, !505, !205}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "get_reg_size", scope: !142, file: !109, line: 166, baseType: !508, size: 64, offset: 832)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!25, !173, !348}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reggroup_get_reg", scope: !142, file: !109, line: 171, baseType: !512, size: 64, offset: 896)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!348, !173, !348, !202}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reg_print", scope: !142, file: !109, line: 177, baseType: !516, size: 64, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !173, !348, !236}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "segreg_print", scope: !142, file: !109, line: 182, baseType: !516, size: 64, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ea_create", scope: !142, file: !109, line: 187, baseType: !521, size: 64, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!524, !173, !315}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_effaddr", file: !24, line: 210, baseType: !526)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_effaddr", file: !24, line: 210, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ea_destroy", scope: !142, file: !109, line: 192, baseType: !528, size: 64, offset: 1152)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !524}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ea_print", scope: !142, file: !109, line: 197, baseType: !532, size: 64, offset: 1216)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535, !236, !205}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "create_empty_insn", scope: !142, file: !109, line: 202, baseType: !538, size: 64, offset: 1280)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!295, !173, !202}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "machines", scope: !142, file: !109, line: 209, baseType: !542, size: 64, offset: 1344)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch_machine", file: !109, line: 80, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_arch_machine", file: !109, line: 74, size: 128, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !109, line: 76, baseType: !145, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "keyword", scope: !545, file: !109, line: 79, baseType: !145, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "default_machine_keyword", scope: !142, file: !109, line: 215, baseType: !145, size: 64, offset: 1408)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "wordsize", scope: !142, file: !109, line: 221, baseType: !25, size: 32, offset: 1472)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "min_insn_len", scope: !142, file: !109, line: 227, baseType: !25, size: 32, offset: 1504)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_objfmt_base", file: !554, line: 40, baseType: !555)
!554 = !DIFile(filename: "libyasm/objfmt.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "8e7c18fd1d052962fbf061dcf70bcae9")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_objfmt_base", file: !554, line: 37, size: 64, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !555, file: !554, line: 39, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_objfmt_module", file: !554, line: 44, size: 960, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !569, !570, !571, !580, !584, !591, !595, !599, !603, !607}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !560, file: !554, line: 46, baseType: !145, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "keyword", scope: !560, file: !554, line: 49, baseType: !145, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !560, file: !554, line: 54, baseType: !145, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "default_x86_mode_bits", scope: !560, file: !554, line: 59, baseType: !492, size: 8, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "id_at_ok", scope: !560, file: !554, line: 62, baseType: !492, size: 8, offset: 200)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dbgfmt_keywords", scope: !560, file: !554, line: 69, baseType: !568, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "default_dbgfmt_keyword", scope: !560, file: !554, line: 74, baseType: !145, size: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "directives", scope: !560, file: !554, line: 77, baseType: !149, size: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "stdmacs", scope: !560, file: !554, line: 80, baseType: !572, size: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_stdmac", file: !24, line: 68, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_stdmac", file: !24, line: 60, size: 192, elements: !576)
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !575, file: !24, line: 61, baseType: !145, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "preproc", scope: !575, file: !24, line: 62, baseType: !145, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "macros", scope: !575, file: !24, line: 67, baseType: !568, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !560, file: !554, line: 89, baseType: !581, size: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!177, !160}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !560, file: !554, line: 94, baseType: !585, size: 64, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !160, !236, !205, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_errwarns", file: !24, line: 90, baseType: !590)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_errwarns", file: !24, line: 90, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !560, file: !554, line: 100, baseType: !592, size: 64, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !177}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "add_default_section", scope: !560, file: !554, line: 105, baseType: !596, size: 64, offset: 704)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!185, !160}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "init_new_section", scope: !560, file: !554, line: 110, baseType: !600, size: 64, offset: 768)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !185, !202}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "section_switch", scope: !560, file: !554, line: 116, baseType: !604, size: 64, offset: 832)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!185, !160, !426, !426, !202}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "get_special_sym", scope: !560, file: !554, line: 124, baseType: !608, size: 64, offset: 896)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!335, !160, !145, !145}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_dbgfmt_base", file: !613, line: 40, baseType: !614)
!613 = !DIFile(filename: "libyasm/dbgfmt.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "7a63e9e5d68a274fccf929049b351cb9")
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_dbgfmt_base", file: !613, line: 37, size: 64, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !614, file: !613, line: 39, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_dbgfmt_module", file: !613, line: 44, size: 384, elements: !620)
!620 = !{!621, !622, !623, !624, !628, !632}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !619, file: !613, line: 46, baseType: !145, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "keyword", scope: !619, file: !613, line: 49, baseType: !145, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "directives", scope: !619, file: !613, line: 52, baseType: !149, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !619, file: !613, line: 60, baseType: !625, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!181, !160}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !619, file: !613, line: 65, baseType: !629, size: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !181}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "generate", scope: !619, file: !613, line: 70, baseType: !633, size: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !160, !636, !588}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_linemap", file: !24, line: 192, baseType: !638)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_linemap", file: !24, line: 192, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "optimize_data", file: !2, line: 888, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "optimize_data", file: !2, line: 879, size: 768, elements: !642)
!642 = !{!643, !703, !708, !709, !741, !747, !748, !749}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "spans", scope: !641, file: !2, line: 880, baseType: !644, size: 128)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_span_head", file: !2, line: 880, size: 128, elements: !645)
!645 = !{!646, !702}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !644, file: !2, line: 880, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_span", file: !2, line: 844, size: 1280, elements: !649)
!649 = !{!650, !656, !660, !661, !662, !675, !676, !678, !679, !680, !681, !682, !683, !684, !685, !687, !688}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !648, file: !2, line: 845, baseType: !651, size: 128)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !648, file: !2, line: 845, size: 128, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !651, file: !2, line: 845, baseType: !647, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !651, file: !2, line: 845, baseType: !655, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "linkq", scope: !648, file: !2, line: 846, baseType: !657, size: 64, offset: 128)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !648, file: !2, line: 846, size: 64, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !657, file: !2, line: 846, baseType: !647, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !648, file: !2, line: 848, baseType: !295, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "depval", scope: !648, file: !2, line: 850, baseType: !311, size: 256, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rel_term", scope: !648, file: !2, line: 853, baseType: !663, size: 64, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_span_term", file: !2, line: 842, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_span_term", file: !2, line: 837, size: 384, elements: !666)
!666 = !{!667, !668, !669, !672, !673, !674}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "precbc", scope: !665, file: !2, line: 838, baseType: !295, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "precbc2", scope: !665, file: !2, line: 838, baseType: !295, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !665, file: !2, line: 839, baseType: !670, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_span", file: !2, line: 825, baseType: !648)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cur_val", scope: !665, file: !2, line: 840, baseType: !264, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "new_val", scope: !665, file: !2, line: 840, baseType: !264, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "subst", scope: !665, file: !2, line: 841, baseType: !25, size: 32, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "terms", scope: !648, file: !2, line: 855, baseType: !663, size: 64, offset: 576)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !648, file: !2, line: 856, baseType: !677, size: 64, offset: 640)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "num_terms", scope: !648, file: !2, line: 857, baseType: !25, size: 32, offset: 704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cur_val", scope: !648, file: !2, line: 859, baseType: !264, size: 64, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "new_val", scope: !648, file: !2, line: 860, baseType: !264, size: 64, offset: 832)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "neg_thres", scope: !648, file: !2, line: 862, baseType: !264, size: 64, offset: 896)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pos_thres", scope: !648, file: !2, line: 863, baseType: !264, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !648, file: !2, line: 865, baseType: !205, size: 32, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !648, file: !2, line: 867, baseType: !205, size: 32, offset: 1056)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "backtrace", scope: !648, file: !2, line: 872, baseType: !686, size: 64, offset: 1088)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "backtrace_size", scope: !648, file: !2, line: 873, baseType: !205, size: 32, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !648, file: !2, line: 876, baseType: !689, size: 64, offset: 1216)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_offset_setter", file: !2, line: 835, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_offset_setter", file: !2, line: 827, size: 320, elements: !692)
!692 = !{!693, !698, !699, !700, !701}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !691, file: !2, line: 829, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !691, file: !2, line: 829, size: 64, elements: !695)
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !694, file: !2, line: 829, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !691, file: !2, line: 831, baseType: !295, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "cur_val", scope: !691, file: !2, line: 833, baseType: !202, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "new_val", scope: !691, file: !2, line: 833, baseType: !202, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "thres", scope: !691, file: !2, line: 834, baseType: !202, size: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !644, file: !2, line: 880, baseType: !655, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "QA", scope: !641, file: !2, line: 881, baseType: !704, size: 128, offset: 128)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_span_shead", file: !2, line: 881, size: 128, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !704, file: !2, line: 881, baseType: !647, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !704, file: !2, line: 881, baseType: !655, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "QB", scope: !641, file: !2, line: 881, baseType: !704, size: 128, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "itree", scope: !641, file: !2, line: 882, baseType: !710, size: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "IntervalTree", file: !712, line: 49, baseType: !713)
!712 = !DIFile(filename: "libyasm/inttree.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "9bea31d3dc25a249189ad53ace1ed5a0")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IntervalTree", file: !712, line: 33, size: 320, elements: !714)
!714 = !{!715, !729, !730, !731, !739, !740}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !713, file: !712, line: 41, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "IntervalTreeNode", file: !712, line: 21, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IntervalTreeNode", file: !712, line: 14, size: 512, elements: !719)
!719 = !{!720, !722, !723, !724, !725, !726, !727, !728}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !718, file: !712, line: 15, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !718, file: !712, line: 15, baseType: !721, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !718, file: !712, line: 15, baseType: !721, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !718, file: !712, line: 16, baseType: !229, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !718, file: !712, line: 17, baseType: !264, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !718, file: !712, line: 18, baseType: !264, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "maxHigh", scope: !718, file: !712, line: 19, baseType: !264, size: 64, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !718, file: !712, line: 20, baseType: !205, size: 32, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "nil", scope: !713, file: !712, line: 42, baseType: !716, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "recursionNodeStackSize", scope: !713, file: !712, line: 45, baseType: !25, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "recursionNodeStack", scope: !713, file: !712, line: 46, baseType: !732, size: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "it_recursion_node", file: !712, line: 31, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "it_recursion_node", file: !712, line: 23, size: 128, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !734, file: !712, line: 28, baseType: !716, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "parentIndex", scope: !734, file: !712, line: 29, baseType: !25, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tryRightBranch", scope: !734, file: !712, line: 30, baseType: !205, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "currentParent", scope: !713, file: !712, line: 47, baseType: !25, size: 32, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "recursionNodeStackTop", scope: !713, file: !712, line: 48, baseType: !25, size: 32, offset: 288)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "offset_setters", scope: !641, file: !2, line: 884, baseType: !742, size: 128, offset: 448)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "offset_setters_head", file: !2, line: 883, size: 128, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !742, file: !2, line: 883, baseType: !697, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !742, file: !2, line: 883, baseType: !746, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "len_diff", scope: !641, file: !2, line: 885, baseType: !264, size: 64, offset: 576)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !641, file: !2, line: 886, baseType: !670, size: 64, offset: 640)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !641, file: !2, line: 887, baseType: !689, size: 64, offset: 704)
!750 = !{!0, !7, !12, !17, !751, !756, !761, !763, !768, !773, !778, !783, !788, !793, !798, !803, !808, !813, !818, !823, !828, !830, !835, !837, !842, !844, !846, !848, !19, !850, !855, !857, !862, !864}
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !2, line: 501, type: !753, isLocal: true, isDefinition: true)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 18)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !2, line: 506, type: !758, isLocal: true, isDefinition: true)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 13)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !2, line: 571, type: !753, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !2, line: 571, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 41)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !2, line: 573, type: !770, isLocal: true, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 46)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !2, line: 703, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 11)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !2, line: 707, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 12)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !2, line: 710, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 21)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !2, line: 717, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 15)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !2, line: 720, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 19)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1350, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 55)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1384, type: !805, isLocal: true, isDefinition: true)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 49)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1418, type: !810, isLocal: true, isDefinition: true)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 32)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1553, type: !815, isLocal: true, isDefinition: true)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 34)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !820, isLocal: true, isDefinition: true)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 8)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !825, isLocal: true, isDefinition: true)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 4)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !820, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !832, isLocal: true, isDefinition: true)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 7)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !2, line: 167, type: !832, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !2, line: 167, type: !839, isLocal: true, isDefinition: true)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 5)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !2, line: 168, type: !832, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !832, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !2, line: 170, type: !820, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !820, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !852, isLocal: true, isDefinition: true)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 36)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !832, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !859, isLocal: true, isDefinition: true)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 35)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !820, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !2, line: 977, type: !866, isLocal: true, isDefinition: true)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 28)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 2304, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 9)
!872 = !{i32 7, !"Dwarf Version", i32 5}
!873 = !{i32 2, !"Debug Info Version", i32 3}
!874 = !{i32 1, !"wchar_size", i32 4}
!875 = !{i32 8, !"PIC Level", i32 2}
!876 = !{i32 7, !"PIE Level", i32 2}
!877 = !{i32 7, !"uwtable", i32 2}
!878 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!879 = distinct !DISubprogram(name: "yasm_object_create", scope: !2, file: !2, line: 214, type: !880, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !21, retainedNodes: !888)
!880 = !DISubroutineType(types: !881)
!881 = !{!160, !145, !145, !173, !882, !885}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_objfmt_module", file: !24, line: 51, baseType: !560)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_dbgfmt_module", file: !24, line: 53, baseType: !619)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897}
!889 = !DILocalVariable(name: "src_filename", arg: 1, scope: !879, file: !2, line: 214, type: !145)
!890 = !DILocalVariable(name: "obj_filename", arg: 2, scope: !879, file: !2, line: 214, type: !145)
!891 = !DILocalVariable(name: "arch", arg: 3, scope: !879, file: !2, line: 215, type: !173)
!892 = !DILocalVariable(name: "objfmt_module", arg: 4, scope: !879, file: !2, line: 216, type: !882)
!893 = !DILocalVariable(name: "dbgfmt_module", arg: 5, scope: !879, file: !2, line: 217, type: !885)
!894 = !DILocalVariable(name: "object", scope: !879, file: !2, line: 219, type: !160)
!895 = !DILocalVariable(name: "matched", scope: !879, file: !2, line: 220, type: !205)
!896 = !DILocalVariable(name: "i", scope: !879, file: !2, line: 220, type: !205)
!897 = !DILabel(scope: !879, name: "error", file: !2, line: 299)
!898 = !{!899, !899, i64 0}
!899 = !{!"any pointer", !900, i64 0}
!900 = !{!"omnipotent char", !901, i64 0}
!901 = !{!"Simple C/C++ TBAA"}
!902 = !DILocation(line: 214, column: 32, scope: !879)
!903 = !DILocation(line: 214, column: 58, scope: !879)
!904 = !DILocation(line: 215, column: 42, scope: !879)
!905 = !DILocation(line: 216, column: 46, scope: !879)
!906 = !DILocation(line: 217, column: 46, scope: !879)
!907 = !DILocation(line: 219, column: 5, scope: !879)
!908 = !DILocation(line: 219, column: 18, scope: !879)
!909 = !DILocation(line: 219, column: 27, scope: !879)
!910 = !DILocation(line: 220, column: 5, scope: !879)
!911 = !DILocation(line: 220, column: 9, scope: !879)
!912 = !DILocation(line: 220, column: 18, scope: !879)
!913 = !DILocation(line: 222, column: 42, scope: !879)
!914 = !DILocation(line: 222, column: 28, scope: !879)
!915 = !DILocation(line: 222, column: 5, scope: !879)
!916 = !DILocation(line: 222, column: 13, scope: !879)
!917 = !DILocation(line: 222, column: 26, scope: !879)
!918 = !{!919, !899, i64 0}
!919 = !{!"yasm_object", !899, i64 0, !899, i64 8, !899, i64 16, !899, i64 24, !899, i64 32, !899, i64 40, !899, i64 48, !920, i64 56, !899, i64 72, !899, i64 80, !899, i64 88}
!920 = !{!"yasm_sectionhead", !899, i64 0, !899, i64 8}
!921 = !DILocation(line: 223, column: 42, scope: !879)
!922 = !DILocation(line: 223, column: 28, scope: !879)
!923 = !DILocation(line: 223, column: 5, scope: !879)
!924 = !DILocation(line: 223, column: 13, scope: !879)
!925 = !DILocation(line: 223, column: 26, scope: !879)
!926 = !{!919, !899, i64 8}
!927 = !DILocation(line: 226, column: 29, scope: !879)
!928 = !DILocation(line: 226, column: 5, scope: !879)
!929 = !DILocation(line: 226, column: 13, scope: !879)
!930 = !DILocation(line: 226, column: 27, scope: !879)
!931 = !{!919, !899, i64 80}
!932 = !DILocation(line: 227, column: 29, scope: !879)
!933 = !DILocation(line: 227, column: 5, scope: !879)
!934 = !DILocation(line: 227, column: 13, scope: !879)
!935 = !DILocation(line: 227, column: 27, scope: !879)
!936 = !{!919, !899, i64 88}
!937 = !DILocation(line: 230, column: 22, scope: !879)
!938 = !DILocation(line: 230, column: 5, scope: !879)
!939 = !DILocation(line: 230, column: 13, scope: !879)
!940 = !DILocation(line: 230, column: 20, scope: !879)
!941 = !{!919, !899, i64 16}
!942 = !DILocation(line: 233, column: 5, scope: !879)
!943 = !DILocation(line: 233, column: 5, scope: !944)
!944 = distinct !DILexicalBlock(scope: !879, file: !2, line: 233, column: 5)
!945 = !{!919, !899, i64 56}
!946 = !{!919, !899, i64 64}
!947 = !DILocation(line: 236, column: 41, scope: !879)
!948 = !DILocation(line: 236, column: 26, scope: !879)
!949 = !DILocation(line: 236, column: 5, scope: !879)
!950 = !DILocation(line: 236, column: 13, scope: !879)
!951 = !DILocation(line: 236, column: 24, scope: !879)
!952 = !{!919, !899, i64 72}
!953 = !DILocation(line: 239, column: 20, scope: !879)
!954 = !DILocation(line: 239, column: 5, scope: !879)
!955 = !DILocation(line: 239, column: 13, scope: !879)
!956 = !DILocation(line: 239, column: 18, scope: !879)
!957 = !{!919, !899, i64 24}
!958 = !DILocation(line: 242, column: 5, scope: !879)
!959 = !DILocation(line: 242, column: 13, scope: !879)
!960 = !DILocation(line: 242, column: 20, scope: !879)
!961 = !{!919, !899, i64 40}
!962 = !DILocation(line: 245, column: 22, scope: !879)
!963 = !{!964, !899, i64 64}
!964 = !{!"yasm_objfmt_module", !899, i64 0, !899, i64 8, !899, i64 16, !900, i64 24, !900, i64 25, !899, i64 32, !899, i64 40, !899, i64 48, !899, i64 56, !899, i64 64, !899, i64 72, !899, i64 80, !899, i64 88, !899, i64 96, !899, i64 104, !899, i64 112}
!965 = !DILocation(line: 245, column: 5, scope: !879)
!966 = !DILocation(line: 245, column: 13, scope: !879)
!967 = !DILocation(line: 245, column: 20, scope: !879)
!968 = !{!919, !899, i64 32}
!969 = !DILocation(line: 246, column: 10, scope: !970)
!970 = distinct !DILexicalBlock(scope: !879, file: !2, line: 246, column: 9)
!971 = !DILocation(line: 246, column: 18, scope: !970)
!972 = !DILocation(line: 246, column: 9, scope: !879)
!973 = !DILocation(line: 249, column: 13, scope: !974)
!974 = distinct !DILexicalBlock(scope: !970, file: !2, line: 246, column: 26)
!975 = !DILocation(line: 249, column: 28, scope: !974)
!976 = !{!964, !899, i64 8}
!977 = !DILocation(line: 249, column: 56, scope: !974)
!978 = !DILocation(line: 249, column: 63, scope: !974)
!979 = !{!980, !899, i64 0}
!980 = !{!"yasm_arch_base", !899, i64 0}
!981 = !DILocation(line: 249, column: 71, scope: !974)
!982 = !{!983, !899, i64 8}
!983 = !{!"yasm_arch_module", !899, i64 0, !899, i64 8, !899, i64 16, !899, i64 24, !899, i64 32, !899, i64 40, !899, i64 48, !899, i64 56, !899, i64 64, !899, i64 72, !899, i64 80, !899, i64 88, !899, i64 96, !899, i64 104, !899, i64 112, !899, i64 120, !899, i64 128, !899, i64 136, !899, i64 144, !899, i64 152, !899, i64 160, !899, i64 168, !899, i64 176, !984, i64 184, !984, i64 188}
!984 = !{!"int", !900, i64 0}
!985 = !DILocation(line: 250, column: 13, scope: !974)
!986 = !{!983, !899, i64 40}
!987 = !DILocation(line: 247, column: 9, scope: !974)
!988 = !DILocation(line: 251, column: 9, scope: !974)
!989 = !DILocation(line: 255, column: 42, scope: !879)
!990 = !DILocation(line: 255, column: 50, scope: !879)
!991 = !DILocation(line: 255, column: 59, scope: !879)
!992 = !{!993, !899, i64 0}
!993 = !{!"yasm_objfmt_base", !899, i64 0}
!994 = !DILocation(line: 255, column: 19, scope: !879)
!995 = !DILocation(line: 258, column: 27, scope: !879)
!996 = !{!964, !899, i64 88}
!997 = !DILocation(line: 258, column: 5, scope: !879)
!998 = !DILocation(line: 258, column: 13, scope: !879)
!999 = !DILocation(line: 258, column: 25, scope: !879)
!1000 = !{!919, !899, i64 48}
!1001 = !DILocation(line: 263, column: 13, scope: !879)
!1002 = !{!984, !984, i64 0}
!1003 = !DILocation(line: 264, column: 11, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !879, file: !2, line: 264, column: 5)
!1005 = !DILocation(line: 264, column: 10, scope: !1004)
!1006 = !DILocation(line: 264, column: 15, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1004, file: !2, line: 264, column: 5)
!1008 = !DILocation(line: 264, column: 30, scope: !1007)
!1009 = !{!964, !899, i64 32}
!1010 = !DILocation(line: 264, column: 46, scope: !1007)
!1011 = !DILocation(line: 264, column: 5, scope: !1004)
!1012 = !DILocation(line: 265, column: 13, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !2, line: 265, column: 13)
!1014 = distinct !DILexicalBlock(scope: !1007, file: !2, line: 264, column: 55)
!1015 = !{!1016, !899, i64 8}
!1016 = !{!"yasm_dbgfmt_module", !899, i64 0, !899, i64 8, !899, i64 16, !899, i64 24, !899, i64 32, !899, i64 40}
!1017 = !DILocation(line: 266, column: 54, scope: !1013)
!1018 = !DILocation(line: 265, column: 13, scope: !1014)
!1019 = !DILocation(line: 267, column: 21, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1013, file: !2, line: 266, column: 60)
!1021 = !DILocation(line: 268, column: 13, scope: !1020)
!1022 = !DILocation(line: 270, column: 5, scope: !1014)
!1023 = !DILocation(line: 264, column: 51, scope: !1007)
!1024 = !DILocation(line: 264, column: 5, scope: !1007)
!1025 = distinct !{!1025, !1011, !1026, !1027}
!1026 = !DILocation(line: 270, column: 5, scope: !1004)
!1027 = !{!"llvm.loop.mustprogress"}
!1028 = !DILocation(line: 272, column: 10, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !879, file: !2, line: 272, column: 9)
!1030 = !DILocation(line: 272, column: 9, scope: !879)
!1031 = !DILocation(line: 275, column: 13, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 272, column: 19)
!1033 = !DILocation(line: 275, column: 28, scope: !1032)
!1034 = !DILocation(line: 275, column: 37, scope: !1032)
!1035 = !DILocation(line: 275, column: 52, scope: !1032)
!1036 = !DILocation(line: 273, column: 9, scope: !1032)
!1037 = !DILocation(line: 276, column: 9, scope: !1032)
!1038 = !DILocation(line: 280, column: 22, scope: !879)
!1039 = !{!1016, !899, i64 24}
!1040 = !DILocation(line: 280, column: 5, scope: !879)
!1041 = !DILocation(line: 280, column: 13, scope: !879)
!1042 = !DILocation(line: 280, column: 20, scope: !879)
!1043 = !DILocation(line: 281, column: 10, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !879, file: !2, line: 281, column: 9)
!1045 = !DILocation(line: 281, column: 18, scope: !1044)
!1046 = !DILocation(line: 281, column: 9, scope: !879)
!1047 = !DILocation(line: 284, column: 13, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1044, file: !2, line: 281, column: 26)
!1049 = !DILocation(line: 284, column: 28, scope: !1048)
!1050 = !DILocation(line: 284, column: 37, scope: !1048)
!1051 = !DILocation(line: 284, column: 52, scope: !1048)
!1052 = !DILocation(line: 282, column: 9, scope: !1048)
!1053 = !DILocation(line: 285, column: 9, scope: !1048)
!1054 = !DILocation(line: 289, column: 20, scope: !879)
!1055 = !DILocation(line: 290, column: 41, scope: !879)
!1056 = !DILocation(line: 290, column: 49, scope: !879)
!1057 = !DILocation(line: 290, column: 58, scope: !879)
!1058 = !DILocation(line: 290, column: 66, scope: !879)
!1059 = !{!964, !899, i64 48}
!1060 = !DILocation(line: 289, column: 5, scope: !879)
!1061 = !DILocation(line: 291, column: 20, scope: !879)
!1062 = !DILocation(line: 292, column: 41, scope: !879)
!1063 = !DILocation(line: 292, column: 49, scope: !879)
!1064 = !DILocation(line: 292, column: 58, scope: !879)
!1065 = !{!1066, !899, i64 0}
!1066 = !{!"yasm_dbgfmt_base", !899, i64 0}
!1067 = !DILocation(line: 292, column: 66, scope: !879)
!1068 = !{!1016, !899, i64 16}
!1069 = !DILocation(line: 291, column: 5, scope: !879)
!1070 = !DILocation(line: 293, column: 20, scope: !879)
!1071 = !DILocation(line: 294, column: 39, scope: !879)
!1072 = !DILocation(line: 294, column: 47, scope: !879)
!1073 = !DILocation(line: 294, column: 54, scope: !879)
!1074 = !DILocation(line: 294, column: 62, scope: !879)
!1075 = !{!983, !899, i64 16}
!1076 = !DILocation(line: 293, column: 5, scope: !879)
!1077 = !DILocation(line: 295, column: 20, scope: !879)
!1078 = !DILocation(line: 295, column: 5, scope: !879)
!1079 = !DILocation(line: 297, column: 12, scope: !879)
!1080 = !DILocation(line: 297, column: 5, scope: !879)
!1081 = !DILocation(line: 299, column: 1, scope: !879)
!1082 = !DILocation(line: 300, column: 25, scope: !879)
!1083 = !DILocation(line: 300, column: 5, scope: !879)
!1084 = !DILocation(line: 301, column: 5, scope: !879)
!1085 = !DILocation(line: 302, column: 1, scope: !879)
!1086 = !DISubprogram(name: "yasm__xstrdup", scope: !24, file: !24, line: 343, type: !1087, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!166, !145}
!1089 = !DISubprogram(name: "yasm_symtab_create", scope: !127, file: !127, line: 62, type: !1090, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!169}
!1092 = !DISubprogram(name: "HAMT_create", scope: !423, file: !423, line: 49, type: !1093, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!1095, !205, !1097}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAMT", file: !423, line: 38, baseType: !422)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{null, !145, !25, !145}
!1100 = !DISubprogram(name: "yasm_error_set", scope: !90, file: !90, line: 162, type: !1101, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null, !1103, !145, null}
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_error_class", file: !90, line: 68, baseType: !89)
!1104 = !DISubprogram(name: "strcasecmp", scope: !1105, file: !1105, line: 116, type: !1106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1105 = !DIFile(filename: "/usr/include/strings.h", directory: "", checksumkind: CSK_MD5, checksum: "7444da68ad94ab9f25ff447750787173")
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!205, !145, !145}
!1108 = distinct !DISubprogram(name: "directives_add", scope: !2, file: !2, line: 188, type: !1109, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !21, retainedNodes: !1111)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null, !160, !149}
!1111 = !{!1112, !1113, !1114, !1116, !1117}
!1112 = !DILocalVariable(name: "object", arg: 1, scope: !1108, file: !2, line: 188, type: !160)
!1113 = !DILocalVariable(name: "dir", arg: 2, scope: !1108, file: !2, line: 188, type: !149)
!1114 = !DILocalVariable(name: "level2", scope: !1115, file: !2, line: 194, type: !1095)
!1115 = distinct !DILexicalBlock(scope: !1108, file: !2, line: 193, column: 23)
!1116 = !DILocalVariable(name: "replace", scope: !1115, file: !2, line: 195, type: !205)
!1117 = !DILocalVariable(name: "wrap", scope: !1115, file: !2, line: 196, type: !1118)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_directive_wrap", file: !2, line: 87, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_directive_wrap", file: !2, line: 85, size: 64, elements: !1121)
!1121 = !{!1122}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !1120, file: !2, line: 86, baseType: !149, size: 64)
!1123 = !DILocation(line: 188, column: 29, scope: !1108)
!1124 = !DILocation(line: 188, column: 70, scope: !1108)
!1125 = !DILocation(line: 190, column: 10, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1108, file: !2, line: 190, column: 9)
!1127 = !DILocation(line: 190, column: 9, scope: !1108)
!1128 = !DILocation(line: 191, column: 9, scope: !1126)
!1129 = !DILocation(line: 193, column: 5, scope: !1108)
!1130 = !DILocation(line: 193, column: 12, scope: !1108)
!1131 = !DILocation(line: 193, column: 17, scope: !1108)
!1132 = !{!1133, !899, i64 0}
!1133 = !{!"yasm_directive", !899, i64 0, !899, i64 8, !899, i64 16, !900, i64 24}
!1134 = !DILocation(line: 194, column: 9, scope: !1115)
!1135 = !DILocation(line: 194, column: 15, scope: !1115)
!1136 = !DILocation(line: 194, column: 36, scope: !1115)
!1137 = !DILocation(line: 194, column: 44, scope: !1115)
!1138 = !DILocation(line: 194, column: 56, scope: !1115)
!1139 = !DILocation(line: 194, column: 61, scope: !1115)
!1140 = !{!1133, !899, i64 8}
!1141 = !DILocation(line: 194, column: 24, scope: !1115)
!1142 = !DILocation(line: 195, column: 9, scope: !1115)
!1143 = !DILocation(line: 195, column: 13, scope: !1115)
!1144 = !DILocation(line: 196, column: 9, scope: !1115)
!1145 = !DILocation(line: 196, column: 30, scope: !1115)
!1146 = !DILocation(line: 196, column: 37, scope: !1115)
!1147 = !DILocation(line: 198, column: 14, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1115, file: !2, line: 198, column: 13)
!1149 = !DILocation(line: 198, column: 13, scope: !1115)
!1150 = !DILocation(line: 199, column: 21, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1148, file: !2, line: 198, column: 22)
!1152 = !DILocation(line: 200, column: 34, scope: !1151)
!1153 = !DILocation(line: 200, column: 42, scope: !1151)
!1154 = !DILocation(line: 200, column: 54, scope: !1151)
!1155 = !DILocation(line: 200, column: 59, scope: !1151)
!1156 = !DILocation(line: 201, column: 49, scope: !1151)
!1157 = !DILocation(line: 201, column: 34, scope: !1151)
!1158 = !DILocation(line: 200, column: 22, scope: !1151)
!1159 = !DILocation(line: 200, column: 20, scope: !1151)
!1160 = !DILocation(line: 203, column: 9, scope: !1151)
!1161 = !DILocation(line: 204, column: 17, scope: !1115)
!1162 = !DILocation(line: 205, column: 27, scope: !1115)
!1163 = !DILocation(line: 205, column: 9, scope: !1115)
!1164 = !DILocation(line: 205, column: 15, scope: !1115)
!1165 = !DILocation(line: 205, column: 25, scope: !1115)
!1166 = !{!1167, !899, i64 0}
!1167 = !{!"yasm_directive_wrap", !899, i64 0}
!1168 = !DILocation(line: 206, column: 21, scope: !1115)
!1169 = !DILocation(line: 206, column: 29, scope: !1115)
!1170 = !DILocation(line: 206, column: 34, scope: !1115)
!1171 = !DILocation(line: 206, column: 40, scope: !1115)
!1172 = !DILocation(line: 206, column: 9, scope: !1115)
!1173 = !DILocation(line: 208, column: 12, scope: !1115)
!1174 = !DILocation(line: 209, column: 5, scope: !1108)
!1175 = distinct !{!1175, !1129, !1174, !1027}
!1176 = !DILocation(line: 210, column: 1, scope: !1108)
!1177 = distinct !DISubprogram(name: "yasm_object_destroy", scope: !2, file: !2, line: 454, type: !1178, scopeLine: 455, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !21, retainedNodes: !1180)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{null, !160}
!1180 = !{!1181, !1182, !1183}
!1181 = !DILocalVariable(name: "object", arg: 1, scope: !1177, file: !2, line: 454, type: !160)
!1182 = !DILocalVariable(name: "cur", scope: !1177, file: !2, line: 456, type: !185)
!1183 = !DILocalVariable(name: "next", scope: !1177, file: !2, line: 456, type: !185)
!1184 = !DILocation(line: 454, column: 34, scope: !1177)
!1185 = !DILocation(line: 456, column: 5, scope: !1177)
!1186 = !DILocation(line: 456, column: 19, scope: !1177)
!1187 = !DILocation(line: 456, column: 25, scope: !1177)
!1188 = !DILocation(line: 461, column: 9, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1177, file: !2, line: 461, column: 9)
!1190 = !DILocation(line: 461, column: 17, scope: !1189)
!1191 = !DILocation(line: 461, column: 9, scope: !1177)
!1192 = !DILocation(line: 462, column: 9, scope: !1189)
!1193 = !{!964, !899, i64 80}
!1194 = !DILocation(line: 463, column: 9, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1177, file: !2, line: 463, column: 9)
!1196 = !DILocation(line: 463, column: 17, scope: !1195)
!1197 = !DILocation(line: 463, column: 9, scope: !1177)
!1198 = !DILocation(line: 464, column: 9, scope: !1195)
!1199 = !{!1016, !899, i64 32}
!1200 = !DILocation(line: 467, column: 11, scope: !1177)
!1201 = !DILocation(line: 467, column: 9, scope: !1177)
!1202 = !DILocation(line: 468, column: 5, scope: !1177)
!1203 = !DILocation(line: 468, column: 12, scope: !1177)
!1204 = !DILocation(line: 469, column: 16, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1177, file: !2, line: 468, column: 17)
!1206 = !{!1207, !899, i64 0}
!1207 = !{!"yasm_section", !1208, i64 0, !899, i64 8, !899, i64 16, !899, i64 24, !1209, i64 32, !1209, i64 40, !984, i64 48, !984, i64 52, !984, i64 56, !1210, i64 64, !1211, i64 80, !899, i64 96}
!1208 = !{!"", !899, i64 0}
!1209 = !{!"long", !900, i64 0}
!1210 = !{!"yasm_bytecodehead", !899, i64 0, !899, i64 8}
!1211 = !{!"yasm_relochead", !899, i64 0, !899, i64 8}
!1212 = !DILocation(line: 469, column: 14, scope: !1205)
!1213 = !DILocation(line: 470, column: 30, scope: !1205)
!1214 = !DILocation(line: 470, column: 9, scope: !1205)
!1215 = !DILocation(line: 471, column: 15, scope: !1205)
!1216 = !DILocation(line: 471, column: 13, scope: !1205)
!1217 = distinct !{!1217, !1202, !1218, !1027}
!1218 = !DILocation(line: 472, column: 5, scope: !1177)
!1219 = !DILocation(line: 475, column: 18, scope: !1177)
!1220 = !DILocation(line: 475, column: 26, scope: !1177)
!1221 = !DILocation(line: 475, column: 5, scope: !1177)
!1222 = !DILocation(line: 478, column: 5, scope: !1177)
!1223 = !DILocation(line: 478, column: 16, scope: !1177)
!1224 = !DILocation(line: 478, column: 24, scope: !1177)
!1225 = !DILocation(line: 479, column: 5, scope: !1177)
!1226 = !DILocation(line: 479, column: 16, scope: !1177)
!1227 = !DILocation(line: 479, column: 24, scope: !1177)
!1228 = !DILocation(line: 482, column: 5, scope: !1177)
!1229 = !DILocation(line: 482, column: 16, scope: !1177)
!1230 = !DILocation(line: 482, column: 24, scope: !1177)
!1231 = !DILocation(line: 483, column: 5, scope: !1177)
!1232 = !DILocation(line: 483, column: 16, scope: !1177)
!1233 = !DILocation(line: 483, column: 24, scope: !1177)
!1234 = !DILocation(line: 486, column: 25, scope: !1177)
!1235 = !DILocation(line: 486, column: 33, scope: !1177)
!1236 = !DILocation(line: 486, column: 5, scope: !1177)
!1237 = !DILocation(line: 489, column: 9, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1177, file: !2, line: 489, column: 9)
!1239 = !DILocation(line: 489, column: 17, scope: !1238)
!1240 = !DILocation(line: 489, column: 9, scope: !1177)
!1241 = !DILocation(line: 490, column: 9, scope: !1238)
!1242 = !{!983, !899, i64 32}
!1243 = !DILocation(line: 492, column: 5, scope: !1177)
!1244 = !DILocation(line: 492, column: 16, scope: !1177)
!1245 = !DILocation(line: 493, column: 1, scope: !1177)
!1246 = distinct !DISubprogram(name: "yasm_object_get_general", scope: !2, file: !2, line: 307, type: !1247, scopeLine: 310, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !21, retainedNodes: !1250)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!185, !160, !145, !202, !205, !205, !1249, !202}
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!1250 = !{!1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259}
!1251 = !DILocalVariable(name: "object", arg: 1, scope: !1246, file: !2, line: 307, type: !160)
!1252 = !DILocalVariable(name: "name", arg: 2, scope: !1246, file: !2, line: 307, type: !145)
!1253 = !DILocalVariable(name: "align", arg: 3, scope: !1246, file: !2, line: 308, type: !202)
!1254 = !DILocalVariable(name: "code", arg: 4, scope: !1246, file: !2, line: 308, type: !205)
!1255 = !DILocalVariable(name: "res_only", arg: 5, scope: !1246, file: !2, line: 308, type: !205)
!1256 = !DILocalVariable(name: "isnew", arg: 6, scope: !1246, file: !2, line: 309, type: !1249)
!1257 = !DILocalVariable(name: "line", arg: 7, scope: !1246, file: !2, line: 309, type: !202)
!1258 = !DILocalVariable(name: "s", scope: !1246, file: !2, line: 311, type: !185)
!1259 = !DILocalVariable(name: "bc", scope: !1246, file: !2, line: 312, type: !295)
!1260 = !DILocation(line: 307, column: 38, scope: !1246)
!1261 = !DILocation(line: 307, column: 58, scope: !1246)
!1262 = !{!1209, !1209, i64 0}
!1263 = !DILocation(line: 308, column: 39, scope: !1246)
