; ModuleID = 'samples/198.bc'
source_filename = "rdkafka_broker.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rd_atomic32_t = type { i32 }
%struct.rd_kafka_pid_s = type { i64, i16 }
%struct.rd_kafka_ApiVersion = type { i16, i16, i16 }
%struct.rd_kafka_broker_s = type { %struct.anon, i32, ptr, i64, ptr, ptr, i32, i32, ptr, %union.mtx_t, i32, %struct.anon.0, i32, %struct.anon.1, i32, ptr, ptr, i64, i32, i32, i64, %struct.rd_interval_s, %struct.rd_atomic32_t, i32, ptr, i64, %struct.rd_interval_s, i32, %struct.anon.2, i32, i64, %struct.rd_atomic32_t, ptr, ptr, i32, %struct.rd_kafka_bufq_s, %struct.rd_kafka_bufq_s, %struct.rd_kafka_bufq_s, %struct.rd_avg_s, %struct.rd_avg_s, %struct.rd_avg_s, %struct.rd_avg_s, [256 x i8], [256 x i8], i16, ptr, i32, i32, ptr, %union.mtx_t, [2 x i32], i32, i64, i64, i8, %struct.anon.6, %struct.anon.7, %struct.rd_kafka_broker_monitor_s, i32, i32, %struct.anon.9, %struct.anon.10, %struct.rd_kafka_timer_s }
%struct.anon = type { ptr, ptr }
%struct.anon.0 = type { ptr, ptr }
%struct.anon.1 = type { ptr, ptr }
%struct.rd_interval_s = type { i64, i64, i32 }

!235 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_UNSUPPORTED_FOR_MESSAGE_FORMAT", value: 43)
!236 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_POLICY_VIOLATION", value: 44)
!237 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_OUT_OF_ORDER_SEQUENCE_NUMBER", value: 45)
!238 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_DUPLICATE_SEQUENCE_NUMBER", value: 46)
!239 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_INVALID_PRODUCER_EPOCH", value: 47)
!240 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_INVALID_TXN_STATE", value: 48)
!241 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_INVALID_PRODUCER_ID_MAPPING", value: 49)
!242 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_INVALID_TRANSACTION_TIMEOUT", value: 50)
!243 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_CONCURRENT_TRANSACTIONS", value: 51)
!244 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_TRANSACTION_COORDINATOR_FENCED", value: 52)
!245 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_TRANSACTIONAL_ID_AUTHORIZATION_FAILED", value: 53)
!246 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_SECURITY_DISABLED", value: 54)
!247 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_OPERATION_NOT_ATTEMPTED", value: 55)
!248 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_KAFKA_STORAGE_ERROR", value: 56)
!249 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_LOG_DIR_NOT_FOUND", value: 57)
!250 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_SASL_AUTHENTICATION_FAILED", value: 58)
!251 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_UNKNOWN_PRODUCER_ID", value: 59)
!252 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_REASSIGNMENT_IN_PROGRESS", value: 60)
!253 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_DELEGATION_TOKEN_AUTH_DISABLED", value: 61)
!254 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_DELEGATION_TOKEN_NOT_FOUND", value: 62)
!255 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_DELEGATION_TOKEN_OWNER_MISMATCH", value: 63)
!256 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_DELEGATION_TOKEN_REQUEST_NOT_ALLOWED", value: 64)
!257 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_DELEGATION_TOKEN_AUTHORIZATION_FAILED", value: 65)
!258 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_DELEGATION_TOKEN_EXPIRED", value: 66)
!259 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_INVALID_PRINCIPAL_TYPE", value: 67)
!260 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_NON_EMPTY_GROUP", value: 68)
!261 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_GROUP_ID_NOT_FOUND", value: 69)
!262 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_FETCH_SESSION_ID_NOT_FOUND", value: 70)
!263 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_INVALID_FETCH_SESSION_EPOCH", value: 71)
!264 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_LISTENER_NOT_FOUND", value: 72)
!265 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_TOPIC_DELETION_DISABLED", value: 73)
!266 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_FENCED_LEADER_EPOCH", value: 74)
!267 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_UNKNOWN_LEADER_EPOCH", value: 75)
!268 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_UNSUPPORTED_COMPRESSION_TYPE", value: 76)
!269 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_STALE_BROKER_EPOCH", value: 77)
!270 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_OFFSET_NOT_AVAILABLE", value: 78)
!271 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_MEMBER_ID_REQUIRED", value: 79)
!272 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_PREFERRED_LEADER_NOT_AVAILABLE", value: 80)
!273 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_GROUP_MAX_SIZE_REACHED", value: 81)
!274 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_FENCED_INSTANCE_ID", value: 82)
!275 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_ELIGIBLE_LEADERS_NOT_AVAILABLE", value: 83)
!276 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_ELECTION_NOT_NEEDED", value: 84)
!277 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_NO_REASSIGNMENT_IN_PROGRESS", value: 85)
!278 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_GROUP_SUBSCRIBED_TO_TOPIC", value: 86)
!279 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_INVALID_RECORD", value: 87)
!280 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_UNSTABLE_OFFSET_COMMIT", value: 88)
!281 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_THROTTLING_QUOTA_EXCEEDED", value: 89)
!282 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_PRODUCER_FENCED", value: 90)
!283 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_RESOURCE_NOT_FOUND", value: 91)
!284 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_DUPLICATE_RESOURCE", value: 92)
!285 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_UNACCEPTABLE_CREDENTIAL", value: 93)
!286 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_INCONSISTENT_VOTER_SET", value: 94)
!287 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_INVALID_UPDATE_VERSION", value: 95)
!288 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_FEATURE_UPDATE_FAILED", value: 96)
!289 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_PRINCIPAL_DESERIALIZATION_FAILURE", value: 97)
!290 = !DIEnumerator(name: "RD_KAFKA_RESP_ERR_END_ALL", value: 98)
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !58, line: 191, baseType: !59, size: 32, elements: !292)
!292 = !{!293, !294, !295, !296}
!293 = !DIEnumerator(name: "RD_KAFKA_PRIO_NORMAL", value: 0)
!294 = !DIEnumerator(name: "RD_KAFKA_PRIO_MEDIUM", value: 1)
!295 = !DIEnumerator(name: "RD_KAFKA_PRIO_HIGH", value: 2)
!296 = !DIEnumerator(name: "RD_KAFKA_PRIO_FLASH", value: 3)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !299, file: !298, line: 151, baseType: !59, size: 32, elements: !2688)
!298 = !DIFile(filename: "./rdkafka_topic.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "1f5fc7aee89e54db9140988662b38d35")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_topic_s", file: !298, line: 118, size: 8000, elements: !300)
!300 = !{!301, !305, !312, !324, !357, !367, !2651, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2661, !2662, !2663, !2664, !2665, !2666, !2667, !2669}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rkt_magic", scope: !299, file: !298, line: 119, baseType: !302, size: 32)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 4)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rkt_link", scope: !299, file: !298, line: 121, baseType: !306, size: 128, offset: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !298, line: 121, size: 128, elements: !307)
!307 = !{!308, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !306, file: !298, line: 121, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !306, file: !298, line: 121, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rkt_refcnt", scope: !299, file: !298, line: 123, baseType: !313, size: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_refcnt_t", file: !314, line: 285, baseType: !315)
!314 = !DIFile(filename: "./rd.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "0c57a7f8998af2a9e28b76545994ed9b")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_atomic32_t", file: !316, line: 38, baseType: !317)
!316 = !DIFile(filename: "./rdatomic.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "3e5a33c027301b1520f165fc3385980c")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 33, size: 32, elements: !318)
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !317, file: !316, line: 34, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !321, line: 26, baseType: !322)
!321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !323, line: 41, baseType: !126)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rkt_lock", scope: !299, file: !298, line: 125, baseType: !325, size: 448, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "rwlock_t", file: !326, line: 196, baseType: !327)
!326 = !DIFile(filename: "./tinycthread_extra.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "55e83ed2c312596cb38f44ee4ec056d4")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !328, line: 91, baseType: !329)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !328, line: 86, size: 448, elements: !330)
!330 = !{!331, !351, !355}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !329, file: !328, line: 88, baseType: !332, size: 448)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_rwlock_arch_t", file: !333, line: 23, size: 448, elements: !334)
!333 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_rwlock.h", directory: "", checksumkind: CSK_MD5, checksum: "2034038f4a99ff6cb7b9de3a3e8c2a8e")
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !345, !348, !350}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__readers", scope: !332, file: !333, line: 25, baseType: !59, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__writers", scope: !332, file: !333, line: 26, baseType: !59, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__wrphase_futex", scope: !332, file: !333, line: 27, baseType: !59, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__writers_futex", scope: !332, file: !333, line: 28, baseType: !59, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !332, file: !333, line: 29, baseType: !59, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !332, file: !333, line: 30, baseType: !59, size: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__cur_writer", scope: !332, file: !333, line: 32, baseType: !126, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !332, file: !333, line: 33, baseType: !126, size: 32, offset: 224)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !332, file: !333, line: 34, baseType: !344, size: 8, offset: 256)
!344 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !332, file: !333, line: 39, baseType: !346, size: 56, offset: 264)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 56, elements: !34)
!347 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !332, file: !333, line: 42, baseType: !349, size: 64, offset: 320)
!349 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !332, file: !333, line: 45, baseType: !59, size: 32, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !329, file: !328, line: 89, baseType: !352, size: 448)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 56)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !329, file: !328, line: 90, baseType: !356, size: 64)
!356 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rkt_topic", scope: !299, file: !298, line: 126, baseType: !358, size: 64, offset: 704)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafkap_str_t", file: !360, line: 240, baseType: !361)
!360 = !DIFile(filename: "./rdkafka_proto.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "8d032be8414e6cbfce8831cc1907b5f7")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafkap_str_s", file: !360, line: 235, size: 128, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !361, file: !360, line: 237, baseType: !126, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !361, file: !360, line: 238, baseType: !365, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rkt_ua", scope: !299, file: !298, line: 128, baseType: !368, size: 64, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_toppar_t", file: !58, line: 40, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_toppar_s", file: !371, line: 131, size: 9664, elements: !372)
!371 = !DIFile(filename: "./rdkafka_partition.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "dbbe5871eb12e632bb69df154df3008b")
!372 = !{!373, !380, !385, !390, !395, !400, !405, !408, !409, !410, !411, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2529, !2530, !2531, !2532, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2555, !2556, !2561, !2562, !2563, !2564, !2565, !2566, !2567, !2618, !2619, !2620, !2621, !2622, !2623, !2624, !2625, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2642}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_rklink", scope: !370, file: !371, line: 132, baseType: !374, size: 128)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !371, line: 132, size: 128, elements: !375)
!375 = !{!376, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !374, file: !371, line: 132, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !374, file: !371, line: 132, baseType: !379, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_rkblink", scope: !370, file: !371, line: 133, baseType: !381, size: 128, offset: 128)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !371, line: 133, size: 128, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !381, file: !371, line: 133, baseType: !377, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !381, file: !371, line: 133, baseType: !379, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_activelink", scope: !370, file: !371, line: 135, baseType: !386, size: 128, offset: 256)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !371, line: 134, size: 128, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "cqe_next", scope: !386, file: !371, line: 134, baseType: !377, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cqe_prev", scope: !386, file: !371, line: 134, baseType: !377, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_rktlink", scope: !370, file: !371, line: 136, baseType: !391, size: 128, offset: 384)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !371, line: 136, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !391, file: !371, line: 136, baseType: !377, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !391, file: !371, line: 136, baseType: !379, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_cgrplink", scope: !370, file: !371, line: 137, baseType: !396, size: 128, offset: 512)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !371, line: 137, size: 128, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !396, file: !371, line: 137, baseType: !377, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !396, file: !371, line: 137, baseType: !379, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_txnlink", scope: !370, file: !371, line: 139, baseType: !401, size: 128, offset: 640)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !371, line: 138, size: 128, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !401, file: !371, line: 138, baseType: !377, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !401, file: !371, line: 138, baseType: !379, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_rkt", scope: !370, file: !371, line: 142, baseType: !406, size: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_topic_t", file: !125, line: 253, baseType: !299)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_partition", scope: !370, file: !371, line: 143, baseType: !320, size: 32, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_leader_id", scope: !370, file: !371, line: 146, baseType: !320, size: 32, offset: 864)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_broker_id", scope: !370, file: !371, line: 149, baseType: !320, size: 32, offset: 896)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rktp_leader", scope: !370, file: !371, line: 150, baseType: !412, size: 64, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_broker_t", file: !414, line: 38, baseType: !415)
!414 = !DIFile(filename: "./rdkafka_buf.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "0acc89a5589ec9a3fd914d1250fb736f")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_broker_s", file: !416, line: 82, size: 25472, elements: !417)
!416 = !DIFile(filename: "./rdkafka_broker.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "aeb38d58b4253d3e312d2957db2737f5")
!417 = !{!418, !425, !426, !486, !491, !494, !500, !501, !502, !2304, !2305, !2306, !2311, !2312, !2317, !2318, !2319, !2322, !2323, !2324, !2340, !2341, !2342, !2343, !2344, !2351, !2352, !2353, !2361, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2402, !2403, !2404, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2474, !2475, !2476, !2477, !2478, !2483, !2488, !2489, !2490, !2491, !2498, !2507}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rkb_link", scope: !415, file: !416, line: 83, baseType: !419, size: 128)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !415, file: !416, line: 83, size: 128, elements: !420)
!420 = !{!421, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !419, file: !416, line: 83, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !419, file: !416, line: 83, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rkb_nodeid", scope: !415, file: !416, line: 85, baseType: !320, size: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rkb_rsal", scope: !415, file: !416, line: 89, baseType: !427, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_sockaddr_list_t", file: !429, line: 112, baseType: !430)
!429 = !DIFile(filename: "./rdaddr.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "68c59d6e7bea2a3d1caf3e096692e2c8")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_sockaddr_list_s", file: !429, line: 108, size: 64, elements: !431)
!431 = !{!432, !433, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rsal_cnt", scope: !430, file: !429, line: 109, baseType: !126, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "rsal_curr", scope: !430, file: !429, line: 110, baseType: !126, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rsal_addr", scope: !430, file: !429, line: 111, baseType: !435, offset: 64)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, elements: !484)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_sockaddr_inx_t", file: !429, line: 53, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !429, line: 50, size: 224, elements: !438)
!438 = !{!439, !461}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !437, file: !429, line: 51, baseType: !440, size: 128)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !441, line: 245, size: 128, elements: !442)
!441 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!442 = !{!443, !447, !452, !459}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !440, file: !441, line: 247, baseType: !444, size: 16)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !445, line: 28, baseType: !446)
!445 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!446 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !440, file: !441, line: 248, baseType: !448, size: 16, offset: 16)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !441, line: 123, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !450, line: 25, baseType: !451)
!450 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !323, line: 40, baseType: !446)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !440, file: !441, line: 249, baseType: !453, size: 32, offset: 32)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !441, line: 31, size: 32, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !453, file: !441, line: 33, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !441, line: 30, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !450, line: 26, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !323, line: 42, baseType: !59)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !440, file: !441, line: 252, baseType: !460, size: 64, offset: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 64, elements: !17)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !437, file: !429, line: 52, baseType: !462, size: 224)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !441, line: 260, size: 224, elements: !463)
!463 = !{!464, !465, !466, !467, !483}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !462, file: !441, line: 262, baseType: !444, size: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !462, file: !441, line: 263, baseType: !448, size: 16, offset: 16)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !462, file: !441, line: 264, baseType: !457, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !462, file: !441, line: 265, baseType: !468, size: 128, offset: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !441, line: 219, size: 128, elements: !469)
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !468, file: !441, line: 226, baseType: !471, size: 128)
!471 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !468, file: !441, line: 221, size: 128, elements: !472)
!472 = !{!473, !479, !481}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !471, file: !441, line: 223, baseType: !474, size: 128)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 128, elements: !477)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !450, line: 24, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !323, line: 38, baseType: !347)
!477 = !{!478}
!478 = !DISubrange(count: 16)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !471, file: !441, line: 224, baseType: !480, size: 128)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 128, elements: !17)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !471, file: !441, line: 225, baseType: !482, size: 128)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 128, elements: !303)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !462, file: !441, line: 266, baseType: !457, size: 32, offset: 192)
!484 = !{!485}
!485 = !DISubrange(count: -1)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rkb_ts_rsal_last", scope: !415, file: !416, line: 90, baseType: !487, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_ts_t", file: !488, line: 44, baseType: !489)
!488 = !DIFile(filename: "./rdtypes.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "016bcfed1153977351687d80c528f953")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !321, line: 27, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !323, line: 44, baseType: !356)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rkb_addr_last", scope: !415, file: !416, line: 91, baseType: !492, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rkb_transport", scope: !415, file: !416, line: 93, baseType: !495, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_transport_t", file: !497, line: 39, baseType: !498)
!497 = !DIFile(filename: "./rdkafka_transport.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "f35caa9f37b09b4f188a09facdd1718e")
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_transport_s", file: !499, line: 45, flags: DIFlagFwdDecl)
!499 = !DIFile(filename: "./rdkafka_conf.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "e765c625455d2ea136e309f8f5f3659d")
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rkb_corrid", scope: !415, file: !416, line: 95, baseType: !457, size: 32, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rkb_connid", scope: !415, file: !416, line: 96, baseType: !126, size: 32, offset: 480)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rkb_ops", scope: !415, file: !416, line: 102, baseType: !503, size: 64, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_q_t", file: !58, line: 39, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_q_s", file: !506, line: 53, size: 1408, elements: !507)
!506 = !DIFile(filename: "./rdkafka_queue.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "5e52ff7c4a295f4821e8f181241b223c")
!507 = !{!508, !518, !528, !530, !2281, !2282, !2283, !2284, !2285, !2286, !2301, !2302, !2303}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rkq_lock", scope: !505, file: !506, line: 54, baseType: !509, size: 320)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtx_t", file: !510, line: 66, baseType: !511)
!510 = !DIFile(filename: "/usr/include/threads.h", directory: "", checksumkind: CSK_MD5, checksum: "6974d482e09577a4fa59cb79dc9d72e5")
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !510, line: 62, size: 320, elements: !512)
!512 = !{!513, !517}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !511, file: !510, line: 64, baseType: !514, size: 320)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 40)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !511, file: !510, line: 65, baseType: !356, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rkq_cond", scope: !505, file: !506, line: 55, baseType: !519, size: 384, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "cnd_t", file: !510, line: 72, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !510, line: 68, size: 384, elements: !521)
!521 = !{!522, !526}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !520, file: !510, line: 70, baseType: !523, size: 384)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 48)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !520, file: !510, line: 71, baseType: !527, size: 64)
!527 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rkq_fwdq", scope: !505, file: !506, line: 56, baseType: !529, size: 64, offset: 704)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rkq_q", scope: !505, file: !506, line: 60, baseType: !531, size: 128, offset: 768)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_op_tailq", file: !506, line: 44, size: 128, elements: !532)
!532 = !{!533, !2280}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !531, file: !506, line: 44, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_op_s", file: !58, line: 267, size: 6656, elements: !536)
!536 = !{!537, !543, !545, !547, !548, !549, !551, !564, !565, !567, !568, !574, !1967, !1968, !1969, !1974}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rko_link", scope: !535, file: !58, line: 268, baseType: !538, size: 128)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !535, file: !58, line: 268, size: 128, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !538, file: !58, line: 268, baseType: !534, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !538, file: !58, line: 268, baseType: !542, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rko_type", scope: !535, file: !58, line: 270, baseType: !544, size: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_op_type_t", file: !58, line: 176, baseType: !57)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rko_evtype", scope: !535, file: !58, line: 271, baseType: !546, size: 32, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_event_type_t", file: !125, line: 5333, baseType: !126)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rko_flags", scope: !535, file: !58, line: 272, baseType: !126, size: 32, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "rko_version", scope: !535, file: !58, line: 273, baseType: !320, size: 32, offset: 224)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rko_err", scope: !535, file: !58, line: 274, baseType: !550, size: 32, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_resp_err_t", file: !125, line: 635, baseType: !124)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rko_error", scope: !535, file: !58, line: 275, baseType: !552, size: 64, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_error_t", file: !125, line: 261, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_error_s", file: !555, line: 40, size: 192, elements: !556)
!555 = !DIFile(filename: "./rdkafka_error.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "95a3539c946490b939345e05c0eea8a1")
!556 = !{!557, !558, !560, !562, !563}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !554, file: !555, line: 41, baseType: !550, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !554, file: !555, line: 42, baseType: !559, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "fatal", scope: !554, file: !555, line: 46, baseType: !561, size: 8, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_bool_t", file: !488, line: 49, baseType: !475)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "retriable", scope: !554, file: !555, line: 47, baseType: !561, size: 8, offset: 136)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "txn_requires_abort", scope: !554, file: !555, line: 49, baseType: !561, size: 8, offset: 144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rko_len", scope: !535, file: !58, line: 276, baseType: !320, size: 32, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rko_prio", scope: !535, file: !58, line: 278, baseType: !566, size: 32, offset: 416)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_prio_t", file: !58, line: 197, baseType: !291)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rko_rktp", scope: !535, file: !58, line: 281, baseType: !368, size: 64, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rko_replyq", scope: !535, file: !58, line: 289, baseType: !569, size: 128, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_replyq_t", file: !58, line: 55, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_replyq_s", file: !58, line: 47, size: 128, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !570, file: !58, line: 48, baseType: !503, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !570, file: !58, line: 49, baseType: !320, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rko_serve", scope: !535, file: !58, line: 294, baseType: !575, size: 64, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_q_serve_cb_t", file: !58, line: 235, baseType: !577)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !586, !529, !534, !1959, !607}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_op_res_t", file: !58, line: 216, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !58, line: 207, baseType: !59, size: 32, elements: !581)
!581 = !{!582, !583, !584, !585}
!582 = !DIEnumerator(name: "RD_KAFKA_OP_RES_PASS", value: 0)
!583 = !DIEnumerator(name: "RD_KAFKA_OP_RES_HANDLED", value: 1)
!584 = !DIEnumerator(name: "RD_KAFKA_OP_RES_KEEP", value: 2)
!585 = !DIEnumerator(name: "RD_KAFKA_OP_RES_YIELD", value: 3)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_t", file: !125, line: 252, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_s", file: !589, line: 243, size: 34624, elements: !590)
!589 = !DIFile(filename: "./rdkafka_int.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "1beb976e5fb92ff8c74626b3b86148e5")
!590 = !{!591, !592, !593, !598, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !631, !632, !928, !1406, !1407, !1411, !1412, !1413, !1414, !1415, !1421, !1429, !1434, !1440, !1441, !1442, !1457, !1458, !1510, !1511, !1512, !1518, !1519, !1615, !1616, !1633, !1664, !1912, !1921, !1922, !1926, !1927, !1928, !1929, !1930, !1931, !1937, !1945, !1950}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rk_rep", scope: !588, file: !589, line: 244, baseType: !503, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rk_ops", scope: !588, file: !589, line: 245, baseType: !503, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rk_brokers", scope: !588, file: !589, line: 247, baseType: !594, size: 128, offset: 128)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !589, line: 247, size: 128, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !594, file: !589, line: 247, baseType: !422, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !594, file: !589, line: 247, baseType: !424, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rk_broker_by_id", scope: !588, file: !589, line: 248, baseType: !599, size: 320, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_list_t", file: !600, line: 61, baseType: !601)
!600 = !DIFile(filename: "./rdlist.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "1bd7bdd3f8c95a8e524b8b8e3965e4ac")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_list_s", file: !600, line: 40, size: 320, elements: !602)
!602 = !{!603, !604, !605, !608, !612, !613, !614}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rl_size", scope: !601, file: !600, line: 41, baseType: !126, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rl_cnt", scope: !601, file: !600, line: 42, baseType: !126, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rl_elems", scope: !601, file: !600, line: 43, baseType: !606, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rl_free_cb", scope: !601, file: !600, line: 44, baseType: !609, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !607}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rl_flags", scope: !601, file: !600, line: 45, baseType: !126, size: 32, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rl_elemsize", scope: !601, file: !600, line: 57, baseType: !126, size: 32, offset: 224)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rl_p", scope: !601, file: !600, line: 58, baseType: !607, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rk_broker_cnt", scope: !588, file: !589, line: 249, baseType: !315, size: 32, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rk_broker_up_cnt", scope: !588, file: !589, line: 251, baseType: !315, size: 32, offset: 608)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rk_logical_broker_up_cnt", scope: !588, file: !589, line: 254, baseType: !315, size: 32, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rk_broker_down_cnt", scope: !588, file: !589, line: 257, baseType: !315, size: 32, offset: 672)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rk_broker_addrless_cnt", scope: !588, file: !589, line: 260, baseType: !315, size: 32, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rk_internal_rkb_lock", scope: !588, file: !589, line: 262, baseType: !509, size: 320, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rk_internal_rkb", scope: !588, file: !589, line: 263, baseType: !412, size: 64, offset: 1088)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rk_broker_state_change_cnd", scope: !588, file: !589, line: 267, baseType: !519, size: 384, offset: 1152)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rk_broker_state_change_lock", scope: !588, file: !589, line: 268, baseType: !509, size: 320, offset: 1536)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rk_broker_state_change_version", scope: !588, file: !589, line: 269, baseType: !126, size: 32, offset: 1856)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rk_broker_state_change_waiters", scope: !588, file: !589, line: 272, baseType: !599, size: 320, offset: 1920)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rk_topics", scope: !588, file: !589, line: 274, baseType: !627, size: 128, offset: 2240)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !589, line: 274, size: 128, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !627, file: !589, line: 274, baseType: !309, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !627, file: !589, line: 274, baseType: !311, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rk_topic_cnt", scope: !588, file: !589, line: 275, baseType: !126, size: 32, offset: 2368)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rk_cgrp", scope: !588, file: !589, line: 277, baseType: !633, size: 64, offset: 2432)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_cgrp_s", file: !635, line: 54, size: 6464, elements: !636)
!635 = !DIFile(filename: "./rdkafka_cgrp.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "2b68c78241eab0ca09ed26ee92e4446a")
!636 = !{!637, !640, !641, !642, !643, !653, !654, !666, !720, !721, !722, !723, !724, !732, !733, !734, !735, !736, !737, !742, !743, !744, !857, !858, !859, !860, !861, !865, !866, !868, !869, !870, !871, !872, !873, !874, !875, !876, !911, !912, !913, !916, !917, !918}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_group_id", scope: !634, file: !635, line: 55, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_member_id", scope: !634, file: !635, line: 56, baseType: !358, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_group_instance_id", scope: !634, file: !635, line: 57, baseType: !358, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_client_id", scope: !634, file: !635, line: 58, baseType: !638, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_state", scope: !634, file: !635, line: 81, baseType: !644, size: 32, offset: 256)
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !634, file: !635, line: 60, baseType: !59, size: 32, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652}
!646 = !DIEnumerator(name: "RD_KAFKA_CGRP_STATE_INIT", value: 0)
!647 = !DIEnumerator(name: "RD_KAFKA_CGRP_STATE_TERM", value: 1)
!648 = !DIEnumerator(name: "RD_KAFKA_CGRP_STATE_QUERY_COORD", value: 2)
!649 = !DIEnumerator(name: "RD_KAFKA_CGRP_STATE_WAIT_COORD", value: 3)
!650 = !DIEnumerator(name: "RD_KAFKA_CGRP_STATE_WAIT_BROKER", value: 4)
!651 = !DIEnumerator(name: "RD_KAFKA_CGRP_STATE_WAIT_BROKER_TRANSPORT", value: 5)
!652 = !DIEnumerator(name: "RD_KAFKA_CGRP_STATE_UP", value: 6)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_ts_statechange", scope: !634, file: !635, line: 82, baseType: !487, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_join_state", scope: !634, file: !635, line: 116, baseType: !655, size: 32, offset: 384)
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !634, file: !635, line: 86, baseType: !59, size: 32, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665}
!657 = !DIEnumerator(name: "RD_KAFKA_CGRP_JOIN_STATE_INIT", value: 0)
!658 = !DIEnumerator(name: "RD_KAFKA_CGRP_JOIN_STATE_WAIT_JOIN", value: 1)
!659 = !DIEnumerator(name: "RD_KAFKA_CGRP_JOIN_STATE_WAIT_METADATA", value: 2)
!660 = !DIEnumerator(name: "RD_KAFKA_CGRP_JOIN_STATE_WAIT_SYNC", value: 3)
!661 = !DIEnumerator(name: "RD_KAFKA_CGRP_JOIN_STATE_WAIT_ASSIGN_CALL", value: 4)
!662 = !DIEnumerator(name: "RD_KAFKA_CGRP_JOIN_STATE_WAIT_UNASSIGN_CALL", value: 5)
!663 = !DIEnumerator(name: "RD_KAFKA_CGRP_JOIN_STATE_WAIT_UNASSIGN_TO_COMPLETE", value: 6)
!664 = !DIEnumerator(name: "RD_KAFKA_CGRP_JOIN_STATE_WAIT_INCR_UNASSIGN_TO_COMPLETE", value: 7)
!665 = !DIEnumerator(name: "RD_KAFKA_CGRP_JOIN_STATE_STEADY", value: 8)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_group_leader", scope: !634, file: !635, line: 122, baseType: !667, size: 128, offset: 448)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !634, file: !635, line: 119, size: 128, elements: !668)
!668 = !{!669, !719}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !667, file: !635, line: 120, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_group_member_t", file: !672, line: 75, baseType: !673)
!672 = !DIFile(filename: "./rdkafka_assignor.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "2b1454e6fb5a6e2c8b60be30c855c60d")
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_group_member_s", file: !672, line: 50, size: 896, elements: !674)
!674 = !{!675, !697, !698, !699, !700, !701, !702, !716, !717, !718}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rkgm_subscription", scope: !673, file: !672, line: 52, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_topic_partition_list_t", file: !125, line: 953, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_topic_partition_list_s", file: !125, line: 949, size: 128, elements: !679)
!679 = !{!680, !681, !682}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !678, file: !125, line: 950, baseType: !126, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !678, file: !125, line: 951, baseType: !126, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !678, file: !125, line: 952, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_topic_partition_t", file: !125, line: 910, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_topic_partition_s", file: !125, line: 898, size: 512, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !694, !695, !696}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !685, file: !125, line: 899, baseType: !559, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !685, file: !125, line: 900, baseType: !320, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !685, file: !125, line: 901, baseType: !489, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !685, file: !125, line: 902, baseType: !607, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_size", scope: !685, file: !125, line: 903, baseType: !692, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !693, line: 70, baseType: !349)
!693 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!694 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !685, file: !125, line: 904, baseType: !607, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !685, file: !125, line: 905, baseType: !550, size: 32, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !685, file: !125, line: 906, baseType: !607, size: 64, offset: 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rkgm_assignment", scope: !673, file: !672, line: 55, baseType: !676, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rkgm_owned", scope: !673, file: !672, line: 59, baseType: !676, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rkgm_eligible", scope: !673, file: !672, line: 62, baseType: !599, size: 320, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rkgm_member_id", scope: !673, file: !672, line: 64, baseType: !358, size: 64, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rkgm_group_instance_id", scope: !673, file: !672, line: 66, baseType: !358, size: 64, offset: 576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rkgm_userdata", scope: !673, file: !672, line: 68, baseType: !703, size: 64, offset: 640)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafkap_bytes_t", file: !360, line: 382, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafkap_bytes_s", file: !360, line: 376, size: 192, elements: !706)
!706 = !{!707, !708, !711}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !705, file: !360, line: 378, baseType: !320, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !705, file: !360, line: 379, baseType: !709, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !705, file: !360, line: 381, baseType: !712, size: 8, offset: 128)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 8, elements: !714)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!714 = !{!715}
!715 = !DISubrange(count: 1)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rkgm_member_metadata", scope: !673, file: !672, line: 70, baseType: !703, size: 64, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "rkgm_generation", scope: !673, file: !672, line: 72, baseType: !126, size: 32, offset: 768)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rkgm_rack_id", scope: !673, file: !672, line: 74, baseType: !358, size: 64, offset: 832)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "member_cnt", scope: !667, file: !635, line: 121, baseType: !126, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_q", scope: !634, file: !635, line: 124, baseType: !503, size: 64, offset: 576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_ops", scope: !634, file: !635, line: 125, baseType: !503, size: 64, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_wait_coord_q", scope: !634, file: !635, line: 126, baseType: !503, size: 64, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_flags", scope: !634, file: !635, line: 127, baseType: !126, size: 32, offset: 768)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_coord_query_intvl", scope: !634, file: !635, line: 164, baseType: !725, size: 192, offset: 832)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_interval_t", file: !726, line: 38, baseType: !727)
!726 = !DIFile(filename: "./rdinterval.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "885947ace5d6d470618d41d32f3ee275")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_interval_s", file: !726, line: 34, size: 192, elements: !728)
!728 = !{!729, !730, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ri_ts_last", scope: !727, file: !726, line: 35, baseType: !487, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ri_fixed", scope: !727, file: !726, line: 36, baseType: !487, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ri_backoff", scope: !727, file: !726, line: 37, baseType: !126, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_heartbeat_intvl", scope: !634, file: !635, line: 165, baseType: !725, size: 192, offset: 1024)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_join_intvl", scope: !634, file: !635, line: 166, baseType: !725, size: 192, offset: 1216)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_timeout_scan_intvl", scope: !634, file: !635, line: 167, baseType: !725, size: 192, offset: 1408)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_ts_session_timeout", scope: !634, file: !635, line: 169, baseType: !487, size: 64, offset: 1600)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_last_heartbeat_err", scope: !634, file: !635, line: 175, baseType: !550, size: 32, offset: 1664)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_topics", scope: !634, file: !635, line: 178, baseType: !738, size: 128, offset: 1728)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !634, file: !635, line: 178, size: 128, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !738, file: !635, line: 178, baseType: !309, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !738, file: !635, line: 178, baseType: !311, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_toppars", scope: !634, file: !635, line: 180, baseType: !599, size: 320, offset: 1856)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_generation_id", scope: !634, file: !635, line: 182, baseType: !320, size: 32, offset: 2176)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_assignor", scope: !634, file: !635, line: 184, baseType: !745, size: 64, offset: 2240)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_assignor_t", file: !672, line: 141, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_assignor_s", file: !672, line: 98, size: 640, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !760, !828, !836, !851, !852, !856}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_protocol_type", scope: !747, file: !672, line: 99, baseType: !358, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_protocol_name", scope: !747, file: !672, line: 100, baseType: !358, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_enabled", scope: !747, file: !672, line: 102, baseType: !126, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_index", scope: !747, file: !672, line: 105, baseType: !126, size: 32, offset: 160)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_protocol", scope: !747, file: !672, line: 107, baseType: !754, size: 32, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_rebalance_protocol_t", file: !672, line: 46, baseType: !755)
!755 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rd_kafka_rebalance_protocol_t", file: !672, line: 39, baseType: !59, size: 32, elements: !756)
!756 = !{!757, !758, !759}
!757 = !DIEnumerator(name: "RD_KAFKA_REBALANCE_PROTOCOL_NONE", value: 0)
!758 = !DIEnumerator(name: "RD_KAFKA_REBALANCE_PROTOCOL_EAGER", value: 1)
!759 = !DIEnumerator(name: "RD_KAFKA_REBALANCE_PROTOCOL_COOPERATIVE", value: 2)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_assign_cb", scope: !747, file: !672, line: 109, baseType: !761, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!550, !586, !764, !365, !766, !670, !692, !801, !692, !559, !692, !607}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_metadata_t", file: !125, line: 4902, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_metadata", file: !125, line: 4893, size: 384, elements: !770)
!770 = !{!771, !772, !779, !780, !799, !800}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "broker_cnt", scope: !769, file: !125, line: 4894, baseType: !126, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "brokers", scope: !769, file: !125, line: 4895, baseType: !773, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_metadata_broker", file: !125, line: 4860, size: 192, elements: !775)
!775 = !{!776, !777, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !774, file: !125, line: 4861, baseType: !320, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !774, file: !125, line: 4862, baseType: !559, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !774, file: !125, line: 4863, baseType: !126, size: 32, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "topic_cnt", scope: !769, file: !125, line: 4897, baseType: !126, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "topics", scope: !769, file: !125, line: 4898, baseType: !781, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_metadata_topic", file: !125, line: 4882, size: 256, elements: !783)
!783 = !{!784, !785, !786, !798}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !782, file: !125, line: 4883, baseType: !559, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "partition_cnt", scope: !782, file: !125, line: 4884, baseType: !126, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "partitions", scope: !782, file: !125, line: 4885, baseType: !787, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_metadata_partition", file: !125, line: 4869, size: 320, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !796, !797}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !788, file: !125, line: 4870, baseType: !320, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !788, file: !125, line: 4871, baseType: !550, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "leader", scope: !788, file: !125, line: 4872, baseType: !320, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "replica_cnt", scope: !788, file: !125, line: 4873, baseType: !126, size: 32, offset: 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "replicas", scope: !788, file: !125, line: 4874, baseType: !795, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "isr_cnt", scope: !788, file: !125, line: 4875, baseType: !126, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "isrs", scope: !788, file: !125, line: 4876, baseType: !795, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !782, file: !125, line: 4886, baseType: !550, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "orig_broker_id", scope: !769, file: !125, line: 4900, baseType: !320, size: 32, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "orig_broker_name", scope: !769, file: !125, line: 4901, baseType: !559, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_assignor_topic_t", file: !672, line: 92, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_assignor_topic_s", file: !672, line: 88, size: 448, elements: !805)
!805 = !{!806, !810, !827}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !804, file: !672, line: 89, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_metadata_topic_t", file: !125, line: 4887, baseType: !782)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_internal", scope: !804, file: !672, line: 90, baseType: !811, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_metadata_topic_internal_t", file: !814, line: 57, baseType: !815)
!814 = !DIFile(filename: "./rdkafka_metadata.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "a780d84ab706ab296dd16c1531a51d66")
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_metadata_topic_internal_s", file: !814, line: 52, size: 64, elements: !816)
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "partitions", scope: !815, file: !814, line: 56, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_metadata_partition_internal_t", file: !814, line: 47, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_metadata_partition_internal_s", file: !814, line: 38, size: 192, elements: !821)
!821 = !{!822, !823, !824, !826}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !820, file: !814, line: 40, baseType: !320, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "leader_epoch", scope: !820, file: !814, line: 42, baseType: !320, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "racks", scope: !820, file: !814, line: 44, baseType: !825, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "racks_cnt", scope: !820, file: !814, line: 46, baseType: !692, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !804, file: !672, line: 91, baseType: !599, size: 320, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_get_metadata_cb", scope: !747, file: !672, line: 122, baseType: !829, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!703, !764, !607, !832, !834, !638}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_on_assignment_cb", scope: !747, file: !672, line: 129, baseType: !837, size: 64, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !764, !606, !834, !840, !842}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_consumer_group_metadata_t", file: !125, line: 260, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_consumer_group_metadata_s", file: !635, line: 361, size: 256, elements: !846)
!846 = !{!847, !848, !849, !850}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !845, file: !635, line: 362, baseType: !559, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "generation_id", scope: !845, file: !635, line: 363, baseType: !320, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "member_id", scope: !845, file: !635, line: 364, baseType: !559, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "group_instance_id", scope: !845, file: !635, line: 365, baseType: !559, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_destroy_state_cb", scope: !747, file: !672, line: 136, baseType: !609, size: 64, offset: 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_unittest", scope: !747, file: !672, line: 138, baseType: !853, size: 64, offset: 512)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!126}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rkas_opaque", scope: !747, file: !672, line: 140, baseType: !607, size: 64, offset: 576)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_assignor_state", scope: !634, file: !635, line: 187, baseType: !607, size: 64, offset: 2304)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_coord_id", scope: !634, file: !635, line: 190, baseType: !320, size: 32, offset: 2368)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_curr_coord", scope: !634, file: !635, line: 193, baseType: !412, size: 64, offset: 2432)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_coord", scope: !634, file: !635, line: 199, baseType: !412, size: 64, offset: 2496)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_wait_resp", scope: !634, file: !635, line: 204, baseType: !862, size: 16, offset: 2560)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !321, line: 25, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !323, line: 39, baseType: !864)
!864 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_subscription", scope: !634, file: !635, line: 212, baseType: !676, size: 64, offset: 2624)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_subscribed_topics", scope: !634, file: !635, line: 215, baseType: !867, size: 64, offset: 2688)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_errored_topics", scope: !634, file: !635, line: 217, baseType: !676, size: 64, offset: 2752)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_next_subscription", scope: !634, file: !635, line: 222, baseType: !676, size: 64, offset: 2816)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_next_unsubscribe", scope: !634, file: !635, line: 227, baseType: !561, size: 8, offset: 2880)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_assignment_lost", scope: !634, file: !635, line: 230, baseType: !315, size: 32, offset: 2912)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_group_assignment", scope: !634, file: !635, line: 252, baseType: !676, size: 64, offset: 2944)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_rebalance_incr_assignment", scope: !634, file: !635, line: 256, baseType: !676, size: 64, offset: 3008)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_rebalance_rejoin", scope: !634, file: !635, line: 260, baseType: !561, size: 8, offset: 3072)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_last_err", scope: !634, file: !635, line: 262, baseType: !550, size: 32, offset: 3104)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_offset_commit_tmr", scope: !634, file: !635, line: 267, baseType: !877, size: 448, offset: 3136)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_timer_t", file: !878, line: 65, baseType: !879)
!878 = !DIFile(filename: "./rdkafka_timer.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "f099f0733e15d490f97c900703ac9bee")
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_timer_s", file: !878, line: 56, size: 448, elements: !880)
!880 = !{!881, !888, !889, !890, !891, !910}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rtmr_link", scope: !879, file: !878, line: 57, baseType: !882, size: 128)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !879, file: !878, line: 57, size: 128, elements: !883)
!883 = !{!884, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !882, file: !878, line: 57, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !882, file: !878, line: 57, baseType: !887, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rtmr_next", scope: !879, file: !878, line: 59, baseType: !487, size: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rtmr_interval", scope: !879, file: !878, line: 60, baseType: !487, size: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rtmr_oneshot", scope: !879, file: !878, line: 61, baseType: !561, size: 8, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "rtmr_callback", scope: !879, file: !878, line: 63, baseType: !892, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !895, !607}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_timers_t", file: !878, line: 53, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_timers_s", file: !878, line: 37, size: 1024, elements: !898)
!898 = !{!899, !904, !906, !907, !908, !909}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rkts_timers", scope: !897, file: !878, line: 39, baseType: !900, size: 128)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !897, file: !878, line: 39, size: 128, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !900, file: !878, line: 39, baseType: !885, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !900, file: !878, line: 39, baseType: !887, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "rkts_rk", scope: !897, file: !878, line: 41, baseType: !905, size: 64, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rkts_lock", scope: !897, file: !878, line: 43, baseType: !509, size: 320, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "rkts_cond", scope: !897, file: !878, line: 44, baseType: !519, size: 384, offset: 512)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rkts_wakeq", scope: !897, file: !878, line: 50, baseType: !529, size: 64, offset: 896)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "rkts_enabled", scope: !897, file: !878, line: 52, baseType: !126, size: 32, offset: 960)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rtmr_arg", scope: !879, file: !878, line: 64, baseType: !607, size: 64, offset: 384)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_max_poll_interval_tmr", scope: !634, file: !635, line: 268, baseType: !877, size: 448, offset: 3584)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_rk", scope: !634, file: !635, line: 271, baseType: !586, size: 64, offset: 4032)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_reply_rko", scope: !634, file: !635, line: 273, baseType: !914, size: 64, offset: 4096)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_op_t", file: !58, line: 41, baseType: !535)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_ts_terminate", scope: !634, file: !635, line: 277, baseType: !487, size: 64, offset: 4160)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_terminated", scope: !634, file: !635, line: 281, baseType: !315, size: 32, offset: 4224)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "rkcg_c", scope: !634, file: !635, line: 294, baseType: !919, size: 2176, offset: 4288)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !634, file: !635, line: 284, size: 2176, elements: !920)
!920 = !{!921, !922, !923, !927}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ts_rebalance", scope: !919, file: !635, line: 285, baseType: !487, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rebalance_cnt", scope: !919, file: !635, line: 287, baseType: !126, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rebalance_reason", scope: !919, file: !635, line: 289, baseType: !924, size: 2048, offset: 96)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "assignment_size", scope: !919, file: !635, line: 291, baseType: !126, size: 32, offset: 2144)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rk_conf", scope: !588, file: !589, line: 279, baseType: !929, size: 16128, offset: 2496)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_conf_t", file: !125, line: 254, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_conf_s", file: !499, line: 188, size: 16128, elements: !931)
!931 = !{!932, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !987, !993, !1068, !1113, !1114, !1115, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1176, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1247, !1248, !1249, !1255, !1256, !1257, !1264, !1265, !1266, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1281, !1299, !1304, !1310, !1311, !1312, !1313, !1314, !1315, !1319, !1323, !1327, !1331, !1342, !1346, !1353, !1376, !1382, !1383, !1384, !1388, !1393, !1400, !1401, !1402}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !930, file: !499, line: 189, baseType: !933, size: 2112)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_anyconf_hdr", file: !499, line: 176, size: 2112, elements: !934)
!934 = !{!935}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !933, file: !499, line: 177, baseType: !936, size: 2112)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 2112, elements: !939)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !450, line: 27, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !323, line: 45, baseType: !349)
!939 = !{!940}
!940 = !DISubrange(count: 33)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "enabled_events", scope: !930, file: !499, line: 194, baseType: !126, size: 32, offset: 2112)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "max_msg_size", scope: !930, file: !499, line: 195, baseType: !126, size: 32, offset: 2144)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "msg_copy_max_size", scope: !930, file: !499, line: 196, baseType: !126, size: 32, offset: 2176)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "recv_max_msg_size", scope: !930, file: !499, line: 197, baseType: !126, size: 32, offset: 2208)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "max_inflight", scope: !930, file: !499, line: 198, baseType: !126, size: 32, offset: 2240)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_request_timeout_ms", scope: !930, file: !499, line: 199, baseType: !126, size: 32, offset: 2272)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_refresh_interval_ms", scope: !930, file: !499, line: 200, baseType: !126, size: 32, offset: 2304)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_refresh_fast_cnt", scope: !930, file: !499, line: 201, baseType: !126, size: 32, offset: 2336)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_refresh_fast_interval_ms", scope: !930, file: !499, line: 202, baseType: !126, size: 32, offset: 2368)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_refresh_sparse", scope: !930, file: !499, line: 203, baseType: !126, size: 32, offset: 2400)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_max_age_ms", scope: !930, file: !499, line: 204, baseType: !126, size: 32, offset: 2432)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_propagation_max_ms", scope: !930, file: !499, line: 205, baseType: !126, size: 32, offset: 2464)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !930, file: !499, line: 206, baseType: !126, size: 32, offset: 2496)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "broker_addr_ttl", scope: !930, file: !499, line: 207, baseType: !126, size: 32, offset: 2528)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "broker_addr_family", scope: !930, file: !499, line: 208, baseType: !126, size: 32, offset: 2560)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "socket_timeout_ms", scope: !930, file: !499, line: 209, baseType: !126, size: 32, offset: 2592)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "socket_blocking_max_ms", scope: !930, file: !499, line: 210, baseType: !126, size: 32, offset: 2624)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "socket_sndbuf_size", scope: !930, file: !499, line: 211, baseType: !126, size: 32, offset: 2656)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "socket_rcvbuf_size", scope: !930, file: !499, line: 212, baseType: !126, size: 32, offset: 2688)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "socket_keepalive", scope: !930, file: !499, line: 213, baseType: !126, size: 32, offset: 2720)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "socket_nagle_disable", scope: !930, file: !499, line: 214, baseType: !126, size: 32, offset: 2752)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "socket_max_fails", scope: !930, file: !499, line: 215, baseType: !126, size: 32, offset: 2784)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "client_id_str", scope: !930, file: !499, line: 216, baseType: !559, size: 64, offset: 2816)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "brokerlist", scope: !930, file: !499, line: 217, baseType: !559, size: 64, offset: 2880)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "stats_interval_ms", scope: !930, file: !499, line: 218, baseType: !126, size: 32, offset: 2944)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "term_sig", scope: !930, file: !499, line: 219, baseType: !126, size: 32, offset: 2976)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_backoff_ms", scope: !930, file: !499, line: 220, baseType: !126, size: 32, offset: 3008)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_backoff_max_ms", scope: !930, file: !499, line: 221, baseType: !126, size: 32, offset: 3040)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_jitter_ms", scope: !930, file: !499, line: 222, baseType: !126, size: 32, offset: 3072)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "socket_connection_setup_timeout_ms", scope: !930, file: !499, line: 223, baseType: !126, size: 32, offset: 3104)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "connections_max_idle_ms", scope: !930, file: !499, line: 224, baseType: !126, size: 32, offset: 3136)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_connections", scope: !930, file: !499, line: 225, baseType: !126, size: 32, offset: 3168)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_connect_intvl", scope: !930, file: !499, line: 226, baseType: !126, size: 32, offset: 3200)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "api_version_request", scope: !930, file: !499, line: 227, baseType: !126, size: 32, offset: 3232)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "api_version_request_timeout_ms", scope: !930, file: !499, line: 228, baseType: !126, size: 32, offset: 3264)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "api_version_fallback_ms", scope: !930, file: !499, line: 229, baseType: !126, size: 32, offset: 3296)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "broker_version_fallback", scope: !930, file: !499, line: 230, baseType: !559, size: 64, offset: 3328)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "security_protocol", scope: !930, file: !499, line: 231, baseType: !979, size: 32, offset: 3392)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_secproto_t", file: !499, line: 99, baseType: !980)
!980 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !499, line: 93, baseType: !59, size: 32, elements: !981)
!981 = !{!982, !983, !984, !985, !986}
!982 = !DIEnumerator(name: "RD_KAFKA_PROTO_PLAINTEXT", value: 0)
!983 = !DIEnumerator(name: "RD_KAFKA_PROTO_SSL", value: 1)
!984 = !DIEnumerator(name: "RD_KAFKA_PROTO_SASL_PLAINTEXT", value: 2)
!985 = !DIEnumerator(name: "RD_KAFKA_PROTO_SASL_SSL", value: 3)
!986 = !DIEnumerator(name: "RD_KAFKA_PROTO_NUM", value: 4)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "client_dns_lookup", scope: !930, file: !499, line: 232, baseType: !988, size: 32, offset: 3424)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_client_dns_lookup_t", file: !499, line: 164, baseType: !989)
!989 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !499, line: 161, baseType: !59, size: 32, elements: !990)
!990 = !{!991, !992}
!991 = !DIEnumerator(name: "RD_KAFKA_USE_ALL_DNS_IPS", value: 0)
!992 = !DIEnumerator(name: "RD_KAFKA_RESOLVE_CANONICAL_BOOTSTRAP_SERVERS_ONLY", value: 1)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !930, file: !499, line: 276, baseType: !994, size: 1920, offset: 3456)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !930, file: !499, line: 234, size: 1920, elements: !995)
!995 = !{!996, !1001, !1002, !1003, !1004, !1005, !1006, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !994, file: !499, line: 236, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !999, line: 185, baseType: !1000)
!999 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !999, line: 185, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_suites", scope: !994, file: !499, line: 238, baseType: !559, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "curves_list", scope: !994, file: !499, line: 239, baseType: !559, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "sigalgs_list", scope: !994, file: !499, line: 240, baseType: !559, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "key_location", scope: !994, file: !499, line: 241, baseType: !559, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "key_pem", scope: !994, file: !499, line: 242, baseType: !559, size: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !994, file: !499, line: 243, baseType: !1007, size: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_cert_t", file: !1009, line: 50, baseType: !1010)
!1009 = !DIFile(filename: "./rdkafka_cert.h", directory: "/local-ssd/librdkafka-boufp7uirdfaurriupperscwkdhn6ziy-build/aidengro/spack-stage-librdkafka-2.2.0-boufp7uirdfaurriupperscwkdhn6ziy/spack-src/src", checksumkind: CSK_MD5, checksum: "287ae34ad089f1b1c1c5c6ec72f688f1")
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_cert_s", file: !1009, line: 41, size: 320, elements: !1011)
!1011 = !{!1012, !1020, !1028, !1029, !1033, !1037}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1010, file: !1009, line: 42, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_cert_type_t", file: !125, line: 2388, baseType: !1014)
!1014 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rd_kafka_cert_type_t", file: !125, line: 2383, baseType: !59, size: 32, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019}
!1016 = !DIEnumerator(name: "RD_KAFKA_CERT_PUBLIC_KEY", value: 0)
!1017 = !DIEnumerator(name: "RD_KAFKA_CERT_PRIVATE_KEY", value: 1)
!1018 = !DIEnumerator(name: "RD_KAFKA_CERT_CA", value: 2)
!1019 = !DIEnumerator(name: "RD_KAFKA_CERT__CNT", value: 3)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1010, file: !1009, line: 43, baseType: !1021, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_cert_enc_t", file: !125, line: 2402, baseType: !1022)
!1022 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rd_kafka_cert_enc_t", file: !125, line: 2397, baseType: !59, size: 32, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027}
!1024 = !DIEnumerator(name: "RD_KAFKA_CERT_ENC_PKCS12", value: 0)
!1025 = !DIEnumerator(name: "RD_KAFKA_CERT_ENC_DER", value: 1)
!1026 = !DIEnumerator(name: "RD_KAFKA_CERT_ENC_PEM", value: 2)
!1027 = !DIEnumerator(name: "RD_KAFKA_CERT_ENC__CNT", value: 3)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1010, file: !1009, line: 44, baseType: !313, size: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "x509", scope: !1010, file: !1009, line: 46, baseType: !1030, size: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !999, line: 157, baseType: !1032)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !999, line: 157, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !1010, file: !1009, line: 47, baseType: !1034, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !999, line: 107, baseType: !1036)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !999, line: 107, flags: DIFlagFwdDecl)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !1010, file: !1009, line: 48, baseType: !1038, size: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE", file: !999, line: 164, baseType: !1040)
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_st", file: !999, line: 164, flags: DIFlagFwdDecl)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "key_password", scope: !994, file: !499, line: 244, baseType: !559, size: 64, offset: 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "cert_location", scope: !994, file: !499, line: 245, baseType: !559, size: 64, offset: 512)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "cert_pem", scope: !994, file: !499, line: 246, baseType: !559, size: 64, offset: 576)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !994, file: !499, line: 247, baseType: !1007, size: 64, offset: 640)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ca_location", scope: !994, file: !499, line: 248, baseType: !559, size: 64, offset: 704)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ca_pem", scope: !994, file: !499, line: 249, baseType: !559, size: 64, offset: 768)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !994, file: !499, line: 250, baseType: !1007, size: 64, offset: 832)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ca_cert_stores", scope: !994, file: !499, line: 252, baseType: !559, size: 64, offset: 896)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "crl_location", scope: !994, file: !499, line: 253, baseType: !559, size: 64, offset: 960)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !994, file: !499, line: 255, baseType: !1051, size: 64, offset: 1024)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !999, line: 183, baseType: !1053)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !999, line: 183, flags: DIFlagFwdDecl)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "engine_location", scope: !994, file: !499, line: 257, baseType: !559, size: 64, offset: 1088)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "engine_id", scope: !994, file: !499, line: 258, baseType: !559, size: 64, offset: 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "engine_callback_data", scope: !994, file: !499, line: 259, baseType: !607, size: 64, offset: 1216)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "providers", scope: !994, file: !499, line: 260, baseType: !559, size: 64, offset: 1280)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "loaded_providers", scope: !994, file: !499, line: 261, baseType: !599, size: 320, offset: 1344)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "keystore_location", scope: !994, file: !499, line: 262, baseType: !559, size: 64, offset: 1664)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "keystore_password", scope: !994, file: !499, line: 263, baseType: !559, size: 64, offset: 1728)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "endpoint_identification", scope: !994, file: !499, line: 264, baseType: !126, size: 32, offset: 1792)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "enable_verify", scope: !994, file: !499, line: 265, baseType: !126, size: 32, offset: 1824)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "cert_verify_cb", scope: !994, file: !499, line: 266, baseType: !1064, size: 64, offset: 1856)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!126, !586, !365, !320, !1067, !126, !365, !692, !559, !692, !607}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "sasl", scope: !930, file: !499, line: 317, baseType: !1069, size: 1664, offset: 5376)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !930, file: !499, line: 278, size: 1664, elements: !1070)
!1070 = !{!1071, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1091, !1092, !1093, !1094, !1095}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "provider", scope: !1069, file: !499, line: 279, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1074)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "rd_kafka_sasl_provider", file: !499, line: 279, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1069, file: !499, line: 280, baseType: !559, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mechanisms", scope: !1069, file: !499, line: 281, baseType: !559, size: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "service_name", scope: !1069, file: !499, line: 282, baseType: !559, size: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "kinit_cmd", scope: !1069, file: !499, line: 283, baseType: !559, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "keytab", scope: !1069, file: !499, line: 284, baseType: !559, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "relogin_min_time", scope: !1069, file: !499, line: 285, baseType: !126, size: 32, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1069, file: !499, line: 288, baseType: !509, size: 320, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !1069, file: !499, line: 289, baseType: !559, size: 64, offset: 768)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !1069, file: !499, line: 290, baseType: !559, size: 64, offset: 832)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "scram_evp", scope: !1069, file: !499, line: 294, baseType: !709, size: 64, offset: 896)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "scram_H", scope: !1069, file: !499, line: 296, baseType: !1086, size: 64, offset: 960)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!1089, !1090, !692, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "scram_H_size", scope: !1069, file: !499, line: 300, baseType: !692, size: 64, offset: 1024)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "oauthbearer_config", scope: !1069, file: !499, line: 302, baseType: !559, size: 64, offset: 1088)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "enable_oauthbearer_unsecure_jwt", scope: !1069, file: !499, line: 303, baseType: !126, size: 32, offset: 1152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "enable_callback_queue", scope: !1069, file: !499, line: 304, baseType: !126, size: 32, offset: 1184)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "oauthbearer", scope: !1069, file: !499, line: 316, baseType: !1096, size: 448, offset: 1216)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1069, file: !499, line: 305, size: 448, elements: !1097)
!1097 = !{!1098, !1104, !1105, !1106, !1107, !1108, !1109}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !1096, file: !499, line: 306, baseType: !1099, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "rd_kafka_oauthbearer_method_t", file: !499, line: 154, baseType: !1100)
!1100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !499, line: 151, baseType: !59, size: 32, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIEnumerator(name: "RD_KAFKA_SASL_OAUTHBEARER_METHOD_DEFAULT", value: 0)
!1103 = !DIEnumerator(name: "RD_KAFKA_SASL_OAUTHBEARER_METHOD_OIDC", value: 1)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "token_endpoint_url", scope: !1096, file: !499, line: 307, baseType: !559, size: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "client_id", scope: !1096, file: !499, line: 308, baseType: !559, size: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "client_secret", scope: !1096, file: !499, line: 309, baseType: !559, size: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !1096, file: !499, line: 310, baseType: !559, size: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "extensions_str", scope: !1096, file: !499, line: 311, baseType: !559, size: 64, offset: 320)
