; ModuleID = 'samples/202.bc'
source_filename = "zip_add_dir.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: nounwind uwtable
define i64 @zip_add_dir(ptr noundef %za, ptr noundef %name) #0 !dbg !45 {
entry:
  %za.addr = alloca ptr, align 8
  %name.addr = alloca ptr, align 8
  store ptr %za, ptr %za.addr, align 8, !tbaa !204
  tail call void @llvm.dbg.declare(metadata ptr %za.addr, metadata !202, metadata !DIExpression()), !dbg !208
  store ptr %name, ptr %name.addr, align 8, !tbaa !204
  tail call void @llvm.dbg.declare(metadata ptr %name.addr, metadata !203, metadata !DIExpression()), !dbg !209
  %0 = load ptr, ptr %za.addr, align 8, !dbg !210, !tbaa !204
  %1 = load ptr, ptr %name.addr, align 8, !dbg !211, !tbaa !204
  %call = call i64 @zip_dir_add(ptr noundef %0, ptr noundef %1, i32 noundef 0), !dbg !212
  ret i64 %call, !dbg !213
}

declare !dbg !214 i64 @zip_dir_add(ptr noundef, ptr noundef, i32 noundef) #1

; Function Attrs: nocallback nofree nosync nounwind speculatable willreturn memory(none)
declare void @llvm.dbg.declare(metadata, metadata, metadata) #2

attributes #0 = { nounwind uwtable "min-legal-vector-width"="0" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cmov,+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "tune-cpu"="generic" }
attributes #1 = { "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cmov,+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "tune-cpu"="generic" }
attributes #2 = { nocallback nofree nosync nounwind speculatable willreturn memory(none) }

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!39, !40, !41, !42, !43}
!llvm.ident = !{!44}

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "zip_add_dir.c", directory: "/local-ssd/libzip-es3wf7bj327ackexr3iovsw37h3bpw5f-build/aidengro/spack-stage-libzip-1.3.2-es3wf7bj327ackexr3iovsw37h3bpw5f/spack-src/lib", checksumkind: CSK_MD5, checksum: "79b8e5ef71ec5fc7a700a402252e87d6")
!2 = !{!3, !24, !31}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zip_source_cmd", file: !4, line: 214, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./zip.h", directory: "/local-ssd/libzip-es3wf7bj327ackexr3iovsw37h3bpw5f-build/aidengro/spack-stage-libzip-1.3.2-es3wf7bj327ackexr3iovsw37h3bpw5f/spack-src/lib", checksumkind: CSK_MD5, checksum: "6758aaa3e0d08949c1a3d4b0a3aed88b")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!7 = !DIEnumerator(name: "ZIP_SOURCE_OPEN", value: 0)
!8 = !DIEnumerator(name: "ZIP_SOURCE_READ", value: 1)
!9 = !DIEnumerator(name: "ZIP_SOURCE_CLOSE", value: 2)
!10 = !DIEnumerator(name: "ZIP_SOURCE_STAT", value: 3)
!11 = !DIEnumerator(name: "ZIP_SOURCE_ERROR", value: 4)
!12 = !DIEnumerator(name: "ZIP_SOURCE_FREE", value: 5)
!13 = !DIEnumerator(name: "ZIP_SOURCE_SEEK", value: 6)
!14 = !DIEnumerator(name: "ZIP_SOURCE_TELL", value: 7)
!15 = !DIEnumerator(name: "ZIP_SOURCE_BEGIN_WRITE", value: 8)
!16 = !DIEnumerator(name: "ZIP_SOURCE_COMMIT_WRITE", value: 9)
!17 = !DIEnumerator(name: "ZIP_SOURCE_ROLLBACK_WRITE", value: 10)
!18 = !DIEnumerator(name: "ZIP_SOURCE_WRITE", value: 11)
!19 = !DIEnumerator(name: "ZIP_SOURCE_SEEK_WRITE", value: 12)
!20 = !DIEnumerator(name: "ZIP_SOURCE_TELL_WRITE", value: 13)
!21 = !DIEnumerator(name: "ZIP_SOURCE_SUPPORTS", value: 14)
!22 = !DIEnumerator(name: "ZIP_SOURCE_REMOVE", value: 15)
!23 = !DIEnumerator(name: "ZIP_SOURCE_GET_COMPRESSION_FLAGS", value: 16)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zip_source_write_state", file: !25, line: 310, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "./zipint.h", directory: "/local-ssd/libzip-es3wf7bj327ackexr3iovsw37h3bpw5f-build/aidengro/spack-stage-libzip-1.3.2-es3wf7bj327ackexr3iovsw37h3bpw5f/spack-src/lib", checksumkind: CSK_MD5, checksum: "9cf4a3b80decb4346dbb92f349ffcae6")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "ZIP_SOURCE_WRITE_CLOSED", value: 0)
!28 = !DIEnumerator(name: "ZIP_SOURCE_WRITE_OPEN", value: 1)
!29 = !DIEnumerator(name: "ZIP_SOURCE_WRITE_FAILED", value: 2)
!30 = !DIEnumerator(name: "ZIP_SOURCE_WRITE_REMOVED", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zip_encoding_type", file: !25, line: 188, baseType: !5, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36, !37, !38}
!33 = !DIEnumerator(name: "ZIP_ENCODING_UNKNOWN", value: 0)
!34 = !DIEnumerator(name: "ZIP_ENCODING_ASCII", value: 1)
!35 = !DIEnumerator(name: "ZIP_ENCODING_UTF8_KNOWN", value: 2)
!36 = !DIEnumerator(name: "ZIP_ENCODING_UTF8_GUESSED", value: 3)
!37 = !DIEnumerator(name: "ZIP_ENCODING_CP437", value: 4)
!38 = !DIEnumerator(name: "ZIP_ENCODING_ERROR", value: 5)
!39 = !{i32 7, !"Dwarf Version", i32 5}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{i32 1, !"wchar_size", i32 4}
!42 = !{i32 8, !"PIC Level", i32 2}
!43 = !{i32 7, !"uwtable", i32 2}
!44 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!45 = distinct !DISubprogram(name: "zip_add_dir", scope: !1, file: !1, line: 42, type: !46, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !201)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !55, !199}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_int64_t", file: !49, line: 39, baseType: !50)
!49 = !DIFile(filename: "./zipconf.h", directory: "/local-ssd/libzip-es3wf7bj327ackexr3iovsw37h3bpw5f-build/aidengro/spack-stage-libzip-1.3.2-es3wf7bj327ackexr3iovsw37h3bpw5f/spack-src/lib", checksumkind: CSK_MD5, checksum: "7cb5f99232d7b54e05c9f9d3c2375652")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !51, line: 27, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 44, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!54 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_t", file: !4, line: 303, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip", file: !25, line: 213, size: 1024, elements: !58)
!58 = !{!59, !105, !106, !107, !108, !109, !110, !132, !133, !134, !135, !136, !187, !188, !189, !191, !195}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !57, file: !25, line: 214, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_source_t", file: !4, line: 306, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_source", file: !25, line: 318, size: 640, elements: !63)
!63 = !{!64, !65, !85, !86, !96, !97, !98, !100, !102, !103, !104}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !62, file: !25, line: 319, baseType: !60, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !62, file: !25, line: 323, baseType: !66, size: 64, offset: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !62, file: !25, line: 320, size: 64, elements: !67)
!67 = !{!68, !80}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !66, file: !25, line: 321, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_source_callback", file: !4, line: 311, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!48, !73, !73, !74, !79}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint64_t", file: !49, line: 43, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !76, line: 27, baseType: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !53, line: 45, baseType: !78)
!78 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_source_cmd_t", file: !4, line: 233, baseType: !3)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !66, file: !25, line: 322, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_source_layered_callback", file: !25, line: 151, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!48, !60, !73, !73, !74, !3}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !62, file: !25, line: 324, baseType: !73, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !62, file: !25, line: 325, baseType: !87, size: 128, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_error_t", file: !4, line: 304, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_error", file: !4, line: 270, size: 128, elements: !89)
!89 = !{!90, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "zip_err", scope: !88, file: !4, line: 271, baseType: !91, size: 32)
!91 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sys_err", scope: !88, file: !4, line: 272, baseType: !91, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !88, file: !4, line: 273, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "supports", scope: !62, file: !25, line: 326, baseType: !48, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "open_count", scope: !62, file: !25, line: 327, baseType: !5, size: 32, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "write_state", scope: !62, file: !25, line: 328, baseType: !99, size: 32, offset: 416)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_source_write_state_t", file: !25, line: 316, baseType: !24)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "source_closed", scope: !62, file: !25, line: 329, baseType: !101, size: 8, offset: 448)
!101 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "source_archive", scope: !62, file: !25, line: 330, baseType: !55, size: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !62, file: !25, line: 331, baseType: !5, size: 32, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !62, file: !25, line: 332, baseType: !101, size: 8, offset: 608)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "open_flags", scope: !57, file: !25, line: 215, baseType: !5, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !57, file: !25, line: 216, baseType: !87, size: 128, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !57, file: !25, line: 218, baseType: !5, size: 32, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ch_flags", scope: !57, file: !25, line: 219, baseType: !5, size: 32, offset: 288)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "default_password", scope: !57, file: !25, line: 221, baseType: !94, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "comment_orig", scope: !57, file: !25, line: 223, baseType: !111, size: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_string_t", file: !25, line: 206, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_string", file: !25, line: 351, size: 256, elements: !114)
!114 = !{!115, !121, !126, !127, !128}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !113, file: !25, line: 352, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint8_t", file: !49, line: 22, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !76, line: 24, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !53, line: 38, baseType: !120)
!120 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !113, file: !25, line: 353, baseType: !122, size: 16, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint16_t", file: !49, line: 29, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !76, line: 25, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !53, line: 40, baseType: !125)
!125 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !113, file: !25, line: 354, baseType: !31, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "converted", scope: !113, file: !25, line: 355, baseType: !116, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "converted_length", scope: !113, file: !25, line: 356, baseType: !129, size: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint32_t", file: !49, line: 36, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !76, line: 26, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !53, line: 42, baseType: !5)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "comment_changes", scope: !57, file: !25, line: 224, baseType: !111, size: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "comment_changed", scope: !57, file: !25, line: 225, baseType: !101, size: 8, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nentry", scope: !57, file: !25, line: 227, baseType: !74, size: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nentry_alloc", scope: !57, file: !25, line: 228, baseType: !74, size: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !57, file: !25, line: 229, baseType: !137, size: 64, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_entry_t", file: !25, line: 204, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_entry", file: !25, line: 341, size: 256, elements: !140)
!140 = !{!141, !184, !185, !186}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !139, file: !25, line: 342, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_dirent_t", file: !25, line: 203, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_dirent", file: !25, line: 261, size: 960, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !157, !161, !162, !163, !164, !165, !176, !177, !178, !179, !180, !181, !182, !183}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !144, file: !25, line: 262, baseType: !129, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "local_extra_fields_read", scope: !144, file: !25, line: 263, baseType: !101, size: 8, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !144, file: !25, line: 264, baseType: !101, size: 8, offset: 40)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "crc_valid", scope: !144, file: !25, line: 266, baseType: !101, size: 8, offset: 48)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "version_madeby", scope: !144, file: !25, line: 268, baseType: !122, size: 16, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "version_needed", scope: !144, file: !25, line: 269, baseType: !122, size: 16, offset: 80)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bitflags", scope: !144, file: !25, line: 270, baseType: !122, size: 16, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !144, file: !25, line: 271, baseType: !154, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_int32_t", file: !49, line: 32, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !51, line: 26, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !53, line: 41, baseType: !91)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "last_mod", scope: !144, file: !25, line: 272, baseType: !158, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !159, line: 10, baseType: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !53, line: 160, baseType: !54)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !144, file: !25, line: 273, baseType: !129, size: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !144, file: !25, line: 274, baseType: !74, size: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "uncomp_size", scope: !144, file: !25, line: 275, baseType: !74, size: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !144, file: !25, line: 276, baseType: !111, size: 64, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "extra_fields", scope: !144, file: !25, line: 277, baseType: !166, size: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_extra_field_t", file: !25, line: 205, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_extra_field", file: !25, line: 302, size: 192, elements: !169)
!169 = !{!170, !171, !173, !174, !175}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !25, line: 303, baseType: !166, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !168, file: !25, line: 304, baseType: !172, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_flags_t", file: !4, line: 309, baseType: !129)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !25, line: 305, baseType: !122, size: 16, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !168, file: !25, line: 306, baseType: !122, size: 16, offset: 112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !25, line: 307, baseType: !116, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !144, file: !25, line: 278, baseType: !111, size: 64, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "disk_number", scope: !144, file: !25, line: 279, baseType: !129, size: 32, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "int_attrib", scope: !144, file: !25, line: 280, baseType: !122, size: 16, offset: 672)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ext_attrib", scope: !144, file: !25, line: 281, baseType: !129, size: 32, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !144, file: !25, line: 282, baseType: !74, size: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !144, file: !25, line: 284, baseType: !122, size: 16, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_method", scope: !144, file: !25, line: 285, baseType: !122, size: 16, offset: 848)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !144, file: !25, line: 286, baseType: !94, size: 64, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "changes", scope: !139, file: !25, line: 343, baseType: !142, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !139, file: !25, line: 344, baseType: !60, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "deleted", scope: !139, file: !25, line: 345, baseType: !101, size: 8, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nopen_source", scope: !57, file: !25, line: 231, baseType: !5, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nopen_source_alloc", scope: !57, file: !25, line: 232, baseType: !5, size: 32, offset: 800)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "open_source", scope: !57, file: !25, line: 233, baseType: !190, size: 64, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !57, file: !25, line: 235, baseType: !192, size: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_hash_t", file: !25, line: 208, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "zip_hash", file: !25, line: 199, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !57, file: !25, line: 237, baseType: !196, size: 64, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_progress_t", file: !25, line: 209, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "zip_progress", file: !25, line: 200, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!201 = !{!202, !203}
!202 = !DILocalVariable(name: "za", arg: 1, scope: !45, file: !1, line: 42, type: !55)
!203 = !DILocalVariable(name: "name", arg: 2, scope: !45, file: !1, line: 42, type: !199)
!204 = !{!205, !205, i64 0}
!205 = !{!"any pointer", !206, i64 0}
!206 = !{!"omnipotent char", !207, i64 0}
!207 = !{!"Simple C/C++ TBAA"}
!208 = !DILocation(line: 42, column: 20, scope: !45)
!209 = !DILocation(line: 42, column: 36, scope: !45)
!210 = !DILocation(line: 44, column: 24, scope: !45)
!211 = !DILocation(line: 44, column: 28, scope: !45)
!212 = !DILocation(line: 44, column: 12, scope: !45)
!213 = !DILocation(line: 44, column: 5, scope: !45)
!214 = !DISubprogram(name: "zip_dir_add", scope: !4, file: !4, line: 333, type: !215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!215 = !DISubroutineType(types: !216)
!216 = !{!48, !55, !199, !172}
