; ModuleID = 'samples/203.bc'
source_filename = "pysam/libcsamtools.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { i64, ptr }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.PyModuleDef_Slot = type { i32, ptr }
%struct.__Pyx_StringTabEntry = type { ptr, ptr, i64, ptr, i8, i8, i8 }
%struct._longobject = type { %struct.PyVarObject, [1 x i32] }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct._ts = type { ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, i64, i64, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr, i64, i64, %struct.PyTraceInfo, ptr, ptr, ptr, %struct._err_stackitem, %struct._PyCFrame }
%struct.PyTraceInfo = type { ptr, %struct._line_offsets }
%struct._line_offsets = type { i32, i32, i32, %struct._opaque }
%struct._opaque = type { i32, ptr, ptr }
%struct._err_stackitem = type { ptr, ptr }
%struct._PyCFrame = type { i8, ptr, ptr }
%struct._frame = type { %struct._object, ptr, ptr, ptr, i32, i8, i8, i8, [1 x ptr] }
%struct.PyDictObject = type { %struct._object, i64, i64, ptr, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_pysam__libcsamtools", scope: !2, file: !3, line: 1247, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !405, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "pysam/libcsamtools.c", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build/aidengro/spack-stage-py-pysam-0.21.0-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z/spack-src", checksumkind: CSK_MD5, checksum: "a2cb825479cd3d1b8d72ea03ff4972d5")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 676, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/object.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "059c0d359e891772b7814c88f6fa55ff")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !{!13, !14, !56, !323, !254, !361, !380, !399, !321}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !16, line: 18, baseType: !17)
!16 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/pytypedefs.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "38482a77e5b3188ef0e82980904fb142")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 100, size: 128, elements: !18)
!18 = !{!19, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !17, file: !6, line: 102, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !21, line: 131, baseType: !22)
!21 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/pyport.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "a198b01de4c7067d893cd27dc3108f8a")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !23, line: 108, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !25, line: 194, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!26 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !17, file: !6, line: 103, baseType: !28, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !16, line: 20, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !31, line: 148, size: 3264, elements: !32)
!31 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/object.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "5cecebbdf3585641a3ef3ab354ac3a06")
!32 = !{!33, !39, !43, !44, !45, !50, !51, !57, !62, !81, !83, !136, !167, !179, !185, !186, !187, !189, !191, !223, !225, !226, !235, !236, !241, !242, !244, !246, !257, !261, !280, !281, !282, !284, !286, !287, !289, !294, !299, !304, !305, !306, !307, !308, !309, !310, !311, !313, !314}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !31, line: 149, baseType: !34, size: 192)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 112, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 109, size: 192, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !6, line: 110, baseType: !15, size: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !35, file: !6, line: 111, baseType: !20, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !30, file: !31, line: 150, baseType: !40, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !30, file: !31, line: 151, baseType: !20, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !30, file: !31, line: 151, baseType: !20, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !30, file: !31, line: 155, baseType: !46, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 213, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !14}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !30, file: !31, line: 156, baseType: !20, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !30, file: !31, line: 157, baseType: !52, size: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 214, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!14, !14, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !30, file: !31, line: 158, baseType: !58, size: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 216, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!7, !14, !56, !14}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !30, file: !31, line: 159, baseType: !63, size: 64, offset: 640)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !31, line: 135, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 130, size: 256, elements: !66)
!66 = !{!67, !72, !73, !74}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !65, file: !31, line: 131, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 196, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!14, !14}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !65, file: !31, line: 132, baseType: !68, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !65, file: !31, line: 133, baseType: !68, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !65, file: !31, line: 134, baseType: !75, size: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !31, line: 128, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !14, !14, !80}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 680, baseType: !5)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !30, file: !31, line: 161, baseType: !82, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 218, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !30, file: !31, line: 165, baseType: !84, size: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !31, line: 106, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 61, size: 2304, elements: !87)
!87 = !{!88, !93, !94, !95, !96, !97, !102, !103, !104, !105, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !86, file: !31, line: 66, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 197, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!14, !14, !14}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !86, file: !31, line: 67, baseType: !89, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !86, file: !31, line: 68, baseType: !89, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !86, file: !31, line: 69, baseType: !89, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !86, file: !31, line: 70, baseType: !89, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !86, file: !31, line: 71, baseType: !98, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 198, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!14, !14, !14, !14}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !86, file: !31, line: 72, baseType: !68, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !86, file: !31, line: 73, baseType: !68, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !86, file: !31, line: 74, baseType: !68, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !86, file: !31, line: 75, baseType: !106, size: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 199, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!7, !14}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !86, file: !31, line: 76, baseType: !68, size: 64, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !86, file: !31, line: 77, baseType: !89, size: 64, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !86, file: !31, line: 78, baseType: !89, size: 64, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !86, file: !31, line: 79, baseType: !89, size: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !86, file: !31, line: 80, baseType: !89, size: 64, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !86, file: !31, line: 81, baseType: !89, size: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !86, file: !31, line: 82, baseType: !68, size: 64, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !86, file: !31, line: 83, baseType: !13, size: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !86, file: !31, line: 84, baseType: !68, size: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !86, file: !31, line: 86, baseType: !89, size: 64, offset: 1216)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !86, file: !31, line: 87, baseType: !89, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !86, file: !31, line: 88, baseType: !89, size: 64, offset: 1344)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !86, file: !31, line: 89, baseType: !89, size: 64, offset: 1408)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !86, file: !31, line: 90, baseType: !98, size: 64, offset: 1472)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !86, file: !31, line: 91, baseType: !89, size: 64, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !86, file: !31, line: 92, baseType: !89, size: 64, offset: 1600)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !86, file: !31, line: 93, baseType: !89, size: 64, offset: 1664)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !86, file: !31, line: 94, baseType: !89, size: 64, offset: 1728)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !86, file: !31, line: 95, baseType: !89, size: 64, offset: 1792)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !86, file: !31, line: 97, baseType: !89, size: 64, offset: 1856)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !86, file: !31, line: 98, baseType: !89, size: 64, offset: 1920)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !86, file: !31, line: 99, baseType: !89, size: 64, offset: 1984)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !86, file: !31, line: 100, baseType: !89, size: 64, offset: 2048)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !86, file: !31, line: 102, baseType: !68, size: 64, offset: 2112)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !86, file: !31, line: 104, baseType: !89, size: 64, offset: 2176)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !86, file: !31, line: 105, baseType: !89, size: 64, offset: 2240)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !30, file: !31, line: 166, baseType: !137, size: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !31, line: 120, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 108, size: 640, elements: !140)
!140 = !{!141, !146, !147, !152, !153, !154, !159, !160, !165, !166}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !139, file: !31, line: 109, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 200, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!20, !14}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !139, file: !31, line: 110, baseType: !89, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !139, file: !31, line: 111, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 201, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!14, !14, !20}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !139, file: !31, line: 112, baseType: !148, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !139, file: !31, line: 113, baseType: !13, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !139, file: !31, line: 114, baseType: !155, size: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 203, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!7, !14, !20, !14}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !139, file: !31, line: 115, baseType: !13, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !139, file: !31, line: 116, baseType: !161, size: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 207, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!7, !14, !14}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !139, file: !31, line: 118, baseType: !89, size: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !139, file: !31, line: 119, baseType: !148, size: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !30, file: !31, line: 167, baseType: !168, size: 64, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !31, line: 126, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 122, size: 192, elements: !171)
!171 = !{!172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !170, file: !31, line: 123, baseType: !142, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !170, file: !31, line: 124, baseType: !89, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !170, file: !31, line: 125, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 205, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!7, !14, !14, !14}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !30, file: !31, line: 171, baseType: !180, size: 64, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 219, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !14}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !21, line: 145, baseType: !20)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !30, file: !31, line: 172, baseType: !98, size: 64, offset: 1024)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !30, file: !31, line: 173, baseType: !82, size: 64, offset: 1088)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !30, file: !31, line: 174, baseType: !188, size: 64, offset: 1152)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 215, baseType: !90)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !30, file: !31, line: 175, baseType: !190, size: 64, offset: 1216)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 217, baseType: !176)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !30, file: !31, line: 178, baseType: !192, size: 64, offset: 1280)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !31, line: 140, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 137, size: 128, elements: !195)
!195 = !{!196, !218}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !194, file: !31, line: 138, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !31, line: 54, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!7, !14, !201, !7}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !203, line: 33, baseType: !204)
!203 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/pybuffer.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "b062a75218ff363c388d03c953e9be96")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 20, size: 640, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !215, !216, !217}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !204, file: !203, line: 21, baseType: !13, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !204, file: !203, line: 22, baseType: !14, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !204, file: !203, line: 23, baseType: !20, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !204, file: !203, line: 24, baseType: !20, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !204, file: !203, line: 26, baseType: !7, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !204, file: !203, line: 27, baseType: !7, size: 32, offset: 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !204, file: !203, line: 28, baseType: !56, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !204, file: !203, line: 29, baseType: !214, size: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !204, file: !203, line: 30, baseType: !214, size: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !204, file: !203, line: 31, baseType: !214, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !204, file: !203, line: 32, baseType: !13, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !194, file: !31, line: 139, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !31, line: 55, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !14, !201}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !30, file: !31, line: 181, baseType: !224, size: 64, offset: 1344)
!224 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !30, file: !31, line: 183, baseType: !40, size: 64, offset: 1408)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !30, file: !31, line: 187, baseType: !227, size: 64, offset: 1472)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 209, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!7, !14, !231, !13}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 208, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!7, !14, !13}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !30, file: !31, line: 190, baseType: !106, size: 64, offset: 1536)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !30, file: !31, line: 194, baseType: !237, size: 64, offset: 1600)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 220, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!14, !14, !14, !7}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !30, file: !31, line: 197, baseType: !20, size: 64, offset: 1664)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !30, file: !31, line: 200, baseType: !243, size: 64, offset: 1728)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 221, baseType: !69)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !30, file: !31, line: 201, baseType: !245, size: 64, offset: 1792)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 222, baseType: !69)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !30, file: !31, line: 204, baseType: !247, size: 64, offset: 1856)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !16, line: 14, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !250, line: 54, size: 256, elements: !251)
!250 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/methodobject.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "d16253797aba078267dcb5d0afce23bc")
!251 = !{!252, !253, !255, !256}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !249, file: !250, line: 55, baseType: !40, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !249, file: !250, line: 56, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !250, line: 19, baseType: !90)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !249, file: !250, line: 57, baseType: !7, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !249, file: !250, line: 59, baseType: !40, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !30, file: !31, line: 205, baseType: !258, size: 64, offset: 1920)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !16, line: 16, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !16, line: 16, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !30, file: !31, line: 206, baseType: !262, size: 64, offset: 1984)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !16, line: 15, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !265, line: 11, size: 320, elements: !266)
!265 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/descrobject.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "242ee4d5fc45bad34457db881bf071ca")
!266 = !{!267, !268, !273, !278, !279}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !264, file: !265, line: 12, baseType: !40, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !264, file: !265, line: 13, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !265, line: 8, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!14, !14, !13}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !264, file: !265, line: 14, baseType: !274, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !265, line: 9, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!7, !14, !14, !13}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !264, file: !265, line: 15, baseType: !40, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !264, file: !265, line: 16, baseType: !13, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !30, file: !31, line: 208, baseType: !28, size: 64, offset: 2048)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !30, file: !31, line: 209, baseType: !14, size: 64, offset: 2112)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !30, file: !31, line: 210, baseType: !283, size: 64, offset: 2176)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 223, baseType: !99)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !30, file: !31, line: 211, baseType: !285, size: 64, offset: 2240)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 224, baseType: !176)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !30, file: !31, line: 212, baseType: !20, size: 64, offset: 2304)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !30, file: !31, line: 213, baseType: !288, size: 64, offset: 2368)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 225, baseType: !176)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !30, file: !31, line: 214, baseType: !290, size: 64, offset: 2432)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 227, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!14, !28, !20}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !30, file: !31, line: 215, baseType: !295, size: 64, offset: 2496)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 226, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!14, !28, !14, !14}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !30, file: !31, line: 216, baseType: !300, size: 64, offset: 2560)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 212, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !13}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !30, file: !31, line: 217, baseType: !106, size: 64, offset: 2624)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !30, file: !31, line: 218, baseType: !14, size: 64, offset: 2688)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !30, file: !31, line: 219, baseType: !14, size: 64, offset: 2752)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !30, file: !31, line: 220, baseType: !14, size: 64, offset: 2816)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !30, file: !31, line: 221, baseType: !14, size: 64, offset: 2880)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !30, file: !31, line: 222, baseType: !14, size: 64, offset: 2944)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !30, file: !31, line: 223, baseType: !46, size: 64, offset: 3008)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !30, file: !31, line: 226, baseType: !312, size: 32, offset: 3072)
!312 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !30, file: !31, line: 228, baseType: !46, size: 64, offset: 3136)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !30, file: !31, line: 229, baseType: !315, size: 64, offset: 3200)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !31, line: 57, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!14, !14, !319, !321, !14}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !322, line: 70, baseType: !224)
!322 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !16, line: 21, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !326, line: 103, size: 1536, elements: !327)
!326 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/code.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "0b18b017cf6ecc9860048f5ec02e4f52")
!327 = !{!328, !329, !330, !331, !332, !333, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !325, file: !326, line: 103, baseType: !34, size: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "co_warmup", scope: !325, file: !326, line: 103, baseType: !334, size: 16, offset: 416)
!334 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_co_linearray_entry_size", scope: !325, file: !326, line: 103, baseType: !334, size: 16, offset: 432)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 480)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 544)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 608)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "co_nplaincellvars", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 672)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 736)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 1024)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 1152)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !325, file: !326, line: 103, baseType: !14, size: 64, offset: 1216)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_co_linearray", scope: !325, file: !326, line: 103, baseType: !56, size: 64, offset: 1280)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !325, file: !326, line: 103, baseType: !7, size: 32, offset: 1344)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !325, file: !326, line: 103, baseType: !13, size: 64, offset: 1408)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !325, file: !326, line: 103, baseType: !358, size: 8, offset: 1472)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 1)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !363, line: 29, baseType: !364)
!363 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/dictobject.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "ca445c2681ff34d200fbf38fa4280db0")
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 11, size: 384, elements: !365)
!365 = !{!366, !367, !368, !372, !376}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !364, file: !363, line: 12, baseType: !15, size: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !364, file: !363, line: 15, baseType: !20, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ma_version_tag", scope: !364, file: !363, line: 19, baseType: !369, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !370, line: 27, baseType: !371)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !25, line: 45, baseType: !224)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !364, file: !363, line: 21, baseType: !373, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !363, line: 5, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !31, line: 254, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !364, file: !363, line: 28, baseType: !377, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictValues", file: !363, line: 6, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictvalues", file: !363, line: 6, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !382, line: 206, baseType: !383)
!382 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/unicodeobject.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "f386b2e1a1c191e8bf459eb4bae7acee")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 72, size: 384, elements: !384)
!384 = !{!385, !386, !387, !388, !396}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 146, baseType: !15, size: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !383, file: !382, line: 147, baseType: !20, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !383, file: !382, line: 148, baseType: !184, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !383, file: !382, line: 204, baseType: !389, size: 32, offset: 256)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !383, file: !382, line: 149, size: 32, elements: !390)
!390 = !{!391, !392, !393, !394, !395}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !389, file: !382, line: 158, baseType: !312, size: 2, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !389, file: !382, line: 186, baseType: !312, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !389, file: !382, line: 191, baseType: !312, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !389, file: !382, line: 195, baseType: !312, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !389, file: !382, line: 200, baseType: !312, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !383, file: !382, line: 205, baseType: !397, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !322, line: 96, baseType: !7)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !3, line: 1195, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 1192, size: 128, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !401, file: !3, line: 1193, baseType: !323, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !401, file: !3, line: 1194, baseType: !7, size: 32, offset: 64)
!405 = !{!0, !406, !411, !441, !444, !449, !454, !459, !464, !466, !471, !473, !478, !483, !485, !495, !500, !502, !507, !509, !511, !516, !518, !523, !528, !533, !538, !543, !546, !548, !550, !552, !554, !556, !558, !574, !576, !579, !582, !584, !587, !589, !591, !594, !596, !598, !600, !602, !604, !606, !608, !610, !615, !617, !619, !621, !624, !629, !631, !633, !635, !637, !639, !641, !643, !645, !647, !649, !651, !653, !826, !828, !835, !837, !842}
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1316, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 104, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 13)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !3, line: 1314, type: !413, isLocal: true, isDefinition: true)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !414, line: 74, size: 832, elements: !415)
!414 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/moduleobject.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "daa9b768501fad61bad25a7caf4dc4db")
!415 = !{!416, !427, !428, !429, !430, !431, !438, !439, !440}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !413, file: !414, line: 75, baseType: !417, size: 320)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !414, line: 49, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !414, line: 44, size: 320, elements: !419)
!419 = !{!420, !421, !425, !426}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !418, file: !414, line: 45, baseType: !15, size: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !418, file: !414, line: 46, baseType: !422, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!14}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !418, file: !414, line: 47, baseType: !20, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !418, file: !414, line: 48, baseType: !14, size: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !413, file: !414, line: 76, baseType: !40, size: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !413, file: !414, line: 77, baseType: !40, size: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !413, file: !414, line: 78, baseType: !20, size: 64, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !413, file: !414, line: 79, baseType: !247, size: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !413, file: !414, line: 80, baseType: !432, size: 64, offset: 576)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !16, line: 13, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !414, line: 60, size: 128, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !434, file: !414, line: 61, baseType: !7, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !434, file: !414, line: 62, baseType: !13, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !413, file: !414, line: 81, baseType: !227, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !413, file: !414, line: 82, baseType: !106, size: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !413, file: !414, line: 83, baseType: !300, size: 64, offset: 768)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !3, line: 1299, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 256, elements: !359)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !3, line: 1307, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 384, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 3)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1517, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 40, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 5)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1524, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 56, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 7)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1524, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 88, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 11)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1525, type: !456, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1525, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 72, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 9)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1526, type: !456, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1526, type: !475, isLocal: true, isDefinition: true)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 96, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 12)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1527, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 216, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 27)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1527, type: !468, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !487, file: !3, line: 1475, type: !492, isLocal: true, isDefinition: true)
!487 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !3, file: !3, line: 1473, type: !488, scopeLine: 1473, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !490)
!488 = !DISubroutineType(types: !489)
!489 = !{!7}
!490 = !{!491}
!491 = !DILocalVariable(name: "current_id", scope: !487, file: !3, line: 1476, type: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !493, line: 27, baseType: !494)
!493 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !25, line: 44, baseType: !26)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1491, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 760, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 95)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !3, line: 1032, type: !14, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1547, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 680, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 85)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1568, type: !358, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1607, type: !468, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1609, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 120, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 15)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1611, type: !408, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1623, type: !520, isLocal: true, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 152, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 19)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1665, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 192, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 24)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !3, line: 2550, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 48, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 6)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !3, line: 2575, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 608, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 76)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1046, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 184, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 23)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !3, line: 1045, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !359)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "__pyx_empty_tuple", scope: !2, file: !3, line: 1036, type: !14, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "__pyx_empty_bytes", scope: !2, file: !3, line: 1037, type: !14, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "__pyx_empty_unicode", scope: !2, file: !3, line: 1038, type: !14, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "__pyx_d", scope: !2, file: !3, line: 1033, type: !14, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "__pyx_b", scope: !2, file: !3, line: 1034, type: !14, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "__pyx_cython_runtime", scope: !2, file: !3, line: 1035, type: !14, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "__pyx_string_tab", scope: !2, file: !3, line: 1344, type: !560, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 2560, elements: !572)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_StringTabEntry", file: !3, line: 846, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 845, size: 320, elements: !563)
!563 = !{!564, !565, !566, !568, !569, !570, !571}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !562, file: !3, line: 845, baseType: !80, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !562, file: !3, line: 845, baseType: !40, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !562, file: !3, line: 845, baseType: !567, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !562, file: !3, line: 845, baseType: !40, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "is_unicode", scope: !562, file: !3, line: 846, baseType: !41, size: 8, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "is_str", scope: !562, file: !3, line: 846, baseType: !41, size: 8, offset: 264)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "intern", scope: !562, file: !3, line: 846, baseType: !41, size: 8, offset: 272)
!572 = !{!573}
!573 = !DISubrange(count: 8)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "__pyx_n_s_cline_in_traceback", scope: !2, file: !3, line: 1257, type: !14, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "__pyx_k_cline_in_traceback", scope: !2, file: !3, line: 1254, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 152, elements: !521)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "__pyx_k_main", scope: !2, file: !3, line: 1250, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 72, elements: !469)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "__pyx_k_name", scope: !2, file: !3, line: 1251, type: !581, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "__pyx_k_py_samtools", scope: !2, file: !3, line: 1253, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 96, elements: !476)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "__pyx_k_pysam_libcsamtools", scope: !2, file: !3, line: 1255, type: !578, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "__pyx_kp_s_pysam_libcsamtools_pyx", scope: !2, file: !3, line: 1262, type: !14, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "__pyx_k_pysam_libcsamtools_pyx", scope: !2, file: !3, line: 1256, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 184, elements: !541)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "__pyx_k_test", scope: !2, file: !3, line: 1252, type: !581, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !3, line: 1042, type: !40, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !3, line: 1039, type: !7, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !3, line: 1040, type: !7, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "__pyx_n_s_name", scope: !2, file: !3, line: 1259, type: !14, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "__pyx_n_s_main", scope: !2, file: !3, line: 1258, type: !14, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !3, line: 487, type: !475, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !3, line: 489, type: !520, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !3, line: 491, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 144, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 18)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !3, line: 493, type: !461, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !3, line: 495, type: !408, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !3, line: 497, type: !468, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !3, line: 498, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64, elements: !572)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !3, line: 499, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 80, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 10)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !3, line: 500, type: !468, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !3, line: 501, type: !475, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !3, line: 502, type: !475, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !3, line: 503, type: !475, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !3, line: 504, type: !408, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !3, line: 508, type: !623, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "__pyx_codeobj_", scope: !2, file: !3, line: 1265, type: !14, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1275, type: !475, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "__pyx_mdef_5pysam_12libcsamtools_1py_samtools", scope: !2, file: !3, line: 1275, type: !248, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "__pyx_n_s_pysam_libcsamtools", scope: !2, file: !3, line: 1261, type: !14, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "__pyx_n_s_py_samtools", scope: !2, file: !3, line: 1260, type: !14, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "__pyx_n_s_test", scope: !2, file: !3, line: 1263, type: !14, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "__pyx_dict_version", scope: !655, file: !3, line: 1779, type: !369, isLocal: true, isDefinition: true)
!655 = distinct !DISubprogram(name: "__Pyx_CLineForTraceback", scope: !3, file: !3, line: 1766, type: !656, scopeLine: 1766, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !815)
!656 = !DISubroutineType(types: !657)
!657 = !{!7, !658, !7}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !16, line: 24, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !661, line: 82, size: 2880, elements: !662)
!661 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/pystate.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "474ae1b51b4924e8bec8b13b56a451da")
!662 = !{!663, !664, !665, !669, !670, !671, !672, !673, !674, !675, !676, !747, !752, !753, !754, !755, !756, !757, !758, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !801, !811, !812, !813, !814}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !660, file: !661, line: 85, baseType: !658, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !661, line: 86, baseType: !658, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !660, file: !661, line: 87, baseType: !666, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !16, line: 25, baseType: !668)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !16, line: 25, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_initialized", scope: !660, file: !661, line: 93, baseType: !7, size: 32, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_static", scope: !660, file: !661, line: 96, baseType: !7, size: 32, offset: 224)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_remaining", scope: !660, file: !661, line: 98, baseType: !7, size: 32, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_limit", scope: !660, file: !661, line: 99, baseType: !7, size: 32, offset: 288)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_headroom", scope: !660, file: !661, line: 100, baseType: !7, size: 32, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !660, file: !661, line: 105, baseType: !7, size: 32, offset: 352)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tracing_what", scope: !660, file: !661, line: 106, baseType: !7, size: 32, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cframe", scope: !660, file: !661, line: 110, baseType: !677, size: 64, offset: 448)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCFrame", file: !661, line: 53, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyCFrame", file: !661, line: 38, size: 192, elements: !680)
!680 = !{!681, !685, !745}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !679, file: !661, line: 49, baseType: !682, size: 8)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !370, line: 24, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !25, line: 38, baseType: !684)
!684 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "current_frame", scope: !679, file: !661, line: 51, baseType: !686, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyInterpreterFrame", file: !688, line: 47, size: 640, elements: !689)
!688 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/internal/pycore_frame.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "553e3382ea38f2c6ad91a452160e87fd")
!689 = !{!690, !714, !715, !716, !717, !718, !733, !734, !740, !741, !743, !744}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "f_func", scope: !687, file: !688, line: 49, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFunctionObject", file: !693, line: 59, baseType: !694)
!693 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/funcobject.h", directory: "/local-ssd/py-pysam-j7d6uw6tj3ibcqfq2vvy3vwnd5ztte4z-build", checksumkind: CSK_MD5, checksum: "7328382f2637048b906e52f1dfe7b495")
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !693, line: 36, size: 1088, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !694, file: !693, line: 37, baseType: !15, size: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "func_globals", scope: !694, file: !693, line: 38, baseType: !14, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "func_builtins", scope: !694, file: !693, line: 38, baseType: !14, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "func_name", scope: !694, file: !693, line: 38, baseType: !14, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "func_qualname", scope: !694, file: !693, line: 38, baseType: !14, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "func_code", scope: !694, file: !693, line: 38, baseType: !14, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "func_defaults", scope: !694, file: !693, line: 38, baseType: !14, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "func_kwdefaults", scope: !694, file: !693, line: 38, baseType: !14, size: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "func_closure", scope: !694, file: !693, line: 38, baseType: !14, size: 64, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "func_doc", scope: !694, file: !693, line: 39, baseType: !14, size: 64, offset: 640)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "func_dict", scope: !694, file: !693, line: 40, baseType: !14, size: 64, offset: 704)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "func_weakreflist", scope: !694, file: !693, line: 41, baseType: !14, size: 64, offset: 768)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "func_module", scope: !694, file: !693, line: 42, baseType: !14, size: 64, offset: 832)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "func_annotations", scope: !694, file: !693, line: 43, baseType: !14, size: 64, offset: 896)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !694, file: !693, line: 44, baseType: !315, size: 64, offset: 960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "func_version", scope: !694, file: !693, line: 52, baseType: !712, size: 32, offset: 1024)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !370, line: 26, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !25, line: 42, baseType: !312)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !687, file: !688, line: 50, baseType: !14, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !687, file: !688, line: 51, baseType: !14, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !687, file: !688, line: 52, baseType: !14, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !687, file: !688, line: 53, baseType: !323, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "frame_obj", scope: !687, file: !688, line: 54, baseType: !719, size: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFrameObject", file: !16, line: 22, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !688, line: 15, size: 448, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !721, file: !688, line: 16, baseType: !15, size: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !721, file: !688, line: 17, baseType: !719, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "f_frame", scope: !721, file: !688, line: 18, baseType: !686, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !721, file: !688, line: 19, baseType: !14, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !721, file: !688, line: 20, baseType: !7, size: 32, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace_lines", scope: !721, file: !688, line: 21, baseType: !42, size: 8, offset: 352)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace_opcodes", scope: !721, file: !688, line: 22, baseType: !42, size: 8, offset: 360)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "f_fast_as_locals", scope: !721, file: !688, line: 23, baseType: !42, size: 8, offset: 368)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_f_frame_data", scope: !721, file: !688, line: 25, baseType: !732, size: 64, offset: 384)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 64, elements: !359)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !687, file: !688, line: 56, baseType: !686, size: 64, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "prev_instr", scope: !687, file: !688, line: 61, baseType: !735, size: 64, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_CODEUNIT", file: !326, line: 19, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !370, line: 25, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !25, line: 40, baseType: !739)
!739 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "stacktop", scope: !687, file: !688, line: 62, baseType: !7, size: 32, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "is_entry", scope: !687, file: !688, line: 63, baseType: !742, size: 8, offset: 544)
!742 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !687, file: !688, line: 64, baseType: !42, size: 8, offset: 552)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "localsplus", scope: !687, file: !688, line: 66, baseType: !732, size: 64, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !679, file: !661, line: 52, baseType: !746, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !660, file: !661, line: 112, baseType: !748, size: 64, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !661, line: 14, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!7, !14, !719, !7, !14}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !660, file: !661, line: 113, baseType: !748, size: 64, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !660, file: !661, line: 114, baseType: !14, size: 64, offset: 640)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !660, file: !661, line: 115, baseType: !14, size: 64, offset: 704)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !660, file: !661, line: 118, baseType: !14, size: 64, offset: 768)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !660, file: !661, line: 119, baseType: !14, size: 64, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !660, file: !661, line: 120, baseType: !14, size: 64, offset: 896)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "exc_info", scope: !660, file: !661, line: 125, baseType: !759, size: 64, offset: 960)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyErr_StackItem", file: !661, line: 73, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_err_stackitem", file: !661, line: 55, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !761, file: !661, line: 69, baseType: !14, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "previous_item", scope: !761, file: !661, line: 71, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !660, file: !661, line: 127, baseType: !14, size: 64, offset: 1024)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !660, file: !661, line: 129, baseType: !7, size: 32, offset: 1088)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !660, file: !661, line: 131, baseType: !14, size: 64, offset: 1152)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !660, file: !661, line: 132, baseType: !224, size: 64, offset: 1216)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "native_thread_id", scope: !660, file: !661, line: 138, baseType: !224, size: 64, offset: 1280)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !660, file: !661, line: 140, baseType: !7, size: 32, offset: 1344)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !660, file: !661, line: 141, baseType: !14, size: 64, offset: 1408)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !660, file: !661, line: 166, baseType: !301, size: 64, offset: 1472)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !660, file: !661, line: 167, baseType: !13, size: 64, offset: 1536)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "coroutine_origin_tracking_depth", scope: !660, file: !661, line: 169, baseType: !7, size: 32, offset: 1600)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "async_gen_firstiter", scope: !660, file: !661, line: 171, baseType: !14, size: 64, offset: 1664)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "async_gen_finalizer", scope: !660, file: !661, line: 172, baseType: !14, size: 64, offset: 1728)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !660, file: !661, line: 174, baseType: !14, size: 64, offset: 1792)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "context_ver", scope: !660, file: !661, line: 175, baseType: !369, size: 64, offset: 1856)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !660, file: !661, line: 178, baseType: !369, size: 64, offset: 1920)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "trace_info", scope: !660, file: !661, line: 180, baseType: !782, size: 384, offset: 1984)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTraceInfo", file: !661, line: 34, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !661, line: 31, size: 384, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !783, file: !661, line: 32, baseType: !323, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !783, file: !661, line: 33, baseType: !787, size: 320, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeAddressRange", file: !326, line: 184, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_line_offsets", file: !326, line: 179, size: 320, elements: !789)
!789 = !{!790, !791, !792, !793}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ar_start", scope: !788, file: !326, line: 180, baseType: !7, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ar_end", scope: !788, file: !326, line: 181, baseType: !7, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ar_line", scope: !788, file: !326, line: 182, baseType: !7, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !788, file: !326, line: 183, baseType: !794, size: 192, offset: 128)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque", file: !326, line: 173, size: 192, elements: !795)
!795 = !{!796, !797, !800}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "computed_line", scope: !794, file: !326, line: 174, baseType: !7, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lo_next", scope: !794, file: !326, line: 175, baseType: !798, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !794, file: !326, line: 176, baseType: !798, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "datastack_chunk", scope: !660, file: !661, line: 182, baseType: !802, size: 64, offset: 2368)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyStackChunk", file: !661, line: 80, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stack_chunk", file: !661, line: 75, size: 256, elements: !805)
!805 = !{!806, !808, !809, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !804, file: !661, line: 76, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !804, file: !661, line: 77, baseType: !321, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !804, file: !661, line: 78, baseType: !321, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !804, file: !661, line: 79, baseType: !732, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "datastack_top", scope: !660, file: !661, line: 183, baseType: !80, size: 64, offset: 2432)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "datastack_limit", scope: !660, file: !661, line: 184, baseType: !80, size: 64, offset: 2496)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "exc_state", scope: !660, file: !661, line: 199, baseType: !760, size: 128, offset: 2560)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "root_cframe", scope: !660, file: !661, line: 202, baseType: !678, size: 192, offset: 2688)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823}
!816 = !DILocalVariable(name: "tstate", arg: 1, scope: !655, file: !3, line: 1766, type: !658)
!817 = !DILocalVariable(name: "c_line", arg: 2, scope: !655, file: !3, line: 1766, type: !7)
!818 = !DILocalVariable(name: "use_cline", scope: !655, file: !3, line: 1767, type: !14)
!819 = !DILocalVariable(name: "ptype", scope: !655, file: !3, line: 1768, type: !14)
!820 = !DILocalVariable(name: "pvalue", scope: !655, file: !3, line: 1768, type: !14)
!821 = !DILocalVariable(name: "ptraceback", scope: !655, file: !3, line: 1768, type: !14)
!822 = !DILocalVariable(name: "cython_runtime_dict", scope: !655, file: !3, line: 1770, type: !80)
!823 = !DILocalVariable(name: "use_cline_obj", scope: !824, file: !3, line: 1785, type: !14)
!824 = distinct !DILexicalBlock(scope: !825, file: !3, line: 1784, column: 5)
!825 = distinct !DILexicalBlock(scope: !655, file: !3, line: 1778, column: 9)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "__pyx_dict_cached_value", scope: !655, file: !3, line: 1779, type: !14, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "__pyx_code_cache", scope: !2, file: !3, line: 1201, type: !830, isLocal: true, isDefinition: true)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__Pyx_CodeObjectCache", file: !3, line: 1196, size: 128, elements: !831)
!831 = !{!832, !833, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !830, file: !3, line: 1197, baseType: !7, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !830, file: !3, line: 1198, baseType: !7, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !830, file: !3, line: 1199, baseType: !399, size: 64, offset: 64)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1911, type: !461, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1041, type: !839, isLocal: true, isDefinition: true)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 168, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 21)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "__pyx_cfilenm", scope: !2, file: !3, line: 1041, type: !40, isLocal: true, isDefinition: true)
!844 = !{i32 7, !"Dwarf Version", i32 5}
!845 = !{i32 2, !"Debug Info Version", i32 3}
!846 = !{i32 1, !"wchar_size", i32 4}
!847 = !{i32 8, !"PIC Level", i32 2}
!848 = !{i32 7, !"uwtable", i32 2}
!849 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!850 = distinct !DISubprogram(name: "PyInit_libcsamtools", scope: !3, file: !3, line: 1468, type: !423, scopeLine: 1470, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!851 = !DILocation(line: 1471, column: 10, scope: !850)
!852 = !DILocation(line: 1471, column: 3, scope: !850)
!853 = !DISubprogram(name: "PyModuleDef_Init", scope: !414, file: !414, line: 40, type: !854, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!854 = !DISubroutineType(types: !855)
!855 = !{!14, !856}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef", file: !16, line: 12, baseType: !413)
!858 = distinct !DISubprogram(name: "__pyx_pymod_create", scope: !3, file: !3, line: 1511, type: !859, scopeLine: 1511, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{!14, !14, !856}
!861 = !{!862, !863, !864, !865, !866, !867}
!862 = !DILocalVariable(name: "spec", arg: 1, scope: !858, file: !3, line: 1511, type: !14)
!863 = !DILocalVariable(name: "def", arg: 2, scope: !858, file: !3, line: 1511, type: !856)
!864 = !DILocalVariable(name: "module", scope: !858, file: !3, line: 1512, type: !14)
!865 = !DILocalVariable(name: "moddict", scope: !858, file: !3, line: 1512, type: !14)
!866 = !DILocalVariable(name: "modname", scope: !858, file: !3, line: 1512, type: !14)
!867 = !DILabel(scope: !858, name: "bad", file: !3, line: 1529)
!868 = !{!869, !869, i64 0}
!869 = !{!"any pointer", !870, i64 0}
!870 = !{!"omnipotent char", !871, i64 0}
!871 = !{!"Simple C/C++ TBAA"}
!872 = !DILocation(line: 1511, column: 65, scope: !858)
!873 = !DILocation(line: 1511, column: 98, scope: !858)
!874 = !DILocation(line: 1512, column: 5, scope: !858)
!875 = !DILocation(line: 1512, column: 15, scope: !858)
!876 = !DILocation(line: 1512, column: 31, scope: !858)
!877 = !DILocation(line: 1512, column: 41, scope: !858)
!878 = !DILocation(line: 1513, column: 9, scope: !879)
!879 = distinct !DILexicalBlock(scope: !858, file: !3, line: 1513, column: 9)
!880 = !DILocation(line: 1513, column: 9, scope: !858)
!881 = !DILocation(line: 1514, column: 9, scope: !879)
!882 = !DILocation(line: 1515, column: 9, scope: !883)
!883 = distinct !DILexicalBlock(scope: !858, file: !3, line: 1515, column: 9)
!884 = !DILocation(line: 1515, column: 9, scope: !858)
!885 = !DILocation(line: 1516, column: 16, scope: !883)
!886 = !DILocation(line: 1516, column: 9, scope: !883)
!887 = !DILocation(line: 1517, column: 38, scope: !858)
!888 = !DILocation(line: 1517, column: 15, scope: !858)
!889 = !DILocation(line: 1517, column: 13, scope: !858)
!890 = !DILocation(line: 1518, column: 9, scope: !891)
