; ModuleID = 'samples/208.bc'
source_filename = "dnssec-revoke.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.isc_buffer = type { i32, ptr, i32, i32, i32, i32, %struct.anon, ptr, i8 }
%struct.anon = type { ptr, ptr }

@.str = private unnamed_addr constant [14 x i8] c"dnssec-revoke\00", align 1, !dbg !0
@program = global ptr @.str, align 8, !dbg !8
@mctx = internal global ptr null, align 8, !dbg !161
@.str.1 = private unnamed_addr constant [14 x i8] c"Out of memory\00", align 1, !dbg !14
@isc_commandline_errprint = external global i8, align 1
@.str.2 = private unnamed_addr constant [12 x i8] c"E:fK:rRhv:V\00", align 1, !dbg !16
@isc_commandline_argument = external global ptr, align 8
@.str.3 = private unnamed_addr constant [16 x i8] c"dnssec-revoke.c\00", align 1, !dbg !21
@.str.4 = private unnamed_addr constant [40 x i8] c"Failed to allocate memory for directory\00", align 1, !dbg !26
@verbose = global i32 0, align 4, !dbg !102
@.str.5 = private unnamed_addr constant [32 x i8] c"-v must be followed by a number\00", align 1, !dbg !31
@isc_commandline_option = external global i32, align 4
@stderr = external global ptr, align 8
@.str.6 = private unnamed_addr constant [26 x i8] c"%s: invalid argument -%c\0A\00", align 1, !dbg !36
@.str.7 = private unnamed_addr constant [26 x i8] c"%s: unhandled option -%c\0A\00", align 1, !dbg !41

!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 54)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !2, line: 230, type: !95, isLocal: true, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 27)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !75, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !2, line: 255, type: !38, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "verbose", scope: !10, file: !2, line: 42, type: !104, isLocal: false, isDefinition: true)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !80, isLocal: true, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !95, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 13)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 7)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !121, isLocal: true, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 42)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 35)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 24)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 47)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 70)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !121, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 45)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !153, isLocal: true, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 9)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 65)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "mctx", scope: !10, file: !2, line: 44, type: !163, isLocal: true, isDefinition: true)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mem_t", file: !165, line: 59, baseType: !166)
!165 = !DIFile(filename: "lib/isc/include/isc/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "6a355582c4f962c465b18bab43b68c96")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mem", file: !167, line: 191, size: 128, elements: !168)
!167 = !DIFile(filename: "lib/isc/include/isc/mem.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "587a841195795b087519b89f298822b2")
!168 = !{!169, !171, !172}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !166, file: !167, line: 192, baseType: !170, size: 32)
!170 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !166, file: !167, line: 193, baseType: !170, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !166, file: !167, line: 194, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_memmethods_t", file: !167, line: 180, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_memmethods", file: !167, line: 170, size: 448, elements: !176)
!176 = !{!177, !185, !189, !194, !195, !199, !204}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "memget", scope: !175, file: !167, line: 171, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!12, !163, !181, !184, !170}
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !182, line: 70, baseType: !183)
!182 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!183 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "memput", scope: !175, file: !167, line: 172, baseType: !186, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !163, !12, !181, !184, !170}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "memputanddetach", scope: !175, file: !167, line: 173, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !193, !12, !181, !184, !170}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "memallocate", scope: !175, file: !167, line: 175, baseType: !178, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "memreallocate", scope: !175, file: !167, line: 176, baseType: !196, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!12, !163, !12, !181, !184, !170}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "memstrdup", scope: !175, file: !167, line: 178, baseType: !200, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !163, !184, !184, !170}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "memfree", scope: !175, file: !167, line: 179, baseType: !205, size: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !163, !12, !184, !170}
!208 = !{i32 7, !"Dwarf Version", i32 5}
!209 = !{i32 2, !"Debug Info Version", i32 3}
!210 = !{i32 1, !"wchar_size", i32 4}
!211 = !{i32 8, !"PIC Level", i32 2}
!212 = !{i32 7, !"uwtable", i32 2}
!213 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!214 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 75, type: !215, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !218)
!215 = !DISubroutineType(types: !216)
!216 = !{!104, !104, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!218 = !{!219, !220, !221, !223, !224, !225, !226, !230, !231, !235, !236, !237, !242, !247, !267, !268, !269, !270, !275}
!219 = !DILocalVariable(name: "argc", arg: 1, scope: !214, file: !2, line: 75, type: !104)
!220 = !DILocalVariable(name: "argv", arg: 2, scope: !214, file: !2, line: 75, type: !217)
!221 = !DILocalVariable(name: "result", scope: !214, file: !2, line: 76, type: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_result_t", file: !165, line: 67, baseType: !170)
!223 = !DILocalVariable(name: "engine", scope: !214, file: !2, line: 77, type: !184)
!224 = !DILocalVariable(name: "filename", scope: !214, file: !2, line: 78, type: !184)
!225 = !DILocalVariable(name: "dir", scope: !214, file: !2, line: 79, type: !203)
!226 = !DILocalVariable(name: "newname", scope: !214, file: !2, line: 80, type: !227)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8192, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 1024)
!230 = !DILocalVariable(name: "oldname", scope: !214, file: !2, line: 80, type: !227)
!231 = !DILocalVariable(name: "keystr", scope: !214, file: !2, line: 81, type: !232)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8408, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 1051)
!235 = !DILocalVariable(name: "endp", scope: !214, file: !2, line: 82, type: !203)
!236 = !DILocalVariable(name: "ch", scope: !214, file: !2, line: 83, type: !104)
!237 = !DILocalVariable(name: "key", scope: !214, file: !2, line: 84, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_key_t", file: !240, line: 44, baseType: !241)
!240 = !DIFile(filename: "lib/dns/include/dst/dst.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "10e76bcacbe005e6cc7dee2ac6ffac9a")
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_key", file: !240, line: 44, flags: DIFlagFwdDecl)
!242 = !DILocalVariable(name: "flags", scope: !214, file: !2, line: 85, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !244, line: 26, baseType: !245)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !246, line: 42, baseType: !170)
!246 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!247 = !DILocalVariable(name: "buf", scope: !214, file: !2, line: 86, type: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_buffer_t", file: !165, line: 35, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_buffer", file: !250, line: 173, size: 512, elements: !251)
!250 = !DIFile(filename: "lib/isc/include/isc/buffer.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "feec9784066f3891a27281dd5bdccd55")
!251 = !{!252, !253, !254, !255, !256, !257, !258, !264, !265}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !249, file: !250, line: 174, baseType: !170, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !249, file: !250, line: 175, baseType: !12, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !249, file: !250, line: 178, baseType: !170, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !249, file: !250, line: 179, baseType: !170, size: 32, offset: 160)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !249, file: !250, line: 180, baseType: !170, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !249, file: !250, line: 181, baseType: !170, size: 32, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !249, file: !250, line: 184, baseType: !259, size: 128, offset: 256)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !249, file: !250, line: 184, size: 128, elements: !260)
!260 = !{!261, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !259, file: !250, line: 184, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !259, file: !250, line: 184, baseType: !262, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !249, file: !250, line: 186, baseType: !163, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "autore", scope: !249, file: !250, line: 188, baseType: !266, size: 8, offset: 448)
!266 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!267 = !DILocalVariable(name: "force", scope: !214, file: !2, line: 87, type: !266)
!268 = !DILocalVariable(name: "removefile", scope: !214, file: !2, line: 88, type: !266)
!269 = !DILocalVariable(name: "id", scope: !214, file: !2, line: 89, type: !266)
!270 = !DILocalVariable(name: "now", scope: !271, file: !2, line: 205, type: !273)
!271 = distinct !DILexicalBlock(scope: !272, file: !2, line: 204, column: 41)
!272 = distinct !DILexicalBlock(scope: !214, file: !2, line: 204, column: 6)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_stdtime_t", file: !274, line: 26, baseType: !243)
!274 = !DIFile(filename: "../../lib/isc/unix/include/isc/stdtime.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/bin/dnssec", checksumkind: CSK_MD5, checksum: "b8868fded6c0eb282ad50986c628a693")
!275 = !DILabel(scope: !214, name: "cleanup", file: !2, line: 258)
!276 = !DILocation(line: 75, column: 10, scope: !214)
!277 = !DILocation(line: 75, column: 23, scope: !214)
!278 = !DILocation(line: 76, column: 2, scope: !214)
!279 = !DILocation(line: 76, column: 15, scope: !214)
!280 = !DILocation(line: 77, column: 2, scope: !214)
!281 = !DILocation(line: 77, column: 14, scope: !214)
!282 = !DILocation(line: 78, column: 2, scope: !214)
!283 = !DILocation(line: 78, column: 14, scope: !214)
!284 = !DILocation(line: 79, column: 2, scope: !214)
!285 = !DILocation(line: 79, column: 8, scope: !214)
!286 = !DILocation(line: 80, column: 2, scope: !214)
!287 = !DILocation(line: 80, column: 7, scope: !214)
!288 = !DILocation(line: 80, column: 22, scope: !214)
!289 = !DILocation(line: 81, column: 2, scope: !214)
!290 = !DILocation(line: 81, column: 7, scope: !214)
!291 = !DILocation(line: 82, column: 2, scope: !214)
!292 = !DILocation(line: 82, column: 8, scope: !214)
!293 = !DILocation(line: 83, column: 2, scope: !214)
!294 = !DILocation(line: 83, column: 6, scope: !214)
!295 = !DILocation(line: 84, column: 2, scope: !214)
!296 = !DILocation(line: 84, column: 13, scope: !214)
!297 = !DILocation(line: 85, column: 2, scope: !214)
!298 = !DILocation(line: 85, column: 11, scope: !214)
!299 = !DILocation(line: 86, column: 2, scope: !214)
!300 = !DILocation(line: 86, column: 15, scope: !214)
!301 = !DILocation(line: 87, column: 2, scope: !214)
!302 = !DILocation(line: 87, column: 7, scope: !214)
!303 = !DILocation(line: 88, column: 2, scope: !214)
!304 = !DILocation(line: 88, column: 7, scope: !214)
!305 = !DILocation(line: 89, column: 2, scope: !214)
!306 = !DILocation(line: 89, column: 7, scope: !214)
!307 = !DILocation(line: 91, column: 6, scope: !308)
!308 = distinct !DILexicalBlock(scope: !214, file: !2, line: 91, column: 6)
!309 = !DILocation(line: 91, column: 11, scope: !308)
!310 = !DILocation(line: 91, column: 6, scope: !214)
!311 = !DILocation(line: 92, column: 3, scope: !308)
!312 = !DILocation(line: 94, column: 11, scope: !214)
!313 = !DILocation(line: 94, column: 9, scope: !214)
!314 = !DILocation(line: 95, column: 6, scope: !315)
!315 = distinct !DILexicalBlock(scope: !214, file: !2, line: 95, column: 6)
!316 = !DILocation(line: 95, column: 13, scope: !315)
!317 = !DILocation(line: 95, column: 6, scope: !214)
!318 = !DILocation(line: 96, column: 3, scope: !315)
!319 = !DILocation(line: 101, column: 2, scope: !214)
!320 = !DILocation(line: 103, column: 27, scope: !214)
!321 = !DILocation(line: 105, column: 2, scope: !214)
!322 = !DILocation(line: 105, column: 37, scope: !214)
!323 = !DILocation(line: 105, column: 43, scope: !214)
!324 = !DILocation(line: 105, column: 15, scope: !214)
!325 = !DILocation(line: 105, column: 13, scope: !214)
!326 = !DILocation(line: 105, column: 65, scope: !214)
!327 = !DILocation(line: 106, column: 11, scope: !328)
!328 = distinct !DILexicalBlock(scope: !214, file: !2, line: 105, column: 72)
!329 = !DILocation(line: 106, column: 3, scope: !328)
!330 = !DILocation(line: 108, column: 13, scope: !331)
!331 = distinct !DILexicalBlock(scope: !328, file: !2, line: 106, column: 15)
!332 = !DILocation(line: 108, column: 11, scope: !331)
!333 = !DILocation(line: 109, column: 4, scope: !331)
!334 = !DILocation(line: 111, column: 10, scope: !331)
!335 = !DILocation(line: 112, column: 4, scope: !331)
!336 = !DILocation(line: 118, column: 10, scope: !331)
!337 = !DILocation(line: 118, column: 8, scope: !331)
!338 = !DILocation(line: 119, column: 8, scope: !339)
!339 = distinct !DILexicalBlock(scope: !331, file: !2, line: 119, column: 8)
!340 = !DILocation(line: 119, column: 12, scope: !339)
!341 = !DILocation(line: 119, column: 8, scope: !331)
!342 = !DILocation(line: 120, column: 5, scope: !343)
!343 = distinct !DILexicalBlock(scope: !339, file: !2, line: 119, column: 21)
!344 = !DILocation(line: 123, column: 4, scope: !331)
!345 = !DILocation(line: 125, column: 15, scope: !331)
!346 = !DILocation(line: 126, column: 4, scope: !331)
!347 = !DILocation(line: 128, column: 7, scope: !331)
!348 = !DILocation(line: 129, column: 4, scope: !331)
!349 = !DILocation(line: 131, column: 21, scope: !331)
!350 = !DILocation(line: 131, column: 14, scope: !331)
!351 = !DILocation(line: 131, column: 12, scope: !331)
!352 = !DILocation(line: 132, column: 9, scope: !353)
!353 = distinct !DILexicalBlock(scope: !331, file: !2, line: 132, column: 8)
!354 = !DILocation(line: 132, column: 8, scope: !353)
!355 = !DILocation(line: 132, column: 14, scope: !353)
!356 = !DILocation(line: 132, column: 8, scope: !331)
!357 = !DILocation(line: 133, column: 5, scope: !353)
!358 = !DILocation(line: 134, column: 4, scope: !331)
!359 = !DILocation(line: 136, column: 8, scope: !360)
!360 = distinct !DILexicalBlock(scope: !331, file: !2, line: 136, column: 8)
!361 = !DILocation(line: 136, column: 31, scope: !360)
!362 = !DILocation(line: 136, column: 8, scope: !331)
!363 = !DILocation(line: 137, column: 13, scope: !360)
!364 = !DILocation(line: 138, column: 6, scope: !360)
!365 = !DILocation(line: 138, column: 15, scope: !360)
!366 = !DILocation(line: 137, column: 5, scope: !360)
!367 = !DILocation(line: 136, column: 34, scope: !360)
!368 = !DILocation(line: 142, column: 4, scope: !331)
!369 = !DILocation(line: 146, column: 12, scope: !331)
!370 = !DILocation(line: 146, column: 4, scope: !331)
!371 = !DILocation(line: 149, column: 12, scope: !331)
!372 = !DILocation(line: 150, column: 5, scope: !331)
!373 = !DILocation(line: 150, column: 14, scope: !331)
!374 = !DILocation(line: 149, column: 4, scope: !331)
!375 = !DILocation(line: 151, column: 4, scope: !331)
!376 = distinct !{!376, !321, !377, !378}
!377 = !DILocation(line: 153, column: 2, scope: !214)
!378 = !{!"llvm.loop.mustprogress"}
!379 = !DILocation(line: 155, column: 6, scope: !380)
!380 = distinct !DILexicalBlock(scope: !214, file: !2, line: 155, column: 6)
!381 = !DILocation(line: 155, column: 13, scope: !380)
!382 = !DILocation(line: 155, column: 35, scope: !380)
!383 = !DILocation(line: 155, column: 11, scope: !380)
!384 = !DILocation(line: 155, column: 39, scope: !380)
!385 = !DILocation(line: 156, column: 6, scope: !380)
!386 = !DILocation(line: 156, column: 11, scope: !380)
!387 = !DILocation(line: 156, column: 34, scope: !380)
!388 = !DILocation(line: 155, column: 6, scope: !214)
!389 = !DILocation(line: 157, column: 3, scope: !380)
!390 = !DILocation(line: 158, column: 6, scope: !391)
!391 = distinct !DILexicalBlock(scope: !214, file: !2, line: 158, column: 6)
!392 = !DILocation(line: 158, column: 13, scope: !391)
!393 = !DILocation(line: 158, column: 35, scope: !391)
!394 = !DILocation(line: 158, column: 11, scope: !391)
!395 = !DILocation(line: 158, column: 6, scope: !214)
!396 = !DILocation(line: 159, column: 3, scope: !391)
!397 = !DILocation(line: 161, column: 6, scope: !398)
!398 = distinct !DILexicalBlock(scope: !214, file: !2, line: 161, column: 6)
!399 = !DILocation(line: 161, column: 10, scope: !398)
!400 = !DILocation(line: 161, column: 6, scope: !214)
!401 = !DILocation(line: 162, column: 14, scope: !402)
!402 = distinct !DILexicalBlock(scope: !398, file: !2, line: 161, column: 19)
!403 = !DILocation(line: 162, column: 19, scope: !402)
!404 = !DILocation(line: 162, column: 12, scope: !402)
!405 = !DILocation(line: 163, column: 2, scope: !402)
!406 = !DILocation(line: 164, column: 31, scope: !407)
!407 = distinct !DILexicalBlock(scope: !398, file: !2, line: 163, column: 9)
!408 = !DILocation(line: 164, column: 37, scope: !407)
!409 = !DILocation(line: 164, column: 42, scope: !407)
!410 = !DILocation(line: 164, column: 12, scope: !407)
!411 = !DILocation(line: 164, column: 10, scope: !407)
!412 = !DILocation(line: 166, column: 7, scope: !413)
!413 = distinct !DILexicalBlock(scope: !407, file: !2, line: 166, column: 7)
!414 = !DILocation(line: 166, column: 14, scope: !413)
!415 = !DILocation(line: 166, column: 7, scope: !407)
!416 = !DILocation(line: 168, column: 10, scope: !413)
!417 = !DILocation(line: 168, column: 15, scope: !413)
!418 = !DILocation(line: 169, column: 28, scope: !413)
!419 = !DILocation(line: 169, column: 10, scope: !413)
!420 = !DILocation(line: 167, column: 4, scope: !413)
!421 = !DILocation(line: 170, column: 14, scope: !422)
!422 = distinct !DILexicalBlock(scope: !407, file: !2, line: 170, column: 7)
!423 = !DILocation(line: 170, column: 7, scope: !422)
!424 = !DILocation(line: 170, column: 24, scope: !422)
!425 = !DILocation(line: 170, column: 7, scope: !407)
!426 = !DILocation(line: 171, column: 4, scope: !427)
!427 = distinct !DILexicalBlock(scope: !422, file: !2, line: 170, column: 30)
!428 = !DILocation(line: 171, column: 4, scope: !429)
!429 = distinct !DILexicalBlock(scope: !427, file: !2, line: 171, column: 4)
!430 = !DILocation(line: 172, column: 8, scope: !427)
!431 = !DILocation(line: 173, column: 3, scope: !427)
!432 = !DILocation(line: 176, column: 24, scope: !214)
!433 = !DILocation(line: 176, column: 30, scope: !214)
!434 = !DILocation(line: 176, column: 11, scope: !214)
!435 = !DILocation(line: 176, column: 9, scope: !214)
!436 = !DILocation(line: 177, column: 6, scope: !437)
!437 = distinct !DILexicalBlock(scope: !214, file: !2, line: 177, column: 6)
!438 = !DILocation(line: 177, column: 13, scope: !437)
!439 = !DILocation(line: 177, column: 6, scope: !214)
!440 = !DILocation(line: 179, column: 27, scope: !437)
!441 = !DILocation(line: 179, column: 9, scope: !437)
!442 = !DILocation(line: 178, column: 3, scope: !437)
!443 = !DILocation(line: 181, column: 33, scope: !214)
!444 = !DILocation(line: 181, column: 43, scope: !214)
!445 = !DILocation(line: 183, column: 12, scope: !214)
!446 = !DILocation(line: 181, column: 11, scope: !214)
!447 = !DILocation(line: 181, column: 9, scope: !214)
!448 = !DILocation(line: 184, column: 6, scope: !449)
!449 = distinct !DILexicalBlock(scope: !214, file: !2, line: 184, column: 6)
!450 = !DILocation(line: 184, column: 13, scope: !449)
!451 = !DILocation(line: 184, column: 6, scope: !214)
!452 = !DILocation(line: 186, column: 9, scope: !449)
!453 = !DILocation(line: 186, column: 37, scope: !449)
!454 = !DILocation(line: 186, column: 19, scope: !449)
!455 = !DILocation(line: 185, column: 3, scope: !449)
!456 = !DILocation(line: 188, column: 6, scope: !457)
!457 = distinct !DILexicalBlock(scope: !214, file: !2, line: 188, column: 6)
!458 = !{i8 0, i8 2}
!459 = !{}
!460 = !DILocation(line: 188, column: 6, scope: !214)
!461 = !DILocation(line: 189, column: 11, scope: !462)
!462 = distinct !DILexicalBlock(scope: !457, file: !2, line: 188, column: 10)
!463 = !DILocation(line: 189, column: 39, scope: !462)
!464 = !DILocation(line: 189, column: 27, scope: !462)
!465 = !DILocation(line: 189, column: 3, scope: !462)
!466 = !DILocation(line: 190, column: 3, scope: !462)
!467 = !DILocation(line: 192, column: 17, scope: !214)
!468 = !DILocation(line: 192, column: 22, scope: !214)
!469 = !DILocation(line: 192, column: 2, scope: !214)
!470 = !DILocation(line: 194, column: 6, scope: !471)
!471 = distinct !DILexicalBlock(scope: !214, file: !2, line: 194, column: 6)
!472 = !DILocation(line: 194, column: 14, scope: !471)
!473 = !DILocation(line: 194, column: 6, scope: !214)
!474 = !DILocation(line: 195, column: 11, scope: !471)
!475 = !DILocation(line: 195, column: 31, scope: !471)
!476 = !DILocation(line: 195, column: 40, scope: !471)
!477 = !DILocation(line: 195, column: 3, scope: !471)
!478 = !DILocation(line: 197, column: 6, scope: !479)
!479 = distinct !DILexicalBlock(scope: !214, file: !2, line: 197, column: 6)
!480 = !DILocation(line: 197, column: 6, scope: !214)
!481 = !DILocation(line: 198, column: 18, scope: !479)
!482 = !DILocation(line: 198, column: 3, scope: !479)
!483 = !DILocation(line: 200, column: 20, scope: !479)
!484 = !DILocation(line: 200, column: 25, scope: !479)
!485 = !DILocation(line: 200, column: 3, scope: !479)
!486 = !DILocation(line: 203, column: 24, scope: !214)
!487 = !DILocation(line: 203, column: 10, scope: !214)
!488 = !DILocation(line: 203, column: 8, scope: !214)
!489 = !DILocation(line: 204, column: 7, scope: !272)
!490 = !DILocation(line: 204, column: 13, scope: !272)
!491 = !DILocation(line: 204, column: 35, scope: !272)
!492 = !DILocation(line: 204, column: 6, scope: !214)
!493 = !DILocation(line: 205, column: 3, scope: !271)
!494 = !DILocation(line: 205, column: 17, scope: !271)
!495 = !DILocation(line: 207, column: 8, scope: !496)
!496 = distinct !DILexicalBlock(scope: !271, file: !2, line: 207, column: 7)
!497 = !DILocation(line: 207, column: 14, scope: !496)
!498 = !DILocation(line: 207, column: 33, scope: !496)
!499 = !DILocation(line: 207, column: 7, scope: !271)
!500 = !DILocation(line: 208, column: 12, scope: !496)
!501 = !DILocation(line: 211, column: 6, scope: !496)
!502 = !DILocation(line: 208, column: 4, scope: !496)
!503 = !DILocation(line: 213, column: 3, scope: !271)
!504 = !DILocation(line: 214, column: 19, scope: !271)
!505 = !DILocation(line: 214, column: 41, scope: !271)
!506 = !DILocation(line: 214, column: 3, scope: !271)
!507 = !DILocation(line: 216, column: 20, scope: !271)
!508 = !DILocation(line: 216, column: 25, scope: !271)
!509 = !DILocation(line: 216, column: 31, scope: !271)
!510 = !DILocation(line: 216, column: 3, scope: !271)
!511 = !DILocation(line: 218, column: 3, scope: !271)
!512 = !DILocation(line: 218, column: 3, scope: !513)
!513 = distinct !DILexicalBlock(scope: !271, file: !2, line: 218, column: 3)
!514 = !DILocation(line: 218, column: 3, scope: !515)
!515 = distinct !DILexicalBlock(scope: !513, file: !2, line: 218, column: 3)
!516 = !DILocation(line: 219, column: 25, scope: !271)
!517 = !DILocation(line: 219, column: 47, scope: !271)
!518 = !DILocation(line: 219, column: 3, scope: !271)
!519 = !DILocation(line: 221, column: 14, scope: !520)
!520 = distinct !DILexicalBlock(scope: !271, file: !2, line: 221, column: 7)
!521 = !DILocation(line: 221, column: 7, scope: !520)
!522 = !DILocation(line: 221, column: 29, scope: !520)
!523 = !DILocation(line: 221, column: 34, scope: !520)
!524 = !DILocation(line: 221, column: 38, scope: !520)
!525 = !DILocation(line: 221, column: 7, scope: !271)
!526 = !DILocation(line: 223, column: 39, scope: !527)
!527 = distinct !DILexicalBlock(scope: !520, file: !2, line: 221, column: 45)
!528 = !DILocation(line: 222, column: 4, scope: !527)
!529 = !DILocation(line: 226, column: 27, scope: !271)
!530 = !DILocation(line: 227, column: 6, scope: !271)
!531 = !DILocation(line: 226, column: 12, scope: !271)
!532 = !DILocation(line: 226, column: 10, scope: !271)
!533 = !DILocation(line: 228, column: 7, scope: !534)
!534 = distinct !DILexicalBlock(scope: !271, file: !2, line: 228, column: 7)
!535 = !DILocation(line: 228, column: 14, scope: !534)
!536 = !DILocation(line: 228, column: 7, scope: !271)
!537 = !DILocation(line: 229, column: 19, scope: !538)
!538 = distinct !DILexicalBlock(scope: !534, file: !2, line: 228, column: 32)
!539 = !DILocation(line: 229, column: 24, scope: !538)
!540 = !DILocation(line: 229, column: 4, scope: !538)
!541 = !DILocation(line: 230, column: 40, scope: !538)
!542 = !DILocation(line: 231, column: 28, scope: !538)
!543 = !DILocation(line: 231, column: 10, scope: !538)
!544 = !DILocation(line: 230, column: 4, scope: !538)
!545 = !DILocation(line: 234, column: 3, scope: !271)
!546 = !DILocation(line: 234, column: 3, scope: !547)
!547 = distinct !DILexicalBlock(scope: !271, file: !2, line: 234, column: 3)
!548 = !DILocation(line: 235, column: 25, scope: !271)
!549 = !DILocation(line: 235, column: 33, scope: !271)
!550 = !DILocation(line: 235, column: 3, scope: !271)
!551 = !DILocation(line: 236, column: 18, scope: !271)
!552 = !DILocation(line: 236, column: 3, scope: !271)
!553 = !DILocation(line: 242, column: 7, scope: !554)
!554 = distinct !DILexicalBlock(scope: !271, file: !2, line: 242, column: 7)
!555 = !DILocation(line: 242, column: 7, scope: !271)
!556 = !DILocation(line: 243, column: 4, scope: !557)
!557 = distinct !DILexicalBlock(scope: !554, file: !2, line: 242, column: 19)
!558 = !DILocation(line: 243, column: 4, scope: !559)
!559 = distinct !DILexicalBlock(scope: !557, file: !2, line: 243, column: 4)
!560 = !DILocation(line: 243, column: 4, scope: !561)
!561 = distinct !DILexicalBlock(scope: !559, file: !2, line: 243, column: 4)
!562 = !DILocation(line: 244, column: 21, scope: !557)
!563 = !DILocation(line: 244, column: 26, scope: !557)
!564 = !DILocation(line: 244, column: 32, scope: !557)
!565 = !DILocation(line: 244, column: 4, scope: !557)
!566 = !DILocation(line: 245, column: 26, scope: !557)
!567 = !DILocation(line: 245, column: 49, scope: !557)
!568 = !DILocation(line: 245, column: 4, scope: !557)
!569 = !DILocation(line: 246, column: 15, scope: !570)
!570 = distinct !DILexicalBlock(scope: !557, file: !2, line: 246, column: 8)
!571 = !DILocation(line: 246, column: 24, scope: !570)
!572 = !DILocation(line: 246, column: 8, scope: !570)
!573 = !DILocation(line: 246, column: 33, scope: !570)
!574 = !DILocation(line: 246, column: 8, scope: !557)
!575 = !DILocation(line: 247, column: 5, scope: !570)
!576 = !DILocation(line: 248, column: 17, scope: !557)
!577 = !DILocation(line: 248, column: 10, scope: !557)
!578 = !DILocation(line: 249, column: 4, scope: !557)
!579 = !DILocation(line: 249, column: 4, scope: !580)
!580 = distinct !DILexicalBlock(scope: !557, file: !2, line: 249, column: 4)
!581 = !DILocation(line: 250, column: 26, scope: !557)
!582 = !DILocation(line: 250, column: 48, scope: !557)
!583 = !DILocation(line: 250, column: 4, scope: !557)
!584 = !DILocation(line: 251, column: 17, scope: !557)
!585 = !DILocation(line: 251, column: 10, scope: !557)
!586 = !DILocation(line: 252, column: 3, scope: !557)
!587 = !DILocation(line: 253, column: 2, scope: !272)
!588 = !DILocation(line: 253, column: 2, scope: !271)
!589 = !DILocation(line: 254, column: 18, scope: !590)
!590 = distinct !DILexicalBlock(scope: !272, file: !2, line: 253, column: 9)
!591 = !DILocation(line: 254, column: 23, scope: !590)
!592 = !DILocation(line: 254, column: 3, scope: !590)
!593 = !DILocation(line: 255, column: 38, scope: !590)
!594 = !DILocation(line: 255, column: 3, scope: !590)
!595 = !DILocation(line: 204, column: 38, scope: !272)
!596 = !DILocation(line: 258, column: 1, scope: !214)
!597 = !DILocation(line: 259, column: 2, scope: !214)
!598 = !DILocation(line: 260, column: 2, scope: !214)
!599 = !DILocation(line: 261, column: 6, scope: !600)
!600 = distinct !DILexicalBlock(scope: !214, file: !2, line: 261, column: 6)
!601 = !DILocation(line: 261, column: 14, scope: !600)
!602 = !DILocation(line: 261, column: 6, scope: !214)
!603 = !DILocation(line: 262, column: 17, scope: !600)
!604 = !DILocation(line: 262, column: 23, scope: !600)
!605 = !DILocation(line: 262, column: 3, scope: !600)
!606 = !DILocation(line: 263, column: 6, scope: !607)
!607 = distinct !DILexicalBlock(scope: !214, file: !2, line: 263, column: 6)
!608 = !DILocation(line: 263, column: 10, scope: !607)
!609 = !DILocation(line: 263, column: 6, scope: !214)
!610 = !DILocation(line: 264, column: 3, scope: !607)
!611 = !DILocation(line: 264, column: 3, scope: !612)
!612 = distinct !DILexicalBlock(scope: !607, file: !2, line: 264, column: 3)
!613 = !DILocation(line: 265, column: 2, scope: !214)
!614 = !DILocation(line: 267, column: 2, scope: !214)
!615 = !DILocation(line: 268, column: 1, scope: !214)
!616 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 50, type: !617, scopeLine: 50, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10)
!617 = !DISubroutineType(types: !618)
!618 = !{null}
!619 = !DILocation(line: 51, column: 10, scope: !616)
!620 = !DILocation(line: 51, column: 2, scope: !616)
!621 = !DILocation(line: 52, column: 10, scope: !616)
!622 = !DILocation(line: 52, column: 50, scope: !616)
!623 = !DILocation(line: 52, column: 2, scope: !616)
!624 = !DILocation(line: 53, column: 10, scope: !616)
!625 = !DILocation(line: 53, column: 2, scope: !616)
!626 = !DILocation(line: 58, column: 10, scope: !616)
!627 = !DILocation(line: 58, column: 2, scope: !616)
!628 = !DILocation(line: 60, column: 10, scope: !616)
!629 = !DILocation(line: 60, column: 2, scope: !616)
!630 = !DILocation(line: 61, column: 10, scope: !616)
!631 = !DILocation(line: 61, column: 2, scope: !616)
!632 = !DILocation(line: 62, column: 10, scope: !616)
!633 = !DILocation(line: 62, column: 2, scope: !616)
!634 = !DILocation(line: 63, column: 10, scope: !616)
!635 = !DILocation(line: 63, column: 2, scope: !616)
!636 = !DILocation(line: 65, column: 10, scope: !616)
!637 = !DILocation(line: 65, column: 2, scope: !616)
!638 = !DILocation(line: 66, column: 10, scope: !616)
!639 = !DILocation(line: 66, column: 2, scope: !616)
!640 = !DILocation(line: 67, column: 10, scope: !616)
!641 = !DILocation(line: 67, column: 2, scope: !616)
!642 = !DILocation(line: 68, column: 10, scope: !616)
!643 = !DILocation(line: 68, column: 2, scope: !616)
!644 = !DILocation(line: 71, column: 2, scope: !616)
!645 = !DISubprogram(name: "isc_mem_create", scope: !167, file: !167, line: 258, type: !646, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!646 = !DISubroutineType(types: !647)
!647 = !{!222, !181, !181, !193}
!648 = !DISubprogram(name: "fatal", scope: !649, file: !649, line: 27, type: !650, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!649 = !DIFile(filename: "./dnssectool.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/bin/dnssec", checksumkind: CSK_MD5, checksum: "a3925156dd343f43ce1030829ae687f7")
!650 = !DISubroutineType(types: !651)
!651 = !{null, !184, null}
!652 = !DISubprogram(name: "dns_result_register", scope: !653, file: !653, line: 195, type: !617, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!653 = !DIFile(filename: "lib/dns/include/dns/result.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "6f221f4c26ac435952b3c9016391913e")
!654 = !DISubprogram(name: "isc_commandline_parse", scope: !655, file: !655, line: 40, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!655 = !DIFile(filename: "lib/isc/include/isc/commandline.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "e2d6ed42554c7c309a715d6bbca56377")
!656 = !DISubroutineType(types: !657)
!657 = !{!104, !104, !658, !184}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!660 = !DISubprogram(name: "isc__mem_strdup", scope: !167, file: !167, line: 642, type: !201, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!661 = !DISubprogram(name: "strtol", scope: !662, file: !662, line: 177, type: !663, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!662 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!663 = !DISubroutineType(types: !664)
!664 = !{!665, !666, !667, !104}
!665 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!666 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !184)
!667 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !217)
!668 = !DISubprogram(name: "fprintf", scope: !669, file: !669, line: 350, type: !670, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!669 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!670 = !DISubroutineType(types: !671)
!671 = !{!104, !672, !666, null}
!672 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !675, line: 7, baseType: !676)
!675 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !677, line: 49, size: 1728, elements: !678)
!677 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !694, !696, !697, !698, !700, !702, !704, !708, !711, !713, !716, !719, !720, !721, !722, !723}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !676, file: !677, line: 51, baseType: !104, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !676, file: !677, line: 54, baseType: !203, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !676, file: !677, line: 55, baseType: !203, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !676, file: !677, line: 56, baseType: !203, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !676, file: !677, line: 57, baseType: !203, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !676, file: !677, line: 58, baseType: !203, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !676, file: !677, line: 59, baseType: !203, size: 64, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !676, file: !677, line: 60, baseType: !203, size: 64, offset: 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !676, file: !677, line: 61, baseType: !203, size: 64, offset: 512)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !676, file: !677, line: 64, baseType: !203, size: 64, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !676, file: !677, line: 65, baseType: !203, size: 64, offset: 640)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !676, file: !677, line: 66, baseType: !203, size: 64, offset: 704)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !676, file: !677, line: 68, baseType: !692, size: 64, offset: 768)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !677, line: 36, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !676, file: !677, line: 70, baseType: !695, size: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !676, file: !677, line: 72, baseType: !104, size: 32, offset: 896)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !676, file: !677, line: 73, baseType: !104, size: 32, offset: 928)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !676, file: !677, line: 74, baseType: !699, size: 64, offset: 960)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !246, line: 152, baseType: !665)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !676, file: !677, line: 77, baseType: !701, size: 16, offset: 1024)
!701 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !676, file: !677, line: 78, baseType: !703, size: 8, offset: 1040)
!703 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !676, file: !677, line: 79, baseType: !705, size: 8, offset: 1048)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 1)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !676, file: !677, line: 81, baseType: !709, size: 64, offset: 1088)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !677, line: 43, baseType: null)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !676, file: !677, line: 89, baseType: !712, size: 64, offset: 1152)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !246, line: 153, baseType: !665)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !676, file: !677, line: 91, baseType: !714, size: 64, offset: 1216)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !677, line: 37, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !676, file: !677, line: 92, baseType: !717, size: 64, offset: 1280)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !677, line: 38, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !676, file: !677, line: 93, baseType: !695, size: 64, offset: 1344)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !676, file: !677, line: 94, baseType: !12, size: 64, offset: 1408)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !676, file: !677, line: 95, baseType: !181, size: 64, offset: 1472)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !676, file: !677, line: 96, baseType: !104, size: 32, offset: 1536)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !676, file: !677, line: 98, baseType: !724, size: 160, offset: 1568)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 20)
!727 = !DISubprogram(name: "version", scope: !649, file: !649, line: 40, type: !728, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !184}
!730 = !DISubprogram(name: "exit", scope: !662, file: !662, line: 624, type: !731, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !104}
!733 = !DISubprogram(name: "isc_file_splitpath", scope: !734, file: !734, line: 311, type: !735, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!734 = !DIFile(filename: "lib/isc/include/isc/file.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "5593ae1824411974c480d3213e2cfe04")
!735 = !DISubroutineType(types: !736)
!736 = !{!222, !163, !184, !217, !737}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!738 = !DISubprogram(name: "isc_result_totext", scope: !739, file: !739, line: 97, type: !740, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!739 = !DIFile(filename: "lib/isc/include/isc/result.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "b66e2fce4d36f26ced5288e76c5bf05c")
!740 = !DISubroutineType(types: !741)
!741 = !{!184, !222}
!742 = !DISubprogram(name: "strcmp", scope: !743, file: !743, line: 156, type: !744, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!743 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!744 = !DISubroutineType(types: !745)
!745 = !{!104, !184, !184}
!746 = !DISubprogram(name: "isc__mem_free", scope: !167, file: !167, line: 640, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DISubprogram(name: "dst_lib_init", scope: !240, file: !240, line: 134, type: !748, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!748 = !DISubroutineType(types: !749)
!749 = !{!222, !163, !184}
!750 = !DISubprogram(name: "dst_key_fromnamedfile", scope: !240, file: !240, line: 335, type: !751, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!751 = !DISubroutineType(types: !752)
!752 = !{!222, !184, !184, !104, !163, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!754 = !DISubprogram(name: "dst_key_rid", scope: !240, file: !240, line: 687, type: !755, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!755 = !DISubroutineType(types: !756)
!756 = !{!757, !761}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_keytag_t", file: !758, line: 98, baseType: !759)
!758 = !DIFile(filename: "lib/dns/include/dns/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "f35a187441d60b1b4301c816339e75b0")
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !244, line: 25, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !246, line: 40, baseType: !701)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!763 = !DISubprogram(name: "dst_key_format", scope: !240, file: !240, line: 902, type: !764, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !761, !203, !170}
!766 = !DISubprogram(name: "set_keyversion", scope: !649, file: !649, line: 71, type: !767, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
