; ModuleID = 'samples/219.bc'
source_filename = "src/match/tyr-search.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Tyrsearchinfo = type { ptr, ptr, ptr, ptr, i64, i32, i32, ptr }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"!err || !gt_error_is_set(err)\00", align 1, !dbg !7
@__func__.gt_tyrsearch = private unnamed_addr constant [13 x i8] c"gt_tyrsearch\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [23 x i8] c"src/match/tyr-search.c\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [17 x i8] c"tyrindex != NULL\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [29 x i8] c"tyrsearchinfo->rcbuf != NULL\00", align 1, !dbg !28
@__func__.singleseqtyrsearch = private unnamed_addr constant [19 x i8] c"singleseqtyrsearch\00", align 1, !dbg !33
@.str.5 = private unnamed_addr constant [13 x i8] c"offset < len\00", align 1, !dbg !38

!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(scope: null, file: !2, line: 228, type: !20, isLocal: true, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 23)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 246, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 17)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !2, line: 189, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 29)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(scope: null, file: !2, line: 189, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 152, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 19)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(scope: null, file: !40, line: 80, type: !41, isLocal: true, isDefinition: true)
!40 = !DIFile(filename: "src/core/chardef_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c89c6639b3cd250bfec2fbc1df35914d")
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !16)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !40, line: 80, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 232, elements: !31)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(scope: null, file: !40, line: 80, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1336, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 167)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 4)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(scope: null, file: !2, line: 124, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 6)
!60 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !61, globals: !68, splitDebugInlining: false, nameTableKind: None)
!61 = !{!62, !63, !66}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUchar", file: !64, line: 102, baseType: !65)
!64 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!65 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !64, line: 83, baseType: !67)
!67 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!68 = !{!0, !7, !12, !18, !23, !28, !33, !38, !42, !45, !50, !55}
!69 = !{i32 7, !"Dwarf Version", i32 5}
!70 = !{i32 2, !"Debug Info Version", i32 3}
!71 = !{i32 1, !"wchar_size", i32 4}
!72 = !{i32 8, !"PIC Level", i32 2}
!73 = !{i32 7, !"uwtable", i32 2}
!74 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!75 = distinct !DISubprogram(name: "gt_searchsinglemer", scope: !2, file: !2, line: 73, type: !76, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !60, retainedNodes: !109)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !78, !80, !85, !104}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tyrindex", file: !83, line: 26, baseType: !84)
!83 = !DIFile(filename: "src/match/tyr-map.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "5830505e326287a0d1a2ace45d2ee60a")
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tyrindex", file: !83, line: 26, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tyrsearchinfo", file: !2, line: 41, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 32, size: 448, elements: !89)
!89 = !{!90, !92, !93, !94, !95, !96, !98, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !88, file: !2, line: 34, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rcbuf", scope: !88, file: !2, line: 35, baseType: !91, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "mertable", scope: !88, file: !2, line: 36, baseType: !78, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "lastmer", scope: !88, file: !2, line: 36, baseType: !78, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "mersize", scope: !88, file: !2, line: 37, baseType: !66, size: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "showmode", scope: !88, file: !2, line: 38, baseType: !97, size: 32, offset: 320)
!97 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "searchstrand", scope: !88, file: !2, line: 39, baseType: !97, size: 32, offset: 352)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dnaalpha", scope: !88, file: !2, line: 40, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtAlphabet", file: !102, line: 32, baseType: !103)
!102 = !DIFile(filename: "src/core/alphabet_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0b48240ce57ca6598f5548b5c9cf52e4")
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtAlphabet", file: !102, line: 32, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tyrbckinfo", file: !107, line: 26, baseType: !108)
!107 = !DIFile(filename: "src/match/tyr-mersplit.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "a0485cf04614cb1d8257f324d4de053e")
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tyrbckinfo", file: !107, line: 26, flags: DIFlagFwdDecl)
!109 = !{!110, !111, !112, !113, !114}
!110 = !DILocalVariable(name: "qptr", arg: 1, scope: !75, file: !2, line: 73, type: !78)
!111 = !DILocalVariable(name: "tyrindex", arg: 2, scope: !75, file: !2, line: 74, type: !80)
!112 = !DILocalVariable(name: "tyrsearchinfo", arg: 3, scope: !75, file: !2, line: 75, type: !85)
!113 = !DILocalVariable(name: "tyrbckinfo", arg: 4, scope: !75, file: !2, line: 76, type: !104)
!114 = !DILocalVariable(name: "result", scope: !75, file: !2, line: 78, type: !78)
!115 = !{!116, !116, i64 0}
!116 = !{!"any pointer", !117, i64 0}
!117 = !{!"omnipotent char", !118, i64 0}
!118 = !{!"Simple C/C++ TBAA"}
!119 = !DILocation(line: 73, column: 61, scope: !75)
!120 = !DILocation(line: 74, column: 57, scope: !75)
!121 = !DILocation(line: 75, column: 62, scope: !75)
!122 = !DILocation(line: 76, column: 59, scope: !75)
!123 = !DILocation(line: 78, column: 3, scope: !75)
!124 = !DILocation(line: 78, column: 18, scope: !75)
!125 = !DILocation(line: 80, column: 31, scope: !75)
!126 = !DILocation(line: 80, column: 46, scope: !75)
!127 = !{!128, !116, i64 0}
!128 = !{!"", !116, i64 0, !116, i64 8, !116, i64 16, !116, i64 24, !129, i64 32, !130, i64 40, !130, i64 44, !116, i64 48}
!129 = !{!"long", !117, i64 0}
!130 = !{!"int", !117, i64 0}
!131 = !DILocation(line: 80, column: 55, scope: !75)
!132 = !DILocation(line: 81, column: 40, scope: !75)
!133 = !DILocation(line: 81, column: 55, scope: !75)
!134 = !{!128, !129, i64 32}
!135 = !DILocation(line: 80, column: 3, scope: !75)
!136 = !DILocation(line: 82, column: 7, scope: !137)
!137 = distinct !DILexicalBlock(scope: !75, file: !2, line: 82, column: 7)
!138 = !DILocation(line: 82, column: 18, scope: !137)
!139 = !DILocation(line: 82, column: 7, scope: !75)
!140 = !DILocation(line: 84, column: 39, scope: !141)
!141 = distinct !DILexicalBlock(scope: !137, file: !2, line: 83, column: 3)
!142 = !DILocation(line: 84, column: 50, scope: !141)
!143 = !DILocation(line: 84, column: 65, scope: !141)
!144 = !DILocation(line: 85, column: 36, scope: !141)
!145 = !DILocation(line: 85, column: 51, scope: !141)
!146 = !{!128, !116, i64 16}
!147 = !DILocation(line: 86, column: 36, scope: !141)
!148 = !DILocation(line: 86, column: 51, scope: !141)
!149 = !{!128, !116, i64 24}
!150 = !DILocation(line: 84, column: 14, scope: !141)
!151 = !DILocation(line: 84, column: 12, scope: !141)
!152 = !DILocation(line: 87, column: 3, scope: !141)
!153 = !DILocation(line: 89, column: 33, scope: !154)
!154 = distinct !DILexicalBlock(scope: !137, file: !2, line: 88, column: 3)
!155 = !DILocation(line: 89, column: 42, scope: !154)
!156 = !DILocation(line: 89, column: 53, scope: !154)
!157 = !DILocation(line: 89, column: 68, scope: !154)
!158 = !DILocation(line: 89, column: 14, scope: !154)
!159 = !DILocation(line: 89, column: 12, scope: !154)
!160 = !DILocation(line: 91, column: 10, scope: !75)
!161 = !DILocation(line: 92, column: 1, scope: !75)
!162 = !DILocation(line: 91, column: 3, scope: !75)
!163 = !DISubprogram(name: "gt_encseq_plainseq2bytecode", scope: !164, file: !164, line: 149, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!164 = !DIFile(filename: "src/core/encseq.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "9251cd05615585d739ba548318e41174")
!165 = !DISubroutineType(types: !166)
!166 = !{null, !91, !78, !66}
!167 = !DISubprogram(name: "gt_tyrindex_binmersearch", scope: !83, file: !83, line: 37, type: !168, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!168 = !DISubroutineType(types: !169)
!169 = !{!78, !80, !66, !78, !78, !78}
!170 = !DISubprogram(name: "gt_searchinbuckets", scope: !107, file: !107, line: 37, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!171 = !DISubroutineType(types: !172)
!172 = !{!78, !80, !104, !78}
!173 = distinct !DISubprogram(name: "gt_tyrsearch", scope: !2, file: !2, line: 215, type: !174, scopeLine: 222, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !60, retainedNodes: !188)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !177, !178, !97, !97, !183, !183, !184}
!176 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStrArray", file: !181, line: 24, baseType: !182)
!181 = !DIFile(filename: "src/core/str_array_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "d2f5724ae7121552c301a489d5e7f125")
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStrArray", file: !181, line: 24, flags: DIFlagFwdDecl)
!183 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !186, line: 44, baseType: !187)
!186 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !186, line: 44, flags: DIFlagFwdDecl)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !198, !202, !204, !205, !208, !209, !211, !216, !217, !218}
!189 = !DILocalVariable(name: "tyrindexname", arg: 1, scope: !173, file: !2, line: 215, type: !177)
!190 = !DILocalVariable(name: "queryfilenames", arg: 2, scope: !173, file: !2, line: 216, type: !178)
!191 = !DILocalVariable(name: "showmode", arg: 3, scope: !173, file: !2, line: 217, type: !97)
!192 = !DILocalVariable(name: "searchstrand", arg: 4, scope: !173, file: !2, line: 218, type: !97)
!193 = !DILocalVariable(name: "verbose", arg: 5, scope: !173, file: !2, line: 219, type: !183)
!194 = !DILocalVariable(name: "performtest", arg: 6, scope: !173, file: !2, line: 220, type: !183)
!195 = !DILocalVariable(name: "err", arg: 7, scope: !173, file: !2, line: 221, type: !184)
!196 = !DILocalVariable(name: "tyrindex", scope: !173, file: !2, line: 223, type: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!198 = !DILocalVariable(name: "tyrcountinfo", scope: !173, file: !2, line: 224, type: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tyrcountinfo", file: !83, line: 49, baseType: !201)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tyrcountinfo", file: !83, line: 49, flags: DIFlagFwdDecl)
!202 = !DILocalVariable(name: "tyrbckinfo", scope: !173, file: !2, line: 225, type: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!204 = !DILocalVariable(name: "haserr", scope: !173, file: !2, line: 226, type: !183)
!205 = !DILocalVariable(name: "query", scope: !206, file: !2, line: 272, type: !78)
!206 = distinct !DILexicalBlock(scope: !207, file: !2, line: 271, column: 3)
!207 = distinct !DILexicalBlock(scope: !173, file: !2, line: 270, column: 7)
!208 = !DILocalVariable(name: "querylen", scope: !206, file: !2, line: 273, type: !66)
!209 = !DILocalVariable(name: "desc", scope: !206, file: !2, line: 274, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!211 = !DILocalVariable(name: "unitnum", scope: !206, file: !2, line: 275, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !213, line: 27, baseType: !214)
!213 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !215, line: 45, baseType: !67)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!216 = !DILocalVariable(name: "retval", scope: !206, file: !2, line: 276, type: !176)
!217 = !DILocalVariable(name: "tyrsearchinfo", scope: !206, file: !2, line: 277, type: !87)
!218 = !DILocalVariable(name: "seqit", scope: !206, file: !2, line: 278, type: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtSeqIterator", file: !221, line: 27, baseType: !222)
!221 = !DIFile(filename: "src/core/seq_iterator_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "ff6b04aad4856267d816ffb10e467dd5")
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtSeqIterator", file: !221, line: 27, flags: DIFlagFwdDecl)
!223 = !DILocation(line: 215, column: 30, scope: !173)
!224 = !DILocation(line: 216, column: 36, scope: !173)
!225 = !{!130, !130, i64 0}
!226 = !DILocation(line: 217, column: 31, scope: !173)
!227 = !DILocation(line: 218, column: 31, scope: !173)
!228 = !{!229, !229, i64 0}
!229 = !{!"_Bool", !117, i64 0}
!230 = !DILocation(line: 219, column: 23, scope: !173)
!231 = !DILocation(line: 220, column: 23, scope: !173)
!232 = !DILocation(line: 221, column: 27, scope: !173)
!233 = !DILocation(line: 223, column: 3, scope: !173)
!234 = !DILocation(line: 223, column: 13, scope: !173)
!235 = !DILocation(line: 224, column: 3, scope: !173)
!236 = !DILocation(line: 224, column: 17, scope: !173)
!237 = !DILocation(line: 225, column: 3, scope: !173)
!238 = !DILocation(line: 225, column: 15, scope: !173)
!239 = !DILocation(line: 226, column: 3, scope: !173)
!240 = !DILocation(line: 226, column: 8, scope: !173)
!241 = !DILocation(line: 228, column: 3, scope: !173)
!242 = !DILocation(line: 228, column: 3, scope: !243)
!243 = distinct !DILexicalBlock(scope: !244, file: !2, line: 228, column: 3)
!244 = distinct !DILexicalBlock(scope: !173, file: !2, line: 228, column: 3)
!245 = !DILocation(line: 228, column: 3, scope: !244)
!246 = !DILocation(line: 228, column: 3, scope: !247)
!247 = distinct !DILexicalBlock(scope: !243, file: !2, line: 228, column: 3)
!248 = !DILocation(line: 229, column: 30, scope: !173)
!249 = !DILocation(line: 229, column: 43, scope: !173)
!250 = !DILocation(line: 229, column: 14, scope: !173)
!251 = !DILocation(line: 229, column: 12, scope: !173)
!252 = !DILocation(line: 230, column: 7, scope: !253)
!253 = distinct !DILexicalBlock(scope: !173, file: !2, line: 230, column: 7)
!254 = !DILocation(line: 230, column: 16, scope: !253)
!255 = !DILocation(line: 230, column: 7, scope: !173)
!256 = !DILocation(line: 232, column: 12, scope: !257)
!257 = distinct !DILexicalBlock(scope: !253, file: !2, line: 231, column: 3)
!258 = !DILocation(line: 233, column: 3, scope: !257)
!259 = !DILocation(line: 235, column: 9, scope: !260)
!260 = distinct !DILexicalBlock(scope: !261, file: !2, line: 235, column: 9)
!261 = distinct !DILexicalBlock(scope: !253, file: !2, line: 234, column: 3)
!262 = !{i8 0, i8 2}
!263 = !{}
!264 = !DILocation(line: 235, column: 9, scope: !261)
!265 = !DILocation(line: 237, column: 24, scope: !266)
!266 = distinct !DILexicalBlock(scope: !260, file: !2, line: 236, column: 5)
!267 = !DILocation(line: 237, column: 7, scope: !266)
!268 = !DILocation(line: 238, column: 5, scope: !266)
!269 = !DILocation(line: 239, column: 9, scope: !270)
!270 = distinct !DILexicalBlock(scope: !261, file: !2, line: 239, column: 9)
!271 = !DILocation(line: 239, column: 9, scope: !261)
!272 = !DILocation(line: 241, column: 25, scope: !273)
!273 = distinct !DILexicalBlock(scope: !270, file: !2, line: 240, column: 5)
!274 = !DILocation(line: 241, column: 7, scope: !273)
!275 = !DILocation(line: 242, column: 5, scope: !273)
!276 = !DILocation(line: 244, column: 8, scope: !277)
!277 = distinct !DILexicalBlock(scope: !173, file: !2, line: 244, column: 7)
!278 = !DILocation(line: 244, column: 7, scope: !173)
!279 = !DILocation(line: 246, column: 5, scope: !280)
!280 = distinct !DILexicalBlock(scope: !277, file: !2, line: 245, column: 3)
!281 = !DILocation(line: 246, column: 5, scope: !282)
!282 = distinct !DILexicalBlock(scope: !283, file: !2, line: 246, column: 5)
!283 = distinct !DILexicalBlock(scope: !280, file: !2, line: 246, column: 5)
!284 = !DILocation(line: 246, column: 5, scope: !283)
!285 = !DILocation(line: 246, column: 5, scope: !286)
!286 = distinct !DILexicalBlock(scope: !282, file: !2, line: 246, column: 5)
!287 = !DILocation(line: 247, column: 10, scope: !288)
!288 = distinct !DILexicalBlock(scope: !280, file: !2, line: 247, column: 9)
!289 = !DILocation(line: 247, column: 19, scope: !288)
!290 = !DILocation(line: 247, column: 33, scope: !288)
!291 = !DILocation(line: 247, column: 57, scope: !288)
!292 = !DILocation(line: 247, column: 37, scope: !288)
!293 = !DILocation(line: 247, column: 9, scope: !280)
!294 = !DILocation(line: 249, column: 42, scope: !295)
!295 = distinct !DILexicalBlock(scope: !288, file: !2, line: 248, column: 5)
!296 = !DILocation(line: 249, column: 51, scope: !295)
!297 = !DILocation(line: 249, column: 64, scope: !295)
!298 = !DILocation(line: 249, column: 22, scope: !295)
!299 = !DILocation(line: 249, column: 20, scope: !295)
!300 = !DILocation(line: 250, column: 11, scope: !301)
!301 = distinct !DILexicalBlock(scope: !295, file: !2, line: 250, column: 11)
!302 = !DILocation(line: 250, column: 24, scope: !301)
!303 = !DILocation(line: 250, column: 11, scope: !295)
!304 = !DILocation(line: 252, column: 16, scope: !305)
!305 = distinct !DILexicalBlock(scope: !301, file: !2, line: 251, column: 7)
!306 = !DILocation(line: 253, column: 7, scope: !305)
!307 = !DILocation(line: 254, column: 5, scope: !295)
!308 = !DILocation(line: 255, column: 3, scope: !280)
!309 = !DILocation(line: 256, column: 8, scope: !310)
!310 = distinct !DILexicalBlock(scope: !173, file: !2, line: 256, column: 7)
!311 = !DILocation(line: 256, column: 7, scope: !173)
!312 = !DILocation(line: 258, column: 5, scope: !313)
!313 = distinct !DILexicalBlock(scope: !310, file: !2, line: 257, column: 3)
!314 = !DILocation(line: 258, column: 5, scope: !315)
!315 = distinct !DILexicalBlock(scope: !316, file: !2, line: 258, column: 5)
!316 = distinct !DILexicalBlock(scope: !313, file: !2, line: 258, column: 5)
!317 = !DILocation(line: 258, column: 5, scope: !316)
!318 = !DILocation(line: 258, column: 5, scope: !319)
!319 = distinct !DILexicalBlock(scope: !315, file: !2, line: 258, column: 5)
!320 = !DILocation(line: 259, column: 30, scope: !321)
!321 = distinct !DILexicalBlock(scope: !313, file: !2, line: 259, column: 9)
!322 = !DILocation(line: 259, column: 10, scope: !321)
!323 = !DILocation(line: 259, column: 9, scope: !313)
!324 = !DILocation(line: 261, column: 38, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !2, line: 260, column: 5)
!326 = !DILocation(line: 262, column: 60, scope: !325)
!327 = !DILocation(line: 262, column: 38, scope: !325)
!328 = !DILocation(line: 263, column: 38, scope: !325)
!329 = !DILocation(line: 261, column: 20, scope: !325)
!330 = !DILocation(line: 261, column: 18, scope: !325)
!331 = !DILocation(line: 264, column: 11, scope: !332)
!332 = distinct !DILexicalBlock(scope: !325, file: !2, line: 264, column: 11)
!333 = !DILocation(line: 264, column: 22, scope: !332)
!334 = !DILocation(line: 264, column: 11, scope: !325)
!335 = !DILocation(line: 266, column: 16, scope: !336)
!336 = distinct !DILexicalBlock(scope: !332, file: !2, line: 265, column: 7)
!337 = !DILocation(line: 267, column: 7, scope: !336)
!338 = !DILocation(line: 268, column: 5, scope: !325)
!339 = !DILocation(line: 269, column: 3, scope: !313)
!340 = !DILocation(line: 270, column: 8, scope: !207)
!341 = !DILocation(line: 270, column: 7, scope: !173)
!342 = !DILocation(line: 272, column: 5, scope: !206)
!343 = !DILocation(line: 272, column: 20, scope: !206)
!344 = !DILocation(line: 273, column: 5, scope: !206)
!345 = !DILocation(line: 273, column: 13, scope: !206)
!346 = !DILocation(line: 274, column: 5, scope: !206)
!347 = !DILocation(line: 274, column: 11, scope: !206)
!348 = !DILocation(line: 275, column: 5, scope: !206)
!349 = !DILocation(line: 275, column: 14, scope: !206)
!350 = !DILocation(line: 276, column: 5, scope: !206)
!351 = !DILocation(line: 276, column: 9, scope: !206)
!352 = !DILocation(line: 277, column: 5, scope: !206)
!353 = !DILocation(line: 277, column: 19, scope: !206)
!354 = !DILocation(line: 278, column: 5, scope: !206)
!355 = !DILocation(line: 278, column: 20, scope: !206)
!356 = !DILocation(line: 280, column: 5, scope: !206)
!357 = !DILocation(line: 280, column: 5, scope: !358)
!358 = distinct !DILexicalBlock(scope: !359, file: !2, line: 280, column: 5)
!359 = distinct !DILexicalBlock(scope: !206, file: !2, line: 280, column: 5)
!360 = !DILocation(line: 280, column: 5, scope: !359)
!361 = !DILocation(line: 280, column: 5, scope: !362)
!362 = distinct !DILexicalBlock(scope: !358, file: !2, line: 280, column: 5)
!363 = !DILocation(line: 281, column: 42, scope: !206)
!364 = !DILocation(line: 281, column: 51, scope: !206)
!365 = !DILocation(line: 281, column: 60, scope: !206)
!366 = !DILocation(line: 281, column: 5, scope: !206)
!367 = !DILocation(line: 282, column: 49, scope: !206)
!368 = !DILocation(line: 282, column: 65, scope: !206)
!369 = !DILocation(line: 282, column: 13, scope: !206)
!370 = !DILocation(line: 282, column: 11, scope: !206)
!371 = !DILocation(line: 283, column: 10, scope: !372)
!372 = distinct !DILexicalBlock(scope: !206, file: !2, line: 283, column: 9)
!373 = !DILocation(line: 283, column: 9, scope: !206)
!374 = !DILocation(line: 284, column: 14, scope: !372)
!375 = !DILocation(line: 284, column: 7, scope: !372)
!376 = !DILocation(line: 285, column: 10, scope: !377)
!377 = distinct !DILexicalBlock(scope: !206, file: !2, line: 285, column: 9)
!378 = !DILocation(line: 285, column: 9, scope: !206)
!379 = !DILocation(line: 287, column: 37, scope: !380)
!380 = distinct !DILexicalBlock(scope: !377, file: !2, line: 286, column: 5)
!381 = !DILocation(line: 288, column: 70, scope: !380)
!382 = !{!128, !116, i64 48}
!383 = !DILocation(line: 288, column: 34, scope: !380)
!384 = !DILocation(line: 287, column: 7, scope: !380)
!385 = !DILocation(line: 289, column: 20, scope: !386)
!386 = distinct !DILexicalBlock(scope: !380, file: !2, line: 289, column: 7)
!387 = !{!129, !129, i64 0}
!388 = !DILocation(line: 289, column: 12, scope: !386)
!389 = !DILocation(line: 291, column: 39, scope: !390)
!390 = distinct !DILexicalBlock(scope: !391, file: !2, line: 290, column: 7)
!391 = distinct !DILexicalBlock(scope: !386, file: !2, line: 289, column: 7)
!392 = !DILocation(line: 295, column: 38, scope: !390)
!393 = !DILocation(line: 291, column: 18, scope: !390)
!394 = !DILocation(line: 291, column: 16, scope: !390)
!395 = !DILocation(line: 296, column: 13, scope: !396)
!396 = distinct !DILexicalBlock(scope: !390, file: !2, line: 296, column: 13)
!397 = !DILocation(line: 296, column: 20, scope: !396)
!398 = !DILocation(line: 296, column: 13, scope: !390)
!399 = !DILocation(line: 298, column: 18, scope: !400)
!400 = distinct !DILexicalBlock(scope: !396, file: !2, line: 297, column: 9)
!401 = !DILocation(line: 299, column: 11, scope: !400)
!402 = !DILocation(line: 301, column: 13, scope: !403)
!403 = distinct !DILexicalBlock(scope: !390, file: !2, line: 301, column: 13)
!404 = !DILocation(line: 301, column: 20, scope: !403)
!405 = !DILocation(line: 301, column: 13, scope: !390)
!406 = !DILocation(line: 303, column: 11, scope: !407)
!407 = distinct !DILexicalBlock(scope: !403, file: !2, line: 302, column: 9)
!408 = !DILocation(line: 305, column: 28, scope: !390)
!409 = !DILocation(line: 306, column: 28, scope: !390)
!410 = !DILocation(line: 308, column: 28, scope: !390)
!411 = !DILocation(line: 309, column: 28, scope: !390)
!412 = !DILocation(line: 310, column: 28, scope: !390)
!413 = !DILocation(line: 311, column: 28, scope: !390)
!414 = !DILocation(line: 312, column: 28, scope: !390)
!415 = !DILocation(line: 305, column: 9, scope: !390)
!416 = !DILocation(line: 313, column: 7, scope: !390)
!417 = !DILocation(line: 289, column: 47, scope: !391)
!418 = !DILocation(line: 289, column: 7, scope: !391)
!419 = distinct !{!419, !420, !421}
!420 = !DILocation(line: 289, column: 7, scope: !386)
!421 = !DILocation(line: 313, column: 7, scope: !386)
!422 = !DILocation(line: 314, column: 30, scope: !380)
!423 = !DILocation(line: 314, column: 7, scope: !380)
!424 = !DILocation(line: 315, column: 5, scope: !380)
!425 = !DILocation(line: 316, column: 5, scope: !206)
!426 = !DILocation(line: 317, column: 3, scope: !207)
!427 = !DILocation(line: 317, column: 3, scope: !206)
!428 = !DILocation(line: 318, column: 7, scope: !429)
!429 = distinct !DILexicalBlock(scope: !173, file: !2, line: 318, column: 7)
!430 = !DILocation(line: 318, column: 18, scope: !429)
!431 = !DILocation(line: 318, column: 7, scope: !173)
!432 = !DILocation(line: 320, column: 5, scope: !433)
!433 = distinct !DILexicalBlock(scope: !429, file: !2, line: 319, column: 3)
!434 = !DILocation(line: 321, column: 3, scope: !433)
!435 = !DILocation(line: 322, column: 7, scope: !436)
!436 = distinct !DILexicalBlock(scope: !173, file: !2, line: 322, column: 7)
!437 = !DILocation(line: 322, column: 20, scope: !436)
!438 = !DILocation(line: 322, column: 7, scope: !173)
!439 = !DILocation(line: 324, column: 5, scope: !440)
!440 = distinct !DILexicalBlock(scope: !436, file: !2, line: 323, column: 3)
!441 = !DILocation(line: 325, column: 3, scope: !440)
!442 = !DILocation(line: 326, column: 7, scope: !443)
!443 = distinct !DILexicalBlock(scope: !173, file: !2, line: 326, column: 7)
!444 = !DILocation(line: 326, column: 16, scope: !443)
!445 = !DILocation(line: 326, column: 7, scope: !173)
!446 = !DILocation(line: 328, column: 5, scope: !447)
!447 = distinct !DILexicalBlock(scope: !443, file: !2, line: 327, column: 3)
!448 = !DILocation(line: 329, column: 3, scope: !447)
!449 = !DILocation(line: 330, column: 10, scope: !173)
!450 = !DILocation(line: 331, column: 1, scope: !173)
!451 = !DILocation(line: 330, column: 3, scope: !173)
!452 = !DISubprogram(name: "gt_error_is_set", scope: !186, file: !186, line: 64, type: !453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!453 = !DISubroutineType(types: !454)
!454 = !{!183, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!457 = !DISubprogram(name: "fprintf", scope: !458, file: !458, line: 350, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!458 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!459 = !DISubroutineType(types: !460)
!460 = !{!176, !461, !519, null}
!461 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !464, line: 7, baseType: !465)
!464 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !466, line: 49, size: 1728, elements: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !483, !485, !486, !487, !490, !492, !494, !498, !501, !503, !506, !509, !510, !511, !514, !515}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !465, file: !466, line: 51, baseType: !176, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !465, file: !466, line: 54, baseType: !210, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !465, file: !466, line: 55, baseType: !210, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !465, file: !466, line: 56, baseType: !210, size: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !465, file: !466, line: 57, baseType: !210, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !465, file: !466, line: 58, baseType: !210, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !465, file: !466, line: 59, baseType: !210, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !465, file: !466, line: 60, baseType: !210, size: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !465, file: !466, line: 61, baseType: !210, size: 64, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !465, file: !466, line: 64, baseType: !210, size: 64, offset: 576)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !465, file: !466, line: 65, baseType: !210, size: 64, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !465, file: !466, line: 66, baseType: !210, size: 64, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !465, file: !466, line: 68, baseType: !481, size: 64, offset: 768)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !466, line: 36, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !465, file: !466, line: 70, baseType: !484, size: 64, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !465, file: !466, line: 72, baseType: !176, size: 32, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !465, file: !466, line: 73, baseType: !176, size: 32, offset: 928)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !465, file: !466, line: 74, baseType: !488, size: 64, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !215, line: 152, baseType: !489)
!489 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !465, file: !466, line: 77, baseType: !491, size: 16, offset: 1024)
!491 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !465, file: !466, line: 78, baseType: !493, size: 8, offset: 1040)
!493 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !465, file: !466, line: 79, baseType: !495, size: 8, offset: 1048)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 1)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !465, file: !466, line: 81, baseType: !499, size: 64, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !466, line: 43, baseType: null)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !465, file: !466, line: 89, baseType: !502, size: 64, offset: 1152)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !215, line: 153, baseType: !489)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !465, file: !466, line: 91, baseType: !504, size: 64, offset: 1216)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !466, line: 37, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !465, file: !466, line: 92, baseType: !507, size: 64, offset: 1280)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !466, line: 38, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !465, file: !466, line: 93, baseType: !484, size: 64, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !465, file: !466, line: 94, baseType: !62, size: 64, offset: 1408)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !465, file: !466, line: 95, baseType: !512, size: 64, offset: 1472)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !513, line: 70, baseType: !67)
!513 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !465, file: !466, line: 96, baseType: !176, size: 32, offset: 1536)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !465, file: !466, line: 98, baseType: !516, size: 160, offset: 1568)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 20)
!519 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !177)
!520 = !DISubprogram(name: "abort", scope: !521, file: !521, line: 598, type: !522, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!521 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!522 = !DISubroutineType(types: !523)
!523 = !{null}
!524 = !DISubprogram(name: "gt_tyrindex_new", scope: !83, file: !83, line: 28, type: !525, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!525 = !DISubroutineType(types: !526)
!526 = !{!197, !177, !184}
!527 = !DISubprogram(name: "gt_tyrindex_show", scope: !83, file: !83, line: 35, type: !528, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !80}
!530 = !DISubprogram(name: "gt_tyrindex_check", scope: !83, file: !83, line: 42, type: !528, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!531 = !DISubprogram(name: "gt_tyrindex_isempty", scope: !83, file: !83, line: 34, type: !532, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!532 = !DISubroutineType(types: !533)
!533 = !{!183, !80}
!534 = !DISubprogram(name: "gt_tyrcountinfo_new", scope: !83, file: !83, line: 51, type: !535, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!535 = !DISubroutineType(types: !536)
!536 = !{!199, !80, !177, !184}
!537 = !DISubprogram(name: "gt_tyrbckinfo_new", scope: !107, file: !107, line: 32, type: !538, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!538 = !DISubroutineType(types: !539)
!539 = !{!203, !177, !97, !184}
!540 = !DISubprogram(name: "gt_tyrindex_alphasize", scope: !83, file: !83, line: 32, type: !541, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !DISubroutineType(types: !542)
!542 = !{!97, !80}
!543 = distinct !DISubprogram(name: "gt_tyrsearchinfo_init", scope: !2, file: !2, line: 43, type: !544, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !60, retainedNodes: !547)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !546, !80, !97, !97}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!547 = !{!548, !549, !550, !551, !552}
!548 = !DILocalVariable(name: "tyrsearchinfo", arg: 1, scope: !543, file: !2, line: 43, type: !546)
!549 = !DILocalVariable(name: "tyrindex", arg: 2, scope: !543, file: !2, line: 44, type: !80)
!550 = !DILocalVariable(name: "showmode", arg: 3, scope: !543, file: !2, line: 45, type: !97)
!551 = !DILocalVariable(name: "searchstrand", arg: 4, scope: !543, file: !2, line: 46, type: !97)
!552 = !DILocalVariable(name: "merbytes", scope: !543, file: !2, line: 48, type: !66)
!553 = !DILocation(line: 43, column: 50, scope: !543)
!554 = !DILocation(line: 44, column: 48, scope: !543)
!555 = !DILocation(line: 45, column: 45, scope: !543)
!556 = !DILocation(line: 46, column: 45, scope: !543)
!557 = !DILocation(line: 48, column: 3, scope: !543)
!558 = !DILocation(line: 48, column: 11, scope: !543)
!559 = !DILocation(line: 50, column: 35, scope: !543)
!560 = !DILocation(line: 50, column: 14, scope: !543)
!561 = !DILocation(line: 50, column: 12, scope: !543)
!562 = !DILocation(line: 51, column: 48, scope: !543)
!563 = !DILocation(line: 51, column: 28, scope: !543)
!564 = !DILocation(line: 51, column: 3, scope: !543)
!565 = !DILocation(line: 51, column: 18, scope: !543)
!566 = !DILocation(line: 51, column: 26, scope: !543)
!567 = !DILocation(line: 52, column: 50, scope: !543)
!568 = !DILocation(line: 52, column: 29, scope: !543)
!569 = !DILocation(line: 52, column: 3, scope: !543)
!570 = !DILocation(line: 52, column: 18, scope: !543)
