; ModuleID = 'samples/224.bc'
source_filename = "redis-check-aof.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.listIter = type { ptr, i32 }
%struct.aofManifest = type { ptr, ptr, ptr, i64, i64, i32 }
%struct.list = type { ptr, ptr, ptr, ptr, ptr, i64 }
%struct.aofInfo = type { ptr, i64, i32 }
%struct.listNode = type { ptr, ptr, ptr }

@.str = private unnamed_addr constant [3 x i8] c"\0D\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [29 x i8] c"Expected \\r\\n, got: %02x%02x\00", align 1, !dbg !7
@error = internal global [1044 x i8] zeroinitializer, align 16, !dbg !12
@.str.2 = private unnamed_addr constant [13 x i8] c"0x%16llx: %s\00", align 1, !dbg !44
@epos = internal global i64 0, align 8, !dbg !267
@line = internal global i64 1, align 8, !dbg !273
@.str.3 = private unnamed_addr constant [32 x i8] c"Expected prefix '%c', got: '%c'\00", align 1, !dbg !49
@.str.4 = private unnamed_addr constant [42 x i8] c"Expected to read %ld bytes, got %ld bytes\00", align 1, !dbg !54
@.str.5 = private unnamed_addr constant [73 x i8] c"Expected to read string of %ld bytes, which is not in the suitable range\00", align 1, !dbg !59

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "redis-check-aof.c", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/src", checksumkind: CSK_MD5, checksum: "65f90980df6ecf9d0ba64ee004300929")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 3)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 29)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "error", scope: !14, file: !2, line: 58, type: !280, isLocal: true, isDefinition: true)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !15, retainedTypes: !28, globals: !43, splitDebugInlining: false, nameTableKind: None)
!15 = !{!16, !22}
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 42, baseType: !17, size: 32, elements: !18)
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !{!19, !20, !21}
!19 = !DIEnumerator(name: "AOF_RESP", value: 0)
!20 = !DIEnumerator(name: "AOF_RDB_PREAMBLE", value: 1)
!21 = !DIEnumerator(name: "AOF_MULTI_PART", value: 2)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 1402, baseType: !17, size: 32, elements: !24)
!23 = !DIFile(filename: "./server.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/src", checksumkind: CSK_MD5, checksum: "d13810607e8b272ce8c5554655a1a06b")
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "AOF_FILE_TYPE_BASE", value: 98)
!26 = !DIEnumerator(name: "AOF_FILE_TYPE_HIST", value: 104)
!27 = !DIEnumerator(name: "AOF_FILE_TYPE_INCR", value: 105)
!28 = !{!29, !30, !31, !32, !33}
!29 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!32 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "aofInfo", file: !23, line: 1412, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 1408, size: 192, elements: !36)
!36 = !{!37, !40, !41}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "file_name", scope: !35, file: !23, line: 1409, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !39, line: 43, baseType: !31)
!39 = !DIFile(filename: "./sds.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/src", checksumkind: CSK_MD5, checksum: "6f1c77e1387f64b3d0932b6a429e2e08")
!40 = !DIDerivedType(tag: DW_TAG_member, name: "file_seq", scope: !35, file: !23, line: 1410, baseType: !29, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "file_type", scope: !35, file: !23, line: 1411, baseType: !42, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "aof_file_type", file: !23, line: 1406, baseType: !22)
!43 = !{!0, !7, !44, !49, !54, !59, !64, !69, !74, !79, !84, !89, !91, !96, !101, !106, !111, !116, !118, !123, !128, !133, !135, !140, !142, !147, !149, !154, !159, !164, !169, !174, !179, !184, !186, !188, !193, !195, !200, !205, !207, !209, !211, !216, !218, !220, !222, !224, !226, !231, !233, !238, !240, !242, !244, !246, !251, !253, !255, !260, !262, !12, !267, !273, !275}
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 13)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !51, isLocal: true, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 32)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !2, line: 91, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 42)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 584, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 73)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !2, line: 146, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 6)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 27)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 5)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 26)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(scope: null, file: !2, line: 180, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 53)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !76, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(scope: null, file: !2, line: 189, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 30)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(scope: null, file: !2, line: 194, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 54)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !2, line: 199, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 728, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 91)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(scope: null, file: !2, line: 201, type: !108, isLocal: true, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1440, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 180)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 207, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 44)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !3, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 38)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 35)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 49)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !2, line: 250, type: !130, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !2, line: 260, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 41)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !93, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 277, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 21)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !2, line: 283, type: !56, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 287, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 4)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !2, line: 294, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 45)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(scope: null, file: !2, line: 299, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 672, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 84)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !2, line: 304, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 59)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !2, line: 309, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 616, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 77)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !2, line: 311, type: !176, isLocal: true, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 18)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 312, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 2)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !2, line: 313, type: !46, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !2, line: 317, type: !71, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 324, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 61)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !181, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 339, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 25)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 345, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 22)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 358, type: !66, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 397, type: !202, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !76, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !2, line: 447, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 31)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !120, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !151, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !76, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 462, type: !202, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !202, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 466, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 48)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 469, type: !213, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !2, line: 478, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 28)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 487, type: !202, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !2, line: 489, type: !202, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !2, line: 501, type: !120, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !2, line: 508, type: !93, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 511, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 17)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !248, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !2, line: 533, type: !66, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !2, line: 540, type: !257, isLocal: true, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 24)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !2, line: 545, type: !51, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !2, line: 577, type: !264, isLocal: true, isDefinition: true)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 632, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 79)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "epos", scope: !14, file: !2, line: 59, type: !269, isLocal: true, isDefinition: true)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !270, line: 58, baseType: !271)
!270 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !272, line: 153, baseType: !32)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "line", scope: !14, file: !2, line: 60, type: !29, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "to_timestamp", scope: !14, file: !2, line: 61, type: !277, isLocal: true, isDefinition: true)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !278, line: 10, baseType: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !272, line: 160, baseType: !32)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8352, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 1044)
!283 = !{i32 7, !"Dwarf Version", i32 5}
!284 = !{i32 2, !"Debug Info Version", i32 3}
!285 = !{i32 1, !"wchar_size", i32 4}
!286 = !{i32 8, !"PIC Level", i32 2}
!287 = !{i32 7, !"PIE Level", i32 2}
!288 = !{i32 7, !"uwtable", i32 2}
!289 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!290 = distinct !DISubprogram(name: "consumeNewline", scope: !2, file: !2, line: 63, type: !291, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !294)
!291 = !DISubroutineType(types: !292)
!292 = !{!293, !31}
!293 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!294 = !{!295, !296}
!295 = !DILocalVariable(name: "buf", arg: 1, scope: !290, file: !2, line: 63, type: !31)
!296 = !DILocalVariable(name: "__buf", scope: !297, file: !2, line: 65, type: !300)
!297 = distinct !DILexicalBlock(scope: !298, file: !2, line: 65, column: 9)
!298 = distinct !DILexicalBlock(scope: !299, file: !2, line: 64, column: 37)
!299 = distinct !DILexicalBlock(scope: !290, file: !2, line: 64, column: 9)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 1024)
!303 = !{!304, !304, i64 0}
!304 = !{!"any pointer", !305, i64 0}
!305 = !{!"omnipotent char", !306, i64 0}
!306 = !{!"Simple C/C++ TBAA"}
!307 = !DILocation(line: 63, column: 26, scope: !290)
!308 = !DILocation(line: 64, column: 17, scope: !299)
!309 = !DILocation(line: 64, column: 9, scope: !299)
!310 = !DILocation(line: 64, column: 31, scope: !299)
!311 = !DILocation(line: 64, column: 9, scope: !290)
!312 = !DILocation(line: 65, column: 9, scope: !297)
!313 = !{!305, !305, i64 0}
!314 = !{!315, !315, i64 0}
!315 = !{!"long", !305, i64 0}
!316 = !DILocation(line: 65, column: 9, scope: !298)
!317 = !DILocation(line: 66, column: 9, scope: !298)
!318 = !DILocation(line: 68, column: 10, scope: !290)
!319 = !{!320, !320, i64 0}
!320 = !{!"long long", !305, i64 0}
!321 = !DILocation(line: 69, column: 5, scope: !290)
!322 = !DILocation(line: 70, column: 1, scope: !290)
!323 = !DISubprogram(name: "strncmp", scope: !324, file: !324, line: 159, type: !325, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!324 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!325 = !DISubroutineType(types: !326)
!326 = !{!293, !327, !327, !329}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !330, line: 70, baseType: !331)
!330 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!331 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!332 = !DISubprogram(name: "snprintf", scope: !333, file: !333, line: 378, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!333 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!334 = !DISubroutineType(types: !335)
!335 = !{!293, !336, !329, !337, null}
!336 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !31)
!337 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !327)
!338 = distinct !DISubprogram(name: "readLong", scope: !2, file: !2, line: 72, type: !339, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !395)
!339 = !DISubroutineType(types: !340)
!340 = !{!293, !341, !4, !394}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !343, line: 7, baseType: !344)
!343 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !345, line: 49, size: 1728, elements: !346)
!345 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !362, !364, !365, !366, !368, !370, !372, !376, !379, !380, !383, !386, !387, !388, !389, !390}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !344, file: !345, line: 51, baseType: !293, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !344, file: !345, line: 54, baseType: !31, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !344, file: !345, line: 55, baseType: !31, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !344, file: !345, line: 56, baseType: !31, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !344, file: !345, line: 57, baseType: !31, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !344, file: !345, line: 58, baseType: !31, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !344, file: !345, line: 59, baseType: !31, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !344, file: !345, line: 60, baseType: !31, size: 64, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !344, file: !345, line: 61, baseType: !31, size: 64, offset: 512)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !344, file: !345, line: 64, baseType: !31, size: 64, offset: 576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !344, file: !345, line: 65, baseType: !31, size: 64, offset: 640)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !344, file: !345, line: 66, baseType: !31, size: 64, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !344, file: !345, line: 68, baseType: !360, size: 64, offset: 768)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !345, line: 36, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !344, file: !345, line: 70, baseType: !363, size: 64, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !344, file: !345, line: 72, baseType: !293, size: 32, offset: 896)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !344, file: !345, line: 73, baseType: !293, size: 32, offset: 928)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !344, file: !345, line: 74, baseType: !367, size: 64, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !272, line: 152, baseType: !32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !344, file: !345, line: 77, baseType: !369, size: 16, offset: 1024)
!369 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !344, file: !345, line: 78, baseType: !371, size: 8, offset: 1040)
!371 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !344, file: !345, line: 79, baseType: !373, size: 8, offset: 1048)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 1)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !344, file: !345, line: 81, baseType: !377, size: 64, offset: 1088)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !345, line: 43, baseType: null)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !344, file: !345, line: 89, baseType: !271, size: 64, offset: 1152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !344, file: !345, line: 91, baseType: !381, size: 64, offset: 1216)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !345, line: 37, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !344, file: !345, line: 92, baseType: !384, size: 64, offset: 1280)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !345, line: 38, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !344, file: !345, line: 93, baseType: !363, size: 64, offset: 1344)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !344, file: !345, line: 94, baseType: !30, size: 64, offset: 1408)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !344, file: !345, line: 95, baseType: !329, size: 64, offset: 1472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !344, file: !345, line: 96, baseType: !293, size: 32, offset: 1536)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !344, file: !345, line: 98, baseType: !391, size: 160, offset: 1568)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 20)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!395 = !{!396, !397, !398, !399, !403, !404}
!396 = !DILocalVariable(name: "fp", arg: 1, scope: !338, file: !2, line: 72, type: !341)
!397 = !DILocalVariable(name: "prefix", arg: 2, scope: !338, file: !2, line: 72, type: !4)
!398 = !DILocalVariable(name: "target", arg: 3, scope: !338, file: !2, line: 72, type: !394)
!399 = !DILocalVariable(name: "buf", scope: !338, file: !2, line: 73, type: !400)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 128)
!403 = !DILocalVariable(name: "eptr", scope: !338, file: !2, line: 73, type: !31)
!404 = !DILocalVariable(name: "__buf", scope: !405, file: !2, line: 79, type: !300)
!405 = distinct !DILexicalBlock(scope: !406, file: !2, line: 79, column: 9)
!406 = distinct !DILexicalBlock(scope: !407, file: !2, line: 78, column: 27)
!407 = distinct !DILexicalBlock(scope: !338, file: !2, line: 78, column: 9)
!408 = !DILocation(line: 72, column: 20, scope: !338)
!409 = !DILocation(line: 72, column: 29, scope: !338)
!410 = !DILocation(line: 72, column: 43, scope: !338)
!411 = !DILocation(line: 73, column: 5, scope: !338)
!412 = !DILocation(line: 73, column: 10, scope: !338)
!413 = !DILocation(line: 73, column: 21, scope: !338)
!414 = !DILocation(line: 74, column: 19, scope: !338)
!415 = !DILocation(line: 74, column: 12, scope: !338)
!416 = !DILocation(line: 74, column: 10, scope: !338)
!417 = !DILocation(line: 75, column: 15, scope: !418)
!418 = distinct !DILexicalBlock(scope: !338, file: !2, line: 75, column: 9)
!419 = !DILocation(line: 75, column: 31, scope: !418)
!420 = !DILocation(line: 75, column: 9, scope: !418)
!421 = !DILocation(line: 75, column: 35, scope: !418)
!422 = !DILocation(line: 75, column: 9, scope: !338)
!423 = !DILocation(line: 76, column: 9, scope: !424)
!424 = distinct !DILexicalBlock(scope: !418, file: !2, line: 75, column: 44)
!425 = !DILocation(line: 78, column: 9, scope: !407)
!426 = !DILocation(line: 78, column: 19, scope: !407)
!427 = !DILocation(line: 78, column: 16, scope: !407)
!428 = !DILocation(line: 78, column: 9, scope: !338)
!429 = !DILocation(line: 79, column: 9, scope: !405)
!430 = !DILocation(line: 79, column: 9, scope: !406)
!431 = !DILocation(line: 80, column: 9, scope: !406)
!432 = !DILocation(line: 82, column: 22, scope: !338)
!433 = !DILocation(line: 82, column: 25, scope: !338)
!434 = !DILocation(line: 82, column: 15, scope: !338)
!435 = !DILocation(line: 82, column: 6, scope: !338)
!436 = !DILocation(line: 82, column: 13, scope: !338)
!437 = !DILocation(line: 83, column: 27, scope: !338)
!438 = !DILocation(line: 83, column: 12, scope: !338)
!439 = !DILocation(line: 83, column: 5, scope: !338)
!440 = !DILocation(line: 84, column: 1, scope: !338)
!441 = !DISubprogram(name: "ftello", linkageName: "ftello64", scope: !333, file: !333, line: 747, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!271, !341}
!444 = !DISubprogram(name: "fgets", scope: !333, file: !333, line: 592, type: !445, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!445 = !DISubroutineType(types: !446)
!446 = !{!31, !336, !293, !447}
!447 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !341)
!448 = !DISubprogram(name: "strtol", scope: !449, file: !449, line: 177, type: !450, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!449 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!450 = !DISubroutineType(types: !451)
!451 = !{!32, !337, !452, !293}
!452 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!454 = distinct !DISubprogram(name: "readBytes", scope: !2, file: !2, line: 86, type: !455, scopeLine: 86, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !457)
!455 = !DISubroutineType(types: !456)
!456 = !{!293, !341, !31, !32}
!457 = !{!458, !459, !460, !461, !462}
!458 = !DILocalVariable(name: "fp", arg: 1, scope: !454, file: !2, line: 86, type: !341)
!459 = !DILocalVariable(name: "target", arg: 2, scope: !454, file: !2, line: 86, type: !31)
!460 = !DILocalVariable(name: "length", arg: 3, scope: !454, file: !2, line: 86, type: !32)
!461 = !DILocalVariable(name: "real", scope: !454, file: !2, line: 87, type: !32)
!462 = !DILocalVariable(name: "__buf", scope: !463, file: !2, line: 91, type: !300)
!463 = distinct !DILexicalBlock(scope: !464, file: !2, line: 91, column: 9)
!464 = distinct !DILexicalBlock(scope: !465, file: !2, line: 90, column: 25)
!465 = distinct !DILexicalBlock(scope: !454, file: !2, line: 90, column: 9)
!466 = !DILocation(line: 86, column: 21, scope: !454)
!467 = !DILocation(line: 86, column: 31, scope: !454)
!468 = !DILocation(line: 86, column: 44, scope: !454)
!469 = !DILocation(line: 87, column: 5, scope: !454)
!470 = !DILocation(line: 87, column: 10, scope: !454)
!471 = !DILocation(line: 88, column: 19, scope: !454)
!472 = !DILocation(line: 88, column: 12, scope: !454)
!473 = !DILocation(line: 88, column: 10, scope: !454)
!474 = !DILocation(line: 89, column: 18, scope: !454)
!475 = !DILocation(line: 89, column: 27, scope: !454)
!476 = !DILocation(line: 89, column: 34, scope: !454)
!477 = !DILocation(line: 89, column: 12, scope: !454)
!478 = !DILocation(line: 89, column: 10, scope: !454)
!479 = !DILocation(line: 90, column: 9, scope: !465)
!480 = !DILocation(line: 90, column: 17, scope: !465)
!481 = !DILocation(line: 90, column: 14, scope: !465)
!482 = !DILocation(line: 90, column: 9, scope: !454)
!483 = !DILocation(line: 91, column: 9, scope: !463)
!484 = !DILocation(line: 91, column: 9, scope: !464)
!485 = !DILocation(line: 92, column: 9, scope: !464)
!486 = !DILocation(line: 94, column: 5, scope: !454)
!487 = !DILocation(line: 95, column: 1, scope: !454)
!488 = !DISubprogram(name: "fread", scope: !333, file: !333, line: 675, type: !489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!489 = !DISubroutineType(types: !490)
!490 = !{!331, !491, !329, !329, !447}
!491 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !30)
!492 = distinct !DISubprogram(name: "readString", scope: !2, file: !2, line: 97, type: !493, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !495)
!493 = !DISubroutineType(types: !494)
!494 = !{!293, !341, !453}
!495 = !{!496, !497, !498, !499}
!496 = !DILocalVariable(name: "fp", arg: 1, scope: !492, file: !2, line: 97, type: !341)
!497 = !DILocalVariable(name: "target", arg: 2, scope: !492, file: !2, line: 97, type: !453)
!498 = !DILocalVariable(name: "len", scope: !492, file: !2, line: 98, type: !32)
!499 = !DILocalVariable(name: "__buf", scope: !500, file: !2, line: 105, type: !300)
!500 = distinct !DILexicalBlock(scope: !501, file: !2, line: 105, column: 9)
!501 = distinct !DILexicalBlock(scope: !502, file: !2, line: 104, column: 40)
!502 = distinct !DILexicalBlock(scope: !492, file: !2, line: 104, column: 9)
!503 = !DILocation(line: 97, column: 22, scope: !492)
!504 = !DILocation(line: 97, column: 33, scope: !492)
!505 = !DILocation(line: 98, column: 5, scope: !492)
!506 = !DILocation(line: 98, column: 10, scope: !492)
!507 = !DILocation(line: 99, column: 6, scope: !492)
!508 = !DILocation(line: 99, column: 13, scope: !492)
!509 = !DILocation(line: 100, column: 19, scope: !510)
!510 = distinct !DILexicalBlock(scope: !492, file: !2, line: 100, column: 9)
!511 = !DILocation(line: 100, column: 10, scope: !510)
!512 = !DILocation(line: 100, column: 9, scope: !492)
!513 = !DILocation(line: 101, column: 9, scope: !514)
!514 = distinct !DILexicalBlock(scope: !510, file: !2, line: 100, column: 33)
!515 = !DILocation(line: 104, column: 9, scope: !502)
!516 = !DILocation(line: 104, column: 13, scope: !502)
!517 = !DILocation(line: 104, column: 17, scope: !502)
!518 = !DILocation(line: 104, column: 20, scope: !502)
!519 = !DILocation(line: 104, column: 24, scope: !502)
!520 = !DILocation(line: 104, column: 9, scope: !492)
!521 = !DILocation(line: 105, column: 9, scope: !500)
!522 = !DILocation(line: 105, column: 9, scope: !501)
!523 = !DILocation(line: 106, column: 9, scope: !501)
!524 = !DILocation(line: 110, column: 9, scope: !492)
!525 = !DILocation(line: 111, column: 30, scope: !492)
!526 = !DILocation(line: 111, column: 22, scope: !492)
!527 = !DILocation(line: 111, column: 6, scope: !492)
!528 = !DILocation(line: 111, column: 13, scope: !492)
!529 = !DILocation(line: 112, column: 20, scope: !530)
!530 = distinct !DILexicalBlock(scope: !492, file: !2, line: 112, column: 9)
!531 = !DILocation(line: 112, column: 24, scope: !530)
!532 = !DILocation(line: 112, column: 23, scope: !530)
!533 = !DILocation(line: 112, column: 31, scope: !530)
!534 = !DILocation(line: 112, column: 10, scope: !530)
!535 = !DILocation(line: 112, column: 9, scope: !492)
!536 = !DILocation(line: 113, column: 16, scope: !537)
!537 = distinct !DILexicalBlock(scope: !530, file: !2, line: 112, column: 37)
!538 = !DILocation(line: 113, column: 15, scope: !537)
!539 = !DILocation(line: 113, column: 9, scope: !537)
!540 = !DILocation(line: 114, column: 10, scope: !537)
!541 = !DILocation(line: 114, column: 17, scope: !537)
!542 = !DILocation(line: 115, column: 9, scope: !537)
!543 = !DILocation(line: 117, column: 26, scope: !544)
!544 = distinct !DILexicalBlock(scope: !492, file: !2, line: 117, column: 9)
!545 = !DILocation(line: 117, column: 25, scope: !544)
!546 = !DILocation(line: 117, column: 33, scope: !544)
!547 = !DILocation(line: 117, column: 32, scope: !544)
!548 = !DILocation(line: 117, column: 36, scope: !544)
!549 = !DILocation(line: 117, column: 10, scope: !544)
!550 = !DILocation(line: 117, column: 9, scope: !492)
!551 = !DILocation(line: 118, column: 16, scope: !552)
!552 = distinct !DILexicalBlock(scope: !544, file: !2, line: 117, column: 41)
!553 = !DILocation(line: 118, column: 15, scope: !552)
!554 = !DILocation(line: 118, column: 9, scope: !552)
!555 = !DILocation(line: 119, column: 10, scope: !552)
!556 = !DILocation(line: 119, column: 17, scope: !552)
!557 = !DILocation(line: 120, column: 9, scope: !552)
!558 = !DILocation(line: 122, column: 7, scope: !492)
!559 = !DILocation(line: 122, column: 6, scope: !492)
!560 = !DILocation(line: 122, column: 15, scope: !492)
!561 = !DILocation(line: 122, column: 18, scope: !492)
!562 = !DILocation(line: 122, column: 5, scope: !492)
!563 = !DILocation(line: 122, column: 22, scope: !492)
!564 = !DILocation(line: 123, column: 5, scope: !492)
!565 = !DILocation(line: 124, column: 1, scope: !492)
!566 = !DISubprogram(name: "zmalloc", scope: !567, file: !567, line: 99, type: !568, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!567 = !DIFile(filename: "./zmalloc.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/src", checksumkind: CSK_MD5, checksum: "e165f08718e6f3b3aaa809126581c85d")
!568 = !DISubroutineType(types: !569)
!569 = !{!30, !329}
!570 = !DISubprogram(name: "zfree", scope: !567, file: !567, line: 106, type: !571, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !30}
!573 = distinct !DISubprogram(name: "readArgc", scope: !2, file: !2, line: 126, type: !574, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !576)
!574 = !DISubroutineType(types: !575)
!575 = !{!293, !341, !394}
!576 = !{!577, !578}
!577 = !DILocalVariable(name: "fp", arg: 1, scope: !573, file: !2, line: 126, type: !341)
!578 = !DILocalVariable(name: "target", arg: 2, scope: !573, file: !2, line: 126, type: !394)
!579 = !DILocation(line: 126, column: 20, scope: !573)
!580 = !DILocation(line: 126, column: 30, scope: !573)
!581 = !DILocation(line: 127, column: 21, scope: !573)
!582 = !DILocation(line: 127, column: 28, scope: !573)
!583 = !DILocation(line: 127, column: 12, scope: !573)
!584 = !DILocation(line: 127, column: 5, scope: !573)
!585 = distinct !DISubprogram(name: "processRESP", scope: !2, file: !2, line: 137, type: !586, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !589)
!586 = !DISubroutineType(types: !587)
!587 = !{!293, !341, !31, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!589 = !{!590, !591, !592, !593, !594, !595, !597, !607}
!590 = !DILocalVariable(name: "fp", arg: 1, scope: !585, file: !2, line: 137, type: !341)
!591 = !DILocalVariable(name: "filename", arg: 2, scope: !585, file: !2, line: 137, type: !31)
!592 = !DILocalVariable(name: "out_multi", arg: 3, scope: !585, file: !2, line: 137, type: !588)
!593 = !DILocalVariable(name: "argc", scope: !585, file: !2, line: 138, type: !32)
!594 = !DILocalVariable(name: "str", scope: !585, file: !2, line: 139, type: !31)
!595 = !DILocalVariable(name: "i", scope: !596, file: !2, line: 143, type: !293)
!596 = distinct !DILexicalBlock(scope: !585, file: !2, line: 143, column: 5)
!597 = !DILocalVariable(name: "__buf", scope: !598, file: !2, line: 148, type: !300)
!598 = distinct !DILexicalBlock(scope: !599, file: !2, line: 148, column: 21)
!599 = distinct !DILexicalBlock(scope: !600, file: !2, line: 147, column: 37)
!600 = distinct !DILexicalBlock(scope: !601, file: !2, line: 147, column: 21)
!601 = distinct !DILexicalBlock(scope: !602, file: !2, line: 146, column: 48)
!602 = distinct !DILexicalBlock(scope: !603, file: !2, line: 146, column: 17)
!603 = distinct !DILexicalBlock(scope: !604, file: !2, line: 145, column: 21)
!604 = distinct !DILexicalBlock(scope: !605, file: !2, line: 145, column: 13)
!605 = distinct !DILexicalBlock(scope: !606, file: !2, line: 143, column: 36)
!606 = distinct !DILexicalBlock(scope: !596, file: !2, line: 143, column: 5)
!607 = !DILocalVariable(name: "__buf", scope: !608, file: !2, line: 154, type: !300)
!608 = distinct !DILexicalBlock(scope: !609, file: !2, line: 154, column: 21)
!609 = distinct !DILexicalBlock(scope: !610, file: !2, line: 153, column: 37)
!610 = distinct !DILexicalBlock(scope: !611, file: !2, line: 153, column: 21)
!611 = distinct !DILexicalBlock(scope: !612, file: !2, line: 152, column: 54)
!612 = distinct !DILexicalBlock(scope: !602, file: !2, line: 152, column: 24)
!613 = !DILocation(line: 137, column: 23, scope: !585)
!614 = !DILocation(line: 137, column: 33, scope: !585)
!615 = !DILocation(line: 137, column: 48, scope: !585)
!616 = !DILocation(line: 138, column: 5, scope: !585)
!617 = !DILocation(line: 138, column: 10, scope: !585)
!618 = !DILocation(line: 139, column: 5, scope: !585)
!619 = !DILocation(line: 139, column: 11, scope: !585)
!620 = !DILocation(line: 141, column: 19, scope: !621)
!621 = distinct !DILexicalBlock(scope: !585, file: !2, line: 141, column: 9)
!622 = !DILocation(line: 141, column: 10, scope: !621)
!623 = !DILocation(line: 141, column: 9, scope: !585)
!624 = !DILocation(line: 141, column: 31, scope: !621)
!625 = !DILocation(line: 143, column: 10, scope: !596)
!626 = !DILocation(line: 143, column: 14, scope: !596)
!627 = !{!628, !628, i64 0}
!628 = !{!"int", !305, i64 0}
!629 = !DILocation(line: 143, column: 21, scope: !606)
!630 = !DILocation(line: 143, column: 25, scope: !606)
!631 = !DILocation(line: 143, column: 23, scope: !606)
!632 = !DILocation(line: 143, column: 5, scope: !596)
!633 = !DILocation(line: 144, column: 25, scope: !634)
!634 = distinct !DILexicalBlock(scope: !605, file: !2, line: 144, column: 13)
!635 = !DILocation(line: 144, column: 14, scope: !634)
!636 = !DILocation(line: 144, column: 13, scope: !605)
!637 = !DILocation(line: 144, column: 36, scope: !634)
!638 = !DILocation(line: 145, column: 13, scope: !604)
!639 = !DILocation(line: 145, column: 15, scope: !604)
!640 = !DILocation(line: 145, column: 13, scope: !605)
!641 = !DILocation(line: 146, column: 28, scope: !602)
!642 = !DILocation(line: 146, column: 17, scope: !602)
!643 = !DILocation(line: 146, column: 42, scope: !602)
!644 = !DILocation(line: 146, column: 17, scope: !603)
!645 = !DILocation(line: 147, column: 23, scope: !600)
!646 = !DILocation(line: 147, column: 33, scope: !600)
!647 = !DILocation(line: 147, column: 21, scope: !601)
!648 = !DILocation(line: 148, column: 21, scope: !598)
!649 = !DILocation(line: 148, column: 21, scope: !599)
!650 = !DILocation(line: 149, column: 27, scope: !599)
!651 = !DILocation(line: 149, column: 21, scope: !599)
!652 = !DILocation(line: 150, column: 21, scope: !599)
!653 = !DILocation(line: 152, column: 13, scope: !601)
!654 = !DILocation(line: 152, column: 35, scope: !612)
!655 = !DILocation(line: 152, column: 24, scope: !612)
!656 = !DILocation(line: 152, column: 48, scope: !612)
!657 = !DILocation(line: 152, column: 24, scope: !602)
!658 = !DILocation(line: 153, column: 25, scope: !610)
!659 = !DILocation(line: 153, column: 21, scope: !610)
!660 = !DILocation(line: 153, column: 21, scope: !611)
!661 = !DILocation(line: 154, column: 21, scope: !608)
!662 = !DILocation(line: 154, column: 21, scope: !609)
!663 = !DILocation(line: 155, column: 27, scope: !609)
!664 = !DILocation(line: 155, column: 21, scope: !609)
!665 = !DILocation(line: 156, column: 21, scope: !609)
!666 = !DILocation(line: 158, column: 13, scope: !611)
!667 = !DILocation(line: 159, column: 9, scope: !603)
!668 = !DILocation(line: 160, column: 15, scope: !605)
!669 = !DILocation(line: 160, column: 9, scope: !605)
!670 = !DILocation(line: 161, column: 5, scope: !605)
!671 = !DILocation(line: 143, column: 32, scope: !606)
!672 = !DILocation(line: 143, column: 5, scope: !606)
!673 = distinct !{!673, !632, !674, !675}
!674 = !DILocation(line: 161, column: 5, scope: !596)
!675 = !{!"llvm.loop.mustprogress"}
!676 = !DILocation(line: 163, column: 5, scope: !585)
!677 = !DILocation(line: 164, column: 1, scope: !585)
!678 = !DISubprogram(name: "strcasecmp", scope: !679, file: !679, line: 116, type: !680, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!679 = !DIFile(filename: "/usr/include/strings.h", directory: "", checksumkind: CSK_MD5, checksum: "7444da68ad94ab9f25ff447750787173")
!680 = !DISubroutineType(types: !681)
!681 = !{!293, !327, !327}
!682 = distinct !DISubprogram(name: "processAnnotations", scope: !2, file: !2, line: 175, type: !683, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !685)
!683 = !DISubroutineType(types: !684)
!684 = !{!293, !341, !31, !293}
!685 = !{!686, !687, !688, !689, !690, !693}
!686 = !DILocalVariable(name: "fp", arg: 1, scope: !682, file: !2, line: 175, type: !341)
!687 = !DILocalVariable(name: "filename", arg: 2, scope: !682, file: !2, line: 175, type: !31)
!688 = !DILocalVariable(name: "last_file", arg: 3, scope: !682, file: !2, line: 175, type: !293)
!689 = !DILocalVariable(name: "buf", scope: !682, file: !2, line: 176, type: !300)
!690 = !DILocalVariable(name: "endptr", scope: !691, file: !2, line: 185, type: !31)
!691 = distinct !DILexicalBlock(scope: !692, file: !2, line: 184, column: 55)
!692 = distinct !DILexicalBlock(scope: !682, file: !2, line: 184, column: 9)
!693 = !DILocalVariable(name: "ts", scope: !691, file: !2, line: 187, type: !277)
!694 = !DILocation(line: 175, column: 30, scope: !682)
!695 = !DILocation(line: 175, column: 40, scope: !682)
!696 = !DILocation(line: 175, column: 54, scope: !682)
!697 = !DILocation(line: 176, column: 5, scope: !682)
!698 = !DILocation(line: 176, column: 10, scope: !682)
!699 = !DILocation(line: 178, column: 19, scope: !682)
!700 = !DILocation(line: 178, column: 12, scope: !682)
!701 = !DILocation(line: 178, column: 10, scope: !682)
!702 = !DILocation(line: 179, column: 15, scope: !703)
!703 = distinct !DILexicalBlock(scope: !682, file: !2, line: 179, column: 9)
!704 = !DILocation(line: 179, column: 33, scope: !703)
!705 = !DILocation(line: 179, column: 9, scope: !703)
!706 = !DILocation(line: 179, column: 37, scope: !703)
!707 = !DILocation(line: 179, column: 9, scope: !682)
!708 = !DILocation(line: 180, column: 73, scope: !709)
!709 = distinct !DILexicalBlock(scope: !703, file: !2, line: 179, column: 46)
!710 = !DILocation(line: 180, column: 9, scope: !709)
!711 = !DILocation(line: 181, column: 9, scope: !709)
!712 = !DILocation(line: 184, column: 9, scope: !692)
!713 = !DILocation(line: 184, column: 22, scope: !692)
!714 = !DILocation(line: 184, column: 33, scope: !692)
!715 = !DILocation(line: 184, column: 25, scope: !692)
!716 = !DILocation(line: 184, column: 49, scope: !692)
!717 = !DILocation(line: 184, column: 9, scope: !682)
!718 = !DILocation(line: 185, column: 9, scope: !691)
!719 = !DILocation(line: 185, column: 15, scope: !691)
!720 = !DILocation(line: 186, column: 9, scope: !691)
!721 = !DILocation(line: 186, column: 15, scope: !691)
!722 = !DILocation(line: 187, column: 9, scope: !691)
!723 = !DILocation(line: 187, column: 16, scope: !691)
!724 = !DILocation(line: 187, column: 28, scope: !691)
!725 = !DILocation(line: 187, column: 31, scope: !691)
!726 = !DILocation(line: 187, column: 21, scope: !691)
!727 = !DILocation(line: 188, column: 13, scope: !728)
!728 = distinct !DILexicalBlock(scope: !691, file: !2, line: 188, column: 13)
!729 = !DILocation(line: 188, column: 19, scope: !728)
!730 = !DILocation(line: 188, column: 24, scope: !728)
!731 = !DILocation(line: 188, column: 28, scope: !728)
!732 = !DILocation(line: 188, column: 27, scope: !728)
!733 = !DILocation(line: 188, column: 35, scope: !728)
!734 = !DILocation(line: 188, column: 13, scope: !691)
!735 = !DILocation(line: 189, column: 13, scope: !736)
!736 = distinct !DILexicalBlock(scope: !728, file: !2, line: 188, column: 44)
!737 = !DILocation(line: 190, column: 13, scope: !736)
!738 = !DILocation(line: 192, column: 13, scope: !739)
!739 = distinct !DILexicalBlock(scope: !691, file: !2, line: 192, column: 13)
!740 = !DILocation(line: 192, column: 19, scope: !739)
!741 = !DILocation(line: 192, column: 16, scope: !739)
!742 = !DILocation(line: 192, column: 13, scope: !691)
!743 = !DILocation(line: 192, column: 33, scope: !739)
!744 = !DILocation(line: 193, column: 13, scope: !745)
!745 = distinct !DILexicalBlock(scope: !691, file: !2, line: 193, column: 13)
!746 = !DILocation(line: 193, column: 18, scope: !745)
!747 = !DILocation(line: 193, column: 13, scope: !691)
!748 = !DILocation(line: 195, column: 38, scope: !749)
!749 = distinct !DILexicalBlock(scope: !745, file: !2, line: 193, column: 24)
!750 = !DILocation(line: 195, column: 48, scope: !749)
!751 = !DILocation(line: 194, column: 13, scope: !749)
!752 = !DILocation(line: 196, column: 13, scope: !749)
!753 = !DILocation(line: 198, column: 14, scope: !754)
!754 = distinct !DILexicalBlock(scope: !691, file: !2, line: 198, column: 13)
!755 = !DILocation(line: 198, column: 13, scope: !691)
!756 = !DILocation(line: 200, column: 17, scope: !757)
!757 = distinct !DILexicalBlock(scope: !754, file: !2, line: 198, column: 25)
!758 = !DILocation(line: 200, column: 27, scope: !757)
!759 = !DILocation(line: 200, column: 51, scope: !757)
!760 = !DILocation(line: 199, column: 13, scope: !757)
!761 = !DILocation(line: 201, column: 13, scope: !757)
!762 = !DILocation(line: 203, column: 13, scope: !757)
!763 = !DILocation(line: 206, column: 30, scope: !764)
!764 = distinct !DILexicalBlock(scope: !691, file: !2, line: 206, column: 13)
!765 = !DILocation(line: 206, column: 23, scope: !764)
!766 = !DILocation(line: 206, column: 35, scope: !764)
!767 = !DILocation(line: 206, column: 13, scope: !764)
!768 = !DILocation(line: 206, column: 41, scope: !764)
!769 = !DILocation(line: 206, column: 13, scope: !691)
!770 = !DILocation(line: 208, column: 21, scope: !771)
!771 = distinct !DILexicalBlock(scope: !764, file: !2, line: 206, column: 48)
!772 = !DILocation(line: 208, column: 31, scope: !771)
!773 = !DILocation(line: 207, column: 13, scope: !771)
!774 = !DILocation(line: 209, column: 13, scope: !771)
!775 = !DILocation(line: 211, column: 13, scope: !776)
!776 = distinct !DILexicalBlock(scope: !764, file: !2, line: 210, column: 16)
!777 = !DILocation(line: 213, column: 5, scope: !692)
!778 = !DILocation(line: 214, column: 5, scope: !682)
!779 = !DILocation(line: 215, column: 1, scope: !682)
!780 = !DISubprogram(name: "printf", scope: !333, file: !333, line: 356, type: !781, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!781 = !DISubroutineType(types: !782)
!782 = !{!293, !337, null}
!783 = !DISubprogram(name: "exit", scope: !449, file: !449, line: 624, type: !784, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !293}
!786 = !DISubprogram(name: "__errno_location", scope: !787, file: !787, line: 37, type: !788, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!787 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!788 = !DISubroutineType(types: !789)
!789 = !{!588}
!790 = !DISubprogram(name: "ftruncate", linkageName: "ftruncate64", scope: !791, file: !791, line: 1052, type: !792, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!791 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!792 = !DISubroutineType(types: !793)
!793 = !{!293, !293, !271}
!794 = !DISubprogram(name: "fileno", scope: !333, file: !333, line: 809, type: !795, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!795 = !DISubroutineType(types: !796)
!796 = !{!293, !341}
!797 = distinct !DISubprogram(name: "checkSingleAof", scope: !2, file: !2, line: 222, type: !798, scopeLine: 222, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{!293, !31, !31, !293, !293, !293}
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !845, !846, !850, !854}
!801 = !DILocalVariable(name: "aof_filename", arg: 1, scope: !797, file: !2, line: 222, type: !31)
!802 = !DILocalVariable(name: "aof_filepath", arg: 2, scope: !797, file: !2, line: 222, type: !31)
!803 = !DILocalVariable(name: "last_file", arg: 3, scope: !797, file: !2, line: 222, type: !293)
!804 = !DILocalVariable(name: "fix", arg: 4, scope: !797, file: !2, line: 222, type: !293)
!805 = !DILocalVariable(name: "preamble", arg: 5, scope: !797, file: !2, line: 222, type: !293)
!806 = !DILocalVariable(name: "pos", scope: !797, file: !2, line: 223, type: !269)
!807 = !DILocalVariable(name: "diff", scope: !797, file: !2, line: 223, type: !269)
!808 = !DILocalVariable(name: "multi", scope: !797, file: !2, line: 224, type: !293)
!809 = !DILocalVariable(name: "buf", scope: !797, file: !2, line: 225, type: !181)
!810 = !DILocalVariable(name: "fp", scope: !797, file: !2, line: 227, type: !341)
!811 = !DILocalVariable(name: "sb", scope: !797, file: !2, line: 233, type: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !813, line: 26, size: 1152, elements: !814)
!813 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!814 = !{!815, !817, !819, !821, !823, !825, !827, !828, !829, !830, !832, !834, !841, !842, !843}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !812, file: !813, line: 31, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !272, line: 145, baseType: !331)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !812, file: !813, line: 36, baseType: !818, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !272, line: 148, baseType: !331)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !812, file: !813, line: 44, baseType: !820, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !272, line: 151, baseType: !331)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !812, file: !813, line: 45, baseType: !822, size: 32, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !272, line: 150, baseType: !17)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !812, file: !813, line: 47, baseType: !824, size: 32, offset: 224)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !272, line: 146, baseType: !17)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !812, file: !813, line: 48, baseType: !826, size: 32, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !272, line: 147, baseType: !17)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !812, file: !813, line: 50, baseType: !293, size: 32, offset: 288)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !812, file: !813, line: 52, baseType: !816, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !812, file: !813, line: 57, baseType: !367, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !812, file: !813, line: 61, baseType: !831, size: 64, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !272, line: 175, baseType: !32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !812, file: !813, line: 63, baseType: !833, size: 64, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !272, line: 180, baseType: !32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !812, file: !813, line: 74, baseType: !835, size: 128, offset: 576)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !836, line: 11, size: 128, elements: !837)
!836 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !835, file: !836, line: 16, baseType: !279, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !835, file: !836, line: 21, baseType: !840, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !272, line: 197, baseType: !32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !812, file: !813, line: 75, baseType: !835, size: 128, offset: 704)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !812, file: !813, line: 76, baseType: !835, size: 128, offset: 832)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !812, file: !813, line: 89, baseType: !844, size: 192, offset: 960)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 192, elements: !5)
!845 = !DILocalVariable(name: "size", scope: !797, file: !2, line: 239, type: !269)
!846 = !DILocalVariable(name: "argv", scope: !847, file: !2, line: 245, type: !849)
!847 = distinct !DILexicalBlock(scope: !848, file: !2, line: 244, column: 19)
!848 = distinct !DILexicalBlock(scope: !797, file: !2, line: 244, column: 9)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !182)
!850 = !DILocalVariable(name: "__buf", scope: !851, file: !2, line: 283, type: !300)
!851 = distinct !DILexicalBlock(scope: !852, file: !2, line: 283, column: 9)
!852 = distinct !DILexicalBlock(scope: !853, file: !2, line: 282, column: 50)
!853 = distinct !DILexicalBlock(scope: !797, file: !2, line: 282, column: 9)
!854 = !DILocalVariable(name: "buf", scope: !855, file: !2, line: 308, type: !181)
!855 = distinct !DILexicalBlock(scope: !856, file: !2, line: 302, column: 18)
!856 = distinct !DILexicalBlock(scope: !857, file: !2, line: 302, column: 13)
!857 = distinct !DILexicalBlock(scope: !858, file: !2, line: 301, column: 19)
!858 = distinct !DILexicalBlock(scope: !797, file: !2, line: 301, column: 9)
!859 = !DILocation(line: 222, column: 26, scope: !797)
!860 = !DILocation(line: 222, column: 46, scope: !797)
!861 = !DILocation(line: 222, column: 64, scope: !797)
!862 = !DILocation(line: 222, column: 79, scope: !797)
!863 = !DILocation(line: 222, column: 88, scope: !797)
!864 = !DILocation(line: 223, column: 5, scope: !797)
!865 = !DILocation(line: 223, column: 11, scope: !797)
!866 = !DILocation(line: 223, column: 20, scope: !797)
!867 = !DILocation(line: 224, column: 5, scope: !797)
!868 = !DILocation(line: 224, column: 9, scope: !797)
!869 = !DILocation(line: 225, column: 5, scope: !797)
!870 = !DILocation(line: 225, column: 10, scope: !797)
!871 = !DILocation(line: 227, column: 5, scope: !797)
!872 = !DILocation(line: 227, column: 11, scope: !797)
!873 = !DILocation(line: 227, column: 22, scope: !797)
!874 = !DILocation(line: 227, column: 16, scope: !797)
!875 = !DILocation(line: 228, column: 9, scope: !876)
!876 = distinct !DILexicalBlock(scope: !797, file: !2, line: 228, column: 9)
!877 = !DILocation(line: 228, column: 12, scope: !876)
!878 = !DILocation(line: 228, column: 9, scope: !797)
!879 = !DILocation(line: 229, column: 58, scope: !880)
!880 = distinct !DILexicalBlock(scope: !876, file: !2, line: 228, column: 21)
!881 = !DILocation(line: 229, column: 81, scope: !880)
!882 = !DILocation(line: 229, column: 72, scope: !880)
!883 = !DILocation(line: 229, column: 9, scope: !880)
!884 = !DILocation(line: 230, column: 9, scope: !880)
!885 = !DILocation(line: 233, column: 5, scope: !797)
!886 = !DILocation(line: 233, column: 23, scope: !797)
!887 = !DILocation(line: 234, column: 28, scope: !888)
!888 = distinct !DILexicalBlock(scope: !797, file: !2, line: 234, column: 9)
!889 = !DILocation(line: 234, column: 21, scope: !888)
!890 = !DILocation(line: 234, column: 9, scope: !888)
!891 = !DILocation(line: 234, column: 37, scope: !888)
!892 = !DILocation(line: 234, column: 9, scope: !797)
!893 = !DILocation(line: 235, column: 55, scope: !894)
!894 = distinct !DILexicalBlock(scope: !888, file: !2, line: 234, column: 44)
!895 = !DILocation(line: 235, column: 9, scope: !894)
!896 = !DILocation(line: 236, column: 9, scope: !894)
!897 = !DILocation(line: 239, column: 5, scope: !797)
!898 = !DILocation(line: 239, column: 11, scope: !797)
!899 = !DILocation(line: 239, column: 21, scope: !797)
!900 = !{!901, !315, i64 48}
!901 = !{!"stat", !315, i64 0, !315, i64 8, !315, i64 16, !628, i64 24, !628, i64 28, !628, i64 32, !628, i64 36, !315, i64 40, !315, i64 48, !315, i64 56, !315, i64 64, !902, i64 72, !902, i64 88, !902, i64 104, !305, i64 120}
!902 = !{!"timespec", !315, i64 0, !315, i64 8}
!903 = !DILocation(line: 240, column: 9, scope: !904)
!904 = distinct !DILexicalBlock(scope: !797, file: !2, line: 240, column: 9)
!905 = !DILocation(line: 240, column: 14, scope: !904)
!906 = !DILocation(line: 240, column: 9, scope: !797)
!907 = !DILocation(line: 241, column: 9, scope: !908)
!908 = distinct !DILexicalBlock(scope: !904, file: !2, line: 240, column: 20)
!909 = !DILocation(line: 244, column: 9, scope: !848)
!910 = !DILocation(line: 244, column: 9, scope: !797)
!911 = !DILocation(line: 245, column: 9, scope: !847)
!912 = !DILocation(line: 245, column: 15, scope: !847)
!913 = !DILocation(line: 245, column: 25, scope: !847)
!914 = !DILocation(line: 245, column: 32, scope: !847)
!915 = !DILocation(line: 246, column: 37, scope: !916)
!916 = distinct !DILexicalBlock(scope: !847, file: !2, line: 246, column: 13)
!917 = !DILocation(line: 246, column: 43, scope: !916)
!918 = !DILocation(line: 246, column: 13, scope: !916)
!919 = !DILocation(line: 246, column: 47, scope: !916)
!920 = !DILocation(line: 246, column: 13, scope: !847)
!921 = !DILocation(line: 247, column: 13, scope: !922)
!922 = distinct !DILexicalBlock(scope: !916, file: !2, line: 246, column: 57)
!923 = !DILocation(line: 248, column: 13, scope: !922)
!924 = !DILocation(line: 250, column: 13, scope: !925)
!925 = distinct !DILexicalBlock(scope: !916, file: !2, line: 249, column: 16)
!926 = !DILocation(line: 252, column: 5, scope: !848)
!927 = !DILocation(line: 252, column: 5, scope: !847)
!928 = !DILocation(line: 254, column: 5, scope: !797)
!929 = !DILocation(line: 255, column: 14, scope: !930)
!930 = distinct !DILexicalBlock(scope: !931, file: !2, line: 255, column: 13)
!931 = distinct !DILexicalBlock(scope: !797, file: !2, line: 254, column: 14)
!932 = !DILocation(line: 255, column: 13, scope: !931)
!933 = !DILocation(line: 255, column: 34, scope: !930)
!934 = !DILocation(line: 255, column: 27, scope: !930)
!935 = !DILocation(line: 255, column: 25, scope: !930)
!936 = !DILocation(line: 255, column: 21, scope: !930)
!937 = !DILocation(line: 256, column: 19, scope: !938)
!938 = distinct !DILexicalBlock(scope: !931, file: !2, line: 256, column: 13)
!939 = !DILocation(line: 256, column: 37, scope: !938)
!940 = !DILocation(line: 256, column: 13, scope: !938)
!941 = !DILocation(line: 256, column: 41, scope: !938)
!942 = !DILocation(line: 256, column: 13, scope: !931)
!943 = !DILocation(line: 257, column: 22, scope: !944)
!944 = distinct !DILexicalBlock(scope: !945, file: !2, line: 257, column: 17)
!945 = distinct !DILexicalBlock(scope: !938, file: !2, line: 256, column: 50)
!946 = !DILocation(line: 257, column: 17, scope: !944)
!947 = !DILocation(line: 257, column: 17, scope: !945)
!948 = !DILocation(line: 258, column: 17, scope: !949)
!949 = distinct !DILexicalBlock(scope: !944, file: !2, line: 257, column: 27)
!950 = !DILocation(line: 260, column: 65, scope: !945)
!951 = !DILocation(line: 260, column: 13, scope: !945)
!952 = !DILocation(line: 261, column: 13, scope: !945)
!953 = !DILocation(line: 264, column: 19, scope: !954)
!954 = distinct !DILexicalBlock(scope: !931, file: !2, line: 264, column: 13)
!955 = !DILocation(line: 264, column: 13, scope: !954)
!956 = !DILocation(line: 264, column: 37, scope: !954)
!957 = !DILocation(line: 264, column: 13, scope: !931)
!958 = !DILocation(line: 265, column: 53, scope: !959)
!959 = distinct !DILexicalBlock(scope: !954, file: !2, line: 264, column: 44)
!960 = !DILocation(line: 265, column: 76, scope: !959)
!961 = !DILocation(line: 265, column: 67, scope: !959)
!962 = !DILocation(line: 265, column: 13, scope: !959)
!963 = !DILocation(line: 266, column: 13, scope: !959)
!964 = !DILocation(line: 269, column: 13, scope: !965)
!965 = distinct !DILexicalBlock(scope: !931, file: !2, line: 269, column: 13)
!966 = !DILocation(line: 269, column: 20, scope: !965)
!967 = !DILocation(line: 269, column: 13, scope: !931)
!968 = !DILocation(line: 270, column: 37, scope: !969)
!969 = distinct !DILexicalBlock(scope: !970, file: !2, line: 270, column: 17)
!970 = distinct !DILexicalBlock(scope: !965, file: !2, line: 269, column: 28)
!971 = !DILocation(line: 270, column: 41, scope: !969)
!972 = !DILocation(line: 270, column: 55, scope: !969)
!973 = !DILocation(line: 270, column: 18, scope: !969)
!974 = !DILocation(line: 270, column: 17, scope: !970)
!975 = !DILocation(line: 271, column: 24, scope: !976)
!976 = distinct !DILexicalBlock(scope: !969, file: !2, line: 270, column: 67)
!977 = !DILocation(line: 271, column: 17, scope: !976)
!978 = !DILocation(line: 272, column: 17, scope: !976)
!979 = !DILocation(line: 274, column: 9, scope: !970)
!980 = !DILocation(line: 274, column: 20, scope: !981)
!981 = distinct !DILexicalBlock(scope: !965, file: !2, line: 274, column: 20)
!982 = !DILocation(line: 274, column: 27, scope: !981)
!983 = !DILocation(line: 274, column: 20, scope: !965)
!984 = !DILocation(line: 275, column: 30, scope: !985)
!985 = distinct !DILexicalBlock(scope: !986, file: !2, line: 275, column: 17)
!986 = distinct !DILexicalBlock(scope: !981, file: !2, line: 274, column: 34)
!987 = !DILocation(line: 275, column: 34, scope: !985)
!988 = !DILocation(line: 275, column: 18, scope: !985)
!989 = !DILocation(line: 275, column: 17, scope: !986)
!990 = !DILocation(line: 275, column: 57, scope: !985)
!991 = !DILocation(line: 276, column: 9, scope: !986)
!992 = !DILocation(line: 277, column: 45, scope: !993)
!993 = distinct !DILexicalBlock(scope: !981, file: !2, line: 276, column: 16)
!994 = !DILocation(line: 277, column: 13, scope: !993)
!995 = !DILocation(line: 278, column: 13, scope: !993)
!996 = distinct !{!996, !928, !997}
!997 = !DILocation(line: 280, column: 5, scope: !797)
!998 = !DILocation(line: 282, column: 14, scope: !853)
!999 = !DILocation(line: 282, column: 9, scope: !853)
!1000 = !DILocation(line: 282, column: 18, scope: !853)
!1001 = !DILocation(line: 282, column: 21, scope: !853)
!1002 = !DILocation(line: 282, column: 27, scope: !853)
!1003 = !DILocation(line: 282, column: 30, scope: !853)
!1004 = !DILocation(line: 282, column: 44, scope: !853)
!1005 = !DILocation(line: 282, column: 9, scope: !797)
!1006 = !DILocation(line: 283, column: 9, scope: !851)
!1007 = !DILocation(line: 283, column: 9, scope: !852)
!1008 = !DILocation(line: 284, column: 5, scope: !852)
!1009 = !DILocation(line: 286, column: 9, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !797, file: !2, line: 286, column: 9)
!1011 = !DILocation(line: 286, column: 23, scope: !1010)
!1012 = !DILocation(line: 286, column: 9, scope: !797)
!1013 = !DILocation(line: 287, column: 9, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1010, file: !2, line: 286, column: 28)
!1015 = !DILocation(line: 288, column: 5, scope: !1014)
!1016 = !DILocation(line: 290, column: 12, scope: !797)
!1017 = !DILocation(line: 290, column: 17, scope: !797)
!1018 = !DILocation(line: 290, column: 16, scope: !797)
!1019 = !DILocation(line: 290, column: 10, scope: !797)
!1020 = !DILocation(line: 293, column: 9, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !797, file: !2, line: 293, column: 9)
!1022 = !DILocation(line: 293, column: 14, scope: !1021)
!1023 = !DILocation(line: 293, column: 19, scope: !1021)
!1024 = !DILocation(line: 293, column: 22, scope: !1021)
!1025 = !DILocation(line: 293, column: 9, scope: !797)
!1026 = !DILocation(line: 294, column: 65, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1021, file: !2, line: 293, column: 36)
!1028 = !DILocation(line: 294, column: 79, scope: !1027)
!1029 = !DILocation(line: 294, column: 9, scope: !1027)
!1030 = !DILocation(line: 295, column: 16, scope: !1027)
!1031 = !DILocation(line: 295, column: 9, scope: !1027)
!1032 = !DILocation(line: 296, column: 9, scope: !1027)
!1033 = !DILocation(line: 300, column: 9, scope: !797)
!1034 = !DILocation(line: 300, column: 35, scope: !797)
!1035 = !DILocation(line: 300, column: 53, scope: !797)
!1036 = !DILocation(line: 300, column: 58, scope: !797)
!1037 = !DILocation(line: 300, column: 76, scope: !797)
!1038 = !DILocation(line: 299, column: 5, scope: !797)
!1039 = !DILocation(line: 301, column: 9, scope: !858)
!1040 = !DILocation(line: 301, column: 14, scope: !858)
!1041 = !DILocation(line: 301, column: 9, scope: !797)
!1042 = !DILocation(line: 302, column: 13, scope: !856)
!1043 = !DILocation(line: 302, column: 13, scope: !857)
!1044 = !DILocation(line: 303, column: 18, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !855, file: !2, line: 303, column: 17)
!1046 = !DILocation(line: 303, column: 17, scope: !855)
!1047 = !DILocation(line: 304, column: 87, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1045, file: !2, line: 303, column: 29)
!1049 = !DILocation(line: 304, column: 17, scope: !1048)
!1050 = !DILocation(line: 305, column: 17, scope: !1048)
!1051 = !DILocation(line: 308, column: 13, scope: !855)
!1052 = !DILocation(line: 308, column: 18, scope: !855)
!1053 = !DILocation(line: 310, column: 17, scope: !855)
!1054 = !DILocation(line: 310, column: 42, scope: !855)
!1055 = !DILocation(line: 310, column: 59, scope: !855)
!1056 = !DILocation(line: 310, column: 76, scope: !855)
!1057 = !DILocation(line: 309, column: 13, scope: !855)
!1058 = !DILocation(line: 311, column: 13, scope: !855)
!1059 = !DILocation(line: 312, column: 23, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !855, file: !2, line: 312, column: 17)
!1061 = !DILocation(line: 312, column: 41, scope: !1060)
!1062 = !DILocation(line: 312, column: 17, scope: !1060)
!1063 = !DILocation(line: 312, column: 48, scope: !1060)
!1064 = !DILocation(line: 312, column: 56, scope: !1060)
!1065 = !DILocation(line: 312, column: 71, scope: !1060)
!1066 = !DILocation(line: 312, column: 59, scope: !1060)
!1067 = !DILocation(line: 312, column: 84, scope: !1060)
!1068 = !DILocation(line: 312, column: 17, scope: !855)
!1069 = !DILocation(line: 313, column: 17, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1060, file: !2, line: 312, column: 90)
!1071 = !DILocation(line: 314, column: 17, scope: !1070)
!1072 = !DILocation(line: 316, column: 34, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !855, file: !2, line: 316, column: 17)
!1074 = !DILocation(line: 316, column: 27, scope: !1073)
!1075 = !DILocation(line: 316, column: 39, scope: !1073)
!1076 = !DILocation(line: 316, column: 17, scope: !1073)
!1077 = !DILocation(line: 316, column: 44, scope: !1073)
!1078 = !DILocation(line: 316, column: 17, scope: !855)
!1079 = !DILocation(line: 317, column: 55, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1073, file: !2, line: 316, column: 51)
!1081 = !DILocation(line: 317, column: 17, scope: !1080)
!1082 = !DILocation(line: 318, column: 17, scope: !1080)
!1083 = !DILocation(line: 320, column: 24, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1073, file: !2, line: 319, column: 20)
!1085 = !DILocation(line: 320, column: 17, scope: !1084)
!1086 = !DILocation(line: 321, column: 17, scope: !1084)
!1087 = !DILocation(line: 323, column: 9, scope: !856)
!1088 = !DILocation(line: 324, column: 85, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !856, file: !2, line: 323, column: 16)
!1090 = !DILocation(line: 324, column: 13, scope: !1089)
!1091 = !DILocation(line: 325, column: 13, scope: !1089)
!1092 = !DILocation(line: 328, column: 12, scope: !797)
!1093 = !DILocation(line: 328, column: 5, scope: !797)
!1094 = !DILocation(line: 329, column: 5, scope: !797)
!1095 = !DILocation(line: 330, column: 1, scope: !797)
!1096 = !DISubprogram(name: "fopen", linkageName: "fopen64", scope: !333, file: !333, line: 270, type: !1097, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!341, !337, !337}
!1099 = !DISubprogram(name: "strerror", scope: !324, file: !324, line: 419, type: !1100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!31, !293}
!1102 = !DISubprogram(name: "fstat", linkageName: "fstat64", scope: !1103, file: !1103, line: 230, type: !1104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!293, !293, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!1107 = !DISubprogram(name: "redis_check_rdb_main", scope: !23, file: !23, line: 3190, type: !1108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!293, !293, !453, !341}
!1110 = !DISubprogram(name: "feof", scope: !333, file: !333, line: 788, type: !795, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1111 = !DISubprogram(name: "fseek", scope: !333, file: !333, line: 713, type: !1112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!293, !341, !32, !293}
!1114 = !DISubprogram(name: "fclose", scope: !333, file: !333, line: 178, type: !795, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1115 = !DISubprogram(name: "strlen", scope: !324, file: !324, line: 407, type: !1116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!331, !327}
!1118 = !DISubprogram(name: "strncasecmp", scope: !679, file: !679, line: 120, type: !325, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1119 = distinct !DISubprogram(name: "fileIsRDB", scope: !2, file: !2, line: 336, type: !291, scopeLine: 336, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1128}
!1121 = !DILocalVariable(name: "filepath", arg: 1, scope: !1119, file: !2, line: 336, type: !31)
!1122 = !DILocalVariable(name: "fp", scope: !1119, file: !2, line: 337, type: !341)
!1123 = !DILocalVariable(name: "sb", scope: !1119, file: !2, line: 343, type: !812)
!1124 = !DILocalVariable(name: "size", scope: !1119, file: !2, line: 349, type: !269)
!1125 = !DILocalVariable(name: "sig", scope: !1126, file: !2, line: 356, type: !76)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !2, line: 355, column: 20)
!1127 = distinct !DILexicalBlock(scope: !1119, file: !2, line: 355, column: 9)
!1128 = !DILocalVariable(name: "rdb_file", scope: !1126, file: !2, line: 357, type: !293)
!1129 = !DILocation(line: 336, column: 21, scope: !1119)
!1130 = !DILocation(line: 337, column: 5, scope: !1119)
!1131 = !DILocation(line: 337, column: 11, scope: !1119)
!1132 = !DILocation(line: 337, column: 22, scope: !1119)
!1133 = !DILocation(line: 337, column: 16, scope: !1119)
!1134 = !DILocation(line: 338, column: 9, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1119, file: !2, line: 338, column: 9)
!1136 = !DILocation(line: 338, column: 12, scope: !1135)
!1137 = !DILocation(line: 338, column: 9, scope: !1119)
!1138 = !DILocation(line: 339, column: 45, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1135, file: !2, line: 338, column: 21)
!1140 = !DILocation(line: 339, column: 64, scope: !1139)
!1141 = !DILocation(line: 339, column: 55, scope: !1139)
!1142 = !DILocation(line: 339, column: 9, scope: !1139)
!1143 = !DILocation(line: 340, column: 9, scope: !1139)
!1144 = !DILocation(line: 343, column: 5, scope: !1119)
!1145 = !DILocation(line: 343, column: 23, scope: !1119)
!1146 = !DILocation(line: 344, column: 28, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1119, file: !2, line: 344, column: 9)
!1148 = !DILocation(line: 344, column: 21, scope: !1147)
!1149 = !DILocation(line: 344, column: 9, scope: !1147)
!1150 = !DILocation(line: 344, column: 38, scope: !1147)
!1151 = !DILocation(line: 344, column: 9, scope: !1119)
!1152 = !DILocation(line: 345, column: 42, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1147, file: !2, line: 344, column: 45)
!1154 = !DILocation(line: 345, column: 9, scope: !1153)
!1155 = !DILocation(line: 346, column: 9, scope: !1153)
!1156 = !DILocation(line: 349, column: 5, scope: !1119)
!1157 = !DILocation(line: 349, column: 11, scope: !1119)
!1158 = !DILocation(line: 349, column: 21, scope: !1119)
!1159 = !DILocation(line: 350, column: 9, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1119, file: !2, line: 350, column: 9)
!1161 = !DILocation(line: 350, column: 14, scope: !1160)
!1162 = !DILocation(line: 350, column: 9, scope: !1119)
!1163 = !DILocation(line: 351, column: 16, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1160, file: !2, line: 350, column: 20)
!1165 = !DILocation(line: 351, column: 9, scope: !1164)
!1166 = !DILocation(line: 352, column: 9, scope: !1164)
!1167 = !DILocation(line: 355, column: 9, scope: !1127)
!1168 = !DILocation(line: 355, column: 14, scope: !1127)
!1169 = !DILocation(line: 355, column: 9, scope: !1119)
!1170 = !DILocation(line: 356, column: 9, scope: !1126)
!1171 = !DILocation(line: 356, column: 14, scope: !1126)
!1172 = !DILocation(line: 357, column: 9, scope: !1126)
!1173 = !DILocation(line: 357, column: 13, scope: !1126)
!1174 = !DILocation(line: 357, column: 30, scope: !1126)
!1175 = !DILocation(line: 357, column: 51, scope: !1126)
!1176 = !DILocation(line: 357, column: 24, scope: !1126)
!1177 = !DILocation(line: 357, column: 55, scope: !1126)
!1178 = !DILocation(line: 357, column: 60, scope: !1126)
!1179 = !DILocation(line: 358, column: 36, scope: !1126)
!1180 = !DILocation(line: 358, column: 29, scope: !1126)
!1181 = !DILocation(line: 358, column: 63, scope: !1126)
!1182 = !DILocation(line: 0, scope: !1126)
!1183 = !DILocation(line: 359, column: 13, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1126, file: !2, line: 359, column: 13)
!1185 = !DILocation(line: 359, column: 13, scope: !1126)
!1186 = !DILocation(line: 360, column: 20, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1184, file: !2, line: 359, column: 23)
!1188 = !DILocation(line: 360, column: 13, scope: !1187)
!1189 = !DILocation(line: 361, column: 13, scope: !1187)
!1190 = !DILocation(line: 363, column: 5, scope: !1127)
!1191 = !DILocation(line: 363, column: 5, scope: !1126)
!1192 = !DILocation(line: 365, column: 12, scope: !1119)
!1193 = !DILocation(line: 365, column: 5, scope: !1119)
!1194 = !DILocation(line: 366, column: 5, scope: !1119)
!1195 = !DILocation(line: 367, column: 1, scope: !1119)
!1196 = !DISubprogram(name: "memcmp", scope: !324, file: !324, line: 64, type: !1197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!293, !1199, !1199, !329}
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1201 = distinct !DISubprogram(name: "fileIsManifest", scope: !2, file: !2, line: 371, type: !291, scopeLine: 371, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !1202)
!1202 = !{!1203, !1204, !1205, !1206, !1207, !1208}
!1203 = !DILocalVariable(name: "filepath", arg: 1, scope: !1201, file: !2, line: 371, type: !31)
!1204 = !DILocalVariable(name: "is_manifest", scope: !1201, file: !2, line: 372, type: !293)
!1205 = !DILocalVariable(name: "fp", scope: !1201, file: !2, line: 373, type: !341)
!1206 = !DILocalVariable(name: "sb", scope: !1201, file: !2, line: 379, type: !812)
!1207 = !DILocalVariable(name: "size", scope: !1201, file: !2, line: 385, type: !269)
!1208 = !DILocalVariable(name: "buf", scope: !1201, file: !2, line: 391, type: !1209)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8200, elements: !1210)
!1210 = !{!1211}
!1211 = !DISubrange(count: 1025)
!1212 = !DILocation(line: 371, column: 26, scope: !1201)
!1213 = !DILocation(line: 372, column: 5, scope: !1201)
!1214 = !DILocation(line: 372, column: 9, scope: !1201)
!1215 = !DILocation(line: 373, column: 5, scope: !1201)
!1216 = !DILocation(line: 373, column: 11, scope: !1201)
!1217 = !DILocation(line: 373, column: 22, scope: !1201)
!1218 = !DILocation(line: 373, column: 16, scope: !1201)
!1219 = !DILocation(line: 374, column: 9, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1201, file: !2, line: 374, column: 9)
!1221 = !DILocation(line: 374, column: 12, scope: !1220)
!1222 = !DILocation(line: 374, column: 9, scope: !1201)
!1223 = !DILocation(line: 375, column: 45, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1220, file: !2, line: 374, column: 21)
!1225 = !DILocation(line: 375, column: 64, scope: !1224)
!1226 = !DILocation(line: 375, column: 55, scope: !1224)
!1227 = !DILocation(line: 375, column: 9, scope: !1224)
!1228 = !DILocation(line: 376, column: 9, scope: !1224)
!1229 = !DILocation(line: 379, column: 5, scope: !1201)
!1230 = !DILocation(line: 379, column: 23, scope: !1201)
!1231 = !DILocation(line: 380, column: 28, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1201, file: !2, line: 380, column: 9)
!1233 = !DILocation(line: 380, column: 21, scope: !1232)
!1234 = !DILocation(line: 380, column: 9, scope: !1232)
!1235 = !DILocation(line: 380, column: 38, scope: !1232)
!1236 = !DILocation(line: 380, column: 9, scope: !1201)
!1237 = !DILocation(line: 381, column: 42, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1232, file: !2, line: 380, column: 45)
!1239 = !DILocation(line: 381, column: 9, scope: !1238)
!1240 = !DILocation(line: 382, column: 9, scope: !1238)
!1241 = !DILocation(line: 385, column: 5, scope: !1201)
!1242 = !DILocation(line: 385, column: 11, scope: !1201)
!1243 = !DILocation(line: 385, column: 21, scope: !1201)
!1244 = !DILocation(line: 386, column: 9, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1201, file: !2, line: 386, column: 9)
!1246 = !DILocation(line: 386, column: 14, scope: !1245)
!1247 = !DILocation(line: 386, column: 9, scope: !1201)
!1248 = !DILocation(line: 387, column: 16, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1245, file: !2, line: 386, column: 20)
!1250 = !DILocation(line: 387, column: 9, scope: !1249)
!1251 = !DILocation(line: 388, column: 9, scope: !1249)
!1252 = !DILocation(line: 391, column: 5, scope: !1201)
!1253 = !DILocation(line: 391, column: 10, scope: !1201)
!1254 = !DILocation(line: 392, column: 5, scope: !1201)
!1255 = !DILocation(line: 393, column: 19, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1257, file: !2, line: 393, column: 13)
!1257 = distinct !DILexicalBlock(scope: !1201, file: !2, line: 392, column: 15)
!1258 = !DILocation(line: 393, column: 45, scope: !1256)
!1259 = !DILocation(line: 393, column: 13, scope: !1256)
!1260 = !DILocation(line: 393, column: 49, scope: !1256)
!1261 = !DILocation(line: 393, column: 13, scope: !1257)
!1262 = !DILocation(line: 394, column: 22, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1264, file: !2, line: 394, column: 17)
!1264 = distinct !DILexicalBlock(scope: !1256, file: !2, line: 393, column: 58)
!1265 = !DILocation(line: 394, column: 17, scope: !1263)
!1266 = !DILocation(line: 394, column: 17, scope: !1264)
!1267 = !DILocation(line: 395, column: 17, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1263, file: !2, line: 394, column: 27)
!1269 = !DILocation(line: 397, column: 50, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1263, file: !2, line: 396, column: 20)
!1271 = !DILocation(line: 397, column: 17, scope: !1270)
!1272 = !DILocation(line: 398, column: 17, scope: !1270)
!1273 = !DILocation(line: 403, column: 13, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1257, file: !2, line: 403, column: 13)
!1275 = !DILocation(line: 403, column: 20, scope: !1274)
!1276 = !DILocation(line: 403, column: 13, scope: !1257)
!1277 = !DILocation(line: 404, column: 13, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1274, file: !2, line: 403, column: 28)
!1279 = distinct !{!1279, !1254, !1280}
!1280 = !DILocation(line: 408, column: 5, scope: !1201)
!1281 = !DILocation(line: 405, column: 28, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1274, file: !2, line: 405, column: 20)
!1283 = !DILocation(line: 405, column: 21, scope: !1282)
!1284 = !DILocation(line: 405, column: 20, scope: !1274)
!1285 = !DILocation(line: 406, column: 25, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1282, file: !2, line: 405, column: 58)
!1287 = !DILocation(line: 407, column: 9, scope: !1286)
!1288 = !DILocation(line: 410, column: 12, scope: !1201)
!1289 = !DILocation(line: 410, column: 5, scope: !1201)
!1290 = !DILocation(line: 411, column: 12, scope: !1201)
!1291 = !DILocation(line: 411, column: 5, scope: !1201)
!1292 = !DILocation(line: 412, column: 1, scope: !1201)
!1293 = distinct !DISubprogram(name: "getInputFileType", scope: !2, file: !2, line: 422, type: !1294, scopeLine: 422, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !1297)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!1296, !31}
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_file_type", file: !2, line: 46, baseType: !16)
!1297 = !{!1298}
!1298 = !DILocalVariable(name: "filepath", arg: 1, scope: !1293, file: !2, line: 422, type: !31)
!1299 = !DILocation(line: 422, column: 40, scope: !1293)
!1300 = !DILocation(line: 423, column: 24, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1293, file: !2, line: 423, column: 9)
!1302 = !DILocation(line: 423, column: 9, scope: !1301)
!1303 = !DILocation(line: 423, column: 9, scope: !1293)
!1304 = !DILocation(line: 424, column: 9, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1301, file: !2, line: 423, column: 35)
!1306 = !DILocation(line: 425, column: 26, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1301, file: !2, line: 425, column: 16)
!1308 = !DILocation(line: 425, column: 16, scope: !1307)
!1309 = !DILocation(line: 425, column: 16, scope: !1301)
!1310 = !DILocation(line: 426, column: 9, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1307, file: !2, line: 425, column: 37)
!1312 = !DILocation(line: 428, column: 9, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1307, file: !2, line: 427, column: 12)
!1314 = !DILocation(line: 430, column: 1, scope: !1293)
!1315 = distinct !DISubprogram(name: "checkMultiPartAof", scope: !2, file: !2, line: 443, type: !1316, scopeLine: 443, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !1318)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{null, !31, !31, !293}
!1318 = !{!1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1363, !1366, !1367, !1368, !1371, !1377, !1379, !1380}
!1319 = !DILocalVariable(name: "dirpath", arg: 1, scope: !1315, file: !2, line: 443, type: !31)
!1320 = !DILocalVariable(name: "manifest_filepath", arg: 2, scope: !1315, file: !2, line: 443, type: !31)
!1321 = !DILocalVariable(name: "fix", arg: 3, scope: !1315, file: !2, line: 443, type: !293)
!1322 = !DILocalVariable(name: "total_num", scope: !1315, file: !2, line: 444, type: !293)
!1323 = !DILocalVariable(name: "aof_num", scope: !1315, file: !2, line: 444, type: !293)
!1324 = !DILocalVariable(name: "last_file", scope: !1315, file: !2, line: 444, type: !293)
!1325 = !DILocalVariable(name: "ret", scope: !1315, file: !2, line: 445, type: !293)
!1326 = !DILocalVariable(name: "am", scope: !1315, file: !2, line: 448, type: !1327)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "aofManifest", file: !23, line: 1424, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 1414, size: 384, elements: !1330)
!1330 = !{!1331, !1332, !1359, !1360, !1361, !1362}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "base_aof_info", scope: !1329, file: !23, line: 1415, baseType: !33, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "incr_aof_list", scope: !1329, file: !23, line: 1416, baseType: !1333, size: 64, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !1335, line: 54, baseType: !1336)
!1335 = !DIFile(filename: "./adlist.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/src", checksumkind: CSK_MD5, checksum: "7a1b206772988edd77b3a60961c7439d")
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !1335, line: 47, size: 384, elements: !1337)
!1337 = !{!1338, !1347, !1348, !1352, !1354, !1358}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1336, file: !1335, line: 48, baseType: !1339, size: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !1335, line: 40, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !1335, line: 36, size: 192, elements: !1342)
!1342 = !{!1343, !1345, !1346}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1341, file: !1335, line: 37, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1341, file: !1335, line: 38, baseType: !1344, size: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1341, file: !1335, line: 39, baseType: !30, size: 64, offset: 128)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1336, file: !1335, line: 49, baseType: !1339, size: 64, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !1336, file: !1335, line: 50, baseType: !1349, size: 64, offset: 128)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!30, !30}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1336, file: !1335, line: 51, baseType: !1353, size: 64, offset: 192)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !1336, file: !1335, line: 52, baseType: !1355, size: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!293, !30, !30}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1336, file: !1335, line: 53, baseType: !331, size: 64, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "history_aof_list", scope: !1329, file: !23, line: 1417, baseType: !1333, size: 64, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "curr_base_file_seq", scope: !1329, file: !23, line: 1420, baseType: !29, size: 64, offset: 192)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "curr_incr_file_seq", scope: !1329, file: !23, line: 1421, baseType: !29, size: 64, offset: 256)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !1329, file: !23, line: 1422, baseType: !293, size: 32, offset: 320)
!1363 = !DILocalVariable(name: "aof_filename", scope: !1364, file: !2, line: 454, type: !38)
!1364 = distinct !DILexicalBlock(scope: !1365, file: !2, line: 453, column: 28)
!1365 = distinct !DILexicalBlock(scope: !1315, file: !2, line: 453, column: 9)
!1366 = !DILocalVariable(name: "aof_filepath", scope: !1364, file: !2, line: 455, type: !38)
!1367 = !DILocalVariable(name: "aof_preable", scope: !1364, file: !2, line: 457, type: !293)
!1368 = !DILocalVariable(name: "ln", scope: !1369, file: !2, line: 475, type: !1339)
!1369 = distinct !DILexicalBlock(scope: !1370, file: !2, line: 474, column: 40)
!1370 = distinct !DILexicalBlock(scope: !1315, file: !2, line: 474, column: 9)
!1371 = !DILocalVariable(name: "li", scope: !1369, file: !2, line: 476, type: !1372)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !1335, line: 45, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !1335, line: 42, size: 128, elements: !1374)
!1374 = !{!1375, !1376}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1373, file: !1335, line: 43, baseType: !1339, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1373, file: !1335, line: 44, baseType: !293, size: 32, offset: 64)
!1377 = !DILocalVariable(name: "ai", scope: !1378, file: !2, line: 481, type: !33)
!1378 = distinct !DILexicalBlock(scope: !1369, file: !2, line: 480, column: 46)
