; ModuleID = 'samples/240.bc'
source_filename = "src/core/splitter.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtSplitter = type { ptr, i64, i64 }

@.str = private unnamed_addr constant [20 x i8] c"src/core/splitter.c\00", align 1, !dbg !0
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [12 x i8] c"s && string\00", align 1, !dbg !12
@__func__.gt_splitter_split = private unnamed_addr constant [18 x i8] c"gt_splitter_split\00", align 1, !dbg !17
@.str.3 = private unnamed_addr constant [13 x i8] c"end_of_token\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [17 x i8] c"s->num_of_tokens\00", align 1, !dbg !28
@__func__.gt_splitter_split_non_empty = private unnamed_addr constant [28 x i8] c"gt_splitter_split_non_empty\00", align 1, !dbg !33
@.str.5 = private unnamed_addr constant [2 x i8] c"s\00", align 1, !dbg !38
@__func__.gt_splitter_get_tokens = private unnamed_addr constant [23 x i8] c"gt_splitter_get_tokens\00", align 1, !dbg !43

!140 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 4)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 48)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !84, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !153, isLocal: true, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 49)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !2, line: 161, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 6)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(scope: null, file: !2, line: 161, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 50)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !119, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !2, line: 201, type: !79, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !2, line: 201, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 45)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !2, line: 207, type: !119, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !119, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !172, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 216, type: !40, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 216, type: !126, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 222, type: !119, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !2, line: 224, type: !126, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !131, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !136, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !131, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !136, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !2, line: 233, type: !172, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 248, type: !84, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !2, line: 248, type: !153, isLocal: true, isDefinition: true)
!203 = !{!204, !205, !221, !222}
!204 = !DILocalVariable(name: "err", arg: 1, scope: !65, file: !2, line: 136, type: !69)
!205 = !DILocalVariable(name: "s", scope: !65, file: !2, line: 147, type: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtSplitter", file: !208, line: 27, baseType: !209)
!208 = !DIFile(filename: "src/core/splitter_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7d5728ff63948c95d9783ad67b6a030e")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtSplitter", file: !2, line: 27, size: 192, elements: !210)
!210 = !{!211, !214, !218}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !209, file: !2, line: 28, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "num_of_tokens", scope: !209, file: !2, line: 29, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !216, line: 83, baseType: !217)
!216 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!217 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !209, file: !2, line: 30, baseType: !219, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 70, baseType: !217)
!220 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!221 = !DILocalVariable(name: "had_err", scope: !65, file: !2, line: 148, type: !68)
!222 = !DILocalVariable(name: "idx", scope: !65, file: !2, line: 149, type: !215)
!223 = !{i32 7, !"Dwarf Version", i32 5}
!224 = !{i32 2, !"Debug Info Version", i32 3}
!225 = !{i32 1, !"wchar_size", i32 4}
!226 = !{i32 8, !"PIC Level", i32 2}
!227 = !{i32 7, !"uwtable", i32 2}
!228 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!229 = distinct !DISubprogram(name: "gt_splitter_new", scope: !2, file: !2, line: 33, type: !230, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !73)
!230 = !DISubroutineType(types: !231)
!231 = !{!206}
!232 = !DILocation(line: 35, column: 10, scope: !229)
!233 = !DILocation(line: 35, column: 3, scope: !229)
!234 = !DISubprogram(name: "gt_calloc_mem", scope: !235, file: !235, line: 62, type: !236, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!235 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !219, !219, !239, !68}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!240 = distinct !DISubprogram(name: "gt_splitter_split", scope: !2, file: !2, line: 38, type: !241, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !73, retainedNodes: !243)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !206, !213, !215, !4}
!243 = !{!244, !245, !246, !247, !248, !249}
!244 = !DILocalVariable(name: "s", arg: 1, scope: !240, file: !2, line: 38, type: !206)
!245 = !DILocalVariable(name: "string", arg: 2, scope: !240, file: !2, line: 38, type: !213)
!246 = !DILocalVariable(name: "length", arg: 3, scope: !240, file: !2, line: 38, type: !215)
!247 = !DILocalVariable(name: "delimiter", arg: 4, scope: !240, file: !2, line: 39, type: !4)
!248 = !DILocalVariable(name: "end_of_token", scope: !240, file: !2, line: 42, type: !213)
!249 = !DILocalVariable(name: "string_index", scope: !240, file: !2, line: 42, type: !213)
!250 = !{!251, !251, i64 0}
!251 = !{!"any pointer", !252, i64 0}
!252 = !{!"omnipotent char", !253, i64 0}
!253 = !{!"Simple C/C++ TBAA"}
!254 = !DILocation(line: 38, column: 36, scope: !240)
!255 = !DILocation(line: 38, column: 45, scope: !240)
!256 = !{!257, !257, i64 0}
!257 = !{!"long", !252, i64 0}
!258 = !DILocation(line: 38, column: 61, scope: !240)
!259 = !{!252, !252, i64 0}
!260 = !DILocation(line: 39, column: 29, scope: !240)
!261 = !DILocation(line: 42, column: 3, scope: !240)
!262 = !DILocation(line: 42, column: 9, scope: !240)
!263 = !DILocation(line: 42, column: 24, scope: !240)
!264 = !DILocation(line: 42, column: 39, scope: !240)
!265 = !DILocation(line: 44, column: 3, scope: !240)
!266 = !DILocation(line: 44, column: 3, scope: !267)
!267 = distinct !DILexicalBlock(scope: !268, file: !2, line: 44, column: 3)
!268 = distinct !DILexicalBlock(scope: !240, file: !2, line: 44, column: 3)
!269 = !DILocation(line: 44, column: 3, scope: !268)
!270 = !DILocation(line: 44, column: 3, scope: !271)
!271 = distinct !DILexicalBlock(scope: !267, file: !2, line: 44, column: 3)
!272 = !DILocation(line: 47, column: 3, scope: !240)
!273 = !DILocation(line: 47, column: 10, scope: !240)
!274 = !DILocation(line: 47, column: 25, scope: !240)
!275 = !DILocation(line: 47, column: 34, scope: !240)
!276 = !DILocation(line: 47, column: 32, scope: !240)
!277 = !DILocation(line: 47, column: 23, scope: !240)
!278 = !DILocation(line: 47, column: 41, scope: !240)
!279 = !DILocation(line: 48, column: 33, scope: !240)
!280 = !DILocation(line: 48, column: 47, scope: !240)
!281 = !DILocation(line: 48, column: 26, scope: !240)
!282 = !DILocation(line: 48, column: 24, scope: !240)
!283 = !DILocation(line: 0, scope: !240)
!284 = !DILocation(line: 49, column: 5, scope: !285)
!285 = distinct !DILexicalBlock(scope: !240, file: !2, line: 48, column: 60)
!286 = !DILocation(line: 49, column: 5, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !2, line: 49, column: 5)
!288 = distinct !DILexicalBlock(scope: !285, file: !2, line: 49, column: 5)
!289 = !DILocation(line: 49, column: 5, scope: !288)
!290 = !DILocation(line: 49, column: 5, scope: !291)
!291 = distinct !DILexicalBlock(scope: !287, file: !2, line: 49, column: 5)
!292 = !DILocation(line: 50, column: 6, scope: !285)
!293 = !DILocation(line: 50, column: 19, scope: !285)
!294 = !DILocation(line: 51, column: 10, scope: !295)
!295 = distinct !DILexicalBlock(scope: !285, file: !2, line: 51, column: 9)
!296 = !DILocation(line: 51, column: 13, scope: !295)
!297 = !{!298, !257, i64 8}
!298 = !{!"GtSplitter", !251, i64 0, !257, i64 8, !257, i64 16}
!299 = !DILocation(line: 51, column: 27, scope: !295)
!300 = !DILocation(line: 51, column: 32, scope: !295)
!301 = !DILocation(line: 51, column: 51, scope: !295)
!302 = !DILocation(line: 51, column: 54, scope: !295)
!303 = !{!298, !257, i64 16}
!304 = !DILocation(line: 51, column: 49, scope: !295)
!305 = !DILocation(line: 51, column: 9, scope: !285)
!306 = !DILocation(line: 52, column: 31, scope: !295)
!307 = !DILocation(line: 52, column: 34, scope: !295)
!308 = !{!298, !251, i64 0}
!309 = !DILocation(line: 52, column: 43, scope: !295)
!310 = !DILocation(line: 52, column: 46, scope: !295)
!311 = !DILocation(line: 53, column: 32, scope: !295)
!312 = !DILocation(line: 53, column: 35, scope: !295)
!313 = !DILocation(line: 53, column: 49, scope: !295)
!314 = !DILocation(line: 53, column: 54, scope: !295)
!315 = !DILocation(line: 52, column: 19, scope: !295)
!316 = !DILocation(line: 52, column: 7, scope: !295)
!317 = !DILocation(line: 52, column: 10, scope: !295)
!318 = !DILocation(line: 52, column: 17, scope: !295)
!319 = !DILocation(line: 54, column: 37, scope: !285)
!320 = !DILocation(line: 54, column: 5, scope: !285)
!321 = !DILocation(line: 54, column: 8, scope: !285)
!322 = !DILocation(line: 54, column: 15, scope: !285)
!323 = !DILocation(line: 54, column: 18, scope: !285)
!324 = !DILocation(line: 54, column: 31, scope: !285)
!325 = !DILocation(line: 54, column: 35, scope: !285)
!326 = !DILocation(line: 55, column: 20, scope: !285)
!327 = !DILocation(line: 55, column: 33, scope: !285)
!328 = !DILocation(line: 55, column: 18, scope: !285)
!329 = distinct !{!329, !272, !330, !331}
!330 = !DILocation(line: 56, column: 3, scope: !240)
!331 = !{!"llvm.loop.mustprogress"}
!332 = !DILocation(line: 59, column: 8, scope: !333)
!333 = distinct !DILexicalBlock(scope: !240, file: !2, line: 59, column: 7)
!334 = !DILocation(line: 59, column: 11, scope: !333)
!335 = !DILocation(line: 59, column: 25, scope: !333)
!336 = !DILocation(line: 59, column: 30, scope: !333)
!337 = !DILocation(line: 59, column: 49, scope: !333)
!338 = !DILocation(line: 59, column: 52, scope: !333)
!339 = !DILocation(line: 59, column: 47, scope: !333)
!340 = !DILocation(line: 59, column: 7, scope: !240)
!341 = !DILocation(line: 60, column: 29, scope: !333)
!342 = !DILocation(line: 60, column: 32, scope: !333)
!343 = !DILocation(line: 60, column: 41, scope: !333)
!344 = !DILocation(line: 60, column: 44, scope: !333)
!345 = !DILocation(line: 61, column: 30, scope: !333)
!346 = !DILocation(line: 61, column: 33, scope: !333)
!347 = !DILocation(line: 61, column: 47, scope: !333)
!348 = !DILocation(line: 61, column: 52, scope: !333)
!349 = !DILocation(line: 60, column: 17, scope: !333)
!350 = !DILocation(line: 60, column: 5, scope: !333)
!351 = !DILocation(line: 60, column: 8, scope: !333)
!352 = !DILocation(line: 60, column: 15, scope: !333)
!353 = !DILocation(line: 62, column: 35, scope: !240)
!354 = !DILocation(line: 62, column: 3, scope: !240)
!355 = !DILocation(line: 62, column: 6, scope: !240)
!356 = !DILocation(line: 62, column: 13, scope: !240)
!357 = !DILocation(line: 62, column: 16, scope: !240)
!358 = !DILocation(line: 62, column: 29, scope: !240)
!359 = !DILocation(line: 62, column: 33, scope: !240)
!360 = !DILocation(line: 63, column: 3, scope: !240)
!361 = !DILocation(line: 63, column: 6, scope: !240)
!362 = !DILocation(line: 63, column: 13, scope: !240)
!363 = !DILocation(line: 63, column: 16, scope: !240)
!364 = !DILocation(line: 63, column: 33, scope: !240)
!365 = !DILocation(line: 65, column: 3, scope: !240)
!366 = !DILocation(line: 65, column: 3, scope: !367)
!367 = distinct !DILexicalBlock(scope: !368, file: !2, line: 65, column: 3)
!368 = distinct !DILexicalBlock(scope: !240, file: !2, line: 65, column: 3)
!369 = !DILocation(line: 65, column: 3, scope: !368)
!370 = !DILocation(line: 65, column: 3, scope: !371)
!371 = distinct !DILexicalBlock(scope: !367, file: !2, line: 65, column: 3)
!372 = !DILocation(line: 66, column: 1, scope: !240)
!373 = !DISubprogram(name: "fprintf", scope: !374, file: !374, line: 350, type: !375, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!374 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!375 = !DISubroutineType(types: !376)
!376 = !{!68, !377, !428, null}
!377 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !380, line: 7, baseType: !381)
!380 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !382, line: 49, size: 1728, elements: !383)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!383 = !{!384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !399, !401, !402, !403, !407, !409, !411, !412, !415, !417, !420, !423, !424, !425, !426, !427}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !381, file: !382, line: 51, baseType: !68, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !381, file: !382, line: 54, baseType: !213, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !381, file: !382, line: 55, baseType: !213, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !381, file: !382, line: 56, baseType: !213, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !381, file: !382, line: 57, baseType: !213, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !381, file: !382, line: 58, baseType: !213, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !381, file: !382, line: 59, baseType: !213, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !381, file: !382, line: 60, baseType: !213, size: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !381, file: !382, line: 61, baseType: !213, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !381, file: !382, line: 64, baseType: !213, size: 64, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !381, file: !382, line: 65, baseType: !213, size: 64, offset: 640)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !381, file: !382, line: 66, baseType: !213, size: 64, offset: 704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !381, file: !382, line: 68, baseType: !397, size: 64, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !382, line: 36, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !381, file: !382, line: 70, baseType: !400, size: 64, offset: 832)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !381, file: !382, line: 72, baseType: !68, size: 32, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !381, file: !382, line: 73, baseType: !68, size: 32, offset: 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !381, file: !382, line: 74, baseType: !404, size: 64, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !405, line: 152, baseType: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!406 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !381, file: !382, line: 77, baseType: !408, size: 16, offset: 1024)
!408 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !381, file: !382, line: 78, baseType: !410, size: 8, offset: 1040)
!410 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !381, file: !382, line: 79, baseType: !79, size: 8, offset: 1048)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !381, file: !382, line: 81, baseType: !413, size: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !382, line: 43, baseType: null)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !381, file: !382, line: 89, baseType: !416, size: 64, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !405, line: 153, baseType: !406)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !381, file: !382, line: 91, baseType: !418, size: 64, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !382, line: 37, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !381, file: !382, line: 92, baseType: !421, size: 64, offset: 1280)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !382, line: 38, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !381, file: !382, line: 93, baseType: !400, size: 64, offset: 1344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !381, file: !382, line: 94, baseType: !238, size: 64, offset: 1408)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !381, file: !382, line: 95, baseType: !219, size: 64, offset: 1472)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !381, file: !382, line: 96, baseType: !68, size: 32, offset: 1536)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !381, file: !382, line: 98, baseType: !3, size: 160, offset: 1568)
!428 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !239)
!429 = !DISubprogram(name: "abort", scope: !430, file: !430, line: 598, type: !431, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!430 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!431 = !DISubroutineType(types: !432)
!432 = !{null}
!433 = !DISubprogram(name: "strchr", scope: !434, file: !434, line: 246, type: !435, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!435 = !DISubroutineType(types: !436)
!436 = !{!213, !239, !68}
!437 = !DISubprogram(name: "gt_dynalloc", scope: !438, file: !438, line: 39, type: !439, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DIFile(filename: "src/core/dynalloc.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "2e50026ed0cabc2fe1462f848e1303b2")
!439 = !DISubroutineType(types: !440)
!440 = !{!238, !238, !441, !219}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!442 = distinct !DISubprogram(name: "gt_splitter_split_non_empty", scope: !2, file: !2, line: 68, type: !241, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !73, retainedNodes: !443)
!443 = !{!444, !445, !446, !447, !448, !449}
!444 = !DILocalVariable(name: "s", arg: 1, scope: !442, file: !2, line: 68, type: !206)
!445 = !DILocalVariable(name: "string", arg: 2, scope: !442, file: !2, line: 68, type: !213)
!446 = !DILocalVariable(name: "length", arg: 3, scope: !442, file: !2, line: 68, type: !215)
!447 = !DILocalVariable(name: "delimiter", arg: 4, scope: !442, file: !2, line: 69, type: !4)
!448 = !DILocalVariable(name: "end_of_token", scope: !442, file: !2, line: 72, type: !213)
!449 = !DILocalVariable(name: "string_index", scope: !442, file: !2, line: 72, type: !213)
!450 = !DILocation(line: 68, column: 46, scope: !442)
!451 = !DILocation(line: 68, column: 55, scope: !442)
!452 = !DILocation(line: 68, column: 71, scope: !442)
!453 = !DILocation(line: 69, column: 39, scope: !442)
!454 = !DILocation(line: 72, column: 3, scope: !442)
!455 = !DILocation(line: 72, column: 9, scope: !442)
!456 = !DILocation(line: 72, column: 24, scope: !442)
!457 = !DILocation(line: 72, column: 39, scope: !442)
!458 = !DILocation(line: 74, column: 3, scope: !442)
!459 = !DILocation(line: 74, column: 3, scope: !460)
!460 = distinct !DILexicalBlock(scope: !461, file: !2, line: 74, column: 3)
!461 = distinct !DILexicalBlock(scope: !442, file: !2, line: 74, column: 3)
!462 = !DILocation(line: 74, column: 3, scope: !461)
!463 = !DILocation(line: 74, column: 3, scope: !464)
!464 = distinct !DILexicalBlock(scope: !460, file: !2, line: 74, column: 3)
!465 = !DILocation(line: 77, column: 3, scope: !442)
!466 = !DILocation(line: 77, column: 10, scope: !442)
!467 = !DILocation(line: 77, column: 25, scope: !442)
!468 = !DILocation(line: 77, column: 34, scope: !442)
!469 = !DILocation(line: 77, column: 32, scope: !442)
!470 = !DILocation(line: 77, column: 23, scope: !442)
!471 = !DILocation(line: 77, column: 41, scope: !442)
!472 = !DILocation(line: 78, column: 33, scope: !442)
!473 = !DILocation(line: 78, column: 47, scope: !442)
!474 = !DILocation(line: 78, column: 26, scope: !442)
!475 = !DILocation(line: 78, column: 24, scope: !442)
!476 = !DILocation(line: 0, scope: !442)
!477 = !DILocation(line: 79, column: 5, scope: !478)
!478 = distinct !DILexicalBlock(scope: !442, file: !2, line: 78, column: 60)
!479 = !DILocation(line: 79, column: 5, scope: !480)
