; ModuleID = 'samples/242.bc'
source_filename = "nvme.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.anon.115 = type { ptr, ptr }
%struct.spdk_log_flag = type { %struct.anon.116, ptr, i8 }
%struct.anon.116 = type { ptr, ptr }
%struct.spdk_nvme_ctrlr = type { %struct.nvme_ns_tree, i32, i8, i8, i8, i8, i8, i8, i8, i16, i16, i64, i32, i16, %struct.spdk_nvme_transport_id, %union.spdk_nvme_cap_register, %union.spdk_nvme_vs_register, i32, i64, i64, i64, %struct.anon.93, [256 x i8], [256 x i8], i32, i32, i32, i32, [8 x %struct.nvme_async_event_request], %union.pthread_mutex_t, ptr, ptr, ptr, %struct.spdk_nvme_ctrlr_data, ptr, ptr, %struct.anon.97, %struct.spdk_nvme_ctrlr_opts, i64, i64, %struct.anon.98, %struct.anon.99, i32, ptr, ptr, ptr, %union.pthread_mutex_t, ptr, %struct.anon.100, ptr, ptr, i32, ptr, i32, i64, i32, i32, ptr, ptr, ptr, i32, i32, i32, %struct.anon.101, %union.spdk_nvme_cc_register }
%struct.nvme_ns_tree = type { ptr }
%struct.spdk_nvme_transport_id = type { [33 x i8], i32, i32, [257 x i8], [33 x i8], [224 x i8], i32 }
%union.spdk_nvme_cap_register = type { i64 }
%union.spdk_nvme_vs_register = type { i32 }
%struct.anon.93 = type { ptr, ptr }

!191 = !DIEnumerator(name: "NVME_CTRLR_STATE_DISABLE_WAIT_FOR_READY_1_WAIT_FOR_CSTS", value: 10)
!192 = !DIEnumerator(name: "NVME_CTRLR_STATE_SET_EN_0", value: 11)
!193 = !DIEnumerator(name: "NVME_CTRLR_STATE_SET_EN_0_WAIT_FOR_CC", value: 12)
!194 = !DIEnumerator(name: "NVME_CTRLR_STATE_DISABLE_WAIT_FOR_READY_0", value: 13)
!195 = !DIEnumerator(name: "NVME_CTRLR_STATE_DISABLE_WAIT_FOR_READY_0_WAIT_FOR_CSTS", value: 14)
!196 = !DIEnumerator(name: "NVME_CTRLR_STATE_DISABLED", value: 15)
!197 = !DIEnumerator(name: "NVME_CTRLR_STATE_ENABLE", value: 16)
!198 = !DIEnumerator(name: "NVME_CTRLR_STATE_ENABLE_WAIT_FOR_CC", value: 17)
!199 = !DIEnumerator(name: "NVME_CTRLR_STATE_ENABLE_WAIT_FOR_READY_1", value: 18)
!200 = !DIEnumerator(name: "NVME_CTRLR_STATE_ENABLE_WAIT_FOR_READY_1_WAIT_FOR_CSTS", value: 19)
!201 = !DIEnumerator(name: "NVME_CTRLR_STATE_RESET_ADMIN_QUEUE", value: 20)
!202 = !DIEnumerator(name: "NVME_CTRLR_STATE_IDENTIFY", value: 21)
!203 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_IDENTIFY", value: 22)
!204 = !DIEnumerator(name: "NVME_CTRLR_STATE_CONFIGURE_AER", value: 23)
!205 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_CONFIGURE_AER", value: 24)
!206 = !DIEnumerator(name: "NVME_CTRLR_STATE_SET_KEEP_ALIVE_TIMEOUT", value: 25)
!207 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_KEEP_ALIVE_TIMEOUT", value: 26)
!208 = !DIEnumerator(name: "NVME_CTRLR_STATE_IDENTIFY_IOCS_SPECIFIC", value: 27)
!209 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_IDENTIFY_IOCS_SPECIFIC", value: 28)
!210 = !DIEnumerator(name: "NVME_CTRLR_STATE_GET_ZNS_CMD_EFFECTS_LOG", value: 29)
!211 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_GET_ZNS_CMD_EFFECTS_LOG", value: 30)
!212 = !DIEnumerator(name: "NVME_CTRLR_STATE_SET_NUM_QUEUES", value: 31)
!213 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_SET_NUM_QUEUES", value: 32)
!214 = !DIEnumerator(name: "NVME_CTRLR_STATE_IDENTIFY_ACTIVE_NS", value: 33)
!215 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_IDENTIFY_ACTIVE_NS", value: 34)
!216 = !DIEnumerator(name: "NVME_CTRLR_STATE_IDENTIFY_NS", value: 35)
!217 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_IDENTIFY_NS", value: 36)
!218 = !DIEnumerator(name: "NVME_CTRLR_STATE_IDENTIFY_ID_DESCS", value: 37)
!219 = !DIEnumerator(name: "NVME_CTRLR_STATE_IDENTIFY_NS_IOCS_SPECIFIC", value: 38)
!220 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_IDENTIFY_NS_IOCS_SPECIFIC", value: 39)
!221 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_IDENTIFY_ID_DESCS", value: 40)
!222 = !DIEnumerator(name: "NVME_CTRLR_STATE_SET_SUPPORTED_LOG_PAGES", value: 41)
!223 = !DIEnumerator(name: "NVME_CTRLR_STATE_SET_SUPPORTED_INTEL_LOG_PAGES", value: 42)
!224 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_SUPPORTED_INTEL_LOG_PAGES", value: 43)
!225 = !DIEnumerator(name: "NVME_CTRLR_STATE_SET_SUPPORTED_FEATURES", value: 44)
!226 = !DIEnumerator(name: "NVME_CTRLR_STATE_SET_DB_BUF_CFG", value: 45)
!227 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_DB_BUF_CFG", value: 46)
!228 = !DIEnumerator(name: "NVME_CTRLR_STATE_SET_HOST_ID", value: 47)
!229 = !DIEnumerator(name: "NVME_CTRLR_STATE_WAIT_FOR_HOST_ID", value: 48)
!230 = !DIEnumerator(name: "NVME_CTRLR_STATE_TRANSPORT_READY", value: 49)
!231 = !DIEnumerator(name: "NVME_CTRLR_STATE_READY", value: 50)
!232 = !DIEnumerator(name: "NVME_CTRLR_STATE_ERROR", value: 51)
!233 = !{!234, !155, !172}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!235 = !{!236, !280, !285, !290, !294, !299, !304, !309, !314, !316, !321, !323, !328, !333, !338, !343, !348, !353, !358, !360, !365, !370, !372, !377, !382, !384, !386, !388, !390, !392, !395, !400, !402, !407, !412, !414, !416, !418, !423, !428, !433, !435, !440, !442, !444, !446, !451, !453, !455, !460, !465, !468, !470, !472, !475, !480, !485, !487, !489, !492, !497, !502, !507, !509, !524, !0, !2095, !2097, !2103, !2105, !2108, !2111, !2113, !2115, !2117, !2120, !2125, !2127, !2130}
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "g_init_mutex", scope: !238, file: !3, line: 538, type: !249, isLocal: true, isDefinition: true)
!238 = distinct !DISubprogram(name: "nvme_driver_init", scope: !3, file: !3, line: 536, type: !239, scopeLine: 537, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !241)
!239 = !DISubroutineType(types: !240)
!240 = !{!155}
!241 = !{!242, !243, !244}
!242 = !DILocalVariable(name: "ret", scope: !238, file: !3, line: 539, type: !155)
!243 = !DILocalVariable(name: "socket_id", scope: !238, file: !3, line: 541, type: !155)
!244 = !DILocalVariable(name: "ms_waited", scope: !245, file: !3, line: 581, type: !155)
!245 = distinct !DILexicalBlock(scope: !246, file: !3, line: 580, column: 35)
!246 = distinct !DILexicalBlock(scope: !247, file: !3, line: 580, column: 7)
!247 = distinct !DILexicalBlock(scope: !248, file: !3, line: 576, column: 9)
!248 = distinct !DILexicalBlock(scope: !238, file: !3, line: 560, column: 6)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !250, line: 72, baseType: !251)
!250 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !250, line: 67, size: 320, elements: !252)
!252 = !{!253, !273, !278}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !251, file: !250, line: 69, baseType: !254, size: 320)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !255, line: 22, size: 320, elements: !256)
!255 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!256 = !{!257, !258, !259, !260, !261, !262, !264, !265}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !254, file: !255, line: 24, baseType: !155, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !254, file: !255, line: 25, baseType: !7, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !254, file: !255, line: 26, baseType: !155, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !254, file: !255, line: 28, baseType: !7, size: 32, offset: 96)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !254, file: !255, line: 32, baseType: !155, size: 32, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !254, file: !255, line: 34, baseType: !263, size: 16, offset: 160)
!263 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !254, file: !255, line: 35, baseType: !263, size: 16, offset: 176)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !254, file: !255, line: 36, baseType: !266, size: 128, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !267, line: 55, baseType: !268)
!267 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !267, line: 51, size: 128, elements: !269)
!269 = !{!270, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !268, file: !267, line: 53, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !268, file: !267, line: 54, baseType: !271, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !251, file: !250, line: 70, baseType: !274, size: 320)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 320, elements: !276)
!275 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!276 = !{!277}
!277 = !DISubrange(count: 40)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !251, file: !250, line: 71, baseType: !279, size: 64)
!279 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !3, line: 566, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 136, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 17)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !3, line: 572, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 56, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 7)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !3, line: 572, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 136, elements: !283)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !3, line: 572, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 336, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 42)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !3, line: 590, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 360, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 45)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !3, line: 595, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 288, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 36)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !3, line: 612, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 224, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 28)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !3, line: 658, type: !292, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !3, line: 658, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 392, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 49)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !3, line: 677, type: !318, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !3, line: 892, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 128, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 16)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !3, line: 892, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 232, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 29)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !3, line: 983, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 144, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 18)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !3, line: 983, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 216, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 27)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1012, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 8, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 1)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1017, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 24, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 3)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1020, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 40, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 5)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1023, type: !355, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1026, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 32, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 4)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1029, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 72, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 9)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1032, type: !287, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1035, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 272, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 34)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1035, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 200, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 25)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1039, type: !350, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1072, type: !355, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1116, type: !355, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1118, type: !355, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1120, type: !350, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1218, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 232, elements: !331)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1218, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 240, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 30)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1222, type: !287, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1224, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 192, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 24)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1228, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 168, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 21)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1231, type: !287, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1233, type: !409, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1236, type: !287, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1238, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 408, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 51)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1243, type: !425, isLocal: true, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 64, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 8)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1245, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 416, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 52)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1250, type: !367, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1252, type: !437, isLocal: true, isDefinition: true)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 424, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 53)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1257, type: !287, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1259, type: !420, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1264, type: !367, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1266, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 80, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 10)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1268, type: !425, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1270, type: !350, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1282, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 88, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 11)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1289, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 248, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 31)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1315, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 192, elements: !405)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1315, type: !379, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1336, type: !437, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1431, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 224, elements: !312)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1431, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 184, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 23)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1435, type: !482, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 48, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 6)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1436, type: !287, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1439, type: !482, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1443, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 144, elements: !336)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1456, type: !494, isLocal: true, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 152, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 19)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1458, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 104, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 13)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1462, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 96, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 12)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1557, type: !355, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "SPDK_LOG_nvme", scope: !2, file: !3, line: 1557, type: !511, isLocal: false, isDefinition: true)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_log_flag", file: !154, line: 183, size: 256, elements: !512)
!512 = !{!513, !520, !522}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tailq", scope: !511, file: !154, line: 184, baseType: !514, size: 128)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !511, file: !154, line: 184, size: 128, elements: !515)
!515 = !{!516, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !514, file: !154, line: 184, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !514, file: !154, line: 184, baseType: !519, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !511, file: !154, line: 185, baseType: !521, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !511, file: !154, line: 186, baseType: !523, size: 8, offset: 192)
!523 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "g_spdk_nvme_driver", scope: !2, file: !3, line: 14, type: !526, isLocal: false, isDefinition: true)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nvme_driver", file: !48, line: 1047, size: 640, elements: !528)
!528 = !{!529, !530, !2085, !2086, !2094}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !527, file: !48, line: 1048, baseType: !249, size: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "shared_attached_ctrlrs", scope: !527, file: !48, line: 1051, baseType: !531, size: 128, offset: 320)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !527, file: !48, line: 1051, size: 128, elements: !532)
!532 = !{!533, !2084}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !531, file: !48, line: 1051, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_nvme_ctrlr", file: !48, line: 863, size: 53824, elements: !536)
!536 = !{!537, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !772, !793, !803, !804, !805, !806, !807, !813, !815, !816, !817, !818, !819, !820, !1551, !1552, !1553, !1554, !1555, !1905, !1914, !1918, !1923, !1966, !1967, !1968, !1973, !1978, !1979, !1984, !1985, !1986, !1987, !1990, !2010, !2017, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2068}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !535, file: !48, line: 867, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nvme_ns_tree", file: !48, line: 867, size: 64, elements: !539)
!539 = !{!540}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rbh_root", scope: !538, file: !48, line: 867, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_nvme_ns", file: !48, line: 497, size: 66240, elements: !543)
!543 = !{!544, !545, !550, !551, !552, !553, !554, !555, !556, !557, !561, !562, !563, !570, !571, !572, !696, !734}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ctrlr", scope: !542, file: !48, line: 498, baseType: !534, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sector_size", scope: !542, file: !48, line: 499, baseType: !546, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !547, line: 26, baseType: !548)
!547 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !549, line: 42, baseType: !7)
!549 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!550 = !DIDerivedType(tag: DW_TAG_member, name: "extended_lba_size", scope: !542, file: !48, line: 506, baseType: !546, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "md_size", scope: !542, file: !48, line: 508, baseType: !546, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pi_type", scope: !542, file: !48, line: 509, baseType: !546, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sectors_per_max_io", scope: !542, file: !48, line: 510, baseType: !546, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sectors_per_max_io_no_md", scope: !542, file: !48, line: 511, baseType: !546, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sectors_per_stripe", scope: !542, file: !48, line: 512, baseType: !546, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !542, file: !48, line: 513, baseType: !546, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !542, file: !48, line: 514, baseType: !558, size: 16, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !547, line: 25, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !549, line: 40, baseType: !560)
!560 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !542, file: !48, line: 515, baseType: !523, size: 8, offset: 336)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "csi", scope: !542, file: !48, line: 518, baseType: !35, size: 32, offset: 352)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "id_desc_list", scope: !542, file: !48, line: 521, baseType: !564, size: 32768, offset: 384)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 32768, elements: !568)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !547, line: 24, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !549, line: 38, baseType: !567)
!567 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!568 = !{!569}
!569 = !DISubrange(count: 4096)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ana_group_id", scope: !542, file: !48, line: 523, baseType: !546, size: 32, offset: 33152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ana_state", scope: !542, file: !48, line: 524, baseType: !40, size: 32, offset: 33184)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "nsdata", scope: !542, file: !48, line: 527, baseType: !573, size: 32768, offset: 33216)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_nvme_ns_data", file: !25, line: 2532, size: 32768, elements: !574)
!574 = !{!575, !579, !580, !581, !590, !591, !597, !603, !611, !617, !622, !637, !642, !653, !654, !655, !656, !657, !658, !659, !660, !664, !665, !666, !667, !668, !669, !670, !671, !672, !674, !675, !677, !679, !680, !688, !692}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "nsze", scope: !573, file: !25, line: 2534, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !547, line: 27, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !549, line: 45, baseType: !578)
!578 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ncap", scope: !573, file: !25, line: 2537, baseType: !576, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nuse", scope: !573, file: !25, line: 2540, baseType: !576, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nsfeat", scope: !573, file: !25, line: 2560, baseType: !582, size: 8, offset: 192)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !573, file: !25, line: 2543, size: 8, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "thin_prov", scope: !582, file: !25, line: 2545, baseType: !565, size: 1, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ns_atomic_write_unit", scope: !582, file: !25, line: 2548, baseType: !565, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dealloc_or_unwritten_error", scope: !582, file: !25, line: 2551, baseType: !565, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "guid_never_reused", scope: !582, file: !25, line: 2554, baseType: !565, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "optperf", scope: !582, file: !25, line: 2557, baseType: !565, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !582, file: !25, line: 2559, baseType: !565, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nlbaf", scope: !573, file: !25, line: 2563, baseType: !565, size: 8, offset: 200)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flbas", scope: !573, file: !25, line: 2570, baseType: !592, size: 8, offset: 208)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !573, file: !25, line: 2566, size: 8, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !592, file: !25, line: 2567, baseType: !565, size: 4, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "extended", scope: !592, file: !25, line: 2568, baseType: !565, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !592, file: !25, line: 2569, baseType: !565, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mc", scope: !573, file: !25, line: 2582, baseType: !598, size: 8, offset: 216)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !573, file: !25, line: 2573, size: 8, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "extended", scope: !598, file: !25, line: 2575, baseType: !565, size: 1, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !598, file: !25, line: 2578, baseType: !565, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reserved3", scope: !598, file: !25, line: 2581, baseType: !565, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dpc", scope: !573, file: !25, line: 2600, baseType: !604, size: 8, offset: 224)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !573, file: !25, line: 2585, size: 8, elements: !605)
!605 = !{!606, !607, !608, !609, !610}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pit1", scope: !604, file: !25, line: 2587, baseType: !565, size: 1, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pit2", scope: !604, file: !25, line: 2590, baseType: !565, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pit3", scope: !604, file: !25, line: 2593, baseType: !565, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "md_start", scope: !604, file: !25, line: 2596, baseType: !565, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "md_end", scope: !604, file: !25, line: 2599, baseType: !565, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dps", scope: !573, file: !25, line: 2612, baseType: !612, size: 8, offset: 232)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !573, file: !25, line: 2603, size: 8, elements: !613)
!613 = !{!614, !615, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pit", scope: !612, file: !25, line: 2605, baseType: !565, size: 3, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "md_start", scope: !612, file: !25, line: 2609, baseType: !565, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "reserved4", scope: !612, file: !25, line: 2611, baseType: !565, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nmic", scope: !573, file: !25, line: 2618, baseType: !618, size: 8, offset: 240)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !573, file: !25, line: 2615, size: 8, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "can_share", scope: !618, file: !25, line: 2616, baseType: !565, size: 1, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !618, file: !25, line: 2617, baseType: !565, size: 7, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nsrescap", scope: !573, file: !25, line: 2648, baseType: !623, size: 8, offset: 248)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !573, file: !25, line: 2621, size: 8, elements: !624)
!624 = !{!625, !636}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rescap", scope: !623, file: !25, line: 2646, baseType: !626, size: 8)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !623, file: !25, line: 2622, size: 8, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "persist", scope: !626, file: !25, line: 2624, baseType: !565, size: 1, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "write_exclusive", scope: !626, file: !25, line: 2627, baseType: !565, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "exclusive_access", scope: !626, file: !25, line: 2630, baseType: !565, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "write_exclusive_reg_only", scope: !626, file: !25, line: 2633, baseType: !565, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "exclusive_access_reg_only", scope: !626, file: !25, line: 2636, baseType: !565, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "write_exclusive_all_reg", scope: !626, file: !25, line: 2639, baseType: !565, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "exclusive_access_all_reg", scope: !626, file: !25, line: 2642, baseType: !565, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_existing_key", scope: !626, file: !25, line: 2645, baseType: !565, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !623, file: !25, line: 2647, baseType: !565, size: 8)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fpi", scope: !573, file: !25, line: 2653, baseType: !638, size: 8, offset: 256)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !573, file: !25, line: 2650, size: 8, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "percentage_remaining", scope: !638, file: !25, line: 2651, baseType: !565, size: 7, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fpi_supported", scope: !638, file: !25, line: 2652, baseType: !565, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dlfeat", scope: !573, file: !25, line: 2682, baseType: !643, size: 8, offset: 264)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !573, file: !25, line: 2656, size: 8, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !643, file: !25, line: 2657, baseType: !565, size: 8)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !643, file: !25, line: 2681, baseType: !647, size: 8)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !643, file: !25, line: 2658, size: 8, elements: !648)
!648 = !{!649, !650, !651, !652}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "read_value", scope: !647, file: !25, line: 2668, baseType: !565, size: 3, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "write_zero_deallocate", scope: !647, file: !25, line: 2671, baseType: !565, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "guard_value", scope: !647, file: !25, line: 2678, baseType: !565, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !647, file: !25, line: 2680, baseType: !565, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nawun", scope: !573, file: !25, line: 2685, baseType: !558, size: 16, offset: 272)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "nawupf", scope: !573, file: !25, line: 2688, baseType: !558, size: 16, offset: 288)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nacwu", scope: !573, file: !25, line: 2691, baseType: !558, size: 16, offset: 304)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nabsn", scope: !573, file: !25, line: 2694, baseType: !558, size: 16, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nabo", scope: !573, file: !25, line: 2697, baseType: !558, size: 16, offset: 336)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nabspf", scope: !573, file: !25, line: 2700, baseType: !558, size: 16, offset: 352)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "noiob", scope: !573, file: !25, line: 2703, baseType: !558, size: 16, offset: 368)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nvmcap", scope: !573, file: !25, line: 2706, baseType: !661, size: 128, offset: 384)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 128, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 2)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "npwg", scope: !573, file: !25, line: 2709, baseType: !558, size: 16, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "npwa", scope: !573, file: !25, line: 2712, baseType: !558, size: 16, offset: 528)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "npdg", scope: !573, file: !25, line: 2715, baseType: !558, size: 16, offset: 544)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "npda", scope: !573, file: !25, line: 2718, baseType: !558, size: 16, offset: 560)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "nows", scope: !573, file: !25, line: 2721, baseType: !558, size: 16, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mssrl", scope: !573, file: !25, line: 2724, baseType: !558, size: 16, offset: 592)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mcl", scope: !573, file: !25, line: 2727, baseType: !546, size: 32, offset: 608)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "msrc", scope: !573, file: !25, line: 2730, baseType: !565, size: 8, offset: 640)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "reserved64", scope: !573, file: !25, line: 2732, baseType: !673, size: 88, offset: 648)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 88, elements: !458)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "anagrpid", scope: !573, file: !25, line: 2735, baseType: !546, size: 32, offset: 736)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "reserved96", scope: !573, file: !25, line: 2737, baseType: !676, size: 64, offset: 768)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 64, elements: !426)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nguid", scope: !573, file: !25, line: 2740, baseType: !678, size: 128, offset: 832)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 128, elements: !326)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "eui64", scope: !573, file: !25, line: 2743, baseType: !576, size: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lbaf", scope: !573, file: !25, line: 2757, baseType: !681, size: 512, offset: 1024)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 512, elements: !326)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !573, file: !25, line: 2746, size: 32, elements: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ms", scope: !682, file: !25, line: 2748, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lbads", scope: !682, file: !25, line: 2751, baseType: !546, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rp", scope: !682, file: !25, line: 2754, baseType: !546, size: 2, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "reserved6", scope: !682, file: !25, line: 2756, baseType: !546, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reserved6", scope: !573, file: !25, line: 2759, baseType: !689, size: 1536, offset: 1536)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 1536, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_specific", scope: !573, file: !25, line: 2761, baseType: !693, size: 29696, offset: 3072)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 29696, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 3712)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "nsdata_zns", scope: !542, file: !48, line: 530, baseType: !697, size: 64, offset: 65984)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_nvme_zns_ns_data", file: !25, line: 2765, size: 32768, elements: !699)
!699 = !{!700, !706, !711, !712, !713, !714, !715, !719, !726, !730}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "zoc", scope: !698, file: !25, line: 2771, baseType: !701, size: 16)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !698, file: !25, line: 2767, size: 16, elements: !702)
!702 = !{!703, !704, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "variable_zone_capacity", scope: !701, file: !25, line: 2768, baseType: !558, size: 1, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "zone_active_excursions", scope: !701, file: !25, line: 2769, baseType: !558, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "reserved0", scope: !701, file: !25, line: 2770, baseType: !558, size: 14, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ozcs", scope: !698, file: !25, line: 2777, baseType: !707, size: 16, offset: 16)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !698, file: !25, line: 2774, size: 16, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "read_across_zone_boundaries", scope: !707, file: !25, line: 2775, baseType: !558, size: 1, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reserved0", scope: !707, file: !25, line: 2776, baseType: !558, size: 15, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mar", scope: !698, file: !25, line: 2780, baseType: !546, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "mor", scope: !698, file: !25, line: 2783, baseType: !546, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rrl", scope: !698, file: !25, line: 2786, baseType: !546, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "frl", scope: !698, file: !25, line: 2789, baseType: !546, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "reserved20", scope: !698, file: !25, line: 2791, baseType: !716, size: 22368, offset: 160)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 22368, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 2796)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lbafe", scope: !698, file: !25, line: 2802, baseType: !720, size: 2048, offset: 22528)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 2048, elements: !326)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !698, file: !25, line: 2794, size: 128, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "zsze", scope: !721, file: !25, line: 2796, baseType: !576, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "zdes", scope: !721, file: !25, line: 2799, baseType: !576, size: 8, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reserved15", scope: !721, file: !25, line: 2801, baseType: !576, size: 56, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "reserved3072", scope: !698, file: !25, line: 2804, baseType: !727, size: 6144, offset: 24576)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 6144, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_specific", scope: !698, file: !25, line: 2806, baseType: !731, size: 2048, offset: 30720)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 2048, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !542, file: !48, line: 532, baseType: !735, size: 192, offset: 66048)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !542, file: !48, line: 532, size: 192, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !735, file: !48, line: 532, baseType: !541, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !735, file: !48, line: 532, baseType: !541, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !735, file: !48, line: 532, baseType: !541, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "active_ns_count", scope: !535, file: !48, line: 870, baseType: !546, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "is_removed", scope: !535, file: !48, line: 872, baseType: !523, size: 8, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "is_resetting", scope: !535, file: !48, line: 874, baseType: !523, size: 8, offset: 104)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "is_failed", scope: !535, file: !48, line: 876, baseType: !523, size: 8, offset: 112)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "is_destructed", scope: !535, file: !48, line: 878, baseType: !523, size: 8, offset: 120)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_enabled", scope: !535, file: !48, line: 880, baseType: !523, size: 8, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_reset", scope: !535, file: !48, line: 886, baseType: !523, size: 8, offset: 136)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "is_disconnecting", scope: !535, file: !48, line: 888, baseType: !523, size: 8, offset: 144)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "max_sges", scope: !535, file: !48, line: 890, baseType: !558, size: 16, offset: 160)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cntlid", scope: !535, file: !48, line: 892, baseType: !558, size: 16, offset: 176)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !535, file: !48, line: 895, baseType: !576, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ioccsz_bytes", scope: !535, file: !48, line: 898, baseType: !546, size: 32, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "icdoff", scope: !535, file: !48, line: 901, baseType: !558, size: 16, offset: 288)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "trid", scope: !535, file: !48, line: 905, baseType: !754, size: 4512, offset: 320)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_nvme_transport_id", file: !6, line: 432, size: 4512, elements: !755)
!755 = !{!756, !760, !761, !762, !766, !767, !771}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "trstring", scope: !754, file: !6, line: 436, baseType: !757, size: 264)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 264, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 33)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "trtype", scope: !754, file: !6, line: 441, baseType: !5, size: 32, offset: 288)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "adrfam", scope: !754, file: !6, line: 448, baseType: !16, size: 32, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "traddr", scope: !754, file: !6, line: 458, baseType: !763, size: 2056, offset: 352)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 2056, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 257)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "trsvcid", scope: !754, file: !6, line: 465, baseType: !757, size: 264, offset: 2408)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "subnqn", scope: !754, file: !6, line: 470, baseType: !768, size: 1792, offset: 2672)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 1792, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 224)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !754, file: !6, line: 477, baseType: !155, size: 32, offset: 4480)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !535, file: !48, line: 907, baseType: !773, size: 64, offset: 4864)
!773 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_cap_register", file: !25, line: 61, size: 64, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !773, file: !25, line: 62, baseType: !576, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !773, file: !25, line: 102, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !773, file: !25, line: 63, size: 64, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mqes", scope: !777, file: !25, line: 65, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "cqr", scope: !777, file: !25, line: 68, baseType: !546, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ams", scope: !777, file: !25, line: 71, baseType: !546, size: 2, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !777, file: !25, line: 73, baseType: !546, size: 5, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !777, file: !25, line: 76, baseType: !546, size: 8, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dstrd", scope: !777, file: !25, line: 79, baseType: !546, size: 4, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nssrs", scope: !777, file: !25, line: 82, baseType: !546, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "css", scope: !777, file: !25, line: 85, baseType: !546, size: 8, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !777, file: !25, line: 88, baseType: !546, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !777, file: !25, line: 90, baseType: !546, size: 2, offset: 46, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mpsmin", scope: !777, file: !25, line: 93, baseType: !546, size: 4, offset: 48, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mpsmax", scope: !777, file: !25, line: 96, baseType: !546, size: 4, offset: 52, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pmrs", scope: !777, file: !25, line: 99, baseType: !546, size: 1, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reserved3", scope: !777, file: !25, line: 101, baseType: !546, size: 7, offset: 57, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "vs", scope: !535, file: !48, line: 908, baseType: !794, size: 32, offset: 4928)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_vs_register", file: !25, line: 205, size: 32, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !794, file: !25, line: 206, baseType: !546, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !794, file: !25, line: 214, baseType: !798, size: 32)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !794, file: !25, line: 207, size: 32, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ter", scope: !798, file: !25, line: 209, baseType: !546, size: 8, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mnr", scope: !798, file: !25, line: 211, baseType: !546, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mjr", scope: !798, file: !25, line: 213, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !535, file: !48, line: 910, baseType: !155, size: 32, offset: 4960)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "state_timeout_tsc", scope: !535, file: !48, line: 911, baseType: !576, size: 64, offset: 4992)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next_keep_alive_tick", scope: !535, file: !48, line: 913, baseType: !576, size: 64, offset: 5056)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_interval_ticks", scope: !535, file: !48, line: 914, baseType: !576, size: 64, offset: 5120)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tailq", scope: !535, file: !48, line: 916, baseType: !808, size: 128, offset: 5184)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !535, file: !48, line: 916, size: 128, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !808, file: !48, line: 916, baseType: !534, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !808, file: !48, line: 916, baseType: !812, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "log_page_supported", scope: !535, file: !48, line: 919, baseType: !814, size: 2048, offset: 5312)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 2048, elements: !732)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "feature_supported", scope: !535, file: !48, line: 922, baseType: !814, size: 2048, offset: 7360)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "max_xfer_size", scope: !535, file: !48, line: 925, baseType: !546, size: 32, offset: 9408)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "min_page_size", scope: !535, file: !48, line: 928, baseType: !546, size: 32, offset: 9440)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !535, file: !48, line: 931, baseType: !546, size: 32, offset: 9472)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "num_aers", scope: !535, file: !48, line: 933, baseType: !546, size: 32, offset: 9504)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "aer", scope: !535, file: !48, line: 934, baseType: !821, size: 2048, offset: 9536)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 2048, elements: !426)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nvme_async_event_request", file: !48, line: 394, size: 256, elements: !823)
!823 = !{!824, !825, !1550}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ctrlr", scope: !822, file: !48, line: 395, baseType: !534, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !822, file: !48, line: 396, baseType: !826, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nvme_request", file: !48, line: 273, size: 2176, elements: !828)
!828 = !{!829, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1255, !1282, !1283, !1287, !1531, !1532, !1533, !1534, !1535, !1540, !1545, !1546, !1547, !1548, !1549}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !827, file: !48, line: 274, baseType: !830, size: 512)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_nvme_cmd", file: !25, line: 1256, size: 512, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !878, !972, !1187, !1208, !1209, !1210}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "opc", scope: !830, file: !25, line: 1258, baseType: !558, size: 8, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fuse", scope: !830, file: !25, line: 1259, baseType: !558, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !830, file: !25, line: 1260, baseType: !558, size: 4, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "psdt", scope: !830, file: !25, line: 1261, baseType: !558, size: 2, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cid", scope: !830, file: !25, line: 1262, baseType: !558, size: 16, offset: 16)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "nsid", scope: !830, file: !25, line: 1265, baseType: !546, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !830, file: !25, line: 1268, baseType: !546, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd3", scope: !830, file: !25, line: 1269, baseType: !546, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mptr", scope: !830, file: !25, line: 1272, baseType: !576, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dptr", scope: !830, file: !25, line: 1282, baseType: !842, size: 128, offset: 192)
!842 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !830, file: !25, line: 1275, size: 128, elements: !843)
!843 = !{!844, !849}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "prp", scope: !842, file: !25, line: 1279, baseType: !845, size: 128)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !842, file: !25, line: 1276, size: 128, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "prp1", scope: !845, file: !25, line: 1277, baseType: !576, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "prp2", scope: !845, file: !25, line: 1278, baseType: !576, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sgl1", scope: !842, file: !25, line: 1281, baseType: !850, size: 128)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_nvme_sgl_descriptor", file: !25, line: 610, size: 128, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !850, file: !25, line: 611, baseType: !576, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, scope: !850, file: !25, line: 612, baseType: !854, size: 64, offset: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !850, file: !25, line: 612, size: 64, elements: !855)
!855 = !{!856, !863, !871}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !854, file: !25, line: 617, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !854, file: !25, line: 613, size: 64, elements: !858)
!858 = !{!859, !861, !862}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !857, file: !25, line: 614, baseType: !860, size: 56)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 56, elements: !288)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !857, file: !25, line: 615, baseType: !565, size: 4, offset: 56, flags: DIFlagBitField, extraData: i64 56)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !857, file: !25, line: 616, baseType: !565, size: 4, offset: 60, flags: DIFlagBitField, extraData: i64 56)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "unkeyed", scope: !854, file: !25, line: 624, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !854, file: !25, line: 619, size: 64, elements: !865)
!865 = !{!866, !867, !869, !870}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !864, file: !25, line: 620, baseType: !546, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !864, file: !25, line: 621, baseType: !868, size: 24, offset: 32)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 24, elements: !351)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !864, file: !25, line: 622, baseType: !565, size: 4, offset: 56, flags: DIFlagBitField, extraData: i64 56)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !864, file: !25, line: 623, baseType: !565, size: 4, offset: 60, flags: DIFlagBitField, extraData: i64 56)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "keyed", scope: !854, file: !25, line: 631, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !854, file: !25, line: 626, size: 64, elements: !873)
!873 = !{!874, !875, !876, !877}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !872, file: !25, line: 627, baseType: !576, size: 24, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !872, file: !25, line: 628, baseType: !576, size: 32, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !872, file: !25, line: 629, baseType: !576, size: 4, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !872, file: !25, line: 630, baseType: !576, size: 4, offset: 60, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, scope: !830, file: !25, line: 1285, baseType: !879, size: 32, offset: 320)
!879 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !830, file: !25, line: 1285, size: 32, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "cdw10", scope: !879, file: !25, line: 1286, baseType: !546, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "cdw10_bits", scope: !879, file: !25, line: 1287, baseType: !883, size: 32)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_cmd_cdw10", file: !25, line: 1028, size: 32, elements: !884)
!884 = !{!885, !886, !892, !900, !905, !912, !917, !922, !928, !934, !939, !944, !949, !956, !964}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !883, file: !25, line: 1029, baseType: !546, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "identify", scope: !883, file: !25, line: 1036, baseType: !887, size: 32)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1030, size: 32, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "cns", scope: !887, file: !25, line: 1032, baseType: !546, size: 8, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !887, file: !25, line: 1033, baseType: !546, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "cntid", scope: !887, file: !25, line: 1035, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "get_log_page", scope: !883, file: !25, line: 1048, baseType: !893, size: 32)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1038, size: 32, elements: !894)
!894 = !{!895, !896, !897, !898, !899}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lid", scope: !893, file: !25, line: 1040, baseType: !546, size: 8, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lsp", scope: !893, file: !25, line: 1042, baseType: !546, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !893, file: !25, line: 1043, baseType: !546, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rae", scope: !893, file: !25, line: 1045, baseType: !546, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "numdl", scope: !893, file: !25, line: 1047, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "abort", scope: !883, file: !25, line: 1055, baseType: !901, size: 32)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1050, size: 32, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "sqid", scope: !901, file: !25, line: 1052, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "cid", scope: !901, file: !25, line: 1054, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "sec_send_recv", scope: !883, file: !25, line: 1066, baseType: !906, size: 32)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1057, size: 32, elements: !907)
!907 = !{!908, !909, !910, !911}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "nssf", scope: !906, file: !25, line: 1059, baseType: !546, size: 8, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "spsp0", scope: !906, file: !25, line: 1061, baseType: !546, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "spsp1", scope: !906, file: !25, line: 1063, baseType: !546, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "secp", scope: !906, file: !25, line: 1065, baseType: !546, size: 8, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "create_io_q", scope: !883, file: !25, line: 1073, baseType: !913, size: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1068, size: 32, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "qid", scope: !913, file: !25, line: 1070, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "qsize", scope: !913, file: !25, line: 1072, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "delete_io_q", scope: !883, file: !25, line: 1079, baseType: !918, size: 32)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1075, size: 32, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "qid", scope: !918, file: !25, line: 1077, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !918, file: !25, line: 1078, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "get_features", scope: !883, file: !25, line: 1087, baseType: !923, size: 32)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1081, size: 32, elements: !924)
!924 = !{!925, !926, !927}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !923, file: !25, line: 1083, baseType: !546, size: 8, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !923, file: !25, line: 1085, baseType: !546, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !923, file: !25, line: 1086, baseType: !546, size: 21, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "set_features", scope: !883, file: !25, line: 1095, baseType: !929, size: 32)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1089, size: 32, elements: !930)
!930 = !{!931, !932, !933}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !929, file: !25, line: 1091, baseType: !546, size: 8, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !929, file: !25, line: 1092, baseType: !546, size: 23, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "sv", scope: !929, file: !25, line: 1094, baseType: !546, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ns_attach", scope: !883, file: !25, line: 1101, baseType: !935, size: 32)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1097, size: 32, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !935, file: !25, line: 1099, baseType: !546, size: 4, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !935, file: !25, line: 1100, baseType: !546, size: 28, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ns_manage", scope: !883, file: !25, line: 1107, baseType: !940, size: 32)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1103, size: 32, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !940, file: !25, line: 1105, baseType: !546, size: 4, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !940, file: !25, line: 1106, baseType: !546, size: 28, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dsm", scope: !883, file: !25, line: 1113, baseType: !945, size: 32)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1109, size: 32, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !945, file: !25, line: 1111, baseType: !546, size: 8, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !945, file: !25, line: 1112, baseType: !546, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "resv_register", scope: !883, file: !25, line: 1123, baseType: !950, size: 32)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1115, size: 32, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rrega", scope: !950, file: !25, line: 1117, baseType: !546, size: 3, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "iekey", scope: !950, file: !25, line: 1119, baseType: !546, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !950, file: !25, line: 1120, baseType: !546, size: 26, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cptpl", scope: !950, file: !25, line: 1122, baseType: !546, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "resv_release", scope: !883, file: !25, line: 1134, baseType: !957, size: 32)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1125, size: 32, elements: !958)
!958 = !{!959, !960, !961, !962, !963}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "rrela", scope: !957, file: !25, line: 1127, baseType: !546, size: 3, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "iekey", scope: !957, file: !25, line: 1129, baseType: !546, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !957, file: !25, line: 1130, baseType: !546, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !957, file: !25, line: 1132, baseType: !546, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !957, file: !25, line: 1133, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "resv_acquire", scope: !883, file: !25, line: 1145, baseType: !965, size: 32)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !25, line: 1136, size: 32, elements: !966)
!966 = !{!967, !968, !969, !970, !971}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "racqa", scope: !965, file: !25, line: 1138, baseType: !546, size: 3, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "iekey", scope: !965, file: !25, line: 1140, baseType: !546, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !965, file: !25, line: 1141, baseType: !546, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !965, file: !25, line: 1143, baseType: !546, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !965, file: !25, line: 1144, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, scope: !830, file: !25, line: 1290, baseType: !973, size: 32, offset: 352)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !830, file: !25, line: 1290, size: 32, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cdw11", scope: !973, file: !25, line: 1291, baseType: !546, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "cdw11_bits", scope: !973, file: !25, line: 1292, baseType: !977, size: 32)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_cmd_cdw11", file: !25, line: 1149, size: 32, elements: !978)
!978 = !{!979, !980, !986, !993, !1000, !1006, !1011, !1016, !1028, !1038, !1047, !1058, !1068, !1077, !1086, !1096, !1106, !1115, !1142, !1150, !1159, !1171, !1180}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !977, file: !25, line: 1150, baseType: !546, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "identify", scope: !977, file: !25, line: 1158, baseType: !981, size: 32)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !977, file: !25, line: 1152, size: 32, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "nvmsetid", scope: !981, file: !25, line: 1154, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !981, file: !25, line: 1155, baseType: !546, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "csi", scope: !981, file: !25, line: 1157, baseType: !546, size: 8, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "create_io_sq", scope: !977, file: !25, line: 1168, baseType: !987, size: 32)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !977, file: !25, line: 1160, size: 32, elements: !988)
!988 = !{!989, !990, !991, !992}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !987, file: !25, line: 1162, baseType: !546, size: 1, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "qprio", scope: !987, file: !25, line: 1164, baseType: !546, size: 2, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !987, file: !25, line: 1165, baseType: !546, size: 13, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "cqid", scope: !987, file: !25, line: 1167, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "create_io_cq", scope: !977, file: !25, line: 1178, baseType: !994, size: 32)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !977, file: !25, line: 1170, size: 32, elements: !995)
!995 = !{!996, !997, !998, !999}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !994, file: !25, line: 1172, baseType: !546, size: 1, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ien", scope: !994, file: !25, line: 1174, baseType: !546, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !994, file: !25, line: 1175, baseType: !546, size: 14, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !994, file: !25, line: 1177, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !977, file: !25, line: 1187, baseType: !1001, size: 32)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !977, file: !25, line: 1180, size: 32, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "doper", scope: !1001, file: !25, line: 1182, baseType: !546, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !1001, file: !25, line: 1184, baseType: !546, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "dspec", scope: !1001, file: !25, line: 1186, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "get_log_page", scope: !977, file: !25, line: 1194, baseType: !1007, size: 32)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !977, file: !25, line: 1189, size: 32, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "numdu", scope: !1007, file: !25, line: 1191, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "lsid", scope: !1007, file: !25, line: 1193, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "resv_report", scope: !977, file: !25, line: 1200, baseType: !1012, size: 32)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !977, file: !25, line: 1196, size: 32, elements: !1013)
!1013 = !{!1014, !1015}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "eds", scope: !1012, file: !25, line: 1198, baseType: !546, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1012, file: !25, line: 1199, baseType: !546, size: 31, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "feat_arbitration", scope: !977, file: !25, line: 1202, baseType: !1017, size: 32)
!1017 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_arbitration", file: !25, line: 692, size: 32, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1017, file: !25, line: 693, baseType: !546, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1017, file: !25, line: 708, baseType: !1021, size: 32)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1017, file: !25, line: 694, size: 32, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ab", scope: !1021, file: !25, line: 696, baseType: !546, size: 3, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1021, file: !25, line: 698, baseType: !546, size: 5, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lpw", scope: !1021, file: !25, line: 701, baseType: !546, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "mpw", scope: !1021, file: !25, line: 704, baseType: !546, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "hpw", scope: !1021, file: !25, line: 707, baseType: !546, size: 8, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "feat_power_management", scope: !977, file: !25, line: 1203, baseType: !1029, size: 32)
!1029 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_power_management", file: !25, line: 717, size: 32, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1029, file: !25, line: 718, baseType: !546, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1029, file: !25, line: 727, baseType: !1033, size: 32)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1029, file: !25, line: 719, size: 32, elements: !1034)
!1034 = !{!1035, !1036, !1037}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !1033, file: !25, line: 721, baseType: !546, size: 5, flags: DIFlagBitField, extraData: i64 0)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "wh", scope: !1033, file: !25, line: 724, baseType: !546, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1033, file: !25, line: 726, baseType: !546, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "feat_lba_range_type", scope: !977, file: !25, line: 1204, baseType: !1039, size: 32)
!1039 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_lba_range_type", file: !25, line: 734, size: 32, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1039, file: !25, line: 735, baseType: !546, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1039, file: !25, line: 741, baseType: !1043, size: 32)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1039, file: !25, line: 736, size: 32, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1043, file: !25, line: 738, baseType: !546, size: 6, flags: DIFlagBitField, extraData: i64 0)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1043, file: !25, line: 740, baseType: !546, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "feat_temp_threshold", scope: !977, file: !25, line: 1205, baseType: !1048, size: 32)
!1048 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_temperature_threshold", file: !25, line: 748, size: 32, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1048, file: !25, line: 749, baseType: !546, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1048, file: !25, line: 761, baseType: !1052, size: 32)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1048, file: !25, line: 750, size: 32, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "tmpth", scope: !1052, file: !25, line: 752, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "tmpsel", scope: !1052, file: !25, line: 755, baseType: !546, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "thsel", scope: !1052, file: !25, line: 758, baseType: !546, size: 2, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1052, file: !25, line: 760, baseType: !546, size: 10, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "feat_error_recovery", scope: !977, file: !25, line: 1206, baseType: !1059, size: 32)
!1059 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_error_recovery", file: !25, line: 768, size: 32, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1059, file: !25, line: 769, baseType: !546, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1059, file: !25, line: 778, baseType: !1063, size: 32)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1059, file: !25, line: 770, size: 32, elements: !1064)
!1064 = !{!1065, !1066, !1067}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "tler", scope: !1063, file: !25, line: 772, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "dulbe", scope: !1063, file: !25, line: 775, baseType: !546, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1063, file: !25, line: 777, baseType: !546, size: 15, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "feat_volatile_write_cache", scope: !977, file: !25, line: 1207, baseType: !1069, size: 32)
!1069 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_volatile_write_cache", file: !25, line: 785, size: 32, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1069, file: !25, line: 786, baseType: !546, size: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1069, file: !25, line: 792, baseType: !1073, size: 32)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1069, file: !25, line: 787, size: 32, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "wce", scope: !1073, file: !25, line: 789, baseType: !546, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1073, file: !25, line: 791, baseType: !546, size: 31, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "feat_num_of_queues", scope: !977, file: !25, line: 1208, baseType: !1078, size: 32)
!1078 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_number_of_queues", file: !25, line: 799, size: 32, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1078, file: !25, line: 800, baseType: !546, size: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1078, file: !25, line: 807, baseType: !1082, size: 32)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1078, file: !25, line: 801, size: 32, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nsqr", scope: !1082, file: !25, line: 803, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ncqr", scope: !1082, file: !25, line: 806, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "feat_interrupt_coalescing", scope: !977, file: !25, line: 1209, baseType: !1087, size: 32)
!1087 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_interrupt_coalescing", file: !25, line: 814, size: 32, elements: !1088)
!1088 = !{!1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1087, file: !25, line: 815, baseType: !546, size: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1087, file: !25, line: 824, baseType: !1091, size: 32)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1087, file: !25, line: 816, size: 32, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "thr", scope: !1091, file: !25, line: 818, baseType: !546, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1091, file: !25, line: 821, baseType: !546, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1091, file: !25, line: 823, baseType: !546, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "feat_interrupt_vector_configuration", scope: !977, file: !25, line: 1210, baseType: !1097, size: 32)
!1097 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_interrupt_vector_configuration", file: !25, line: 831, size: 32, elements: !1098)
!1098 = !{!1099, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1097, file: !25, line: 832, baseType: !546, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1097, file: !25, line: 841, baseType: !1101, size: 32)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1097, file: !25, line: 833, size: 32, elements: !1102)
!1102 = !{!1103, !1104, !1105}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !1101, file: !25, line: 835, baseType: !546, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !1101, file: !25, line: 838, baseType: !546, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1101, file: !25, line: 840, baseType: !546, size: 15, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "feat_write_atomicity", scope: !977, file: !25, line: 1211, baseType: !1107, size: 32)
!1107 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_write_atomicity", file: !25, line: 849, size: 32, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1107, file: !25, line: 850, baseType: !546, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1107, file: !25, line: 856, baseType: !1111, size: 32)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1107, file: !25, line: 851, size: 32, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "dn", scope: !1111, file: !25, line: 853, baseType: !546, size: 1, flags: DIFlagBitField, extraData: i64 0)
