; ModuleID = 'samples/244.bc'
source_filename = "./src/libxsmm_dnn_fusedbatchnorm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.libxsmm_dnn_fusedbatchnorm_desc = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.libxsmm_dnn_fusedbatchnorm = type { %struct.libxsmm_dnn_fusedbatchnorm_desc, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i64, ptr }
%struct.libxsmm_dnn_tensor_datalayout = type { ptr, ptr, i32, i32, i32, i32 }
%struct.libxsmm_dnn_tensor = type { ptr, ptr, i8 }

@libxsmm_ninit = external global i32, align 4

; Function Attrs: nounwind uwtable
define ptr @libxsmm_dnn_create_fusedbatchnorm(ptr noundef byval(%struct.libxsmm_dnn_fusedbatchnorm_desc) align 8 %fusedbatchnorm_desc, ptr noundef %status) #0 !dbg !235 {
entry:
  %retval = alloca ptr, align 8
  %status.addr = alloca ptr, align 8
  %handle = alloca ptr, align 8
  %lpb = alloca i32, align 4
  %cleanup.dest.slot = alloca i32, align 4
  tail call void @llvm.dbg.declare(metadata ptr %fusedbatchnorm_desc, metadata !242, metadata !DIExpression()), !dbg !246
  store ptr %status, ptr %status.addr, align 8, !tbaa !247
  tail call void @llvm.dbg.declare(metadata ptr %status.addr, metadata !243, metadata !DIExpression()), !dbg !251
  call void @llvm.lifetime.start.p0(i64 8, ptr %handle) #8, !dbg !252

!84 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_FILTER_TRANS", value: 11)
!85 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_FILTER", value: 12)
!86 = !DIEnumerator(name: "LIBXSMM_DNN_MASTER_FILTER", value: 13)
!87 = !DIEnumerator(name: "LIBXSMM_DNN_FILTER", value: 14)
!88 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_CHANNEL_BIAS", value: 15)
!89 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_CHANNEL_BIAS", value: 16)
!90 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_BIAS", value: 17)
!91 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_CHANNEL_BETA", value: 18)
!92 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_CHANNEL_BETA", value: 19)
!93 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_BETA", value: 20)
!94 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_CHANNEL_GAMMA", value: 21)
!95 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_CHANNEL_GAMMA", value: 22)
!96 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_GAMMA", value: 23)
!97 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_EXPECTVAL", value: 24)
!98 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_RCPSTDDEV", value: 25)
!99 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_VARIANCE", value: 26)
!100 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_SCALAR", value: 27)
!101 = !DIEnumerator(name: "LIBXSMM_DNN_LABEL", value: 28)
!102 = !DIEnumerator(name: "LIBXSMM_DNN_BATCH_STATS", value: 29)
!103 = !DIEnumerator(name: "LIBXSMM_DNN_MAX_STATS_FWD", value: 30)
!104 = !DIEnumerator(name: "LIBXSMM_DNN_MAX_STATS_BWD", value: 31)
!105 = !DIEnumerator(name: "LIBXSMM_DNN_MAX_STATS_UPD", value: 32)
!106 = !DIEnumerator(name: "LIBXSMM_DNN_POOLING_MASK", value: 33)
!107 = !DIEnumerator(name: "LIBXSMM_DNN_RELU_MASK", value: 34)
!108 = !DIEnumerator(name: "LIBXSMM_DNN_TENSOR", value: 35)
!109 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_INPUT", value: 36)
!110 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_CS_PREV", value: 37)
!111 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_HIDDEN_STATE_PREV", value: 38)
!112 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_WEIGHT", value: 39)
!113 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_RECUR_WEIGHT", value: 40)
!114 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_WEIGHT_TRANS", value: 41)
!115 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_RECUR_WEIGHT_TRANS", value: 42)
!116 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_BIAS", value: 43)
!117 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_CS", value: 44)
!118 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_HIDDEN_STATE", value: 45)
!119 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_INPUT", value: 46)
!120 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_CS_PREV", value: 47)
!121 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_HIDDEN_STATE_PREV", value: 48)
!122 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_WEIGHT", value: 49)
!123 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_RECUR_WEIGHT", value: 50)
!124 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_BIAS", value: 51)
!125 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_CS", value: 52)
!126 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_HIDDEN_STATE", value: 53)
!127 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_INTERNAL_I", value: 54)
!128 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_INTERNAL_F", value: 55)
!129 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_INTERNAL_O", value: 56)
!130 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_INTERNAL_CI", value: 57)
!131 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_INTERNAL_CO", value: 58)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "libxsmm_dnn_compute_kind", file: !133, line: 71, baseType: !5, size: 32, elements: !134)
!133 = !DIFile(filename: "include/libxsmm_dnn.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "a78420eba4319a1d6474d35f9855f3e6")
!134 = !{!135, !136, !137, !138, !139}
!135 = !DIEnumerator(name: "LIBXSMM_DNN_COMPUTE_KIND_FWD", value: 0)
!136 = !DIEnumerator(name: "LIBXSMM_DNN_COMPUTE_KIND_BWD", value: 1)
!137 = !DIEnumerator(name: "LIBXSMM_DNN_COMPUTE_KIND_UPD", value: 2)
!138 = !DIEnumerator(name: "LIBXSMM_DNN_COMPUTE_KIND_BWDUPD", value: 3)
!139 = !DIEnumerator(name: "LIBXSMM_DNN_COMPUTE_KIND_ALL", value: 4)
!140 = !{!141, !225, !180, !185, !188, !227, !195, !175}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_fusedbatchnorm", file: !143, line: 18, baseType: !144)
!143 = !DIFile(filename: "include/libxsmm_dnn_fusedbatchnorm.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "1eccab476e2fe06d92893d9e88a470f4")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_dnn_fusedbatchnorm", file: !145, line: 512, size: 1792, elements: !146)
!145 = !DIFile(filename: "./src/libxsmm_main.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "327f1483fde3a8c227e86e12c0467dc8")
!146 = !{!147, !174, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !216, !217, !218, !219, !220, !224}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !144, file: !145, line: 513, baseType: !148, size: 576)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_fusedbatchnorm_desc", file: !4, line: 500, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_dnn_fusedbatchnorm_desc", file: !4, line: 481, size: 576, elements: !150)
!150 = !{!151, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !166, !167, !168, !170, !172}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "partN", scope: !149, file: !4, line: 482, baseType: !152, size: 32)
!152 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fullN", scope: !149, file: !4, line: 483, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !149, file: !4, line: 484, baseType: !152, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "H", scope: !149, file: !4, line: 485, baseType: !152, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !149, file: !4, line: 486, baseType: !152, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !149, file: !4, line: 487, baseType: !152, size: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !149, file: !4, line: 488, baseType: !152, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pad_h_in", scope: !149, file: !4, line: 489, baseType: !152, size: 32, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pad_w_in", scope: !149, file: !4, line: 490, baseType: !152, size: 32, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pad_h_out", scope: !149, file: !4, line: 491, baseType: !152, size: 32, offset: 288)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pad_w_out", scope: !149, file: !4, line: 492, baseType: !152, size: 32, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !149, file: !4, line: 493, baseType: !152, size: 32, offset: 352)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "datatype_in", scope: !149, file: !4, line: 494, baseType: !165, size: 32, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_datatype", file: !4, line: 430, baseType: !3)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "datatype_out", scope: !149, file: !4, line: 495, baseType: !165, size: 32, offset: 416)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "datatype_stats", scope: !149, file: !4, line: 496, baseType: !165, size: 32, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_format", scope: !149, file: !4, line: 497, baseType: !169, size: 32, offset: 480)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_tensor_format", file: !4, line: 420, baseType: !13)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fuse_order", scope: !149, file: !4, line: 498, baseType: !171, size: 32, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_fusedbatchnorm_fuse_order", file: !4, line: 446, baseType: !24)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fuse_ops", scope: !149, file: !4, line: 499, baseType: !173, size: 32, offset: 544)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_fusedbatchnorm_fuse_op", file: !4, line: 479, baseType: !27)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reg_input", scope: !144, file: !145, line: 514, baseType: !175, size: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_tensor", file: !59, line: 18, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_dnn_tensor", file: !145, line: 352, size: 192, elements: !178)
!178 = !{!179, !194, !196}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !177, file: !145, line: 353, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_tensor_datalayout", file: !59, line: 172, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_dnn_tensor_datalayout", file: !59, line: 165, size: 256, elements: !183)
!183 = !{!184, !187, !189, !190, !191, !192}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "dim_type", scope: !182, file: !59, line: 166, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_tensor_dimtype", file: !59, line: 41, baseType: !58)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dim_size", scope: !182, file: !59, line: 167, baseType: !188, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "num_dims", scope: !182, file: !59, line: 168, baseType: !5, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !182, file: !59, line: 169, baseType: !169, size: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !182, file: !59, line: 170, baseType: !165, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tensor_type", scope: !182, file: !59, line: 171, baseType: !193, size: 32, offset: 224)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_tensor_type", file: !59, line: 161, baseType: !71)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !177, file: !145, line: 354, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "scf", scope: !177, file: !145, line: 355, baseType: !197, size: 8, offset: 128)
!197 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "reg_output", scope: !144, file: !145, line: 515, baseType: !175, size: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "grad_input", scope: !144, file: !145, line: 516, baseType: !175, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "grad_output", scope: !144, file: !145, line: 517, baseType: !175, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "reg_add", scope: !144, file: !145, line: 518, baseType: !175, size: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "grad_add", scope: !144, file: !145, line: 519, baseType: !175, size: 64, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "reg_beta", scope: !144, file: !145, line: 520, baseType: !175, size: 64, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reg_gamma", scope: !144, file: !145, line: 521, baseType: !175, size: 64, offset: 1024)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "grad_beta", scope: !144, file: !145, line: 522, baseType: !175, size: 64, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "grad_gamma", scope: !144, file: !145, line: 523, baseType: !175, size: 64, offset: 1152)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "expvalue", scope: !144, file: !145, line: 524, baseType: !175, size: 64, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rcpstddev", scope: !144, file: !145, line: 525, baseType: !175, size: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !144, file: !145, line: 526, baseType: !175, size: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "relumask", scope: !144, file: !145, line: 527, baseType: !175, size: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "barrier", scope: !144, file: !145, line: 528, baseType: !212, size: 64, offset: 1472)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_barrier", file: !214, line: 766, baseType: !215)
!214 = !DIFile(filename: "include/libxsmm_sync.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "83f98b39b8b6b876fabdfb62c1483c6b")
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_barrier", file: !214, line: 766, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ifmblock", scope: !144, file: !145, line: 529, baseType: !152, size: 32, offset: 1536)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ofmblock", scope: !144, file: !145, line: 530, baseType: !152, size: 32, offset: 1568)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "blocksifm", scope: !144, file: !145, line: 531, baseType: !152, size: 32, offset: 1600)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "blocksofm", scope: !144, file: !145, line: 532, baseType: !152, size: 32, offset: 1632)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_size", scope: !144, file: !145, line: 533, baseType: !221, size: 64, offset: 1664)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !222, line: 70, baseType: !223)
!222 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!223 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !144, file: !145, line: 534, baseType: !195, size: 64, offset: 1728)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !228, line: 90, baseType: !223)
!228 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!229 = !{i32 7, !"Dwarf Version", i32 5}
!230 = !{i32 2, !"Debug Info Version", i32 3}
!231 = !{i32 1, !"wchar_size", i32 4}
!232 = !{i32 8, !"PIC Level", i32 2}
!233 = !{i32 7, !"uwtable", i32 2}
!234 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!235 = distinct !DISubprogram(name: "libxsmm_dnn_create_fusedbatchnorm", scope: !236, file: !236, line: 16, type: !237, scopeLine: 16, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !241)
!236 = !DIFile(filename: "./src/libxsmm_dnn_fusedbatchnorm.c", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "d2c111ce6cec6e723303d0a44ea83a12")
!237 = !DISubroutineType(types: !238)
!238 = !{!141, !148, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_err_t", file: !133, line: 16, baseType: !5)
!241 = !{!242, !243, !244, !245}
!242 = !DILocalVariable(name: "fusedbatchnorm_desc", arg: 1, scope: !235, file: !236, line: 16, type: !148)
!243 = !DILocalVariable(name: "status", arg: 2, scope: !235, file: !236, line: 16, type: !239)
!244 = !DILocalVariable(name: "handle", scope: !235, file: !236, line: 17, type: !141)
!245 = !DILocalVariable(name: "lpb", scope: !235, file: !236, line: 18, type: !152)
!246 = !DILocation(line: 16, column: 107, scope: !235)
!247 = !{!248, !248, i64 0}
!248 = !{!"any pointer", !249, i64 0}
!249 = !{!"omnipotent char", !250, i64 0}
!250 = !{!"Simple C/C++ TBAA"}
!251 = !DILocation(line: 16, column: 147, scope: !235)
!252 = !DILocation(line: 17, column: 3, scope: !235)
!253 = !DILocation(line: 17, column: 31, scope: !235)
!254 = !DILocation(line: 18, column: 3, scope: !235)
!255 = !DILocation(line: 18, column: 7, scope: !235)
!256 = !DILocation(line: 21, column: 3, scope: !257)
!257 = distinct !DILexicalBlock(scope: !235, file: !236, line: 21, column: 3)
!258 = !{!259, !259, i64 0}
!259 = !{!"int", !249, i64 0}
!260 = !DILocation(line: 21, column: 3, scope: !235)
!261 = !DILocation(line: 23, column: 28, scope: !262)
!262 = distinct !DILexicalBlock(scope: !235, file: !236, line: 23, column: 8)
!263 = !{!264, !259, i64 0}
!264 = !{!"libxsmm_dnn_fusedbatchnorm_desc", !259, i64 0, !259, i64 4, !259, i64 8, !259, i64 12, !259, i64 16, !259, i64 20, !259, i64 24, !259, i64 28, !259, i64 32, !259, i64 36, !259, i64 40, !259, i64 44, !249, i64 48, !249, i64 52, !249, i64 56, !249, i64 60, !249, i64 64, !249, i64 68}
!265 = !DILocation(line: 23, column: 56, scope: !262)
!266 = !{!264, !259, i64 4}
!267 = !DILocation(line: 23, column: 34, scope: !262)
!268 = !DILocation(line: 23, column: 8, scope: !235)
!269 = !DILocation(line: 24, column: 6, scope: !270)
!270 = distinct !DILexicalBlock(scope: !262, file: !236, line: 23, column: 64)
!271 = !DILocation(line: 24, column: 13, scope: !270)
!272 = !DILocation(line: 25, column: 12, scope: !270)
!273 = !DILocation(line: 25, column: 5, scope: !270)
!274 = !DILocation(line: 26, column: 36, scope: !275)
!275 = distinct !DILexicalBlock(scope: !262, file: !236, line: 26, column: 15)
!276 = !DILocation(line: 26, column: 65, scope: !275)
!277 = !DILocation(line: 26, column: 42, scope: !275)
!278 = !DILocation(line: 26, column: 72, scope: !275)
!279 = !DILocation(line: 26, column: 97, scope: !275)
