; ModuleID = 'samples/252.bc'
source_filename = "datastruct/pgtable.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ucs_global_opts_t = type { %struct.ucs_log_component_config, ptr, i64, i32, i64, i64, i32, i32, i32, %struct.anon, ptr, ptr, ptr, i32, i32, i32, i32, ptr, ptr, ptr, i64, i32, ptr, i64, i32, ptr, i64, %struct.ucs_config_names_array_t, i32, %struct.ucs_config_names_array_t, i32, i32, ptr, i32, %struct.ucs_config_allow_list_t, %struct.ucs_arch_global_opts, i32, i64, i64 }
%struct.ucs_log_component_config = type { i32, [16 x i8], ptr }
%struct.anon = type { ptr, i32, i32 }
%struct.ucs_config_names_array_t = type { ptr, i32, i32 }
%struct.ucs_config_allow_list_t = type { %struct.ucs_config_names_array_t, i32 }
%struct.ucs_arch_global_opts = type { i64, i64 }
%struct.ucs_pgtable = type { %struct.ucs_pgt_entry, i64, i64, i32, i32, ptr, ptr }
%struct.ucs_pgt_entry = type { i64 }
%struct.ucs_pgt_region = type { i64, i64 }
%struct.ucs_pgt_dir = type { [16 x %struct.ucs_pgt_entry], i32 }

@.str = private unnamed_addr constant [5 x i8] c"dump\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [7 x i8] c"insert\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [7 x i8] c"remove\00", align 1, !dbg !12
@ucs_global_opts = external global %struct.ucs_global_opts_t, align 8

!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 47)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !9, isLocal: true, isDefinition: true)
!106 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !163, globals: !201, splitDebugInlining: false, nameTableKind: None)
!107 = !{!108, !126}
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 16, baseType: !110, size: 32, elements: !111)
!109 = !DIFile(filename: "config/types.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src/ucs", checksumkind: CSK_MD5, checksum: "334625b5e9d9ea7b05f72001931650ae")
!110 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125}
!112 = !DIEnumerator(name: "UCS_LOG_LEVEL_FATAL", value: 0)
!113 = !DIEnumerator(name: "UCS_LOG_LEVEL_ERROR", value: 1)
!114 = !DIEnumerator(name: "UCS_LOG_LEVEL_WARN", value: 2)
!115 = !DIEnumerator(name: "UCS_LOG_LEVEL_DIAG", value: 3)
!116 = !DIEnumerator(name: "UCS_LOG_LEVEL_INFO", value: 4)
!117 = !DIEnumerator(name: "UCS_LOG_LEVEL_DEBUG", value: 5)
!118 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE", value: 6)
!119 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE_REQ", value: 7)
!120 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE_DATA", value: 8)
!121 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE_ASYNC", value: 9)
!122 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE_FUNC", value: 10)
!123 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE_POLL", value: 11)
!124 = !DIEnumerator(name: "UCS_LOG_LEVEL_LAST", value: 12)
!125 = !DIEnumerator(name: "UCS_LOG_LEVEL_PRINT", value: 13)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !127, line: 45, baseType: !128, size: 8, elements: !129)
!127 = !DIFile(filename: "type/status.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src/ucs", checksumkind: CSK_MD5, checksum: "28c283b29442b5def29f6cf41aecfb03")
!128 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!130 = !DIEnumerator(name: "UCS_OK", value: 0)
!131 = !DIEnumerator(name: "UCS_INPROGRESS", value: 1)
!132 = !DIEnumerator(name: "UCS_ERR_NO_MESSAGE", value: -1)
!133 = !DIEnumerator(name: "UCS_ERR_NO_RESOURCE", value: -2)
!134 = !DIEnumerator(name: "UCS_ERR_IO_ERROR", value: -3)
!135 = !DIEnumerator(name: "UCS_ERR_NO_MEMORY", value: -4)
!136 = !DIEnumerator(name: "UCS_ERR_INVALID_PARAM", value: -5)
!137 = !DIEnumerator(name: "UCS_ERR_UNREACHABLE", value: -6)
!138 = !DIEnumerator(name: "UCS_ERR_INVALID_ADDR", value: -7)
!139 = !DIEnumerator(name: "UCS_ERR_NOT_IMPLEMENTED", value: -8)
!140 = !DIEnumerator(name: "UCS_ERR_MESSAGE_TRUNCATED", value: -9)
!141 = !DIEnumerator(name: "UCS_ERR_NO_PROGRESS", value: -10)
!142 = !DIEnumerator(name: "UCS_ERR_BUFFER_TOO_SMALL", value: -11)
!143 = !DIEnumerator(name: "UCS_ERR_NO_ELEM", value: -12)
!144 = !DIEnumerator(name: "UCS_ERR_SOME_CONNECTS_FAILED", value: -13)
!145 = !DIEnumerator(name: "UCS_ERR_NO_DEVICE", value: -14)
!146 = !DIEnumerator(name: "UCS_ERR_BUSY", value: -15)
!147 = !DIEnumerator(name: "UCS_ERR_CANCELED", value: -16)
!148 = !DIEnumerator(name: "UCS_ERR_SHMEM_SEGMENT", value: -17)
!149 = !DIEnumerator(name: "UCS_ERR_ALREADY_EXISTS", value: -18)
!150 = !DIEnumerator(name: "UCS_ERR_OUT_OF_RANGE", value: -19)
!151 = !DIEnumerator(name: "UCS_ERR_TIMED_OUT", value: -20)
!152 = !DIEnumerator(name: "UCS_ERR_EXCEEDS_LIMIT", value: -21)
!153 = !DIEnumerator(name: "UCS_ERR_UNSUPPORTED", value: -22)
!154 = !DIEnumerator(name: "UCS_ERR_REJECTED", value: -23)
!155 = !DIEnumerator(name: "UCS_ERR_NOT_CONNECTED", value: -24)
!156 = !DIEnumerator(name: "UCS_ERR_CONNECTION_RESET", value: -25)
!157 = !DIEnumerator(name: "UCS_ERR_FIRST_LINK_FAILURE", value: -40)
!158 = !DIEnumerator(name: "UCS_ERR_LAST_LINK_FAILURE", value: -59)
!159 = !DIEnumerator(name: "UCS_ERR_FIRST_ENDPOINT_FAILURE", value: -60)
!160 = !DIEnumerator(name: "UCS_ERR_ENDPOINT_TIMEOUT", value: -80)
!161 = !DIEnumerator(name: "UCS_ERR_LAST_ENDPOINT_FAILURE", value: -89)
!162 = !DIEnumerator(name: "UCS_ERR_LAST", value: -100)
!163 = !{!164, !173, !174, !185, !190, !195, !199, !170}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_region_t", file: !166, line: 58, baseType: !167)
!166 = !DIFile(filename: "datastruct/pgtable.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src/ucs", checksumkind: CSK_MD5, checksum: "a88370ba33ea72e5a4a96f02d1bf5ee7")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_pgt_region", file: !166, line: 100, size: 128, align: 64, elements: !168)
!168 = !{!169, !172}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !167, file: !166, line: 101, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_addr_t", file: !166, line: 54, baseType: !171)
!171 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !167, file: !166, line: 102, baseType: !170, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_dir_t", file: !166, line: 60, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_pgt_dir", file: !166, line: 126, size: 1088, elements: !177)
!177 = !{!178, !184}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !176, file: !166, line: 127, baseType: !179, size: 1024)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 1024, elements: !56)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_entry_t", file: !166, line: 59, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_pgt_entry", file: !166, line: 116, size: 64, elements: !182)
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !181, file: !166, line: 117, baseType: !170, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !176, file: !166, line: 128, baseType: !110, size: 32, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_log_component_config_t", file: !109, line: 150, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_log_component_config", file: !109, line: 146, size: 256, elements: !188)
!188 = !{!189, !191, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !187, file: !109, line: 147, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_log_level_t", file: !109, line: 31, baseType: !108)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !109, line: 148, baseType: !192, size: 128, offset: 32)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !56)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "file_filter", scope: !187, file: !109, line: 149, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !196, line: 27, baseType: !197)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !198, line: 45, baseType: !171)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !200, line: 90, baseType: !171)
!200 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!201 = !{!0, !7, !12, !14, !19, !25, !30, !33, !38, !43, !48, !53, !58, !63, !68, !73, !78, !83, !88, !90, !95, !97, !99, !104}
!202 = !{i32 7, !"Dwarf Version", i32 5}
!203 = !{i32 2, !"Debug Info Version", i32 3}
!204 = !{i32 1, !"wchar_size", i32 4}
!205 = !{i32 8, !"PIC Level", i32 2}
!206 = !{i32 7, !"uwtable", i32 2}
!207 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!208 = distinct !DISubprogram(name: "ucs_pgtable_dump", scope: !2, file: !2, line: 134, type: !209, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !231)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !211, !190}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgtable_t", file: !166, line: 57, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_pgtable", file: !166, line: 133, size: 384, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !226}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !214, file: !166, line: 138, baseType: !180, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !214, file: !166, line: 139, baseType: !170, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !214, file: !166, line: 140, baseType: !170, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !214, file: !166, line: 141, baseType: !110, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !214, file: !166, line: 142, baseType: !110, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pgd_alloc_cb", scope: !214, file: !166, line: 143, baseType: !222, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_dir_alloc_callback_t", file: !166, line: 71, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!174, !211}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pgd_release_cb", scope: !214, file: !166, line: 144, baseType: !227, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_dir_release_callback_t", file: !166, line: 81, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !211, !174}
!231 = !{!232, !233}
!232 = !DILocalVariable(name: "pgtable", arg: 1, scope: !208, file: !2, line: 134, type: !211)
!233 = !DILocalVariable(name: "log_level", arg: 2, scope: !208, file: !2, line: 134, type: !190)
!234 = !{!235, !235, i64 0}
!235 = !{!"any pointer", !236, i64 0}
!236 = !{!"omnipotent char", !237, i64 0}
!237 = !{!"Simple C/C++ TBAA"}
!238 = !DILocation(line: 134, column: 44, scope: !208)
!239 = !{!236, !236, i64 0}
!240 = !DILocation(line: 134, column: 69, scope: !208)
!241 = !DILocation(line: 136, column: 21, scope: !208)
!242 = !DILocation(line: 136, column: 30, scope: !208)
!243 = !DILocation(line: 136, column: 5, scope: !208)
!244 = !DILocation(line: 137, column: 31, scope: !208)
!245 = !DILocation(line: 137, column: 44, scope: !208)
!246 = !DILocation(line: 137, column: 53, scope: !208)
!247 = !DILocation(line: 137, column: 62, scope: !208)
!248 = !DILocation(line: 137, column: 71, scope: !208)
!249 = !{!250, !252, i64 8}
!250 = !{!"ucs_pgtable", !251, i64 0, !252, i64 8, !252, i64 16, !253, i64 24, !253, i64 28, !235, i64 32, !235, i64 40}
!251 = !{!"ucs_pgt_entry", !252, i64 0}
!252 = !{!"long", !236, i64 0}
!253 = !{!"int", !236, i64 0}
!254 = !DILocation(line: 138, column: 31, scope: !208)
!255 = !DILocation(line: 138, column: 40, scope: !208)
!256 = !{!250, !252, i64 16}
!257 = !DILocation(line: 138, column: 46, scope: !208)
!258 = !DILocation(line: 138, column: 55, scope: !208)
!259 = !{!250, !253, i64 24}
!260 = !DILocation(line: 138, column: 62, scope: !208)
!261 = !DILocation(line: 137, column: 5, scope: !208)
!262 = !DILocation(line: 139, column: 1, scope: !208)
!263 = distinct !DISubprogram(name: "ucs_pgtable_log", scope: !2, file: !2, line: 126, type: !264, scopeLine: 128, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !211, !190, !194}
!266 = !{!267, !268, !269}
!267 = !DILocalVariable(name: "pgtable", arg: 1, scope: !263, file: !2, line: 126, type: !211)
!268 = !DILocalVariable(name: "log_level", arg: 2, scope: !263, file: !2, line: 127, type: !190)
!269 = !DILocalVariable(name: "message", arg: 3, scope: !263, file: !2, line: 127, type: !194)
!270 = !DILocation(line: 126, column: 50, scope: !263)
!271 = !DILocation(line: 127, column: 45, scope: !263)
!272 = !DILocation(line: 127, column: 68, scope: !263)
!273 = !DILocation(line: 129, column: 5, scope: !263)
!274 = !DILocation(line: 129, column: 5, scope: !275)
!275 = distinct !DILexicalBlock(scope: !263, file: !2, line: 129, column: 5)
!276 = !DILocation(line: 129, column: 5, scope: !277)
!277 = distinct !DILexicalBlock(scope: !278, file: !2, line: 129, column: 5)
!278 = distinct !DILexicalBlock(scope: !275, file: !2, line: 129, column: 5)
!279 = !{!280, !236, i64 0}
!280 = !{!"ucs_log_component_config", !236, i64 0, !236, i64 4, !235, i64 24}
!281 = !DILocation(line: 0, scope: !277)
!282 = !DILocation(line: 129, column: 5, scope: !278)
!283 = !DILocation(line: 129, column: 5, scope: !284)
!284 = distinct !DILexicalBlock(scope: !277, file: !2, line: 129, column: 5)
!285 = !{!250, !253, i64 28}
!286 = !DILocation(line: 132, column: 1, scope: !263)
!287 = distinct !DISubprogram(name: "ucs_pgt_entry_dump_recurs", scope: !2, file: !2, line: 96, type: !288, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !292)
!288 = !DISubroutineType(types: !289)
