; ModuleID = 'samples/264.bc'
source_filename = "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q/spack-src/src/fdevent.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.__SOCKADDR_ARG = type { ptr }
%struct.tcp_info = type { i8, i8, i8, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@use_sock_nonblock = internal global i32 0, align 4, !dbg !0
@use_sock_cloexec = internal global i32 0, align 4, !dbg !161
@.str = private unnamed_addr constant [153 x i8] c"/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q/spack-src/src/fdevent.c\00", align 1, !dbg !107
@.str.1 = private unnamed_addr constant [22 x i8] c"-1 != fcntl(fd, 2, 1)\00", align 1, !dbg !114
@.str.2 = private unnamed_addr constant [22 x i8] c"-1 != fcntl(fd, 2, 0)\00", align 1, !dbg !119
@.str.3 = private unnamed_addr constant [31 x i8] c"-1 != fcntl(fd, 4, 04000 | 02)\00", align 1, !dbg !121
@.str.4 = private unnamed_addr constant [10 x i8] c"/dev/null\00", align 1, !dbg !126

!463 = !DILocation(line: 212, column: 12, scope: !410)
!464 = !DILocation(line: 213, column: 1, scope: !410)
!465 = !DILocation(line: 212, column: 5, scope: !410)
!466 = !DISubprogram(name: "strrchr", scope: !467, file: !467, line: 273, type: !468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!467 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!468 = !DISubroutineType(types: !469)
!469 = !{!413, !238, !101}
!470 = distinct !DISubprogram(name: "fdevent_pipe_cloexec", scope: !109, file: !109, line: 220, type: !471, scopeLine: 220, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !476)
!471 = !DISubroutineType(types: !472)
!472 = !{!101, !473, !475}
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!476 = !{!477, !478}
!477 = !DILocalVariable(name: "fds", arg: 1, scope: !470, file: !109, line: 220, type: !473)
!478 = !DILocalVariable(name: "bufsz_hint", arg: 2, scope: !470, file: !109, line: 220, type: !475)
!479 = !DILocation(line: 220, column: 39, scope: !470)
!480 = !DILocation(line: 220, column: 63, scope: !470)
!481 = !DILocation(line: 225, column: 20, scope: !482)
!482 = distinct !DILexicalBlock(scope: !470, file: !109, line: 225, column: 9)
!483 = !DILocation(line: 225, column: 14, scope: !482)
!484 = !DILocation(line: 225, column: 11, scope: !482)
!485 = !DILocation(line: 225, column: 9, scope: !470)
!486 = !DILocation(line: 228, column: 23, scope: !487)
!487 = distinct !DILexicalBlock(scope: !488, file: !109, line: 228, column: 13)
!488 = distinct !DILexicalBlock(scope: !482, file: !109, line: 227, column: 5)
!489 = !DILocation(line: 228, column: 18, scope: !487)
!490 = !DILocation(line: 228, column: 15, scope: !487)
!491 = !DILocation(line: 230, column: 10, scope: !487)
!492 = !DILocation(line: 230, column: 24, scope: !487)
!493 = !DILocation(line: 230, column: 18, scope: !487)
!494 = !DILocation(line: 230, column: 15, scope: !487)
!495 = !DILocation(line: 231, column: 10, scope: !487)
!496 = !DILocation(line: 231, column: 24, scope: !487)
!497 = !DILocation(line: 231, column: 18, scope: !487)
!498 = !DILocation(line: 231, column: 15, scope: !487)
!499 = !DILocation(line: 228, column: 13, scope: !488)
!500 = !DILocation(line: 234, column: 13, scope: !487)
!501 = !DILocation(line: 235, column: 5, scope: !488)
!502 = !DILocation(line: 237, column: 9, scope: !503)
!503 = distinct !DILexicalBlock(scope: !470, file: !109, line: 237, column: 9)
!504 = !DILocation(line: 237, column: 20, scope: !503)
!505 = !DILocation(line: 237, column: 9, scope: !470)
!506 = !DILocation(line: 238, column: 24, scope: !507)
!507 = distinct !DILexicalBlock(scope: !503, file: !109, line: 238, column: 13)
!508 = !DILocation(line: 238, column: 46, scope: !507)
!509 = !DILocation(line: 238, column: 18, scope: !507)
!510 = !DILocation(line: 238, column: 15, scope: !507)
!511 = !DILocation(line: 238, column: 13, scope: !503)
!512 = !DILocation(line: 238, column: 61, scope: !513)
!513 = distinct !DILexicalBlock(scope: !507, file: !109, line: 238, column: 59)
!514 = !DILocation(line: 238, column: 56, scope: !507)
!515 = !DILocation(line: 242, column: 5, scope: !470)
!516 = !DILocation(line: 244, column: 1, scope: !470)
!517 = !DISubprogram(name: "pipe2", scope: !216, file: !216, line: 442, type: !518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!518 = !DISubroutineType(types: !519)
!519 = !{!101, !474, !101}
!520 = !DISubprogram(name: "pipe", scope: !216, file: !216, line: 437, type: !521, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!521 = !DISubroutineType(types: !522)
!522 = !{!101, !474}
!523 = distinct !DISubprogram(name: "fdevent_mkostemp", scope: !109, file: !109, line: 247, type: !411, scopeLine: 247, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !524)
!524 = !{!525, !526}
!525 = !DILocalVariable(name: "path", arg: 1, scope: !523, file: !109, line: 247, type: !413)
!526 = !DILocalVariable(name: "flags", arg: 2, scope: !523, file: !109, line: 247, type: !101)
!527 = !DILocation(line: 247, column: 28, scope: !523)
!528 = !DILocation(line: 247, column: 38, scope: !523)
!529 = !DILocation(line: 259, column: 21, scope: !523)
!530 = !DILocation(line: 259, column: 39, scope: !523)
!531 = !DILocation(line: 259, column: 37, scope: !523)
!532 = !DILocation(line: 259, column: 12, scope: !523)
!533 = !DILocation(line: 259, column: 5, scope: !523)
!534 = !DISubprogram(name: "mkostemp", linkageName: "mkostemp64", scope: !535, file: !535, line: 752, type: !411, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!535 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!536 = distinct !DISubprogram(name: "fdevent_accept_listenfd", scope: !109, file: !109, line: 297, type: !537, scopeLine: 297, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !551)
!537 = !DISubroutineType(types: !538)
!538 = !{!101, !101, !539, !550}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !19, line: 180, size: 128, elements: !541)
!541 = !{!542, !546}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !540, file: !19, line: 182, baseType: !543, size: 16)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !544, line: 28, baseType: !545)
!544 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!545 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !540, file: !19, line: 183, baseType: !547, size: 112, offset: 16)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 112, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 14)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!551 = !{!552, !553, !554, !555, !556, !557}
!552 = !DILocalVariable(name: "listenfd", arg: 1, scope: !536, file: !109, line: 297, type: !101)
!553 = !DILocalVariable(name: "addr", arg: 2, scope: !536, file: !109, line: 297, type: !539)
!554 = !DILocalVariable(name: "addrlen", arg: 3, scope: !536, file: !109, line: 297, type: !550)
!555 = !DILocalVariable(name: "fd", scope: !536, file: !109, line: 298, type: !101)
!556 = !DILocalVariable(name: "len", scope: !536, file: !109, line: 299, type: !90)
!557 = !DILocalVariable(name: "sock_cloexec", scope: !536, file: !109, line: 306, type: !101)
!558 = !DILocation(line: 297, column: 33, scope: !536)
!559 = !DILocation(line: 297, column: 60, scope: !536)
!560 = !DILocation(line: 297, column: 74, scope: !536)
!561 = !DILocation(line: 298, column: 2, scope: !536)
!562 = !DILocation(line: 298, column: 6, scope: !536)
!563 = !DILocation(line: 299, column: 2, scope: !536)
!564 = !DILocation(line: 299, column: 12, scope: !536)
!565 = !DILocation(line: 299, column: 31, scope: !536)
!566 = !DILocation(line: 299, column: 30, scope: !536)
!567 = !{!568, !568, i64 0}
!568 = !{!"long", !185, i64 0}
!569 = !DILocation(line: 299, column: 18, scope: !536)
!570 = !DILocation(line: 306, column: 2, scope: !536)
!571 = !DILocation(line: 306, column: 6, scope: !536)
!572 = !DILocation(line: 306, column: 21, scope: !536)
!573 = !DILocation(line: 307, column: 6, scope: !574)
!574 = distinct !DILexicalBlock(scope: !536, file: !109, line: 307, column: 6)
!575 = !DILocation(line: 307, column: 6, scope: !536)
!576 = !DILocation(line: 308, column: 16, scope: !577)
!577 = distinct !DILexicalBlock(scope: !574, file: !109, line: 307, column: 20)
!578 = !DILocation(line: 308, column: 8, scope: !577)
!579 = !DILocation(line: 308, column: 26, scope: !577)
!580 = !DILocation(line: 308, column: 6, scope: !577)
!581 = !DILocation(line: 309, column: 7, scope: !582)
!582 = distinct !DILexicalBlock(scope: !577, file: !109, line: 309, column: 7)
!583 = !DILocation(line: 309, column: 10, scope: !582)
!584 = !DILocation(line: 309, column: 7, scope: !577)
!585 = !DILocation(line: 310, column: 9, scope: !586)
!586 = distinct !DILexicalBlock(scope: !587, file: !109, line: 310, column: 8)
!587 = distinct !DILexicalBlock(scope: !582, file: !109, line: 309, column: 16)
!588 = !DILocation(line: 310, column: 8, scope: !587)
!589 = !DILocation(line: 311, column: 35, scope: !590)
!590 = distinct !DILexicalBlock(scope: !591, file: !109, line: 311, column: 9)
!591 = distinct !DILexicalBlock(scope: !586, file: !109, line: 310, column: 28)
!592 = !DILocation(line: 311, column: 14, scope: !590)
!593 = !DILocation(line: 311, column: 11, scope: !590)
!594 = !DILocation(line: 311, column: 9, scope: !591)
!595 = !DILocation(line: 312, column: 12, scope: !596)
!596 = distinct !DILexicalBlock(scope: !590, file: !109, line: 311, column: 40)
!597 = !DILocation(line: 312, column: 6, scope: !596)
!598 = !DILocation(line: 313, column: 9, scope: !596)
!599 = !DILocation(line: 314, column: 5, scope: !596)
!600 = !DILocation(line: 315, column: 4, scope: !591)
!601 = !DILocation(line: 316, column: 3, scope: !587)
!602 = !DILocation(line: 318, column: 12, scope: !603)
!603 = distinct !DILexicalBlock(scope: !582, file: !109, line: 317, column: 8)
!604 = !DILocation(line: 318, column: 4, scope: !603)
!605 = !DILocation(line: 322, column: 17, scope: !606)
!606 = distinct !DILexicalBlock(scope: !603, file: !109, line: 318, column: 19)
!607 = !DILocation(line: 322, column: 10, scope: !606)
!608 = !DILocation(line: 322, column: 27, scope: !606)
!609 = !DILocation(line: 322, column: 8, scope: !606)
!610 = !DILocation(line: 323, column: 18, scope: !606)
!611 = !DILocation(line: 324, column: 5, scope: !606)
!612 = !DILocation(line: 326, column: 5, scope: !606)
!613 = !DILocation(line: 329, column: 2, scope: !577)
!614 = !DILocation(line: 331, column: 15, scope: !615)
!615 = distinct !DILexicalBlock(scope: !574, file: !109, line: 330, column: 7)
!616 = !DILocation(line: 331, column: 8, scope: !615)
!617 = !DILocation(line: 331, column: 25, scope: !615)
!618 = !DILocation(line: 331, column: 6, scope: !615)
!619 = !DILocation(line: 339, column: 6, scope: !620)
!620 = distinct !DILexicalBlock(scope: !536, file: !109, line: 339, column: 6)
!621 = !DILocation(line: 339, column: 9, scope: !620)
!622 = !DILocation(line: 339, column: 6, scope: !536)
!623 = !DILocation(line: 340, column: 22, scope: !624)
!624 = distinct !DILexicalBlock(scope: !620, file: !109, line: 339, column: 15)
!625 = !DILocation(line: 340, column: 14, scope: !624)
!626 = !DILocation(line: 340, column: 4, scope: !624)
!627 = !DILocation(line: 340, column: 12, scope: !624)
!628 = !DILocation(line: 341, column: 8, scope: !629)
!629 = distinct !DILexicalBlock(scope: !624, file: !109, line: 341, column: 7)
!630 = !DILocation(line: 341, column: 21, scope: !629)
!631 = !DILocation(line: 341, column: 58, scope: !629)
!632 = !DILocation(line: 341, column: 29, scope: !629)
!633 = !DILocation(line: 341, column: 26, scope: !629)
!634 = !DILocation(line: 341, column: 7, scope: !624)
!635 = !DILocation(line: 342, column: 10, scope: !636)
!636 = distinct !DILexicalBlock(scope: !629, file: !109, line: 341, column: 63)
!637 = !DILocation(line: 342, column: 4, scope: !636)
!638 = !DILocation(line: 343, column: 7, scope: !636)
!639 = !DILocation(line: 344, column: 3, scope: !636)
!640 = !DILocation(line: 345, column: 2, scope: !624)
!641 = !DILocation(line: 346, column: 9, scope: !536)
!642 = !DILocation(line: 347, column: 1, scope: !536)
!643 = !DILocation(line: 346, column: 2, scope: !536)
!644 = !DISubprogram(name: "accept4", scope: !208, file: !208, line: 314, type: !645, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!645 = !DISubroutineType(types: !646)
!646 = !{!101, !101, !647, !747, !101}
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__SOCKADDR_ARG", file: !208, line: 80, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !208, line: 79, size: 64, elements: !649)
!649 = !{!650, !652, !656, !660, !664, !668, !689, !716, !720, !724, !728, !732, !743}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr__", scope: !648, file: !208, line: 79, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !539)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_at__", scope: !648, file: !208, line: 79, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_at", file: !208, line: 79, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_ax25__", scope: !648, file: !208, line: 79, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_ax25", file: !208, line: 79, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_dl__", scope: !648, file: !208, line: 79, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_dl", file: !208, line: 79, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_eon__", scope: !648, file: !208, line: 79, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_eon", file: !208, line: 79, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_in__", scope: !648, file: !208, line: 79, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !58, line: 245, size: 128, elements: !672)
!672 = !{!673, !674, !679, !686}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !671, file: !58, line: 247, baseType: !543, size: 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !671, file: !58, line: 248, baseType: !675, size: 16, offset: 16)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !58, line: 123, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !677, line: 25, baseType: !678)
!677 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !92, line: 40, baseType: !545)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !671, file: !58, line: 249, baseType: !680, size: 32, offset: 32)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !58, line: 31, size: 32, elements: !681)
!681 = !{!682}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !680, file: !58, line: 33, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !58, line: 30, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !677, line: 26, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !92, line: 42, baseType: !7)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !671, file: !58, line: 252, baseType: !687, size: 64, offset: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 64, elements: !141)
!688 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_in6__", scope: !648, file: !208, line: 79, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !58, line: 260, size: 224, elements: !693)
!693 = !{!694, !695, !696, !697, !715}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !692, file: !58, line: 262, baseType: !543, size: 16)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !692, file: !58, line: 263, baseType: !675, size: 16, offset: 16)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !692, file: !58, line: 264, baseType: !684, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !692, file: !58, line: 265, baseType: !698, size: 128, offset: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !58, line: 219, size: 128, elements: !699)
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !698, file: !58, line: 226, baseType: !701, size: 128)
!701 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !698, file: !58, line: 221, size: 128, elements: !702)
!702 = !{!703, !709, !711}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !701, file: !58, line: 223, baseType: !704, size: 128)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 128, elements: !707)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !677, line: 24, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !92, line: 38, baseType: !688)
!707 = !{!708}
!708 = !DISubrange(count: 16)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !701, file: !58, line: 224, baseType: !710, size: 128)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 128, elements: !141)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !701, file: !58, line: 225, baseType: !712, size: 128)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 128, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 4)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !692, file: !58, line: 266, baseType: !684, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_inarp__", scope: !648, file: !208, line: 79, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_inarp", file: !208, line: 79, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_ipx__", scope: !648, file: !208, line: 79, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_ipx", file: !208, line: 79, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_iso__", scope: !648, file: !208, line: 79, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_iso", file: !208, line: 79, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_ns__", scope: !648, file: !208, line: 79, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_ns", file: !208, line: 79, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_un__", scope: !648, file: !208, line: 79, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !736, line: 29, size: 880, elements: !737)
!736 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !735, file: !736, line: 31, baseType: !543, size: 16)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !735, file: !736, line: 32, baseType: !740, size: 864, offset: 16)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 864, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 108)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_x25__", scope: !648, file: !208, line: 79, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_x25", file: !208, line: 79, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!749 = !DISubprogram(name: "__errno_location", scope: !750, file: !750, line: 37, type: !751, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!750 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!751 = !DISubroutineType(types: !752)
!752 = !{!474}
!753 = !DISubprogram(name: "accept", scope: !208, file: !208, line: 306, type: !754, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!754 = !DISubroutineType(types: !755)
!755 = !{!101, !101, !647, !747}
!756 = distinct !DISubprogram(name: "fdevent_environ", scope: !109, file: !109, line: 356, type: !757, scopeLine: 356, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!757 = !DISubroutineType(types: !758)
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!760 = !DILocation(line: 356, column: 41, scope: !756)
!761 = !DILocation(line: 356, column: 34, scope: !756)
!762 = distinct !DISubprogram(name: "fdevent_set_stdin_stdout_stderr", scope: !109, file: !109, line: 386, type: !209, scopeLine: 386, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !763)
!763 = !{!764, !765, !766}
!764 = !DILocalVariable(name: "fdin", arg: 1, scope: !762, file: !109, line: 386, type: !101)
!765 = !DILocalVariable(name: "fdout", arg: 2, scope: !762, file: !109, line: 386, type: !101)
!766 = !DILocalVariable(name: "fderr", arg: 3, scope: !762, file: !109, line: 386, type: !101)
!767 = !DILocation(line: 386, column: 41, scope: !762)
!768 = !DILocation(line: 386, column: 51, scope: !762)
!769 = !DILocation(line: 386, column: 62, scope: !762)
!770 = !DILocation(line: 388, column: 58, scope: !771)
!771 = distinct !DILexicalBlock(scope: !762, file: !109, line: 388, column: 9)
!772 = !DILocation(line: 388, column: 25, scope: !771)
!773 = !DILocation(line: 388, column: 22, scope: !771)
!774 = !DILocation(line: 388, column: 9, scope: !762)
!775 = !DILocation(line: 389, column: 9, scope: !771)
!776 = !DILocation(line: 390, column: 59, scope: !777)
!777 = distinct !DILexicalBlock(scope: !762, file: !109, line: 390, column: 9)
!778 = !DILocation(line: 390, column: 26, scope: !777)
!779 = !DILocation(line: 390, column: 23, scope: !777)
!780 = !DILocation(line: 390, column: 9, scope: !762)
!781 = !DILocation(line: 391, column: 9, scope: !777)
!782 = !DILocation(line: 392, column: 59, scope: !783)
!783 = distinct !DILexicalBlock(scope: !762, file: !109, line: 392, column: 9)
!784 = !DILocation(line: 392, column: 26, scope: !783)
!785 = !DILocation(line: 392, column: 23, scope: !783)
!786 = !DILocation(line: 392, column: 9, scope: !762)
!787 = !DILocation(line: 393, column: 9, scope: !783)
!788 = !DILocation(line: 407, column: 5, scope: !762)
!789 = !DILocation(line: 408, column: 1, scope: !762)
!790 = distinct !DISubprogram(name: "fdevent_dup2_close_clrfd_cloexec", scope: !109, file: !109, line: 360, type: !791, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !793)
!791 = !DISubroutineType(types: !792)
!792 = !{!101, !101, !101}
!793 = !{!794, !795}
!794 = !DILocalVariable(name: "oldfd", arg: 1, scope: !790, file: !109, line: 360, type: !101)
!795 = !DILocalVariable(name: "newfd", arg: 2, scope: !790, file: !109, line: 360, type: !101)
!796 = !DILocation(line: 360, column: 49, scope: !790)
!797 = !DILocation(line: 360, column: 60, scope: !790)
!798 = !DILocation(line: 361, column: 9, scope: !799)
!799 = distinct !DILexicalBlock(scope: !790, file: !109, line: 361, column: 9)
!800 = !DILocation(line: 361, column: 15, scope: !799)
!801 = !DILocation(line: 361, column: 9, scope: !790)
!802 = !DILocation(line: 362, column: 13, scope: !803)
!803 = distinct !DILexicalBlock(scope: !804, file: !109, line: 362, column: 13)
!804 = distinct !DILexicalBlock(scope: !799, file: !109, line: 361, column: 21)
!805 = !DILocation(line: 362, column: 22, scope: !803)
!806 = !DILocation(line: 362, column: 19, scope: !803)
!807 = !DILocation(line: 362, column: 13, scope: !804)
!808 = !DILocation(line: 363, column: 13, scope: !809)
!809 = distinct !DILexicalBlock(scope: !803, file: !109, line: 362, column: 29)
!810 = !DILocation(line: 363, column: 13, scope: !811)
!811 = distinct !DILexicalBlock(scope: !812, file: !109, line: 363, column: 13)
!812 = distinct !DILexicalBlock(scope: !809, file: !109, line: 363, column: 13)
!813 = !DILocation(line: 363, column: 13, scope: !812)
!814 = !DILocation(line: 364, column: 17, scope: !815)
!815 = distinct !DILexicalBlock(scope: !809, file: !109, line: 364, column: 17)
!816 = !DILocation(line: 364, column: 31, scope: !815)
!817 = !DILocation(line: 364, column: 38, scope: !815)
!818 = !DILocation(line: 364, column: 26, scope: !815)
!819 = !DILocation(line: 364, column: 23, scope: !815)
!820 = !DILocation(line: 364, column: 17, scope: !809)
!821 = !DILocation(line: 364, column: 46, scope: !815)
!822 = !DILocation(line: 365, column: 9, scope: !809)
!823 = !DILocation(line: 367, column: 35, scope: !824)
!824 = distinct !DILexicalBlock(scope: !803, file: !109, line: 366, column: 14)
!825 = !DILocation(line: 367, column: 13, scope: !824)
!826 = !DILocation(line: 369, column: 5, scope: !804)
!827 = !DILocation(line: 370, column: 12, scope: !790)
!828 = !DILocation(line: 370, column: 5, scope: !790)
!829 = !DILocation(line: 371, column: 1, scope: !790)
!830 = distinct !DISubprogram(name: "fdevent_rename", scope: !109, file: !109, line: 415, type: !831, scopeLine: 415, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{!101, !238, !238}
!833 = !{!834, !835}
!834 = !DILocalVariable(name: "oldpath", arg: 1, scope: !830, file: !109, line: 415, type: !238)
!835 = !DILocalVariable(name: "newpath", arg: 2, scope: !830, file: !109, line: 415, type: !238)
!836 = !DILocation(line: 415, column: 32, scope: !830)
!837 = !DILocation(line: 415, column: 53, scope: !830)
!838 = !DILocation(line: 416, column: 19, scope: !830)
!839 = !DILocation(line: 416, column: 28, scope: !830)
!840 = !DILocation(line: 416, column: 12, scope: !830)
!841 = !DILocation(line: 416, column: 5, scope: !830)
!842 = !DISubprogram(name: "rename", scope: !843, file: !843, line: 154, type: !831, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!843 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!844 = distinct !DISubprogram(name: "fdevent_fork_execve", scope: !109, file: !109, line: 420, type: !845, scopeLine: 420, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !849)
!845 = !DISubroutineType(types: !846)
!846 = !{!847, !238, !759, !759, !101, !101, !101, !101}
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !103, line: 97, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !92, line: 154, baseType: !101)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858, !859}
!850 = !DILocalVariable(name: "name", arg: 1, scope: !844, file: !109, line: 420, type: !238)
!851 = !DILocalVariable(name: "argv", arg: 2, scope: !844, file: !109, line: 420, type: !759)
!852 = !DILocalVariable(name: "envp", arg: 3, scope: !844, file: !109, line: 420, type: !759)
!853 = !DILocalVariable(name: "fdin", arg: 4, scope: !844, file: !109, line: 420, type: !101)
!854 = !DILocalVariable(name: "fdout", arg: 5, scope: !844, file: !109, line: 420, type: !101)
!855 = !DILocalVariable(name: "fderr", arg: 6, scope: !844, file: !109, line: 420, type: !101)
!856 = !DILocalVariable(name: "dfd", arg: 7, scope: !844, file: !109, line: 420, type: !101)
!857 = !DILocalVariable(name: "pid", scope: !844, file: !109, line: 423, type: !847)
!858 = !DILocalVariable(name: "errnum", scope: !844, file: !109, line: 455, type: !101)
!859 = !DILocalVariable(name: "argnum", scope: !844, file: !109, line: 456, type: !101)
!860 = !DILocation(line: 420, column: 39, scope: !844)
!861 = !DILocation(line: 420, column: 51, scope: !844)
!862 = !DILocation(line: 420, column: 65, scope: !844)
!863 = !DILocation(line: 420, column: 77, scope: !844)
!864 = !DILocation(line: 420, column: 87, scope: !844)
!865 = !DILocation(line: 420, column: 98, scope: !844)
!866 = !DILocation(line: 420, column: 109, scope: !844)
!867 = !DILocation(line: 423, column: 5, scope: !844)
!868 = !DILocation(line: 423, column: 11, scope: !844)
!869 = !DILocation(line: 423, column: 17, scope: !844)
!870 = !DILocation(line: 424, column: 14, scope: !871)
!871 = distinct !DILexicalBlock(scope: !844, file: !109, line: 424, column: 9)
!872 = !DILocation(line: 424, column: 11, scope: !871)
!873 = !DILocation(line: 424, column: 9, scope: !844)
!874 = !DILocation(line: 424, column: 26, scope: !871)
!875 = !DILocation(line: 475, column: 1, scope: !844)
!876 = !DILocation(line: 424, column: 19, scope: !871)
!877 = !DILocation(line: 428, column: 15, scope: !878)
!878 = distinct !DILexicalBlock(scope: !844, file: !109, line: 428, column: 9)
!879 = !DILocation(line: 428, column: 12, scope: !878)
!880 = !DILocation(line: 428, column: 9, scope: !844)
!881 = !DILocation(line: 429, column: 25, scope: !882)
!882 = distinct !DILexicalBlock(scope: !883, file: !109, line: 429, column: 13)
!883 = distinct !DILexicalBlock(scope: !878, file: !109, line: 428, column: 20)
!884 = !DILocation(line: 429, column: 18, scope: !882)
!885 = !DILocation(line: 429, column: 15, scope: !882)
!886 = !DILocation(line: 429, column: 13, scope: !883)
!887 = !DILocation(line: 430, column: 19, scope: !882)
!888 = !DILocation(line: 430, column: 13, scope: !882)
!889 = !DILocation(line: 431, column: 15, scope: !883)
!890 = !DILocation(line: 431, column: 9, scope: !883)
!891 = !DILocation(line: 432, column: 5, scope: !883)
!892 = !DILocation(line: 434, column: 46, scope: !893)
!893 = distinct !DILexicalBlock(scope: !844, file: !109, line: 434, column: 9)
!894 = !DILocation(line: 434, column: 52, scope: !893)
!895 = !DILocation(line: 434, column: 59, scope: !893)
!896 = !DILocation(line: 434, column: 14, scope: !893)
!897 = !DILocation(line: 434, column: 11, scope: !893)
!898 = !DILocation(line: 434, column: 9, scope: !844)
!899 = !DILocation(line: 434, column: 73, scope: !893)
!900 = !DILocation(line: 434, column: 67, scope: !893)
!901 = !DILocation(line: 442, column: 5, scope: !844)
!902 = !DILocation(line: 445, column: 5, scope: !844)
!903 = !DILocation(line: 448, column: 5, scope: !844)
!904 = !DILocation(line: 450, column: 5, scope: !844)
!905 = !DILocation(line: 451, column: 5, scope: !844)
!906 = !DILocation(line: 453, column: 12, scope: !844)
!907 = !DILocation(line: 453, column: 18, scope: !844)
!908 = !DILocation(line: 453, column: 24, scope: !844)
!909 = !DILocation(line: 453, column: 31, scope: !844)
!910 = !DILocation(line: 453, column: 38, scope: !844)
!911 = !DILocation(line: 453, column: 5, scope: !844)
!912 = !DILocation(line: 455, column: 5, scope: !844)
!913 = !DILocation(line: 455, column: 9, scope: !844)
!914 = !DILocation(line: 455, column: 18, scope: !844)
!915 = !DILocation(line: 456, column: 5, scope: !844)
!916 = !DILocation(line: 456, column: 9, scope: !844)
!917 = !DILocation(line: 457, column: 20, scope: !844)
!918 = !DILocation(line: 457, column: 13, scope: !844)
!919 = !DILocation(line: 457, column: 10, scope: !844)
!920 = !DILocation(line: 457, column: 40, scope: !844)
!921 = !DILocation(line: 457, column: 43, scope: !844)
!922 = !DILocation(line: 457, column: 51, scope: !844)
!923 = !DILocation(line: 457, column: 66, scope: !844)
!924 = !DILocation(line: 457, column: 59, scope: !844)
!925 = !DILocation(line: 457, column: 56, scope: !844)
!926 = !DILocation(line: 0, scope: !844)
!927 = !DILocation(line: 457, column: 7, scope: !844)
!928 = !DILocation(line: 460, column: 12, scope: !844)
!929 = !DILocation(line: 460, column: 17, scope: !844)
!930 = !DILocation(line: 460, column: 5, scope: !844)
!931 = !DILocation(line: 461, column: 11, scope: !844)
!932 = !DILocation(line: 461, column: 5, scope: !844)
!933 = !DISubprogram(name: "fork", scope: !216, file: !216, line: 778, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!934 = !DISubroutineType(types: !935)
!935 = !{!848}
!936 = !DISubprogram(name: "fchdir", scope: !216, file: !216, line: 521, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!937 = !DISubprogram(name: "_exit", scope: !216, file: !216, line: 624, type: !99, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!938 = !DISubprogram(name: "signal", scope: !97, file: !97, line: 88, type: !939, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!939 = !DISubroutineType(types: !940)
!940 = !{!96, !101, !96}
!941 = !DISubprogram(name: "execve", scope: !216, file: !216, line: 572, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!942 = !DISubroutineType(types: !943)
!943 = !{!101, !238, !944, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!945 = !DISubprogram(name: "strcmp", scope: !467, file: !467, line: 156, type: !831, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!946 = !DISubprogram(name: "perror", scope: !843, file: !843, line: 804, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !238}
!949 = distinct !DISubprogram(name: "fdevent_waitpid", scope: !109, file: !109, line: 482, type: !950, scopeLine: 482, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !952)
!950 = !DISubroutineType(types: !951)
!951 = !{!101, !847, !473, !101}
!952 = !{!953, !954, !955, !956, !958}
!953 = !DILocalVariable(name: "pid", arg: 1, scope: !949, file: !109, line: 482, type: !847)
!954 = !DILocalVariable(name: "status", arg: 2, scope: !949, file: !109, line: 482, type: !473)
!955 = !DILocalVariable(name: "nb", arg: 3, scope: !949, file: !109, line: 482, type: !101)
!956 = !DILocalVariable(name: "flags", scope: !949, file: !109, line: 483, type: !957)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!958 = !DILocalVariable(name: "rv", scope: !949, file: !109, line: 484, type: !847)
!959 = !DILocation(line: 482, column: 27, scope: !949)
!960 = !DILocation(line: 482, column: 44, scope: !949)
!961 = !DILocation(line: 482, column: 56, scope: !949)
!962 = !DILocation(line: 483, column: 5, scope: !949)
!963 = !DILocation(line: 483, column: 15, scope: !949)
!964 = !DILocation(line: 483, column: 23, scope: !949)
!965 = !DILocation(line: 484, column: 5, scope: !949)
!966 = !DILocation(line: 484, column: 11, scope: !949)
!967 = !DILocation(line: 485, column: 5, scope: !949)
!968 = !DILocation(line: 485, column: 23, scope: !969)
!969 = distinct !DILexicalBlock(scope: !949, file: !109, line: 485, column: 8)
!970 = !DILocation(line: 485, column: 28, scope: !969)
!971 = !DILocation(line: 485, column: 36, scope: !969)
!972 = !DILocation(line: 485, column: 15, scope: !969)
!973 = !DILocation(line: 485, column: 13, scope: !969)
!974 = !DILocation(line: 485, column: 44, scope: !969)
!975 = !DILocation(line: 485, column: 59, scope: !949)
!976 = !DILocation(line: 485, column: 56, scope: !949)
!977 = !DILocation(line: 485, column: 62, scope: !949)
!978 = !DILocation(line: 485, column: 65, scope: !949)
!979 = !DILocation(line: 485, column: 71, scope: !949)
!980 = !DILocation(line: 0, scope: !949)
!981 = distinct !{!981, !967, !982, !983}
!982 = !DILocation(line: 485, column: 79, scope: !949)
!983 = !{!"llvm.loop.mustprogress"}
!984 = !DILocation(line: 486, column: 12, scope: !949)
!985 = !DILocation(line: 487, column: 1, scope: !949)
!986 = !DILocation(line: 486, column: 5, scope: !949)
!987 = !DISubprogram(name: "waitpid", scope: !988, file: !988, line: 111, type: !989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!988 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/wait.h", directory: "", checksumkind: CSK_MD5, checksum: "f653fe63e16922d44e1c6e15caa2acb6")
!989 = !DISubroutineType(types: !990)
!990 = !{!848, !848, !474, !101}
!991 = distinct !DISubprogram(name: "fdevent_waitpid_intr", scope: !109, file: !109, line: 489, type: !992, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !994)
!992 = !DISubroutineType(types: !993)
!993 = !{!101, !847, !473}
!994 = !{!995, !996}
!995 = !DILocalVariable(name: "pid", arg: 1, scope: !991, file: !109, line: 489, type: !847)
!996 = !DILocalVariable(name: "status", arg: 2, scope: !991, file: !109, line: 489, type: !473)
!997 = !DILocation(line: 489, column: 32, scope: !991)
!998 = !DILocation(line: 489, column: 49, scope: !991)
!999 = !DILocation(line: 490, column: 20, scope: !991)
!1000 = !DILocation(line: 490, column: 25, scope: !991)
!1001 = !DILocation(line: 490, column: 12, scope: !991)
!1002 = !DILocation(line: 490, column: 5, scope: !991)
!1003 = distinct !DISubprogram(name: "fdevent_socket_read_discard", scope: !109, file: !109, line: 502, type: !1004, scopeLine: 502, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1008)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1006, !101, !413, !93, !101, !101}
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !103, line: 108, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !92, line: 194, baseType: !105)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1014}
!1009 = !DILocalVariable(name: "fd", arg: 1, scope: !1003, file: !109, line: 502, type: !101)
!1010 = !DILocalVariable(name: "buf", arg: 2, scope: !1003, file: !109, line: 502, type: !413)
!1011 = !DILocalVariable(name: "sz", arg: 3, scope: !1003, file: !109, line: 502, type: !93)
!1012 = !DILocalVariable(name: "family", arg: 4, scope: !1003, file: !109, line: 502, type: !101)
!1013 = !DILocalVariable(name: "so_type", arg: 5, scope: !1003, file: !109, line: 502, type: !101)
!1014 = !DILocalVariable(name: "len", scope: !1015, file: !109, line: 505, type: !1006)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !109, line: 504, column: 78)
!1016 = distinct !DILexicalBlock(scope: !1003, file: !109, line: 504, column: 9)
!1017 = !DILocation(line: 502, column: 42, scope: !1003)
!1018 = !DILocation(line: 502, column: 52, scope: !1003)
!1019 = !DILocation(line: 502, column: 64, scope: !1003)
!1020 = !DILocation(line: 502, column: 72, scope: !1003)
!1021 = !DILocation(line: 502, column: 84, scope: !1003)
!1022 = !DILocation(line: 504, column: 10, scope: !1016)
!1023 = !DILocation(line: 504, column: 17, scope: !1016)
!1024 = !DILocation(line: 504, column: 28, scope: !1016)
!1025 = !DILocation(line: 504, column: 31, scope: !1016)
!1026 = !DILocation(line: 504, column: 38, scope: !1016)
!1027 = !DILocation(line: 504, column: 51, scope: !1016)
!1028 = !DILocation(line: 504, column: 54, scope: !1016)
!1029 = !DILocation(line: 504, column: 62, scope: !1016)
!1030 = !DILocation(line: 504, column: 9, scope: !1003)
!1031 = !DILocation(line: 505, column: 9, scope: !1015)
!1032 = !DILocation(line: 505, column: 17, scope: !1015)
!1033 = !DILocation(line: 505, column: 28, scope: !1015)
!1034 = !DILocation(line: 505, column: 32, scope: !1015)
!1035 = !DILocation(line: 505, column: 37, scope: !1015)
!1036 = !DILocation(line: 505, column: 23, scope: !1015)
!1037 = !DILocation(line: 506, column: 13, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1015, file: !109, line: 506, column: 13)
!1039 = !DILocation(line: 506, column: 17, scope: !1038)
!1040 = !DILocation(line: 506, column: 22, scope: !1038)
!1041 = !DILocation(line: 506, column: 25, scope: !1038)
!1042 = !DILocation(line: 506, column: 31, scope: !1038)
!1043 = !DILocation(line: 506, column: 13, scope: !1015)
!1044 = !DILocation(line: 506, column: 49, scope: !1038)
!1045 = !DILocation(line: 506, column: 42, scope: !1038)
!1046 = !DILocation(line: 507, column: 5, scope: !1016)
!1047 = !DILocation(line: 507, column: 5, scope: !1015)
!1048 = !DILocation(line: 512, column: 17, scope: !1003)
!1049 = !DILocation(line: 512, column: 21, scope: !1003)
!1050 = !DILocation(line: 512, column: 26, scope: !1003)
!1051 = !DILocation(line: 512, column: 12, scope: !1003)
!1052 = !DILocation(line: 512, column: 5, scope: !1003)
!1053 = !DILocation(line: 513, column: 1, scope: !1003)
!1054 = !DISubprogram(name: "recv", scope: !208, file: !208, line: 145, type: !1055, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!1006, !101, !89, !93, !101}
!1057 = !DISubprogram(name: "read", scope: !216, file: !216, line: 371, type: !1058, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1006, !101, !89, !93}
!1060 = distinct !DISubprogram(name: "fdevent_ioctl_fionread", scope: !109, file: !109, line: 523, type: !1061, scopeLine: 523, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1063)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!101, !101, !101, !474}
!1063 = !{!1064, !1065, !1066}
!1064 = !DILocalVariable(name: "fd", arg: 1, scope: !1060, file: !109, line: 523, type: !101)
!1065 = !DILocalVariable(name: "fdfmt", arg: 2, scope: !1060, file: !109, line: 523, type: !101)
!1066 = !DILocalVariable(name: "toread", arg: 3, scope: !1060, file: !109, line: 523, type: !474)
!1067 = !DILocation(line: 523, column: 33, scope: !1060)
!1068 = !DILocation(line: 523, column: 41, scope: !1060)
!1069 = !DILocation(line: 523, column: 53, scope: !1060)
!1070 = !DILocation(line: 532, column: 5, scope: !1060)
!1071 = !DILocation(line: 534, column: 18, scope: !1060)
!1072 = !DILocation(line: 534, column: 32, scope: !1060)
!1073 = !DILocation(line: 534, column: 12, scope: !1060)
!1074 = !DILocation(line: 534, column: 5, scope: !1060)
!1075 = !DISubprogram(name: "ioctl", scope: !1076, file: !1076, line: 42, type: !1077, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1076 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/ioctl.h", directory: "", checksumkind: CSK_MD5, checksum: "17041ae374bfd0bee8350d01883d298c")
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!101, !101, !95, null}
!1079 = distinct !DISubprogram(name: "fdevent_connect_status", scope: !109, file: !109, line: 539, type: !217, scopeLine: 539, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1080)
!1080 = !{!1081, !1082, !1083}
!1081 = !DILocalVariable(name: "fd", arg: 1, scope: !1079, file: !109, line: 539, type: !101)
!1082 = !DILocalVariable(name: "opt", scope: !1079, file: !109, line: 542, type: !101)
!1083 = !DILocalVariable(name: "len", scope: !1079, file: !109, line: 543, type: !90)
!1084 = !DILocation(line: 539, column: 32, scope: !1079)
!1085 = !DILocation(line: 542, column: 5, scope: !1079)
!1086 = !DILocation(line: 542, column: 9, scope: !1079)
!1087 = !DILocation(line: 543, column: 5, scope: !1079)
!1088 = !DILocation(line: 543, column: 15, scope: !1079)
!1089 = !DILocation(line: 544, column: 29, scope: !1079)
!1090 = !DILocation(line: 544, column: 18, scope: !1079)
!1091 = !DILocation(line: 544, column: 15, scope: !1079)
!1092 = !DILocation(line: 544, column: 12, scope: !1079)
!1093 = !DILocation(line: 544, column: 66, scope: !1079)
!1094 = !DILocation(line: 544, column: 72, scope: !1079)
!1095 = !DILocation(line: 545, column: 1, scope: !1079)
!1096 = !DILocation(line: 544, column: 5, scope: !1079)
!1097 = !DISubprogram(name: "getsockopt", scope: !208, file: !208, line: 255, type: !1098, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!101, !101, !101, !101, !1100, !747}
!1100 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !89)
!1101 = distinct !DISubprogram(name: "fdevent_is_tcp_half_closed", scope: !109, file: !109, line: 563, type: !217, scopeLine: 563, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1102)
!1102 = !{!1103, !1104, !1139}
!1103 = !DILocalVariable(name: "fd", arg: 1, scope: !1101, file: !109, line: 563, type: !101)
!1104 = !DILocalVariable(name: "tcpi", scope: !1101, file: !109, line: 577, type: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_info", file: !44, line: 226, size: 832, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_state", scope: !1105, file: !44, line: 228, baseType: !705, size: 8)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_ca_state", scope: !1105, file: !44, line: 229, baseType: !705, size: 8, offset: 8)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_retransmits", scope: !1105, file: !44, line: 230, baseType: !705, size: 8, offset: 16)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_probes", scope: !1105, file: !44, line: 231, baseType: !705, size: 8, offset: 24)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_backoff", scope: !1105, file: !44, line: 232, baseType: !705, size: 8, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_options", scope: !1105, file: !44, line: 233, baseType: !705, size: 8, offset: 40)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_snd_wscale", scope: !1105, file: !44, line: 234, baseType: !705, size: 4, offset: 48, flags: DIFlagBitField, extraData: i64 48)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_rcv_wscale", scope: !1105, file: !44, line: 234, baseType: !705, size: 4, offset: 52, flags: DIFlagBitField, extraData: i64 48)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_rto", scope: !1105, file: !44, line: 236, baseType: !684, size: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_ato", scope: !1105, file: !44, line: 237, baseType: !684, size: 32, offset: 96)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_snd_mss", scope: !1105, file: !44, line: 238, baseType: !684, size: 32, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_rcv_mss", scope: !1105, file: !44, line: 239, baseType: !684, size: 32, offset: 160)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_unacked", scope: !1105, file: !44, line: 241, baseType: !684, size: 32, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_sacked", scope: !1105, file: !44, line: 242, baseType: !684, size: 32, offset: 224)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_lost", scope: !1105, file: !44, line: 243, baseType: !684, size: 32, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_retrans", scope: !1105, file: !44, line: 244, baseType: !684, size: 32, offset: 288)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_fackets", scope: !1105, file: !44, line: 245, baseType: !684, size: 32, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_last_data_sent", scope: !1105, file: !44, line: 248, baseType: !684, size: 32, offset: 352)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_last_ack_sent", scope: !1105, file: !44, line: 249, baseType: !684, size: 32, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_last_data_recv", scope: !1105, file: !44, line: 250, baseType: !684, size: 32, offset: 416)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_last_ack_recv", scope: !1105, file: !44, line: 251, baseType: !684, size: 32, offset: 448)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_pmtu", scope: !1105, file: !44, line: 254, baseType: !684, size: 32, offset: 480)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_rcv_ssthresh", scope: !1105, file: !44, line: 255, baseType: !684, size: 32, offset: 512)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_rtt", scope: !1105, file: !44, line: 256, baseType: !684, size: 32, offset: 544)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_rttvar", scope: !1105, file: !44, line: 257, baseType: !684, size: 32, offset: 576)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_snd_ssthresh", scope: !1105, file: !44, line: 258, baseType: !684, size: 32, offset: 608)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_snd_cwnd", scope: !1105, file: !44, line: 259, baseType: !684, size: 32, offset: 640)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_advmss", scope: !1105, file: !44, line: 260, baseType: !684, size: 32, offset: 672)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_reordering", scope: !1105, file: !44, line: 261, baseType: !684, size: 32, offset: 704)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_rcv_rtt", scope: !1105, file: !44, line: 263, baseType: !684, size: 32, offset: 736)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_rcv_space", scope: !1105, file: !44, line: 264, baseType: !684, size: 32, offset: 768)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "tcpi_total_retrans", scope: !1105, file: !44, line: 266, baseType: !684, size: 32, offset: 800)
!1139 = !DILocalVariable(name: "tlen", scope: !1101, file: !109, line: 578, type: !90)
!1140 = !DILocation(line: 563, column: 36, scope: !1101)
!1141 = !DILocation(line: 577, column: 5, scope: !1101)
!1142 = !DILocation(line: 577, column: 21, scope: !1101)
!1143 = !DILocation(line: 578, column: 5, scope: !1101)
!1144 = !DILocation(line: 578, column: 15, scope: !1101)
!1145 = !DILocation(line: 579, column: 29, scope: !1101)
!1146 = !DILocation(line: 579, column: 18, scope: !1101)
!1147 = !DILocation(line: 579, column: 15, scope: !1101)
!1148 = !DILocation(line: 580, column: 13, scope: !1101)
!1149 = !DILocation(line: 580, column: 21, scope: !1101)
!1150 = !{!1151, !185, i64 0}
!1151 = !{!"tcp_info", !185, i64 0, !185, i64 1, !185, i64 2, !185, i64 3, !185, i64 4, !185, i64 5, !185, i64 6, !185, i64 6, !184, i64 8, !184, i64 12, !184, i64 16, !184, i64 20, !184, i64 24, !184, i64 28, !184, i64 32, !184, i64 36, !184, i64 40, !184, i64 44, !184, i64 48, !184, i64 52, !184, i64 56, !184, i64 60, !184, i64 64, !184, i64 68, !184, i64 72, !184, i64 76, !184, i64 80, !184, i64 84, !184, i64 88, !184, i64 92, !184, i64 96, !184, i64 100}
!1152 = !DILocation(line: 580, column: 16, scope: !1101)
!1153 = !DILocation(line: 580, column: 32, scope: !1101)
!1154 = !DILocation(line: 0, scope: !1101)
!1155 = !DILocation(line: 587, column: 1, scope: !1101)
!1156 = !DILocation(line: 579, column: 5, scope: !1101)
!1157 = distinct !DISubprogram(name: "fdevent_set_tcp_nodelay", scope: !109, file: !109, line: 590, type: !1158, scopeLine: 591, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1160)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!101, !957, !957}
!1160 = !{!1161, !1162}
!1161 = !DILocalVariable(name: "fd", arg: 1, scope: !1157, file: !109, line: 590, type: !957)
!1162 = !DILocalVariable(name: "opt", arg: 2, scope: !1157, file: !109, line: 590, type: !957)
!1163 = !DILocation(line: 590, column: 40, scope: !1157)
!1164 = !DILocation(line: 590, column: 54, scope: !1157)
!1165 = !DILocation(line: 592, column: 23, scope: !1157)
!1166 = !DILocation(line: 592, column: 12, scope: !1157)
!1167 = !DILocation(line: 592, column: 5, scope: !1157)
!1168 = !DISubprogram(name: "setsockopt", scope: !208, file: !208, line: 277, type: !1169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!101, !101, !101, !101, !1171, !90}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1173 = distinct !DISubprogram(name: "fdevent_set_so_reuseaddr", scope: !109, file: !109, line: 596, type: !1158, scopeLine: 597, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1174)
!1174 = !{!1175, !1176}
!1175 = !DILocalVariable(name: "fd", arg: 1, scope: !1173, file: !109, line: 596, type: !957)
!1176 = !DILocalVariable(name: "opt", arg: 2, scope: !1173, file: !109, line: 596, type: !957)
!1177 = !DILocation(line: 596, column: 41, scope: !1173)
!1178 = !DILocation(line: 596, column: 55, scope: !1173)
!1179 = !DILocation(line: 598, column: 23, scope: !1173)
!1180 = !DILocation(line: 598, column: 12, scope: !1173)
!1181 = !DILocation(line: 598, column: 5, scope: !1173)
!1182 = distinct !DISubprogram(name: "fdevent_load_file", scope: !109, file: !109, line: 607, type: !1183, scopeLine: 608, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1196)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!413, !420, !1185, !1186, !1190, !1193}
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_error_st", file: !1188, line: 29, baseType: !1189)
!1188 = !DIFile(filename: "spack-src/src/base_decls.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "8960b8ee22f07d697e266aa4c1b4b9fa")
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "fdlog_st", file: !1188, line: 27, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!89, !93}
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{null, !89}
!1196 = !{!1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1241, !1244, !1245}
!1197 = !DILocalVariable(name: "fn", arg: 1, scope: !1182, file: !109, line: 607, type: !420)
!1198 = !DILocalVariable(name: "lim", arg: 2, scope: !1182, file: !109, line: 607, type: !1185)
!1199 = !DILocalVariable(name: "errh", arg: 3, scope: !1182, file: !109, line: 607, type: !1186)
!1200 = !DILocalVariable(name: "malloc_fn", arg: 4, scope: !1182, file: !109, line: 607, type: !1190)
!1201 = !DILocalVariable(name: "free_fn", arg: 5, scope: !1182, file: !109, line: 607, type: !1193)
!1202 = !DILocalVariable(name: "fd", scope: !1182, file: !109, line: 609, type: !101)
!1203 = !DILocalVariable(name: "sz", scope: !1182, file: !109, line: 610, type: !102)
!1204 = !DILocalVariable(name: "buf", scope: !1182, file: !109, line: 611, type: !413)
!1205 = !DILocalVariable(name: "st", scope: !1206, file: !109, line: 616, type: !1207)
!1206 = distinct !DILexicalBlock(scope: !1182, file: !109, line: 612, column: 8)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1208, line: 26, size: 1152, elements: !1209)
!1208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!1209 = !{!1210, !1212, !1214, !1216, !1217, !1219, !1221, !1222, !1223, !1225, !1227, !1229, !1237, !1238, !1239}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1207, file: !1208, line: 31, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !92, line: 145, baseType: !95)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1207, file: !1208, line: 36, baseType: !1213, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !92, line: 148, baseType: !95)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1207, file: !1208, line: 44, baseType: !1215, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !92, line: 151, baseType: !95)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1207, file: !1208, line: 45, baseType: !378, size: 32, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1207, file: !1208, line: 47, baseType: !1218, size: 32, offset: 224)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !92, line: 146, baseType: !7)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1207, file: !1208, line: 48, baseType: !1220, size: 32, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !92, line: 147, baseType: !7)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1207, file: !1208, line: 50, baseType: !101, size: 32, offset: 288)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1207, file: !1208, line: 52, baseType: !1211, size: 64, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1207, file: !1208, line: 57, baseType: !1224, size: 64, offset: 384)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !92, line: 152, baseType: !105)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1207, file: !1208, line: 61, baseType: !1226, size: 64, offset: 448)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !92, line: 175, baseType: !105)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1207, file: !1208, line: 63, baseType: !1228, size: 64, offset: 512)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !92, line: 180, baseType: !105)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1207, file: !1208, line: 74, baseType: !1230, size: 128, offset: 576)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1231, line: 11, size: 128, elements: !1232)
!1231 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1232 = !{!1233, !1235}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1230, file: !1231, line: 16, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !92, line: 160, baseType: !105)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1230, file: !1231, line: 21, baseType: !1236, size: 64, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !92, line: 197, baseType: !105)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1207, file: !1208, line: 75, baseType: !1230, size: 128, offset: 704)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1207, file: !1208, line: 76, baseType: !1230, size: 128, offset: 832)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1207, file: !1208, line: 89, baseType: !1240, size: 192, offset: 960)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1236, size: 192, elements: !146)
!1241 = !DILocalVariable(name: "rd", scope: !1242, file: !109, line: 629, type: !1006)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !109, line: 628, column: 17)
!1243 = distinct !DILexicalBlock(scope: !1206, file: !109, line: 628, column: 13)
!1244 = !DILocalVariable(name: "off", scope: !1242, file: !109, line: 630, type: !102)
!1245 = !DILocalVariable(name: "errnum", scope: !1182, file: !109, line: 645, type: !101)
!1246 = !DILocation(line: 607, column: 39, scope: !1182)
!1247 = !DILocation(line: 607, column: 50, scope: !1182)
!1248 = !DILocation(line: 607, column: 69, scope: !1182)
!1249 = !DILocation(line: 607, column: 82, scope: !1182)
!1250 = !DILocation(line: 607, column: 107, scope: !1182)
!1251 = !DILocation(line: 609, column: 5, scope: !1182)
!1252 = !DILocation(line: 609, column: 9, scope: !1182)
!1253 = !DILocation(line: 610, column: 5, scope: !1182)
!1254 = !DILocation(line: 610, column: 11, scope: !1182)
!1255 = !DILocation(line: 611, column: 5, scope: !1182)
!1256 = !DILocation(line: 611, column: 11, scope: !1182)
!1257 = !DILocation(line: 612, column: 5, scope: !1182)
!1258 = !DILocation(line: 613, column: 35, scope: !1206)
!1259 = !DILocation(line: 613, column: 14, scope: !1206)
!1260 = !DILocation(line: 613, column: 12, scope: !1206)
!1261 = !DILocation(line: 614, column: 13, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1206, file: !109, line: 614, column: 13)
!1263 = !DILocation(line: 614, column: 16, scope: !1262)
!1264 = !DILocation(line: 614, column: 13, scope: !1206)
!1265 = !DILocation(line: 614, column: 21, scope: !1262)
!1266 = !DILocation(line: 616, column: 9, scope: !1206)
!1267 = !DILocation(line: 616, column: 21, scope: !1206)
!1268 = !DILocation(line: 617, column: 24, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1206, file: !109, line: 617, column: 13)
!1270 = !DILocation(line: 617, column: 18, scope: !1269)
!1271 = !DILocation(line: 617, column: 15, scope: !1269)
!1272 = !DILocation(line: 617, column: 13, scope: !1206)
!1273 = !DILocation(line: 617, column: 34, scope: !1269)
!1274 = !DILocation(line: 619, column: 18, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1206, file: !109, line: 618, column: 13)
!1276 = !DILocation(line: 619, column: 17, scope: !1275)
!1277 = !DILocation(line: 619, column: 22, scope: !1275)
!1278 = !DILocation(line: 619, column: 27, scope: !1275)
!1279 = !DILocation(line: 619, column: 33, scope: !1275)
!1280 = !{!1281, !568, i64 48}
!1281 = !{!"stat", !568, i64 0, !568, i64 8, !568, i64 16, !184, i64 24, !184, i64 28, !184, i64 32, !184, i64 36, !568, i64 40, !568, i64 48, !568, i64 56, !568, i64 64, !1282, i64 72, !1282, i64 88, !1282, i64 104, !185, i64 120}
!1282 = !{!"timespec", !568, i64 0, !568, i64 8}
!1283 = !DILocation(line: 619, column: 45, scope: !1275)
!1284 = !DILocation(line: 619, column: 44, scope: !1275)
!1285 = !DILocation(line: 619, column: 41, scope: !1275)
!1286 = !DILocation(line: 618, column: 13, scope: !1206)
!1287 = !DILocation(line: 620, column: 13, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1275, file: !109, line: 619, column: 51)
!1289 = !DILocation(line: 620, column: 19, scope: !1288)
!1290 = !DILocation(line: 621, column: 13, scope: !1288)
!1291 = !DILocation(line: 624, column: 17, scope: !1206)
!1292 = !DILocation(line: 624, column: 12, scope: !1206)
!1293 = !DILocation(line: 625, column: 15, scope: !1206)
!1294 = !DILocation(line: 625, column: 33, scope: !1206)
!1295 = !DILocation(line: 625, column: 35, scope: !1206)
!1296 = !DILocation(line: 625, column: 13, scope: !1206)
!1297 = !DILocation(line: 626, column: 21, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1206, file: !109, line: 626, column: 13)
!1299 = !DILocation(line: 626, column: 18, scope: !1298)
