; ModuleID = 'samples/286.bc'
source_filename = "sdlz.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.dns_dlzmethods = type { ptr, ptr, ptr, ptr, ptr, ptr }
%struct.isc_logcategory = type { ptr, i32 }
%struct.isc_logmodule = type { ptr, i32 }
%struct.dns_dbmethods = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.dns_dbiteratormethods = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.dns_rdatasetmethods = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.dns_rdatasetitermethods = type { ptr, ptr, ptr, ptr }
%struct.isc_consttextregion = type { ptr, i32 }
%struct.isc_buffer = type { i32, ptr, i32, i32, i32, i32, %struct.anon.6, ptr, i8 }
%struct.anon.6 = type { ptr, ptr }
%union.anon = type { ptr }
%struct.isc__magic_t = type { i32 }
%struct.dns_sdlzlookup = type { i32, ptr, %struct.anon.7, %struct.anon.8, ptr, %struct.anon.9, %union.pthread_mutex_t, %struct.dns_rdatacallbacks, i32 }
%struct.anon.7 = type { ptr, ptr }
%struct.anon.8 = type { ptr, ptr }
%struct.anon.9 = type { ptr, ptr }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }

!164 = !DIEnumerator(name: "dns_rdatatype_key", value: 25)
!165 = !DIEnumerator(name: "dns_rdatatype_px", value: 26)
!166 = !DIEnumerator(name: "dns_rdatatype_gpos", value: 27)
!167 = !DIEnumerator(name: "dns_rdatatype_aaaa", value: 28)
!168 = !DIEnumerator(name: "dns_rdatatype_loc", value: 29)
!169 = !DIEnumerator(name: "dns_rdatatype_nxt", value: 30)
!170 = !DIEnumerator(name: "dns_rdatatype_eid", value: 31)
!171 = !DIEnumerator(name: "dns_rdatatype_nimloc", value: 32)
!172 = !DIEnumerator(name: "dns_rdatatype_srv", value: 33)
!173 = !DIEnumerator(name: "dns_rdatatype_atma", value: 34)
!174 = !DIEnumerator(name: "dns_rdatatype_naptr", value: 35)
!175 = !DIEnumerator(name: "dns_rdatatype_kx", value: 36)
!176 = !DIEnumerator(name: "dns_rdatatype_cert", value: 37)
!177 = !DIEnumerator(name: "dns_rdatatype_a6", value: 38)
!178 = !DIEnumerator(name: "dns_rdatatype_dname", value: 39)
!179 = !DIEnumerator(name: "dns_rdatatype_sink", value: 40)
!180 = !DIEnumerator(name: "dns_rdatatype_opt", value: 41)
!181 = !DIEnumerator(name: "dns_rdatatype_apl", value: 42)
!182 = !DIEnumerator(name: "dns_rdatatype_ds", value: 43)
!183 = !DIEnumerator(name: "dns_rdatatype_sshfp", value: 44)
!184 = !DIEnumerator(name: "dns_rdatatype_ipseckey", value: 45)
!185 = !DIEnumerator(name: "dns_rdatatype_rrsig", value: 46)
!186 = !DIEnumerator(name: "dns_rdatatype_nsec", value: 47)
!187 = !DIEnumerator(name: "dns_rdatatype_dnskey", value: 48)
!188 = !DIEnumerator(name: "dns_rdatatype_dhcid", value: 49)
!189 = !DIEnumerator(name: "dns_rdatatype_nsec3", value: 50)
!190 = !DIEnumerator(name: "dns_rdatatype_nsec3param", value: 51)
!191 = !DIEnumerator(name: "dns_rdatatype_tlsa", value: 52)
!192 = !DIEnumerator(name: "dns_rdatatype_smimea", value: 53)
!193 = !DIEnumerator(name: "dns_rdatatype_hip", value: 55)
!194 = !DIEnumerator(name: "dns_rdatatype_ninfo", value: 56)
!195 = !DIEnumerator(name: "dns_rdatatype_rkey", value: 57)
!196 = !DIEnumerator(name: "dns_rdatatype_talink", value: 58)
!197 = !DIEnumerator(name: "dns_rdatatype_cds", value: 59)
!198 = !DIEnumerator(name: "dns_rdatatype_cdnskey", value: 60)
!199 = !DIEnumerator(name: "dns_rdatatype_openpgpkey", value: 61)
!200 = !DIEnumerator(name: "dns_rdatatype_csync", value: 62)
!201 = !DIEnumerator(name: "dns_rdatatype_zonemd", value: 63)
!202 = !DIEnumerator(name: "dns_rdatatype_spf", value: 99)
!203 = !DIEnumerator(name: "dns_rdatatype_nid", value: 104)
!204 = !DIEnumerator(name: "dns_rdatatype_l32", value: 105)
!205 = !DIEnumerator(name: "dns_rdatatype_l64", value: 106)
!206 = !DIEnumerator(name: "dns_rdatatype_lp", value: 107)
!207 = !DIEnumerator(name: "dns_rdatatype_eui48", value: 108)
!208 = !DIEnumerator(name: "dns_rdatatype_eui64", value: 109)
!209 = !DIEnumerator(name: "dns_rdatatype_tkey", value: 249)
!210 = !DIEnumerator(name: "dns_rdatatype_tsig", value: 250)
!211 = !DIEnumerator(name: "dns_rdatatype_uri", value: 256)
!212 = !DIEnumerator(name: "dns_rdatatype_caa", value: 257)
!213 = !DIEnumerator(name: "dns_rdatatype_avc", value: 258)
!214 = !DIEnumerator(name: "dns_rdatatype_doa", value: 259)
!215 = !DIEnumerator(name: "dns_rdatatype_amtrelay", value: 260)
!216 = !DIEnumerator(name: "dns_rdatatype_ta", value: 32768)
!217 = !DIEnumerator(name: "dns_rdatatype_dlv", value: 32769)
!218 = !DIEnumerator(name: "dns_rdatatype_keydata", value: 65533)
!219 = !DIEnumerator(name: "dns_rdatatype_ixfr", value: 251)
!220 = !DIEnumerator(name: "dns_rdatatype_axfr", value: 252)
!221 = !DIEnumerator(name: "dns_rdatatype_mailb", value: 253)
!222 = !DIEnumerator(name: "dns_rdatatype_maila", value: 254)
!223 = !DIEnumerator(name: "dns_rdatatype_any", value: 255)
!224 = !{!225, !226, !233, !480, !254, !255, !1237, !285, !1344, !937, !2072, !403, !984, !2074}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc__magic_t", file: !229, line: 22, baseType: !230)
!229 = !DIFile(filename: "isc/include/isc/magic.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "8ece3f29379e72c0b49c17feca828350")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !229, line: 20, size: 32, elements: !231)
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !230, file: !229, line: 21, baseType: !80, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_sdlz_db_t", file: !235, line: 66, baseType: !236)
!235 = !DIFile(filename: "include/dns/sdlz.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "c409a1cc13bc727ebd9b6e03f17596bb")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_sdlz_db", file: !2, line: 98, size: 1664, elements: !237)
!237 = !{!238, !1235, !1236, !2068, !2069, !2070, !2071}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !236, file: !2, line: 100, baseType: !239, size: 1024)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_db_t", file: !89, line: 54, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_db", file: !241, line: 223, size: 1024, elements: !242)
!241 = !DIFile(filename: "include/dns/db.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "f7341a6445a0da00d6edbc7f74bf2ce5")
!242 = !{!243, !244, !245, !1211, !1212, !1213, !1214, !1215}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !240, file: !241, line: 224, baseType: !80, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !240, file: !241, line: 225, baseType: !80, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !240, file: !241, line: 226, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbmethods_t", file: !241, line: 200, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_dbmethods", file: !241, line: 71, size: 3072, elements: !249)
!249 = !{!250, !256, !260, !874, !875, !879, !884, !889, !893, !897, !901, !908, !912, !916, !920, !924, !928, !932, !975, !979, !1012, !1016, !1020, !1024, !1028, !1032, !1033, !1037, !1044, !1048, !1052, !1061, !1062, !1066, !1070, !1074, !1075, !1082, !1086, !1090, !1175, !1179, !1186, !1190, !1194, !1201, !1205, !1210}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "attach", scope: !248, file: !241, line: 72, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !254, !255}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !248, file: !241, line: 73, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !255}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "beginload", scope: !248, file: !241, line: 74, baseType: !261, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !254, !266}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_result_t", file: !265, line: 67, baseType: !80)
!265 = !DIFile(filename: "isc/include/isc/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "6a355582c4f962c465b18bab43b68c96")
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatacallbacks_t", file: !89, line: 120, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatacallbacks", file: !269, line: 36, size: 704, elements: !270)
!269 = !DIFile(filename: "include/dns/callbacks.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "63e693eb1cc4ad6f15f89851bc8cca18")
!270 = !{!271, !272, !785, !844, !863, !864, !869, !870, !871, !872, !873}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !268, file: !269, line: 37, baseType: !80, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !268, file: !269, line: 42, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_addrdatasetfunc_t", file: !89, line: 400, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!264, !225, !277, !364}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_name_t", file: !89, line: 107, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_name", file: !281, line: 104, size: 640, elements: !282)
!281 = !DIFile(filename: "include/dns/name.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "ec64c9a43875cd86cb4b0e37c1191a89")
!282 = !{!283, !284, !287, !288, !289, !290, !291, !354, !360}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !280, file: !281, line: 105, baseType: !80, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ndata", scope: !280, file: !281, line: 106, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !280, file: !281, line: 107, baseType: !80, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !280, file: !281, line: 108, baseType: !80, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !280, file: !281, line: 109, baseType: !80, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !280, file: !281, line: 110, baseType: !285, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !280, file: !281, line: 111, baseType: !292, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_buffer_t", file: !265, line: 35, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_buffer", file: !295, line: 173, size: 512, elements: !296)
!295 = !DIFile(filename: "isc/include/isc/buffer.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "feec9784066f3891a27281dd5bdccd55")
!296 = !{!297, !298, !299, !300, !301, !302, !303, !308, !352}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !294, file: !295, line: 174, baseType: !80, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !294, file: !295, line: 175, baseType: !225, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !294, file: !295, line: 178, baseType: !80, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !294, file: !295, line: 179, baseType: !80, size: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !294, file: !295, line: 180, baseType: !80, size: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !294, file: !295, line: 181, baseType: !80, size: 32, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !294, file: !295, line: 184, baseType: !304, size: 128, offset: 256)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !294, file: !295, line: 184, size: 128, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !304, file: !295, line: 184, baseType: !292, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !295, line: 184, baseType: !292, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !294, file: !295, line: 186, baseType: !309, size: 64, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mem_t", file: !265, line: 59, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mem", file: !312, line: 191, size: 128, elements: !313)
!312 = !DIFile(filename: "isc/include/isc/mem.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "587a841195795b087519b89f298822b2")
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !311, file: !312, line: 192, baseType: !80, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !311, file: !312, line: 193, baseType: !80, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !311, file: !312, line: 194, baseType: !317, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_memmethods_t", file: !312, line: 180, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_memmethods", file: !312, line: 170, size: 448, elements: !320)
!320 = !{!321, !329, !333, !338, !339, !343, !348}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "memget", scope: !319, file: !312, line: 171, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!225, !309, !325, !328, !80}
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !326, line: 70, baseType: !327)
!326 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!327 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "memput", scope: !319, file: !312, line: 172, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !309, !225, !325, !328, !80}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "memputanddetach", scope: !319, file: !312, line: 173, baseType: !334, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !337, !225, !325, !328, !80}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "memallocate", scope: !319, file: !312, line: 175, baseType: !322, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "memreallocate", scope: !319, file: !312, line: 176, baseType: !340, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!225, !309, !225, !325, !328, !80}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "memstrdup", scope: !319, file: !312, line: 178, baseType: !344, size: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!347, !309, !328, !328, !80}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "memfree", scope: !319, file: !312, line: 179, baseType: !349, size: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !309, !225, !328, !80}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "autore", scope: !294, file: !295, line: 188, baseType: !353, size: 8, offset: 448)
!353 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !280, file: !281, line: 112, baseType: !355, size: 128, offset: 384)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !280, file: !281, line: 112, size: 128, elements: !356)
!356 = !{!357, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !355, file: !281, line: 112, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !281, line: 112, baseType: !358, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !280, file: !281, line: 113, baseType: !361, size: 128, offset: 512)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !280, file: !281, line: 113, size: 128, elements: !362)
!362 = !{!363, !784}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !361, file: !281, line: 113, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataset_t", file: !89, line: 123, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdataset", file: !367, line: 107, size: 960, elements: !368)
!367 = !DIFile(filename: "include/dns/rdataset.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "a2414fd23f718a363582354673aed6a8")
!368 = !{!369, !370, !761, !766, !767, !768, !769, !770, !771, !772, !773, !774, !777, !778, !779, !780, !781, !782, !783}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !366, file: !367, line: 108, baseType: !80, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !366, file: !367, line: 109, baseType: !371, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetmethods_t", file: !367, line: 96, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetmethods", file: !367, line: 64, size: 1024, elements: !374)
!374 = !{!375, !379, !383, !384, !410, !414, !418, !422, !426, !427, !428, !433, !434, !435, !439, !445}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "disassociate", scope: !373, file: !367, line: 65, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !364}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !373, file: !367, line: 66, baseType: !380, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!264, !364}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !373, file: !367, line: 67, baseType: !380, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !373, file: !367, line: 68, baseType: !385, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !364, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdata_t", file: !89, line: 119, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdata", file: !391, line: 112, size: 320, elements: !392)
!391 = !DIFile(filename: "include/dns/rdata.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "e790fb4f336bc4fdcd566550403b32a6")
!392 = !{!393, !394, !395, !402, !404, !405}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !391, line: 113, baseType: !285, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !390, file: !391, line: 114, baseType: !80, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !390, file: !391, line: 115, baseType: !396, size: 16, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataclass_t", file: !89, line: 121, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !398, line: 25, baseType: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !400, line: 40, baseType: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!401 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !391, line: 116, baseType: !403, size: 16, offset: 112)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatatype_t", file: !89, line: 126, baseType: !397)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !390, file: !391, line: 117, baseType: !80, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !390, file: !391, line: 118, baseType: !406, size: 128, offset: 192)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !391, line: 118, size: 128, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !406, file: !391, line: 118, baseType: !388, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !406, file: !391, line: 118, baseType: !388, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !373, file: !367, line: 70, baseType: !411, size: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !364, !364}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !373, file: !367, line: 72, baseType: !415, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!80, !364}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "addnoqname", scope: !373, file: !367, line: 73, baseType: !419, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!264, !364, !277}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "getnoqname", scope: !373, file: !367, line: 75, baseType: !423, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!264, !364, !358, !364, !364}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "addclosest", scope: !373, file: !367, line: 79, baseType: !419, size: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "getclosest", scope: !373, file: !367, line: 81, baseType: !423, size: 64, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "settrust", scope: !373, file: !367, line: 85, baseType: !429, size: 64, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !364, !432}
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_trust_t", file: !89, line: 140, baseType: !397)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !373, file: !367, line: 87, baseType: !376, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "clearprefetch", scope: !373, file: !367, line: 88, baseType: !376, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "setownercase", scope: !373, file: !367, line: 89, baseType: !436, size: 64, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !364, !277}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "getownercase", scope: !373, file: !367, line: 91, baseType: !440, size: 64, offset: 896)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !443, !358}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "addglue", scope: !373, file: !367, line: 93, baseType: !446, size: 64, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!264, !364, !449, !451}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbversion_t", file: !89, line: 61, baseType: null)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_message_t", file: !89, line: 103, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_message", file: !454, line: 197, size: 3840, elements: !455)
!454 = !DIFile(filename: "include/dns/message.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "6416f0e57c4314c86bb1ccbb29bdbc0d")
!455 = !{!456, !457, !459, !460, !462, !464, !465, !467, !474, !476, !477, !478, !479, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !533, !534, !541, !542, !548, !549, !557, !562, !567, !572, !601, !602, !603, !604, !605, !609, !614, !615, !616, !617, !621, !622, !623, !624, !633}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !453, file: !454, line: 199, baseType: !80, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !453, file: !454, line: 201, baseType: !458, size: 16, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_messageid_t", file: !89, line: 104, baseType: !397)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !453, file: !454, line: 202, baseType: !80, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !453, file: !454, line: 203, baseType: !461, size: 16, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rcode_t", file: !89, line: 118, baseType: !397)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !453, file: !454, line: 204, baseType: !463, size: 16, offset: 112)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_opcode_t", file: !89, line: 111, baseType: !397)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !453, file: !454, line: 205, baseType: !396, size: 16, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !453, file: !454, line: 208, baseType: !466, size: 128, offset: 160)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 128, elements: !35)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sections", scope: !453, file: !454, line: 211, baseType: !468, size: 512, offset: 320)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 512, elements: !35)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_namelist_t", file: !89, line: 108, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 108, size: 128, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !470, file: !89, line: 108, baseType: !358, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !470, file: !89, line: 108, baseType: !358, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cursors", scope: !453, file: !454, line: 212, baseType: !475, size: 256, offset: 832)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 256, elements: !35)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !453, file: !454, line: 213, baseType: !364, size: 64, offset: 1088)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "sig0", scope: !453, file: !454, line: 214, baseType: !364, size: 64, offset: 1152)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tsig", scope: !453, file: !454, line: 215, baseType: !364, size: 64, offset: 1216)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !453, file: !454, line: 217, baseType: !480, size: 32, offset: 1280)
!480 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "from_to_wire", scope: !453, file: !454, line: 218, baseType: !80, size: 2, offset: 1312, flags: DIFlagBitField, extraData: i64 1312)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "header_ok", scope: !453, file: !454, line: 219, baseType: !80, size: 1, offset: 1314, flags: DIFlagBitField, extraData: i64 1312)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "question_ok", scope: !453, file: !454, line: 220, baseType: !80, size: 1, offset: 1315, flags: DIFlagBitField, extraData: i64 1312)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_continuation", scope: !453, file: !454, line: 221, baseType: !80, size: 1, offset: 1316, flags: DIFlagBitField, extraData: i64 1312)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "verified_sig", scope: !453, file: !454, line: 222, baseType: !80, size: 1, offset: 1317, flags: DIFlagBitField, extraData: i64 1312)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "verify_attempted", scope: !453, file: !454, line: 223, baseType: !80, size: 1, offset: 1318, flags: DIFlagBitField, extraData: i64 1312)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "free_query", scope: !453, file: !454, line: 224, baseType: !80, size: 1, offset: 1319, flags: DIFlagBitField, extraData: i64 1312)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "free_saved", scope: !453, file: !454, line: 225, baseType: !80, size: 1, offset: 1320, flags: DIFlagBitField, extraData: i64 1312)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cc_ok", scope: !453, file: !454, line: 226, baseType: !80, size: 1, offset: 1321, flags: DIFlagBitField, extraData: i64 1312)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cc_bad", scope: !453, file: !454, line: 227, baseType: !80, size: 1, offset: 1322, flags: DIFlagBitField, extraData: i64 1312)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tkey", scope: !453, file: !454, line: 228, baseType: !80, size: 1, offset: 1323, flags: DIFlagBitField, extraData: i64 1312)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass_set", scope: !453, file: !454, line: 229, baseType: !80, size: 1, offset: 1324, flags: DIFlagBitField, extraData: i64 1312)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "opt_reserved", scope: !453, file: !454, line: 231, baseType: !80, size: 32, offset: 1344)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sig_reserved", scope: !453, file: !454, line: 232, baseType: !80, size: 32, offset: 1376)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !453, file: !454, line: 233, baseType: !80, size: 32, offset: 1408)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !453, file: !454, line: 235, baseType: !397, size: 16, offset: 1440)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "padding_off", scope: !453, file: !454, line: 236, baseType: !80, size: 32, offset: 1472)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !453, file: !454, line: 238, baseType: !292, size: 64, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cctx", scope: !453, file: !454, line: 239, baseType: !500, size: 64, offset: 1600)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compress_t", file: !89, line: 53, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compress", file: !503, line: 66, size: 18688, elements: !504)
!503 = !DIFile(filename: "include/dns/compress.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "ae360072e6dd15c4fe76c4efa2dcea4c")
!504 = !{!505, !506, !507, !508, !527, !531, !532}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !502, file: !503, line: 67, baseType: !80, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !502, file: !503, line: 68, baseType: !80, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "edns", scope: !502, file: !503, line: 69, baseType: !480, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !502, file: !503, line: 71, baseType: !509, size: 4096, offset: 128)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 4096, elements: !525)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compressnode_t", file: !503, line: 56, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compressnode", file: !503, line: 58, size: 896, elements: !513)
!513 = !{!514, !515, !516, !517, !524}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !503, line: 59, baseType: !510, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !512, file: !503, line: 60, baseType: !397, size: 16, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !512, file: !503, line: 61, baseType: !397, size: 16, offset: 80)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !512, file: !503, line: 62, baseType: !518, size: 128, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_region_t", file: !265, line: 65, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_region", file: !520, line: 21, size: 128, elements: !521)
!520 = !DIFile(filename: "isc/include/isc/region.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "2ed4a07dc05ddbd48f51e2dc9be9f317")
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !519, file: !520, line: 22, baseType: !285, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !519, file: !520, line: 23, baseType: !80, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !512, file: !503, line: 63, baseType: !279, size: 640, offset: 256)
!525 = !{!526}
!526 = !DISubrange(count: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "initialnodes", scope: !502, file: !503, line: 73, baseType: !528, size: 14336, offset: 4224)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 14336, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !502, file: !503, line: 74, baseType: !397, size: 16, offset: 18560)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !502, file: !503, line: 75, baseType: !309, size: 64, offset: 18624)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !453, file: !454, line: 241, baseType: !309, size: 64, offset: 1664)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "namepool", scope: !453, file: !454, line: 242, baseType: !535, size: 64, offset: 1728)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mempool_t", file: !265, line: 60, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mempool", file: !312, line: 205, size: 64, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !537, file: !312, line: 206, baseType: !80, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !537, file: !312, line: 207, baseType: !80, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rdspool", scope: !453, file: !454, line: 243, baseType: !535, size: 64, offset: 1792)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "scratchpad", scope: !453, file: !454, line: 245, baseType: !543, size: 128, offset: 1856)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_bufferlist_t", file: !265, line: 36, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 36, size: 128, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !544, file: !265, line: 36, baseType: !292, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !544, file: !265, line: 36, baseType: !292, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !453, file: !454, line: 246, baseType: !543, size: 128, offset: 1984)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rdatas", scope: !453, file: !454, line: 248, baseType: !550, size: 128, offset: 2112)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !454, line: 248, size: 128, elements: !551)
!551 = !{!552, !556}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !550, file: !454, line: 248, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_msgblock_t", file: !454, line: 189, baseType: !555)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_msgblock", file: !454, line: 189, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !550, file: !454, line: 248, baseType: !553, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rdatalists", scope: !453, file: !454, line: 249, baseType: !558, size: 128, offset: 2240)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !454, line: 249, size: 128, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !558, file: !454, line: 249, baseType: !553, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !558, file: !454, line: 249, baseType: !553, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !453, file: !454, line: 250, baseType: !563, size: 128, offset: 2368)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !454, line: 250, size: 128, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !563, file: !454, line: 250, baseType: !553, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !563, file: !454, line: 250, baseType: !553, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "freerdata", scope: !453, file: !454, line: 252, baseType: !568, size: 128, offset: 2496)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !454, line: 252, size: 128, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !568, file: !454, line: 252, baseType: !388, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !568, file: !454, line: 252, baseType: !388, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "freerdatalist", scope: !453, file: !454, line: 253, baseType: !573, size: 128, offset: 2624)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !454, line: 253, size: 128, elements: !574)
!574 = !{!575, !600}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !573, file: !454, line: 253, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatalist_t", file: !89, line: 122, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatalist", file: !579, line: 47, size: 640, elements: !580)
!579 = !DIFile(filename: "include/dns/rdatalist.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "83ad1004003459f099937cac6d2eb8e0")
!580 = !{!581, !582, !583, !584, !588, !593, !598}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !578, file: !579, line: 48, baseType: !396, size: 16)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !578, file: !579, line: 49, baseType: !403, size: 16, offset: 16)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "covers", scope: !578, file: !579, line: 50, baseType: !403, size: 16, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !578, file: !579, line: 51, baseType: !585, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_ttl_t", file: !89, line: 144, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !398, line: 26, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !400, line: 42, baseType: !80)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rdata", scope: !578, file: !579, line: 52, baseType: !589, size: 128, offset: 128)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !578, file: !579, line: 52, size: 128, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !589, file: !579, line: 52, baseType: !388, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !589, file: !579, line: 52, baseType: !388, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !578, file: !579, line: 53, baseType: !594, size: 128, offset: 256)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !578, file: !579, line: 53, size: 128, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !594, file: !579, line: 53, baseType: !576, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !594, file: !579, line: 53, baseType: !576, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !578, file: !579, line: 59, baseType: !599, size: 256, offset: 384)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !50)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !573, file: !454, line: 253, baseType: !576, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tsigstatus", scope: !453, file: !454, line: 255, baseType: !461, size: 16, offset: 2752)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "querytsigstatus", scope: !453, file: !454, line: 256, baseType: !461, size: 16, offset: 2768)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tsigname", scope: !453, file: !454, line: 257, baseType: !358, size: 64, offset: 2816)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "querytsig", scope: !453, file: !454, line: 258, baseType: !364, size: 64, offset: 2880)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tsigkey", scope: !453, file: !454, line: 259, baseType: !606, size: 64, offset: 2944)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_tsigkey_t", file: !89, line: 143, baseType: !608)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_tsigkey", file: !89, line: 143, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tsigctx", scope: !453, file: !454, line: 260, baseType: !610, size: 64, offset: 3008)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_context_t", file: !612, line: 45, baseType: !613)
!612 = !DIFile(filename: "include/dst/dst.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "10e76bcacbe005e6cc7dee2ac6ffac9a")
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_context", file: !612, line: 45, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sigstart", scope: !453, file: !454, line: 261, baseType: !480, size: 32, offset: 3072)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "timeadjust", scope: !453, file: !454, line: 262, baseType: !480, size: 32, offset: 3104)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sig0name", scope: !453, file: !454, line: 264, baseType: !358, size: 64, offset: 3136)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sig0key", scope: !453, file: !454, line: 265, baseType: !618, size: 64, offset: 3200)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_key_t", file: !612, line: 44, baseType: !620)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_key", file: !612, line: 44, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sig0status", scope: !453, file: !454, line: 266, baseType: !461, size: 16, offset: 3264)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !453, file: !454, line: 267, baseType: !518, size: 128, offset: 3328)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !453, file: !454, line: 268, baseType: !518, size: 128, offset: 3456)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !453, file: !454, line: 270, baseType: !625, size: 64, offset: 3584)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetorderfunc_t", file: !89, line: 415, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!480, !629, !631}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "order_arg", scope: !453, file: !454, line: 271, baseType: !634, size: 192, offset: 3648)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_sortlist_arg_t", file: !89, line: 134, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_sortlist_arg", file: !454, line: 191, size: 192, elements: !636)
!636 = !{!637, !755, !758}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !635, file: !454, line: 192, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclenv_t", file: !89, line: 32, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclenv", file: !79, line: 90, size: 192, elements: !641)
!641 = !{!642, !753, !754}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "localhost", scope: !640, file: !79, line: 91, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_acl_t", file: !89, line: 30, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_acl", file: !79, line: 76, size: 640, elements: !646)
!646 = !{!647, !648, !649, !657, !733, !744, !745, !746, !747, !748}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !645, file: !79, line: 77, baseType: !80, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !645, file: !79, line: 78, baseType: !309, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !645, file: !79, line: 79, baseType: !650, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_refcount_t", file: !651, line: 33, baseType: !652)
!651 = !DIFile(filename: "isc/include/isc/refcount.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "91efe302f7658e72e20c0f8ed1bea09f")
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_uint_fast32_t", file: !653, line: 123, baseType: !654)
!653 = !DIFile(filename: "/usr/lib/clang/18/include/stdatomic.h", directory: "", checksumkind: CSK_MD5, checksum: "1c2aee2a953dfc5407753d1f439b6977")
!654 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !656, line: 74, baseType: !327)
!656 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!657 = !DIDerivedType(tag: DW_TAG_member, name: "iptable", scope: !645, file: !79, line: 80, baseType: !658, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_iptable_t", file: !89, line: 92, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_iptable", file: !661, line: 24, size: 384, elements: !662)
!661 = !DIFile(filename: "include/dns/iptable.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "44ddbfe18541d6c9d7b36fcfec983270")
!662 = !{!663, !664, !665, !666, !728}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !660, file: !661, line: 25, baseType: !80, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !660, file: !661, line: 26, baseType: !309, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !660, file: !661, line: 27, baseType: !650, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "radix", scope: !660, file: !661, line: 28, baseType: !667, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_radix_tree_t", file: !669, line: 108, baseType: !670)
!669 = !DIFile(filename: "isc/include/isc/radix.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "349efdba94ad90663f1e49de2024c1c4")
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_radix_tree", file: !669, line: 101, size: 320, elements: !671)
!671 = !{!672, !673, !674, !725, !726, !727}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !670, file: !669, line: 102, baseType: !80, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !670, file: !669, line: 103, baseType: !309, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !670, file: !669, line: 104, baseType: !675, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_radix_node_t", file: !669, line: 96, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_radix_node", file: !669, line: 87, size: 576, elements: !678)
!678 = !{!679, !680, !681, !715, !717, !718, !719, !723}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !677, file: !669, line: 88, baseType: !309, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !677, file: !669, line: 89, baseType: !586, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !677, file: !669, line: 90, baseType: !682, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_prefix_t", file: !669, line: 54, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_prefix", file: !669, line: 45, size: 320, elements: !685)
!685 = !{!686, !687, !688, !689, !690}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !684, file: !669, line: 46, baseType: !309, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !684, file: !669, line: 47, baseType: !80, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bitlen", scope: !684, file: !669, line: 48, baseType: !80, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !684, file: !669, line: 49, baseType: !650, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !684, file: !669, line: 53, baseType: !691, size: 128, offset: 192)
!691 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !684, file: !669, line: 50, size: 128, elements: !692)
!692 = !{!693, !699}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !691, file: !669, line: 51, baseType: !694, size: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !695, line: 31, size: 32, elements: !696)
!695 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !694, file: !695, line: 33, baseType: !698, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !695, line: 30, baseType: !586)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !691, file: !669, line: 52, baseType: !700, size: 128)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !695, line: 219, size: 128, elements: !701)
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !700, file: !695, line: 226, baseType: !703, size: 128)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !695, line: 221, size: 128, elements: !704)
!704 = !{!705, !709, !713}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !703, file: !695, line: 223, baseType: !706, size: 128)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 128, elements: !529)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !398, line: 24, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !400, line: 38, baseType: !286)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !703, file: !695, line: 224, baseType: !710, size: 128)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 128, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !703, file: !695, line: 225, baseType: !714, size: 128)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 128, elements: !35)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !677, file: !669, line: 91, baseType: !716, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !677, file: !669, line: 91, baseType: !716, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !677, file: !669, line: 92, baseType: !716, size: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !677, file: !669, line: 93, baseType: !720, size: 128, offset: 384)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 128, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 2)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "node_num", scope: !677, file: !669, line: 94, baseType: !724, size: 64, offset: 512)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 64, elements: !721)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "maxbits", scope: !670, file: !669, line: 105, baseType: !586, size: 32, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "num_active_node", scope: !670, file: !669, line: 106, baseType: !480, size: 32, offset: 224)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "num_added_node", scope: !670, file: !669, line: 107, baseType: !480, size: 32, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nextincache", scope: !660, file: !661, line: 29, baseType: !729, size: 128, offset: 256)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !660, file: !661, line: 29, size: 128, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !729, file: !661, line: 29, baseType: !658, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !729, file: !661, line: 29, baseType: !658, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !645, file: !79, line: 82, baseType: !734, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclelement_t", file: !89, line: 31, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclelement", file: !79, line: 65, size: 832, elements: !737)
!737 = !{!738, !740, !741, !742, !743}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !736, file: !79, line: 66, baseType: !739, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclelementtype_t", file: !79, line: 56, baseType: !78)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !736, file: !79, line: 67, baseType: !353, size: 8, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "keyname", scope: !736, file: !79, line: 68, baseType: !279, size: 640, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nestedacl", scope: !736, file: !79, line: 72, baseType: !643, size: 64, offset: 704)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "node_num", scope: !736, file: !79, line: 73, baseType: !480, size: 32, offset: 768)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "has_negatives", scope: !645, file: !79, line: 83, baseType: !353, size: 8, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !645, file: !79, line: 84, baseType: !80, size: 32, offset: 352)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !645, file: !79, line: 85, baseType: !80, size: 32, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !645, file: !79, line: 86, baseType: !347, size: 64, offset: 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nextincache", scope: !645, file: !79, line: 87, baseType: !749, size: 128, offset: 512)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !645, file: !79, line: 87, size: 128, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !749, file: !79, line: 87, baseType: !643, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !749, file: !79, line: 87, baseType: !643, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "localnets", scope: !640, file: !79, line: 92, baseType: !643, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "match_mapped", scope: !640, file: !79, line: 93, baseType: !353, size: 8, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !635, file: !454, line: 193, baseType: !756, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !635, file: !454, line: 194, baseType: !759, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !366, file: !367, line: 110, baseType: !762, size: 128, offset: 128)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !366, file: !367, line: 110, size: 128, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !762, file: !367, line: 110, baseType: !364, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !762, file: !367, line: 110, baseType: !364, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !366, file: !367, line: 117, baseType: !396, size: 16, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !367, line: 118, baseType: !403, size: 16, offset: 272)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !366, file: !367, line: 119, baseType: !585, size: 32, offset: 288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "stale_ttl", scope: !366, file: !367, line: 124, baseType: !585, size: 32, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !366, file: !367, line: 125, baseType: !432, size: 16, offset: 352)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "covers", scope: !366, file: !367, line: 126, baseType: !403, size: 16, offset: 368)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !366, file: !367, line: 131, baseType: !80, size: 32, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !366, file: !367, line: 139, baseType: !586, size: 32, offset: 416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "resign", scope: !366, file: !367, line: 145, baseType: !775, size: 32, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_stdtime_t", file: !776, line: 26, baseType: !586)
!776 = !DIFile(filename: "../../lib/isc/unix/include/isc/stdtime.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "b8868fded6c0eb282ad50986c628a693")
!777 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !366, file: !367, line: 152, baseType: !225, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !366, file: !367, line: 153, baseType: !225, size: 64, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !366, file: !367, line: 154, baseType: !225, size: 64, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "privateuint4", scope: !366, file: !367, line: 155, baseType: !80, size: 32, offset: 704)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !366, file: !367, line: 156, baseType: !225, size: 64, offset: 768)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !366, file: !367, line: 157, baseType: !631, size: 64, offset: 832)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "private7", scope: !366, file: !367, line: 158, baseType: !631, size: 64, offset: 896)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !361, file: !281, line: 113, baseType: !364, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "deserialize", scope: !268, file: !269, line: 48, baseType: !786, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_deserializefunc_t", file: !89, line: 432, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!264, !225, !790, !842}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !792, line: 7, baseType: !793)
!792 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !794, line: 49, size: 1728, elements: !795)
!794 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !811, !813, !814, !815, !818, !819, !821, !825, !828, !830, !833, !836, !837, !838, !839, !840}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !793, file: !794, line: 51, baseType: !480, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !793, file: !794, line: 54, baseType: !347, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !793, file: !794, line: 55, baseType: !347, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !793, file: !794, line: 56, baseType: !347, size: 64, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !793, file: !794, line: 57, baseType: !347, size: 64, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !793, file: !794, line: 58, baseType: !347, size: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !793, file: !794, line: 59, baseType: !347, size: 64, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !793, file: !794, line: 60, baseType: !347, size: 64, offset: 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !793, file: !794, line: 61, baseType: !347, size: 64, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !793, file: !794, line: 64, baseType: !347, size: 64, offset: 576)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !793, file: !794, line: 65, baseType: !347, size: 64, offset: 640)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !793, file: !794, line: 66, baseType: !347, size: 64, offset: 704)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !793, file: !794, line: 68, baseType: !809, size: 64, offset: 768)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !794, line: 36, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !793, file: !794, line: 70, baseType: !812, size: 64, offset: 832)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !793, file: !794, line: 72, baseType: !480, size: 32, offset: 896)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !793, file: !794, line: 73, baseType: !480, size: 32, offset: 928)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !793, file: !794, line: 74, baseType: !816, size: 64, offset: 960)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !400, line: 152, baseType: !817)
!817 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !793, file: !794, line: 77, baseType: !401, size: 16, offset: 1024)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !793, file: !794, line: 78, baseType: !820, size: 8, offset: 1040)
!820 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !793, file: !794, line: 79, baseType: !822, size: 8, offset: 1048)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 1)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !793, file: !794, line: 81, baseType: !826, size: 64, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !794, line: 43, baseType: null)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !793, file: !794, line: 89, baseType: !829, size: 64, offset: 1152)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !400, line: 153, baseType: !817)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !793, file: !794, line: 91, baseType: !831, size: 64, offset: 1216)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !794, line: 37, flags: DIFlagFwdDecl)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !793, file: !794, line: 92, baseType: !834, size: 64, offset: 1280)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !794, line: 38, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !793, file: !794, line: 93, baseType: !812, size: 64, offset: 1344)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !793, file: !794, line: 94, baseType: !225, size: 64, offset: 1408)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !793, file: !794, line: 95, baseType: !325, size: 64, offset: 1472)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !793, file: !794, line: 96, baseType: !480, size: 32, offset: 1536)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !793, file: !794, line: 98, baseType: !841, size: 160, offset: 1568)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !23)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !843, line: 85, baseType: !816)
!843 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rawdata", scope: !268, file: !269, line: 54, baseType: !845, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rawdatafunc_t", file: !89, line: 397, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !849, !852}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_zone_t", file: !89, line: 149, baseType: !851)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_zone", file: !89, line: 149, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_masterrawheader_t", file: !89, line: 101, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_masterrawheader", file: !855, line: 75, size: 192, elements: !856)
!855 = !DIFile(filename: "include/dns/master.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "9c4212df68cef85d47e8b24e204803a0")
!856 = !{!857, !858, !859, !860, !861, !862}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !854, file: !855, line: 76, baseType: !586, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !854, file: !855, line: 80, baseType: !586, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dumptime", scope: !854, file: !855, line: 82, baseType: !586, size: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !854, file: !855, line: 84, baseType: !586, size: 32, offset: 96)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "sourceserial", scope: !854, file: !855, line: 85, baseType: !586, size: 32, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lastxfrin", scope: !854, file: !855, line: 87, baseType: !586, size: 32, offset: 160)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !268, file: !269, line: 55, baseType: !849, size: 64, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !268, file: !269, line: 60, baseType: !865, size: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !868, !328, null}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !268, file: !269, line: 64, baseType: !865, size: 64, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "add_private", scope: !268, file: !269, line: 68, baseType: !225, size: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "deserialize_private", scope: !268, file: !269, line: 69, baseType: !225, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "error_private", scope: !268, file: !269, line: 70, baseType: !225, size: 64, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "warn_private", scope: !268, file: !269, line: 71, baseType: !225, size: 64, offset: 640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "endload", scope: !248, file: !241, line: 76, baseType: !261, size: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "serialize", scope: !248, file: !241, line: 78, baseType: !876, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!264, !254, !449, !790}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !248, file: !241, line: 80, baseType: !880, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!264, !254, !449, !328, !883}
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_masterformat_t", file: !89, line: 218, baseType: !88)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "currentversion", scope: !248, file: !241, line: 83, baseType: !885, size: 64, offset: 384)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !254, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "newversion", scope: !248, file: !241, line: 85, baseType: !890, size: 64, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!264, !254, !888}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "attachversion", scope: !248, file: !241, line: 87, baseType: !894, size: 64, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !254, !449, !888}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "closeversion", scope: !248, file: !241, line: 89, baseType: !898, size: 64, offset: 576)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !254, !888, !353}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "findnode", scope: !248, file: !241, line: 92, baseType: !902, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!264, !254, !277, !353, !905}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbnode_t", file: !89, line: 58, baseType: null)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !248, file: !241, line: 95, baseType: !909, size: 64, offset: 704)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!264, !254, !277, !449, !403, !80, !775, !905, !358, !364, !364}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "findzonecut", scope: !248, file: !241, line: 102, baseType: !913, size: 64, offset: 768)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!264, !254, !277, !80, !775, !905, !358, !358, !364, !364}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "attachnode", scope: !248, file: !241, line: 109, baseType: !917, size: 64, offset: 832)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !254, !906, !905}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "detachnode", scope: !248, file: !241, line: 112, baseType: !921, size: 64, offset: 896)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !254, !905}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "expirenode", scope: !248, file: !241, line: 114, baseType: !925, size: 64, offset: 960)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!264, !254, !906, !775}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "printnode", scope: !248, file: !241, line: 116, baseType: !929, size: 64, offset: 1024)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !254, !906, !790}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "createiterator", scope: !248, file: !241, line: 118, baseType: !933, size: 64, offset: 1088)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!264, !254, !80, !936}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbiterator_t", file: !89, line: 56, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_dbiterator", file: !940, line: 97, size: 256, elements: !941)
!940 = !DIFile(filename: "include/dns/dbiterator.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "e80aa0115ff591a0b9e600123d76473d")
!941 = !{!942, !943, !972, !973, !974}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !939, file: !940, line: 99, baseType: !80, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !939, file: !940, line: 100, baseType: !944, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbiteratormethods_t", file: !940, line: 83, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_dbiteratormethods", file: !940, line: 70, size: 576, elements: !947)
!947 = !{!948, !952, !956, !957, !961, !962, !963, !967, !968}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !946, file: !940, line: 71, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !936}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !946, file: !940, line: 72, baseType: !953, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!264, !937}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !946, file: !940, line: 73, baseType: !953, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !946, file: !940, line: 74, baseType: !958, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!264, !937, !277}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !946, file: !940, line: 76, baseType: !953, size: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !946, file: !940, line: 77, baseType: !953, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !946, file: !940, line: 78, baseType: !964, size: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!264, !937, !905, !358}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !946, file: !940, line: 80, baseType: !953, size: 64, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !946, file: !940, line: 81, baseType: !969, size: 64, offset: 512)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!264, !937, !358}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !939, file: !940, line: 101, baseType: !254, size: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "relative_names", scope: !939, file: !940, line: 102, baseType: !353, size: 8, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "cleaning", scope: !939, file: !940, line: 103, baseType: !353, size: 8, offset: 200)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "findrdataset", scope: !248, file: !241, line: 120, baseType: !976, size: 64, offset: 1152)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!264, !254, !906, !449, !403, !403, !775, !364, !364}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "allrdatasets", scope: !248, file: !241, line: 127, baseType: !980, size: 64, offset: 1216)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!264, !254, !906, !449, !775, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetiter_t", file: !89, line: 125, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetiter", file: !987, line: 89, size: 384, elements: !988)
!987 = !DIFile(filename: "include/dns/rdatasetiter.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "9746ed7a00ac2faebfbf0cffc47d675f")
!988 = !{!989, !990, !1008, !1009, !1010, !1011}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !986, file: !987, line: 91, baseType: !80, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !986, file: !987, line: 92, baseType: !991, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetitermethods_t", file: !987, line: 75, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetitermethods", file: !987, line: 69, size: 256, elements: !994)
!994 = !{!995, !999, !1003, !1004}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !993, file: !987, line: 70, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{null, !983}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !993, file: !987, line: 71, baseType: !1000, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!264, !984}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !993, file: !987, line: 72, baseType: !1000, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !993, file: !987, line: 73, baseType: !1005, size: 64, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !984, !364}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !986, file: !987, line: 93, baseType: !254, size: 64, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !986, file: !987, line: 94, baseType: !906, size: 64, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !986, file: !987, line: 95, baseType: !449, size: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "now", scope: !986, file: !987, line: 96, baseType: !775, size: 32, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "addrdataset", scope: !248, file: !241, line: 131, baseType: !1013, size: 64, offset: 1280)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!264, !254, !906, !449, !775, !364, !80, !364}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "subtractrdataset", scope: !248, file: !241, line: 137, baseType: !1017, size: 64, offset: 1344)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!264, !254, !906, !449, !364, !80, !364}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "deleterdataset", scope: !248, file: !241, line: 142, baseType: !1021, size: 64, offset: 1408)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!264, !254, !906, !449, !403, !403}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "issecure", scope: !248, file: !241, line: 146, baseType: !1025, size: 64, offset: 1472)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!353, !254}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "nodecount", scope: !248, file: !241, line: 147, baseType: !1029, size: 64, offset: 1536)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!80, !254}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ispersistent", scope: !248, file: !241, line: 148, baseType: !1025, size: 64, offset: 1600)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "overmem", scope: !248, file: !241, line: 149, baseType: !1034, size: 64, offset: 1664)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !254, !353}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "settask", scope: !248, file: !241, line: 150, baseType: !1038, size: 64, offset: 1728)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !254, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_task_t", file: !265, line: 77, baseType: !1043)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_task", file: !265, line: 77, flags: DIFlagFwdDecl)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "getoriginnode", scope: !248, file: !241, line: 151, baseType: !1045, size: 64, offset: 1792)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!264, !254, !905}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "transfernode", scope: !248, file: !241, line: 152, baseType: !1049, size: 64, offset: 1856)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{null, !254, !905, !905}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "getnsec3parameters", scope: !248, file: !241, line: 154, baseType: !1053, size: 64, offset: 1920)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!264, !254, !449, !1056, !1058, !1059, !285, !1060}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_hash_t", file: !89, line: 166, baseType: !95)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "findnsec3node", scope: !248, file: !241, line: 161, baseType: !902, size: 64, offset: 1984)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "setsigningtime", scope: !248, file: !241, line: 164, baseType: !1063, size: 64, offset: 2048)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!264, !254, !364, !775}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "getsigningtime", scope: !248, file: !241, line: 167, baseType: !1067, size: 64, offset: 2112)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!264, !254, !364, !358}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "resigned", scope: !248, file: !241, line: 170, baseType: !1071, size: 64, offset: 2176)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !254, !364, !449}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "isdnssec", scope: !248, file: !241, line: 172, baseType: !1025, size: 64, offset: 2240)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "getrrsetstats", scope: !248, file: !241, line: 173, baseType: !1076, size: 64, offset: 2304)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!1079, !254}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_stats_t", file: !89, line: 137, baseType: !1081)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_stats", file: !89, line: 137, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "rpz_attach", scope: !248, file: !241, line: 174, baseType: !1083, size: 64, offset: 2368)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{null, !254, !225, !707}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "rpz_ready", scope: !248, file: !241, line: 176, baseType: !1087, size: 64, offset: 2432)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!264, !254}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "findnodeext", scope: !248, file: !241, line: 177, baseType: !1091, size: 64, offset: 2496)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!264, !254, !277, !353, !1094, !1106, !905}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_clientinfomethods_t", file: !1096, line: 68, baseType: !1097)
!1096 = !DIFile(filename: "include/dns/clientinfo.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "f273dbbef534c5352c6d152e1993b2e9")
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_clientinfomethods", file: !1096, line: 64, size: 128, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1097, file: !1096, line: 65, baseType: !397, size: 16)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !1097, file: !1096, line: 66, baseType: !397, size: 16, offset: 16)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "sourceip", scope: !1097, file: !1096, line: 67, baseType: !1102, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_clientinfo_sourceip_t", file: !1096, line: 58, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!264, !1106, !1113}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_clientinfo_t", file: !1096, line: 56, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_clientinfo", file: !1096, line: 52, size: 192, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1108, file: !1096, line: 53, baseType: !397, size: 16)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1108, file: !1096, line: 54, baseType: !225, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "dbversion", scope: !1108, file: !1096, line: 55, baseType: !225, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_sockaddr_t", file: !265, line: 69, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_sockaddr", file: !1117, line: 27, size: 1216, elements: !1118)
!1117 = !DIFile(filename: "isc/include/isc/sockaddr.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "b46a0f057942d922d0824c5621821d46")
!1118 = !{!1119, !1168, !1169}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1116, file: !1117, line: 36, baseType: !1120, size: 1024)
!1120 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1116, file: !1117, line: 28, size: 1024, elements: !1121)
!1121 = !{!1122, !1133, !1142, !1150, !1159}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !1120, file: !1117, line: 29, baseType: !1123, size: 128)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !1124, line: 180, size: 128, elements: !1125)
!1124 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!1125 = !{!1126, !1129}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !1123, file: !1124, line: 182, baseType: !1127, size: 16)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !1128, line: 28, baseType: !401)
!1128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !1123, file: !1124, line: 183, baseType: !1130, size: 112, offset: 16)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 112, elements: !1131)
!1131 = !{!1132}
!1132 = !DISubrange(count: 14)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !1120, file: !1117, line: 30, baseType: !1134, size: 128)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !695, line: 245, size: 128, elements: !1135)
!1135 = !{!1136, !1137, !1139, !1140}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !1134, file: !695, line: 247, baseType: !1127, size: 16)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !1134, file: !695, line: 248, baseType: !1138, size: 16, offset: 16)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !695, line: 123, baseType: !397)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1134, file: !695, line: 249, baseType: !694, size: 32, offset: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !1134, file: !695, line: 252, baseType: !1141, size: 64, offset: 64)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 64, elements: !711)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !1120, file: !1117, line: 31, baseType: !1143, size: 224)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !695, line: 260, size: 224, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !1143, file: !695, line: 262, baseType: !1127, size: 16)
