; ModuleID = 'samples/298.bc'
source_filename = "fsconvert.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.fsXCharInfo = type { i16, i16, i16, i16, i16, i16 }
%struct.xCharInfo = type { i16, i16, i16, i16, i16, i16 }
%struct._fs_fpe_data = type { ptr, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, ptr, i64, %struct._fs_buf, %struct._fs_buf, i64, i32, i32, i32, i32, i32, ptr, ptr }
%struct._fs_buf = type { ptr, i64, i64, i64 }
%struct._FontInfo = type { i16, i16, i16, i16, i16, i16, i16, i16, %struct.xCharInfo, %struct.xCharInfo, %struct.xCharInfo, %struct.xCharInfo, i16, i16, i32, ptr, ptr }
%struct.fsPropOffset = type { %struct.fsOffset32, %struct.fsOffset32, i8, i8, i16 }
%struct.fsOffset32 = type { i32, i32 }
%struct.fsPropInfo = type { i32, i32 }
%struct._FontProp = type { i64, i64 }
%struct.fsListFontsWithXInfoReply = type { i8, i8, i16, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.fsRange = type { i8, i8, i8, i8 }
%struct._Font = type { i32, %struct._FontInfo, i8, i8, i8, i8, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr }
%struct._fs_font = type { ptr, ptr, ptr, ptr }
%struct._fs_font_data = type { i64, i32, i64, i32, ptr, i32, i32 }
%struct._CharInfo = type { %struct.xCharInfo, ptr }
%struct._fs_glyph = type { ptr }

@_fs_glyph_undefined = external global i8, align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "fsconvert.c", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build/aidengro/spack-stage-libxfont-1.5.4-scvwheodi5y5phavsi67myzr3xykgcgd/spack-src/src/fc", checksumkind: CSK_MD5, checksum: "b183d9b110e3561d2f01bd6f4b6775ef")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 162, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/fontsproto-2.1.3-b3ds5xiancrlyhfaooh5rnsbzohsusmb/include/X11/fonts/font.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build", checksumkind: CSK_MD5, checksum: "a41ff5d042660dc9657472c9cc981807")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "Linear8Bit", value: 0)
!8 = !DIEnumerator(name: "TwoD8Bit", value: 1)
!9 = !DIEnumerator(name: "Linear16Bit", value: 2)
!10 = !DIEnumerator(name: "TwoD16Bit", value: 3)
!11 = !{!12, !14, !17, !36, !70, !72, !74, !75}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !15, line: 98, baseType: !16)
!15 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/xproto-7.0.31-jty6j5k6aazxxzyyjqrr6lta4awdkwpn/include/X11/Xmd.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build", checksumkind: CSK_MD5, checksum: "6659907b96ce8071adc5e93d9bbce63a")
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSFontDataPtr", file: !18, line: 60, baseType: !19)
!18 = !DIFile(filename: "./fserve.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build/aidengro/spack-stage-libxfont-1.5.4-scvwheodi5y5phavsi67myzr3xykgcgd/spack-src/src/fc", checksumkind: CSK_MD5, checksum: "ebab7dc8e03d8fbce658e0d7c2dba896")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_fs_font_data", file: !21, line: 51, size: 384, elements: !22)
!21 = !DIFile(filename: "./fservestr.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build/aidengro/spack-stage-libxfont-1.5.4-scvwheodi5y5phavsi67myzr3xykgcgd/spack-src/src/fc", checksumkind: CSK_MD5, checksum: "884f2a5b7ac528c6c100827341dfbd57")
!22 = !{!23, !25, !26, !28, !29, !30, !34}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "fontid", scope: !20, file: !21, line: 52, baseType: !24, size: 64)
!24 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "generation", scope: !20, file: !21, line: 53, baseType: !16, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "glyphs_to_get", scope: !20, file: !21, line: 54, baseType: !27, size: 64, offset: 128)
!27 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !20, file: !21, line: 57, baseType: !16, size: 32, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !20, file: !21, line: 58, baseType: !12, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !20, file: !21, line: 59, baseType: !31, size: 32, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsBitmapFormat", file: !32, line: 94, baseType: !33)
!32 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/fontsproto-2.1.3-b3ds5xiancrlyhfaooh5rnsbzohsusmb/include/X11/fonts/fsmasks.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build", checksumkind: CSK_MD5, checksum: "4bfc20aced0cbacb54e9d5fba7414335")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "CARD32", file: !15, line: 108, baseType: !5)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "fmask", scope: !20, file: !21, line: 60, baseType: !35, size: 32, offset: 352)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsBitmapFormatMask", file: !32, line: 95, baseType: !33)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSFontPtr", file: !21, line: 48, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_fs_font", file: !21, line: 43, size: 256, elements: !39)
!39 = !{!40, !62, !63, !64}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "pDefault", scope: !38, file: !21, line: 44, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "CharInfoPtr", file: !4, line: 43, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CharInfo", file: !44, line: 63, size: 192, elements: !45)
!44 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/fontsproto-2.1.3-b3ds5xiancrlyhfaooh5rnsbzohsusmb/include/X11/fonts/fontstruct.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build", checksumkind: CSK_MD5, checksum: "83a2b2a763f7c1e423b85aece6a41bc2")
!45 = !{!46, !61}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !43, file: !44, line: 64, baseType: !47, size: 96)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "xCharInfo", file: !48, line: 385, baseType: !49)
!48 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/xproto-7.0.31-jty6j5k6aazxxzyyjqrr6lta4awdkwpn/include/X11/Xproto.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build", checksumkind: CSK_MD5, checksum: "9480d28dfcb38412fb2746e48b2eb919")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 378, size: 96, elements: !50)
!50 = !{!51, !54, !55, !56, !57, !58}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "leftSideBearing", scope: !49, file: !48, line: 379, baseType: !52, size: 16)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !15, line: 102, baseType: !53)
!53 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "rightSideBearing", scope: !49, file: !48, line: 380, baseType: !52, size: 16, offset: 16)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "characterWidth", scope: !49, file: !48, line: 381, baseType: !52, size: 16, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !49, file: !48, line: 382, baseType: !52, size: 16, offset: 48)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !49, file: !48, line: 383, baseType: !52, size: 16, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !49, file: !48, line: 384, baseType: !59, size: 16, offset: 80)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "CARD16", file: !15, line: 113, baseType: !60)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !43, file: !44, line: 65, baseType: !12, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !38, file: !21, line: 45, baseType: !41, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "inkMetrics", scope: !38, file: !21, line: 46, baseType: !41, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "glyphs", scope: !38, file: !21, line: 47, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSGlyphPtr", file: !21, line: 41, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_fs_glyph", file: !21, line: 39, size: 64, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !67, file: !21, line: 40, baseType: !66, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", file: !73, line: 53, baseType: !74)
!73 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/xproto-7.0.31-jty6j5k6aazxxzyyjqrr6lta4awdkwpn/include/X11/Xdefs.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build", checksumkind: CSK_MD5, checksum: "3cf4f3a89c166d4994924d34661b81e6")
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!76 = !{i32 7, !"Dwarf Version", i32 5}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{i32 1, !"wchar_size", i32 4}
!79 = !{i32 8, !"PIC Level", i32 2}
!80 = !{i32 7, !"uwtable", i32 2}
!81 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!82 = distinct !DISubprogram(name: "_fs_convert_char_info", scope: !1, file: !1, line: 50, type: !83, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !96)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !85, !75}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsXCharInfo", file: !87, line: 144, baseType: !88)
!87 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/fontsproto-2.1.3-b3ds5xiancrlyhfaooh5rnsbzohsusmb/include/X11/fonts/FSproto.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build", checksumkind: CSK_MD5, checksum: "0bc3d09c523e7c259901b4e39f1aa167")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 137, size: 96, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !88, file: !87, line: 138, baseType: !52, size: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !88, file: !87, line: 139, baseType: !52, size: 16, offset: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !88, file: !87, line: 140, baseType: !52, size: 16, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !88, file: !87, line: 141, baseType: !52, size: 16, offset: 48)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !88, file: !87, line: 142, baseType: !52, size: 16, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !88, file: !87, line: 143, baseType: !59, size: 16, offset: 80)
!96 = !{!97, !98}
!97 = !DILocalVariable(name: "src", arg: 1, scope: !82, file: !1, line: 50, type: !85)
!98 = !DILocalVariable(name: "dst", arg: 2, scope: !82, file: !1, line: 50, type: !75)
!99 = !DILocation(line: 50, column: 36, scope: !82)
!100 = !DILocation(line: 50, column: 52, scope: !82)
!101 = !DILocation(line: 52, column: 19, scope: !82)
!102 = !DILocation(line: 52, column: 24, scope: !82)
!103 = !DILocation(line: 52, column: 5, scope: !82)
!104 = !DILocation(line: 52, column: 10, scope: !82)
!105 = !DILocation(line: 52, column: 17, scope: !82)
!106 = !DILocation(line: 53, column: 20, scope: !82)
!107 = !DILocation(line: 53, column: 25, scope: !82)
!108 = !DILocation(line: 53, column: 5, scope: !82)
!109 = !DILocation(line: 53, column: 10, scope: !82)
!110 = !DILocation(line: 53, column: 18, scope: !82)
!111 = !DILocation(line: 54, column: 28, scope: !82)
!112 = !DILocation(line: 54, column: 33, scope: !82)
!113 = !DILocation(line: 54, column: 5, scope: !82)
!114 = !DILocation(line: 54, column: 10, scope: !82)
!115 = !DILocation(line: 54, column: 26, scope: !82)
!116 = !DILocation(line: 55, column: 29, scope: !82)
!117 = !DILocation(line: 55, column: 34, scope: !82)
!118 = !DILocation(line: 55, column: 5, scope: !82)
!119 = !DILocation(line: 55, column: 10, scope: !82)
!120 = !DILocation(line: 55, column: 27, scope: !82)
!121 = !DILocation(line: 56, column: 27, scope: !82)
!122 = !DILocation(line: 56, column: 32, scope: !82)
!123 = !DILocation(line: 56, column: 5, scope: !82)
!124 = !DILocation(line: 56, column: 10, scope: !82)
!125 = !DILocation(line: 56, column: 25, scope: !82)
!126 = !DILocation(line: 57, column: 23, scope: !82)
!127 = !DILocation(line: 57, column: 28, scope: !82)
!128 = !DILocation(line: 57, column: 5, scope: !82)
!129 = !DILocation(line: 57, column: 10, scope: !82)
!130 = !DILocation(line: 57, column: 21, scope: !82)
!131 = !DILocation(line: 58, column: 1, scope: !82)
!132 = distinct !DISubprogram(name: "_fs_init_fontinfo", scope: !1, file: !1, line: 61, type: !133, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !237)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135, !201}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSFpePtr", file: !18, line: 67, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_fs_fpe_data", file: !138, line: 82, size: 1536, elements: !139)
!138 = !DIFile(filename: "./fsio.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build/aidengro/spack-stage-libxfont-1.5.4-scvwheodi5y5phavsi67myzr3xykgcgd/spack-src/src/fc", checksumkind: CSK_MD5, checksum: "f554a262995d0e7cd40a3b530d4cabcc")
!139 = !{!140, !141, !142, !143, !144, !145, !147, !148, !149, !150, !151, !158, !169, !170, !178, !179, !180, !181, !182, !183, !184, !185, !197}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !138, line: 83, baseType: !135, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "fs_fd", scope: !137, file: !138, line: 84, baseType: !16, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "fs_conn_state", scope: !137, file: !138, line: 85, baseType: !16, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "current_seq", scope: !137, file: !138, line: 86, baseType: !16, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "servername", scope: !137, file: !138, line: 87, baseType: !12, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "has_catalogues", scope: !137, file: !138, line: 88, baseType: !146, size: 32, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !73, line: 47, baseType: !16)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "generation", scope: !137, file: !138, line: 90, baseType: !16, size: 32, offset: 288)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "numAlts", scope: !137, file: !138, line: 91, baseType: !16, size: 32, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "alternate", scope: !137, file: !138, line: 92, baseType: !16, size: 32, offset: 352)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fsMajorVersion", scope: !137, file: !138, line: 93, baseType: !16, size: 32, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "alts", scope: !137, file: !138, line: 94, baseType: !152, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSFpeAltPtr", file: !138, line: 36, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_fs_fpe_alternate", file: !138, line: 33, size: 128, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !138, line: 34, baseType: !12, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "subset", scope: !154, file: !138, line: 35, baseType: !146, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !137, file: !138, line: 96, baseType: !159, size: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSClientPtr", file: !138, line: 45, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_fs_client_data", file: !138, line: 40, size: 256, elements: !162)
!162 = !{!163, !164, !165, !168}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !161, file: !138, line: 41, baseType: !72, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !138, line: 42, baseType: !160, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "acid", scope: !161, file: !138, line: 43, baseType: !166, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !167, line: 66, baseType: !27)
!167 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/xproto-7.0.31-jty6j5k6aazxxzyyjqrr6lta4awdkwpn/include/X11/X.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build", checksumkind: CSK_MD5, checksum: "2487f55a62008b5a3fa226f1acb1d84a")
!168 = !DIDerivedType(tag: DW_TAG_member, name: "auth_generation", scope: !161, file: !138, line: 44, baseType: !16, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "curacid", scope: !137, file: !138, line: 97, baseType: !166, size: 64, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "outBuf", scope: !137, file: !138, line: 105, baseType: !171, size: 256, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSBufRec", file: !138, line: 60, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_fs_buf", file: !138, line: 55, size: 256, elements: !173)
!173 = !{!174, !175, !176, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !172, file: !138, line: 56, baseType: !12, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !172, file: !138, line: 57, baseType: !24, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !172, file: !138, line: 58, baseType: !24, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !172, file: !138, line: 59, baseType: !24, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "inBuf", scope: !137, file: !138, line: 106, baseType: !171, size: 256, offset: 896)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "inNeed", scope: !137, file: !138, line: 107, baseType: !24, size: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "blockState", scope: !137, file: !138, line: 109, baseType: !33, size: 32, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "blockedReplyTime", scope: !137, file: !138, line: 110, baseType: !33, size: 32, offset: 1248)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "brokenWriteTime", scope: !137, file: !138, line: 111, baseType: !33, size: 32, offset: 1280)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "blockedConnectTime", scope: !137, file: !138, line: 112, baseType: !33, size: 32, offset: 1312)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "brokenConnectionTime", scope: !137, file: !138, line: 113, baseType: !33, size: 32, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "blockedRequests", scope: !137, file: !138, line: 115, baseType: !186, size: 64, offset: 1408)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSBlockDataPtr", file: !18, line: 65, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_fs_block_data", file: !21, line: 125, size: 448, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195, !196}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !188, file: !21, line: 126, baseType: !16, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !188, file: !21, line: 128, baseType: !72, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sequenceNumber", scope: !188, file: !21, line: 129, baseType: !59, size: 16, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !21, line: 130, baseType: !72, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "errcode", scope: !188, file: !21, line: 131, baseType: !16, size: 32, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "depending", scope: !188, file: !21, line: 132, baseType: !187, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !21, line: 133, baseType: !187, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "trans_conn", scope: !137, file: !138, line: 117, baseType: !198, size: 64, offset: 1472)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XtransConnInfo", file: !200, line: 168, flags: DIFlagFwdDecl)
!200 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/xtrans-1.4.0-jpsmiftwabehdhwraffmnogmgq54a5fn/include/X11/Xtrans/Xtrans.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build", checksumkind: CSK_MD5, checksum: "f8475ae5c4f9993e1bfb8ae8fdb33149")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontInfoPtr", file: !4, line: 37, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FontInfo", file: !44, line: 73, size: 704, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !236}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "firstCol", scope: !203, file: !44, line: 74, baseType: !60, size: 16)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lastCol", scope: !203, file: !44, line: 75, baseType: !60, size: 16, offset: 16)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "firstRow", scope: !203, file: !44, line: 76, baseType: !60, size: 16, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lastRow", scope: !203, file: !44, line: 77, baseType: !60, size: 16, offset: 48)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "defaultCh", scope: !203, file: !44, line: 78, baseType: !60, size: 16, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "noOverlap", scope: !203, file: !44, line: 79, baseType: !5, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "terminalFont", scope: !203, file: !44, line: 80, baseType: !5, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 80)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "constantMetrics", scope: !203, file: !44, line: 81, baseType: !5, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 80)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "constantWidth", scope: !203, file: !44, line: 82, baseType: !5, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 80)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "inkInside", scope: !203, file: !44, line: 83, baseType: !5, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 80)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "inkMetrics", scope: !203, file: !44, line: 84, baseType: !5, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 80)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "allExist", scope: !203, file: !44, line: 85, baseType: !5, size: 1, offset: 86, flags: DIFlagBitField, extraData: i64 80)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "drawDirection", scope: !203, file: !44, line: 86, baseType: !5, size: 2, offset: 87, flags: DIFlagBitField, extraData: i64 80)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "cachable", scope: !203, file: !44, line: 87, baseType: !5, size: 1, offset: 89, flags: DIFlagBitField, extraData: i64 80)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "anamorphic", scope: !203, file: !44, line: 88, baseType: !5, size: 1, offset: 90, flags: DIFlagBitField, extraData: i64 80)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "maxOverlap", scope: !203, file: !44, line: 89, baseType: !53, size: 16, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !203, file: !44, line: 90, baseType: !53, size: 16, offset: 112)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "maxbounds", scope: !203, file: !44, line: 91, baseType: !47, size: 96, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "minbounds", scope: !203, file: !44, line: 92, baseType: !47, size: 96, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ink_maxbounds", scope: !203, file: !44, line: 93, baseType: !47, size: 96, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ink_minbounds", scope: !203, file: !44, line: 94, baseType: !47, size: 96, offset: 416)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fontAscent", scope: !203, file: !44, line: 95, baseType: !53, size: 16, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fontDescent", scope: !203, file: !44, line: 96, baseType: !53, size: 16, offset: 528)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nprops", scope: !203, file: !44, line: 97, baseType: !16, size: 32, offset: 544)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !203, file: !44, line: 98, baseType: !230, size: 64, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontPropPtr", file: !4, line: 38, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FontProp", file: !44, line: 41, size: 128, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !232, file: !44, line: 42, baseType: !24, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !232, file: !44, line: 43, baseType: !24, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "isStringProp", scope: !203, file: !44, line: 99, baseType: !12, size: 64, offset: 640)
!237 = !{!238, !239, !240}
!238 = !DILocalVariable(name: "conn", arg: 1, scope: !132, file: !1, line: 61, type: !135)
!239 = !DILocalVariable(name: "pfi", arg: 2, scope: !132, file: !1, line: 61, type: !201)
!240 = !DILocalVariable(name: "n", scope: !241, file: !1, line: 64, type: !60)
!241 = distinct !DILexicalBlock(scope: !242, file: !1, line: 63, column: 36)
!242 = distinct !DILexicalBlock(scope: !132, file: !1, line: 63, column: 9)
!243 = !DILocation(line: 61, column: 28, scope: !132)
!244 = !DILocation(line: 61, column: 46, scope: !132)
!245 = !DILocation(line: 63, column: 9, scope: !242)
!246 = !DILocation(line: 63, column: 15, scope: !242)
!247 = !DILocation(line: 63, column: 30, scope: !242)
!248 = !DILocation(line: 63, column: 9, scope: !132)
!249 = !DILocation(line: 64, column: 2, scope: !241)
!250 = !DILocation(line: 64, column: 17, scope: !241)
!251 = !DILocation(line: 65, column: 6, scope: !241)
!252 = !DILocation(line: 65, column: 11, scope: !241)
!253 = !DILocation(line: 65, column: 4, scope: !241)
!254 = !DILocation(line: 66, column: 18, scope: !241)
!255 = !DILocation(line: 66, column: 23, scope: !241)
!256 = !DILocation(line: 66, column: 2, scope: !241)
!257 = !DILocation(line: 66, column: 7, scope: !241)
!258 = !DILocation(line: 66, column: 16, scope: !241)
!259 = !DILocation(line: 67, column: 18, scope: !241)
!260 = !DILocation(line: 67, column: 2, scope: !241)
!261 = !DILocation(line: 67, column: 7, scope: !241)
!262 = !DILocation(line: 67, column: 16, scope: !241)
!263 = !DILocation(line: 68, column: 6, scope: !241)
!264 = !DILocation(line: 68, column: 11, scope: !241)
!265 = !DILocation(line: 68, column: 4, scope: !241)
!266 = !DILocation(line: 69, column: 17, scope: !241)
!267 = !DILocation(line: 69, column: 22, scope: !241)
!268 = !DILocation(line: 69, column: 2, scope: !241)
!269 = !DILocation(line: 69, column: 7, scope: !241)
!270 = !DILocation(line: 69, column: 15, scope: !241)
!271 = !DILocation(line: 70, column: 17, scope: !241)
!272 = !DILocation(line: 70, column: 2, scope: !241)
!273 = !DILocation(line: 70, column: 7, scope: !241)
!274 = !DILocation(line: 70, column: 15, scope: !241)
!275 = !DILocation(line: 71, column: 21, scope: !241)
!276 = !DILocation(line: 71, column: 26, scope: !241)
!277 = !DILocation(line: 71, column: 36, scope: !241)
!278 = !DILocation(line: 71, column: 42, scope: !241)
!279 = !DILocation(line: 72, column: 25, scope: !241)
!280 = !DILocation(line: 72, column: 30, scope: !241)
!281 = !DILocation(line: 72, column: 40, scope: !241)
!282 = !DILocation(line: 72, column: 48, scope: !241)
!283 = !DILocation(line: 72, column: 21, scope: !241)
!284 = !DILocation(line: 71, column: 19, scope: !241)
!285 = !DILocation(line: 71, column: 2, scope: !241)
!286 = !DILocation(line: 71, column: 7, scope: !241)
!287 = !DILocation(line: 71, column: 17, scope: !241)
!288 = !DILocation(line: 73, column: 5, scope: !242)
!289 = !DILocation(line: 73, column: 5, scope: !241)
!290 = !DILocation(line: 75, column: 30, scope: !291)
!291 = distinct !DILexicalBlock(scope: !132, file: !1, line: 75, column: 9)
!292 = !DILocation(line: 75, column: 9, scope: !291)
!293 = !DILocation(line: 75, column: 9, scope: !132)
!294 = !DILocation(line: 77, column: 2, scope: !295)
!295 = distinct !DILexicalBlock(scope: !291, file: !1, line: 76, column: 5)
!296 = !DILocation(line: 77, column: 7, scope: !295)
!297 = !DILocation(line: 77, column: 20, scope: !295)
!298 = !DILocation(line: 78, column: 26, scope: !295)
!299 = !DILocation(line: 78, column: 31, scope: !295)
!300 = !DILocation(line: 78, column: 2, scope: !295)
!301 = !DILocation(line: 78, column: 7, scope: !295)
!302 = !DILocation(line: 78, column: 17, scope: !295)
!303 = !DILocation(line: 78, column: 24, scope: !295)
!304 = !DILocation(line: 79, column: 27, scope: !295)
!305 = !DILocation(line: 79, column: 32, scope: !295)
!306 = !DILocation(line: 79, column: 2, scope: !295)
!307 = !DILocation(line: 79, column: 7, scope: !295)
!308 = !DILocation(line: 79, column: 17, scope: !295)
!309 = !DILocation(line: 79, column: 25, scope: !295)
!310 = !DILocation(line: 80, column: 2, scope: !295)
!311 = !DILocation(line: 80, column: 7, scope: !295)
!312 = !DILocation(line: 80, column: 17, scope: !295)
!313 = !DILocation(line: 80, column: 33, scope: !295)
!314 = !DILocation(line: 81, column: 36, scope: !295)
!315 = !DILocation(line: 81, column: 41, scope: !295)
!316 = !DILocation(line: 81, column: 51, scope: !295)
!317 = !DILocation(line: 81, column: 2, scope: !295)
!318 = !DILocation(line: 81, column: 7, scope: !295)
!319 = !DILocation(line: 81, column: 17, scope: !295)
!320 = !DILocation(line: 81, column: 34, scope: !295)
!321 = !DILocation(line: 82, column: 2, scope: !295)
!322 = !DILocation(line: 82, column: 7, scope: !295)
!323 = !DILocation(line: 82, column: 19, scope: !295)
!324 = !DILocation(line: 82, column: 24, scope: !295)
!325 = !DILocation(line: 83, column: 5, scope: !295)
!326 = !DILocation(line: 85, column: 34, scope: !132)
!327 = !DILocation(line: 85, column: 5, scope: !132)
!328 = !DILocation(line: 86, column: 1, scope: !132)
!329 = !DISubprogram(name: "FontCouldBeTerminal", scope: !330, file: !330, line: 6, type: !331, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!330 = !DIFile(filename: "../../include/X11/fonts/fontutil.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build/aidengro/spack-stage-libxfont-1.5.4-scvwheodi5y5phavsi67myzr3xykgcgd/spack-src/src/fc", checksumkind: CSK_MD5, checksum: "c132f9f5c8d47ca89ec629808fd8a997")
!331 = !DISubroutineType(types: !332)
!332 = !{!16, !201}
!333 = !DISubprogram(name: "FontComputeInfoAccelerators", scope: !330, file: !330, line: 9, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !201}
!336 = distinct !DISubprogram(name: "_fs_convert_props", scope: !1, file: !1, line: 89, type: !337, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !361)
!337 = !DISubroutineType(types: !338)
!338 = !{!16, !339, !345, !72, !201}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsPropInfo", file: !87, line: 181, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 176, size: 64, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "num_offsets", scope: !341, file: !87, line: 177, baseType: !33, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !341, file: !87, line: 178, baseType: !33, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsPropOffset", file: !87, line: 174, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 168, size: 160, elements: !348)
!348 = !{!349, !355, !356, !358, !360}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !347, file: !87, line: 169, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsOffset32", file: !87, line: 166, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 163, size: 64, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !351, file: !87, line: 164, baseType: !33, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !351, file: !87, line: 165, baseType: !33, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !347, file: !87, line: 170, baseType: !350, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !347, file: !87, line: 171, baseType: !357, size: 8, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "CARD8", file: !15, line: 114, baseType: !71)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !347, file: !87, line: 172, baseType: !359, size: 8, offset: 136)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "BYTE", file: !15, line: 119, baseType: !357)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !347, file: !87, line: 173, baseType: !59, size: 16, offset: 144)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373}
!362 = !DILocalVariable(name: "pi", arg: 1, scope: !336, file: !1, line: 89, type: !339)
!363 = !DILocalVariable(name: "po", arg: 2, scope: !336, file: !1, line: 89, type: !345)
!364 = !DILocalVariable(name: "pd", arg: 3, scope: !336, file: !1, line: 89, type: !72)
!365 = !DILocalVariable(name: "pfi", arg: 4, scope: !336, file: !1, line: 90, type: !201)
!366 = !DILocalVariable(name: "dprop", scope: !336, file: !1, line: 92, type: !230)
!367 = !DILocalVariable(name: "i", scope: !336, file: !1, line: 93, type: !16)
!368 = !DILocalVariable(name: "nprops", scope: !336, file: !1, line: 94, type: !16)
!369 = !DILocalVariable(name: "is_str", scope: !336, file: !1, line: 95, type: !12)
!370 = !DILocalVariable(name: "local_off", scope: !336, file: !1, line: 96, type: !346)
!371 = !DILocalVariable(name: "off_adr", scope: !336, file: !1, line: 97, type: !12)
!372 = !DILocalVariable(name: "pdc", scope: !336, file: !1, line: 98, type: !12)
!373 = !DILabel(scope: !374, name: "bail", file: !1, line: 140)
!374 = distinct !DILexicalBlock(scope: !375, file: !1, line: 139, column: 6)
!375 = distinct !DILexicalBlock(scope: !376, file: !1, line: 138, column: 10)
!376 = distinct !DILexicalBlock(scope: !377, file: !1, line: 130, column: 9)
!377 = distinct !DILexicalBlock(scope: !378, file: !1, line: 127, column: 6)
!378 = distinct !DILexicalBlock(scope: !379, file: !1, line: 119, column: 5)
!379 = distinct !DILexicalBlock(scope: !380, file: !1, line: 118, column: 5)
!380 = distinct !DILexicalBlock(scope: !336, file: !1, line: 118, column: 5)
!381 = !DILocation(line: 89, column: 31, scope: !336)
!382 = !DILocation(line: 89, column: 49, scope: !336)
!383 = !DILocation(line: 89, column: 61, scope: !336)
!384 = !DILocation(line: 90, column: 17, scope: !336)
!385 = !DILocation(line: 92, column: 5, scope: !336)
!386 = !DILocation(line: 92, column: 17, scope: !336)
!387 = !DILocation(line: 93, column: 5, scope: !336)
!388 = !DILocation(line: 93, column: 17, scope: !336)
!389 = !DILocation(line: 94, column: 17, scope: !336)
!390 = !DILocation(line: 95, column: 5, scope: !336)
!391 = !DILocation(line: 95, column: 17, scope: !336)
!392 = !DILocation(line: 96, column: 5, scope: !336)
!393 = !DILocation(line: 96, column: 18, scope: !336)
!394 = !DILocation(line: 97, column: 5, scope: !336)
!395 = !DILocation(line: 97, column: 11, scope: !336)
!396 = !DILocation(line: 98, column: 5, scope: !336)
!397 = !DILocation(line: 98, column: 11, scope: !336)
!398 = !DILocation(line: 98, column: 17, scope: !336)
!399 = !DILocation(line: 103, column: 28, scope: !336)
!400 = !DILocation(line: 103, column: 32, scope: !336)
!401 = !DILocation(line: 103, column: 14, scope: !336)
!402 = !DILocation(line: 103, column: 19, scope: !336)
!403 = !DILocation(line: 103, column: 26, scope: !336)
!404 = !DILocation(line: 103, column: 12, scope: !336)
!405 = !DILocation(line: 105, column: 9, scope: !406)
!406 = distinct !DILexicalBlock(scope: !336, file: !1, line: 105, column: 9)
!407 = !DILocation(line: 105, column: 16, scope: !406)
!408 = !DILocation(line: 106, column: 2, scope: !406)
!409 = !DILocation(line: 106, column: 5, scope: !406)
!410 = !DILocation(line: 106, column: 12, scope: !406)
!411 = !DILocation(line: 105, column: 9, scope: !336)
!412 = !DILocation(line: 107, column: 2, scope: !406)
!413 = !DILocation(line: 109, column: 42, scope: !336)
!414 = !DILocation(line: 109, column: 40, scope: !336)
!415 = !DILocation(line: 109, column: 67, scope: !336)
!416 = !DILocation(line: 109, column: 65, scope: !336)
!417 = !DILocation(line: 109, column: 49, scope: !336)
!418 = !DILocation(line: 109, column: 13, scope: !336)
!419 = !DILocation(line: 109, column: 11, scope: !336)
!420 = !DILocation(line: 110, column: 10, scope: !421)
!421 = distinct !DILexicalBlock(scope: !336, file: !1, line: 110, column: 9)
!422 = !DILocation(line: 110, column: 9, scope: !336)
!423 = !DILocation(line: 111, column: 2, scope: !421)
!424 = !DILocation(line: 113, column: 24, scope: !336)
!425 = !DILocation(line: 113, column: 32, scope: !336)
!426 = !DILocation(line: 113, column: 30, scope: !336)
!427 = !DILocation(line: 113, column: 12, scope: !336)
!428 = !DILocation(line: 114, column: 18, scope: !336)
!429 = !DILocation(line: 114, column: 5, scope: !336)
!430 = !DILocation(line: 114, column: 10, scope: !336)
!431 = !DILocation(line: 114, column: 16, scope: !336)
!432 = !DILocation(line: 115, column: 25, scope: !336)
!433 = !DILocation(line: 115, column: 5, scope: !336)
!434 = !DILocation(line: 115, column: 10, scope: !336)
!435 = !DILocation(line: 115, column: 23, scope: !336)
!436 = !DILocation(line: 117, column: 23, scope: !336)
!437 = !DILocation(line: 117, column: 13, scope: !336)
!438 = !DILocation(line: 118, column: 12, scope: !380)
!439 = !DILocation(line: 118, column: 10, scope: !380)
!440 = !DILocation(line: 118, column: 17, scope: !379)
!441 = !DILocation(line: 118, column: 21, scope: !379)
!442 = !DILocation(line: 118, column: 19, scope: !379)
!443 = !DILocation(line: 118, column: 5, scope: !380)
!444 = !DILocation(line: 120, column: 21, scope: !378)
!445 = !DILocation(line: 120, column: 2, scope: !378)
!446 = !DILocation(line: 121, column: 17, scope: !447)
!447 = distinct !DILexicalBlock(scope: !378, file: !1, line: 121, column: 6)
!448 = !DILocation(line: 121, column: 22, scope: !447)
!449 = !DILocation(line: 121, column: 34, scope: !447)
!450 = !DILocation(line: 121, column: 38, scope: !447)
!451 = !DILocation(line: 121, column: 31, scope: !447)
!452 = !DILocation(line: 121, column: 48, scope: !447)
!453 = !DILocation(line: 122, column: 14, scope: !447)
!454 = !DILocation(line: 122, column: 19, scope: !447)
!455 = !DILocation(line: 123, column: 5, scope: !447)
!456 = !DILocation(line: 123, column: 9, scope: !447)
!457 = !DILocation(line: 123, column: 30, scope: !447)
!458 = !DILocation(line: 123, column: 35, scope: !447)
!459 = !DILocation(line: 123, column: 18, scope: !447)
!460 = !DILocation(line: 122, column: 26, scope: !447)
!461 = !DILocation(line: 121, column: 6, scope: !378)
!462 = !DILocation(line: 124, column: 6, scope: !447)
!463 = !DILocation(line: 125, column: 26, scope: !378)
!464 = !DILocation(line: 125, column: 40, scope: !378)
!465 = !DILocation(line: 125, column: 45, scope: !378)
!466 = !DILocation(line: 126, column: 21, scope: !378)
!467 = !DILocation(line: 126, column: 26, scope: !378)
!468 = !DILocation(line: 125, column: 16, scope: !378)
!469 = !DILocation(line: 125, column: 2, scope: !378)
!470 = !DILocation(line: 125, column: 9, scope: !378)
!471 = !DILocation(line: 125, column: 14, scope: !378)
!472 = !DILocation(line: 127, column: 16, scope: !377)
!473 = !DILocation(line: 127, column: 6, scope: !377)
!474 = !DILocation(line: 127, column: 21, scope: !377)
!475 = !DILocation(line: 127, column: 6, scope: !378)
!476 = !DILocation(line: 128, column: 7, scope: !477)
!477 = distinct !DILexicalBlock(scope: !377, file: !1, line: 127, column: 40)
!478 = !DILocation(line: 128, column: 14, scope: !477)
!479 = !DILocation(line: 129, column: 31, scope: !477)
!480 = !DILocation(line: 129, column: 37, scope: !477)
!481 = !DILocation(line: 129, column: 21, scope: !477)
!482 = !DILocation(line: 129, column: 6, scope: !477)
!483 = !DILocation(line: 129, column: 13, scope: !477)
!484 = !DILocation(line: 129, column: 19, scope: !477)
!485 = !DILocation(line: 130, column: 2, scope: !477)
!486 = !DILocation(line: 131, column: 7, scope: !376)
!487 = !DILocation(line: 131, column: 14, scope: !376)
!488 = !DILocation(line: 132, column: 21, scope: !489)
!489 = distinct !DILexicalBlock(scope: !376, file: !1, line: 132, column: 10)
!490 = !DILocation(line: 132, column: 27, scope: !489)
!491 = !DILocation(line: 132, column: 39, scope: !489)
!492 = !DILocation(line: 132, column: 43, scope: !489)
!493 = !DILocation(line: 132, column: 36, scope: !489)
!494 = !DILocation(line: 132, column: 53, scope: !489)
!495 = !DILocation(line: 133, column: 14, scope: !489)
!496 = !DILocation(line: 133, column: 20, scope: !489)
!497 = !DILocation(line: 134, column: 5, scope: !489)
!498 = !DILocation(line: 134, column: 9, scope: !489)
!499 = !DILocation(line: 134, column: 30, scope: !489)
!500 = !DILocation(line: 134, column: 36, scope: !489)
!501 = !DILocation(line: 134, column: 18, scope: !489)
!502 = !DILocation(line: 133, column: 27, scope: !489)
!503 = !DILocation(line: 132, column: 10, scope: !376)
!504 = !DILocation(line: 135, column: 3, scope: !489)
!505 = !DILocation(line: 136, column: 39, scope: !376)
!506 = !DILocation(line: 136, column: 53, scope: !376)
!507 = !DILocation(line: 136, column: 59, scope: !376)
!508 = !DILocation(line: 137, column: 20, scope: !376)
!509 = !DILocation(line: 137, column: 26, scope: !376)
!510 = !DILocation(line: 136, column: 29, scope: !376)
!511 = !DILocation(line: 136, column: 21, scope: !376)
!512 = !DILocation(line: 136, column: 6, scope: !376)
!513 = !DILocation(line: 136, column: 13, scope: !376)
!514 = !DILocation(line: 136, column: 19, scope: !376)
!515 = !DILocation(line: 138, column: 10, scope: !375)
!516 = !DILocation(line: 138, column: 17, scope: !375)
!517 = !DILocation(line: 138, column: 23, scope: !375)
!518 = !DILocation(line: 138, column: 10, scope: !376)
!519 = !DILocation(line: 139, column: 6, scope: !375)
!520 = !DILocation(line: 140, column: 8, scope: !374)
!521 = !DILocation(line: 141, column: 9, scope: !374)
!522 = !DILocation(line: 141, column: 14, scope: !374)
!523 = !DILocation(line: 141, column: 3, scope: !374)
!524 = !DILocation(line: 142, column: 3, scope: !374)
!525 = !DILocation(line: 142, column: 8, scope: !374)
!526 = !DILocation(line: 142, column: 15, scope: !374)
!527 = !DILocation(line: 143, column: 3, scope: !374)
!528 = !DILocation(line: 143, column: 8, scope: !374)
!529 = !DILocation(line: 143, column: 14, scope: !374)
!530 = !DILocation(line: 144, column: 3, scope: !374)
!531 = !DILocation(line: 144, column: 8, scope: !374)
!532 = !DILocation(line: 144, column: 21, scope: !374)
!533 = !DILocation(line: 145, column: 3, scope: !374)
!534 = !DILocation(line: 148, column: 10, scope: !378)
!535 = !DILocation(line: 149, column: 5, scope: !378)
!536 = !DILocation(line: 118, column: 30, scope: !379)
!537 = !DILocation(line: 118, column: 39, scope: !379)
!538 = !DILocation(line: 118, column: 49, scope: !379)
!539 = !DILocation(line: 118, column: 5, scope: !379)
!540 = distinct !{!540, !443, !541, !542}
!541 = !DILocation(line: 149, column: 5, scope: !380)
!542 = !{!"llvm.loop.mustprogress"}
!543 = !DILocation(line: 151, column: 12, scope: !336)
!544 = !DILocation(line: 151, column: 5, scope: !336)
!545 = !DILocation(line: 152, column: 1, scope: !336)
!546 = !DISubprogram(name: "malloc", scope: !547, file: !547, line: 540, type: !548, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!547 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!548 = !DISubroutineType(types: !549)
!549 = !{!74, !550}
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !551, line: 70, baseType: !27)
!551 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!552 = !DISubprogram(name: "MakeAtom", scope: !553, file: !553, line: 55, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!553 = !DIFile(filename: "../../include/X11/fonts/fontmisc.h", directory: "/local-ssd/libxfont-scvwheodi5y5phavsi67myzr3xykgcgd-build/aidengro/spack-stage-libxfont-1.5.4-scvwheodi5y5phavsi67myzr3xykgcgd/spack-src/src/fc", checksumkind: CSK_MD5, checksum: "ca2c870721803850633432853869513a")
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !557, !5, !16}
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !167, line: 74, baseType: !27)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!559 = !DISubprogram(name: "free", scope: !547, file: !547, line: 555, type: !560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !74}
!562 = distinct !DISubprogram(name: "_fs_free_props", scope: !1, file: !1, line: 155, type: !334, scopeLine: 156, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !563)
!563 = !{!564}
!564 = !DILocalVariable(name: "pfi", arg: 1, scope: !562, file: !1, line: 155, type: !201)
!565 = !DILocation(line: 155, column: 29, scope: !562)
!566 = !DILocation(line: 157, column: 9, scope: !567)
!567 = distinct !DILexicalBlock(scope: !562, file: !1, line: 157, column: 9)
!568 = !DILocation(line: 157, column: 14, scope: !567)
!569 = !DILocation(line: 157, column: 9, scope: !562)
!570 = !DILocation(line: 159, column: 8, scope: !571)
!571 = distinct !DILexicalBlock(scope: !567, file: !1, line: 158, column: 5)
!572 = !DILocation(line: 159, column: 13, scope: !571)
!573 = !DILocation(line: 159, column: 2, scope: !571)
!574 = !DILocation(line: 160, column: 2, scope: !571)
!575 = !DILocation(line: 160, column: 7, scope: !571)
!576 = !DILocation(line: 160, column: 14, scope: !571)
!577 = !DILocation(line: 161, column: 2, scope: !571)
!578 = !DILocation(line: 161, column: 7, scope: !571)
!579 = !DILocation(line: 161, column: 13, scope: !571)
!580 = !DILocation(line: 162, column: 5, scope: !571)
!581 = !DILocation(line: 163, column: 1, scope: !562)
!582 = distinct !DISubprogram(name: "_fs_convert_lfwi_reply", scope: !1, file: !1, line: 166, type: !583, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !617)
!583 = !DISubroutineType(types: !584)
!584 = !{!16, !135, !201, !585, !339, !345, !72}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsListFontsWithXInfoReply", file: !87, line: 530, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 499, size: 416, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !87, line: 500, baseType: !359, size: 8)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nameLength", scope: !587, file: !87, line: 501, baseType: !357, size: 8, offset: 8)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sequenceNumber", scope: !587, file: !87, line: 502, baseType: !59, size: 16, offset: 16)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !587, file: !87, line: 503, baseType: !33, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nReplies", scope: !587, file: !87, line: 504, baseType: !33, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_flags", scope: !587, file: !87, line: 505, baseType: !33, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "font_hdr_char_range_min_char_high", scope: !587, file: !87, line: 506, baseType: !357, size: 8, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "font_hdr_char_range_min_char_low", scope: !587, file: !87, line: 507, baseType: !357, size: 8, offset: 136)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "font_hdr_char_range_max_char_high", scope: !587, file: !87, line: 508, baseType: !357, size: 8, offset: 144)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "font_hdr_char_range_max_char_low", scope: !587, file: !87, line: 509, baseType: !357, size: 8, offset: 152)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_draw_direction", scope: !587, file: !87, line: 510, baseType: !357, size: 8, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_pad", scope: !587, file: !87, line: 511, baseType: !357, size: 8, offset: 168)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_default_char_high", scope: !587, file: !87, line: 512, baseType: !357, size: 8, offset: 176)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_default_char_low", scope: !587, file: !87, line: 513, baseType: !357, size: 8, offset: 184)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_min_bounds_left", scope: !587, file: !87, line: 514, baseType: !52, size: 16, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_min_bounds_right", scope: !587, file: !87, line: 515, baseType: !52, size: 16, offset: 208)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_min_bounds_width", scope: !587, file: !87, line: 516, baseType: !52, size: 16, offset: 224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_min_bounds_ascent", scope: !587, file: !87, line: 517, baseType: !52, size: 16, offset: 240)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_min_bounds_descent", scope: !587, file: !87, line: 518, baseType: !52, size: 16, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_min_bounds_attributes", scope: !587, file: !87, line: 519, baseType: !59, size: 16, offset: 272)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_max_bounds_left", scope: !587, file: !87, line: 520, baseType: !52, size: 16, offset: 288)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_max_bounds_right", scope: !587, file: !87, line: 521, baseType: !52, size: 16, offset: 304)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_max_bounds_width", scope: !587, file: !87, line: 522, baseType: !52, size: 16, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_max_bounds_ascent", scope: !587, file: !87, line: 523, baseType: !52, size: 16, offset: 336)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_max_bounds_descent", scope: !587, file: !87, line: 524, baseType: !52, size: 16, offset: 352)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_max_bounds_attributes", scope: !587, file: !87, line: 525, baseType: !59, size: 16, offset: 368)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_font_ascent", scope: !587, file: !87, line: 526, baseType: !52, size: 16, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "font_header_font_descent", scope: !587, file: !87, line: 527, baseType: !52, size: 16, offset: 400)
!617 = !{!618, !619, !620, !621, !622, !623}
!618 = !DILocalVariable(name: "conn", arg: 1, scope: !582, file: !1, line: 166, type: !135)
!619 = !DILocalVariable(name: "pfi", arg: 2, scope: !582, file: !1, line: 166, type: !201)
!620 = !DILocalVariable(name: "fsrep", arg: 3, scope: !582, file: !1, line: 167, type: !585)
!621 = !DILocalVariable(name: "pi", arg: 4, scope: !582, file: !1, line: 168, type: !339)
!622 = !DILocalVariable(name: "po", arg: 5, scope: !582, file: !1, line: 168, type: !345)
!623 = !DILocalVariable(name: "pd", arg: 6, scope: !582, file: !1, line: 168, type: !72)
!624 = !DILocation(line: 166, column: 33, scope: !582)
!625 = !DILocation(line: 166, column: 51, scope: !582)
!626 = !DILocation(line: 167, column: 37, scope: !582)
!627 = !DILocation(line: 168, column: 22, scope: !582)
!628 = !DILocation(line: 168, column: 40, scope: !582)
!629 = !DILocation(line: 168, column: 52, scope: !582)
!630 = !DILocation(line: 170, column: 5, scope: !582)
!631 = !DILocation(line: 171, column: 23, scope: !582)
!632 = !DILocation(line: 171, column: 29, scope: !582)
!633 = !DILocation(line: 171, column: 5, scope: !582)
!634 = !DILocation(line: 173, column: 27, scope: !635)
!635 = distinct !DILexicalBlock(scope: !582, file: !1, line: 173, column: 9)
!636 = !DILocation(line: 173, column: 31, scope: !635)
!637 = !DILocation(line: 173, column: 35, scope: !635)
!638 = !DILocation(line: 173, column: 39, scope: !635)
!639 = !DILocation(line: 173, column: 9, scope: !635)
!640 = !DILocation(line: 173, column: 44, scope: !635)
!641 = !DILocation(line: 173, column: 9, scope: !582)
!642 = !DILocation(line: 174, column: 2, scope: !635)
!643 = !DILocation(line: 176, column: 5, scope: !582)
!644 = !DILocation(line: 177, column: 1, scope: !582)
!645 = distinct !DISubprogram(name: "fs_build_range", scope: !1, file: !1, line: 200, type: !646, scopeLine: 203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !703)
!646 = !DISubroutineType(types: !647)
!647 = !{!16, !648, !146, !5, !16, !70, !693, !694}
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontPtr", file: !73, line: 81, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Font", file: !44, line: 102, size: 1472, elements: !651)
!651 = !{!652, !653, !655, !656, !657, !658, !659, !660, !667, !672, !676, !677, !687, !688, !689, !690, !691}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !650, file: !44, line: 103, baseType: !16, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !650, file: !44, line: 104, baseType: !654, size: 704, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontInfoRec", file: !44, line: 100, baseType: !203)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !650, file: !44, line: 105, baseType: !13, size: 8, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "byte", scope: !650, file: !44, line: 106, baseType: !13, size: 8, offset: 776)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "glyph", scope: !650, file: !44, line: 107, baseType: !13, size: 8, offset: 784)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "scan", scope: !650, file: !44, line: 108, baseType: !13, size: 8, offset: 792)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !650, file: !44, line: 109, baseType: !31, size: 32, offset: 800)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "get_glyphs", scope: !650, file: !44, line: 110, baseType: !661, size: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!16, !648, !27, !70, !664, !665, !666}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontEncoding", file: !4, line: 164, baseType: !3)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "get_metrics", scope: !650, file: !44, line: 116, baseType: !668, size: 64, offset: 896)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!16, !648, !27, !70, !664, !665, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "unload_font", scope: !650, file: !44, line: 122, baseType: !673, size: 64, offset: 960)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !648}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "unload_glyphs", scope: !650, file: !44, line: 123, baseType: !673, size: 64, offset: 1024)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fpe", scope: !650, file: !44, line: 124, baseType: !678, size: 64, offset: 1088)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontPathElementPtr", file: !4, line: 40, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FontPathElement", file: !44, line: 148, size: 256, elements: !681)
!681 = !{!682, !683, !684, !685, !686}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "name_length", scope: !680, file: !44, line: 149, baseType: !16, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !44, line: 153, baseType: !12, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !680, file: !44, line: 154, baseType: !16, size: 32, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !680, file: !44, line: 155, baseType: !16, size: 32, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !680, file: !44, line: 156, baseType: !74, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "svrPrivate", scope: !650, file: !44, line: 125, baseType: !74, size: 64, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fontPrivate", scope: !650, file: !44, line: 126, baseType: !74, size: 64, offset: 1216)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fpePrivate", scope: !650, file: !44, line: 127, baseType: !74, size: 64, offset: 1280)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "maxPrivate", scope: !650, file: !44, line: 128, baseType: !16, size: 32, offset: 1344)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "devPrivates", scope: !650, file: !44, line: 129, baseType: !692, size: 64, offset: 1408)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsRange", file: !87, line: 161, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 156, size: 32, elements: !698)
!698 = !{!699, !700, !701, !702}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "min_char_high", scope: !697, file: !87, line: 157, baseType: !357, size: 8)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "min_char_low", scope: !697, file: !87, line: 158, baseType: !357, size: 8, offset: 8)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "max_char_high", scope: !697, file: !87, line: 159, baseType: !357, size: 8, offset: 16)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "max_char_low", scope: !697, file: !87, line: 160, baseType: !357, size: 8, offset: 24)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !731, !732, !737, !739, !740, !741, !742}
!704 = !DILocalVariable(name: "pfont", arg: 1, scope: !645, file: !1, line: 200, type: !648)
!705 = !DILocalVariable(name: "range_flag", arg: 2, scope: !645, file: !1, line: 200, type: !146)
!706 = !DILocalVariable(name: "count", arg: 3, scope: !645, file: !1, line: 200, type: !5)
!707 = !DILocalVariable(name: "item_size", arg: 4, scope: !645, file: !1, line: 201, type: !16)
!708 = !DILocalVariable(name: "data", arg: 5, scope: !645, file: !1, line: 201, type: !70)
!709 = !DILocalVariable(name: "nranges", arg: 6, scope: !645, file: !1, line: 201, type: !693)
!710 = !DILocalVariable(name: "ranges", arg: 7, scope: !645, file: !1, line: 202, type: !694)
!711 = !DILocalVariable(name: "fsd", scope: !645, file: !1, line: 204, type: !17)
!712 = !DILocalVariable(name: "fsfont", scope: !645, file: !1, line: 205, type: !36)
!713 = !DILocalVariable(name: "encoding", scope: !645, file: !1, line: 206, type: !41)
!714 = !DILocalVariable(name: "pfi", scope: !645, file: !1, line: 207, type: !201)
!715 = !DILocalVariable(name: "range", scope: !645, file: !1, line: 208, type: !696)
!716 = !DILocalVariable(name: "access_done", scope: !645, file: !1, line: 209, type: !16)
!717 = !DILocalVariable(name: "err", scope: !645, file: !1, line: 210, type: !16)
!718 = !DILocalVariable(name: "firstrow", scope: !645, file: !1, line: 211, type: !27)
!719 = !DILocalVariable(name: "lastrow", scope: !645, file: !1, line: 211, type: !27)
!720 = !DILocalVariable(name: "firstcol", scope: !645, file: !1, line: 211, type: !27)
!721 = !DILocalVariable(name: "lastcol", scope: !645, file: !1, line: 211, type: !27)
!722 = !DILocalVariable(name: "row", scope: !645, file: !1, line: 212, type: !27)
!723 = !DILocalVariable(name: "col", scope: !645, file: !1, line: 213, type: !27)
!724 = !DILocalVariable(name: "loc", scope: !645, file: !1, line: 214, type: !27)
!725 = !DILocalVariable(name: "col1", scope: !726, file: !1, line: 249, type: !16)
!726 = distinct !DILexicalBlock(scope: !727, file: !1, line: 248, column: 6)
!727 = distinct !DILexicalBlock(scope: !728, file: !1, line: 246, column: 10)
!728 = distinct !DILexicalBlock(scope: !729, file: !1, line: 244, column: 2)
!729 = distinct !DILexicalBlock(scope: !730, file: !1, line: 241, column: 5)
!730 = distinct !DILexicalBlock(scope: !645, file: !1, line: 240, column: 9)
!731 = !DILocalVariable(name: "col2", scope: !726, file: !1, line: 249, type: !16)
!732 = !DILocalVariable(name: "fullrange", scope: !733, file: !1, line: 272, type: !734)
!733 = distinct !DILexicalBlock(scope: !730, file: !1, line: 271, column: 5)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 32, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 1)
!737 = !DILocalVariable(name: "row1", scope: !738, file: !1, line: 286, type: !16)
!738 = distinct !DILexicalBlock(scope: !733, file: !1, line: 285, column: 2)
!739 = !DILocalVariable(name: "col1", scope: !738, file: !1, line: 286, type: !16)
!740 = !DILocalVariable(name: "row2", scope: !738, file: !1, line: 286, type: !16)
!741 = !DILocalVariable(name: "col2", scope: !738, file: !1, line: 286, type: !16)
!742 = !DILabel(scope: !743, name: "expand_glyph_range", file: !1, line: 315)
!743 = distinct !DILexicalBlock(scope: !744, file: !1, line: 314, column: 6)
!744 = distinct !DILexicalBlock(scope: !745, file: !1, line: 313, column: 6)
!745 = distinct !DILexicalBlock(scope: !738, file: !1, line: 313, column: 6)
!746 = !DILocation(line: 200, column: 24, scope: !645)
!747 = !DILocation(line: 200, column: 36, scope: !645)
!748 = !DILocation(line: 200, column: 61, scope: !645)
!749 = !DILocation(line: 201, column: 13, scope: !645)
!750 = !DILocation(line: 201, column: 39, scope: !645)
