; ModuleID = 'samples/303.bc'
source_filename = "./src/libxsmm_dnn_optimizer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.libxsmm_dnn_optimizer_desc = type { i32, i32, i32, i32, float, i32, i32, i32, i32, i32 }
%struct.libxsmm_dnn_optimizer = type { %struct.libxsmm_dnn_optimizer_desc, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i64, ptr }
%struct.libxsmm_dnn_tensor_datalayout = type { ptr, ptr, i32, i32, i32, i32 }
%struct.libxsmm_dnn_tensor = type { ptr, ptr, i8 }

@libxsmm_ninit = external global i32, align 4

; Function Attrs: nounwind uwtable
define ptr @libxsmm_dnn_create_optimizer(ptr noundef byval(%struct.libxsmm_dnn_optimizer_desc) align 8 %optimizer_desc, ptr noundef %status) #0 !dbg !178 {
entry:
  %retval = alloca ptr, align 8
  %status.addr = alloca ptr, align 8
  %handle = alloca ptr, align 8
  %cleanup.dest.slot = alloca i32, align 4
  tail call void @llvm.dbg.declare(metadata ptr %optimizer_desc, metadata !186, metadata !DIExpression()), !dbg !189
  store ptr %status, ptr %status.addr, align 8, !tbaa !190
  tail call void @llvm.dbg.declare(metadata ptr %status.addr, metadata !187, metadata !DIExpression()), !dbg !194
  call void @llvm.lifetime.start.p0(i64 8, ptr %handle) #8, !dbg !195
  tail call void @llvm.dbg.declare(metadata ptr %handle, metadata !188, metadata !DIExpression()), !dbg !196

!39 = !DIEnumerator(name: "LIBXSMM_DNN_TENSOR_DIMTYPE_G", value: 8)
!40 = !DIEnumerator(name: "LIBXSMM_DNN_TENSOR_DIMTYPE_X", value: 9)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "libxsmm_dnn_tensor_type", file: !29, line: 44, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!43 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_INPUT", value: 0)
!44 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_INPUT_ADD", value: 1)
!45 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_INPUT_TRANS", value: 2)
!46 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_INPUT", value: 3)
!47 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_INPUT_ADD", value: 4)
!48 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_OUTPUT", value: 5)
!49 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_OUTPUT", value: 6)
!50 = !DIEnumerator(name: "LIBXSMM_DNN_INPUT", value: 7)
!51 = !DIEnumerator(name: "LIBXSMM_DNN_OUTPUT", value: 8)
!52 = !DIEnumerator(name: "LIBXSMM_DNN_ACTIVATION", value: 9)
!53 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_FILTER", value: 10)
!54 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_FILTER_TRANS", value: 11)
!55 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_FILTER", value: 12)
!56 = !DIEnumerator(name: "LIBXSMM_DNN_MASTER_FILTER", value: 13)
!57 = !DIEnumerator(name: "LIBXSMM_DNN_FILTER", value: 14)
!58 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_CHANNEL_BIAS", value: 15)
!59 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_CHANNEL_BIAS", value: 16)
!60 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_BIAS", value: 17)
!61 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_CHANNEL_BETA", value: 18)
!62 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_CHANNEL_BETA", value: 19)
!63 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_BETA", value: 20)
!64 = !DIEnumerator(name: "LIBXSMM_DNN_REGULAR_CHANNEL_GAMMA", value: 21)
!65 = !DIEnumerator(name: "LIBXSMM_DNN_GRADIENT_CHANNEL_GAMMA", value: 22)
!66 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_GAMMA", value: 23)
!67 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_EXPECTVAL", value: 24)
!68 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_RCPSTDDEV", value: 25)
!69 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_VARIANCE", value: 26)
!70 = !DIEnumerator(name: "LIBXSMM_DNN_CHANNEL_SCALAR", value: 27)
!71 = !DIEnumerator(name: "LIBXSMM_DNN_LABEL", value: 28)
!72 = !DIEnumerator(name: "LIBXSMM_DNN_BATCH_STATS", value: 29)
!73 = !DIEnumerator(name: "LIBXSMM_DNN_MAX_STATS_FWD", value: 30)
!74 = !DIEnumerator(name: "LIBXSMM_DNN_MAX_STATS_BWD", value: 31)
!75 = !DIEnumerator(name: "LIBXSMM_DNN_MAX_STATS_UPD", value: 32)
!76 = !DIEnumerator(name: "LIBXSMM_DNN_POOLING_MASK", value: 33)
!77 = !DIEnumerator(name: "LIBXSMM_DNN_RELU_MASK", value: 34)
!78 = !DIEnumerator(name: "LIBXSMM_DNN_TENSOR", value: 35)
!79 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_INPUT", value: 36)
!80 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_CS_PREV", value: 37)
!81 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_HIDDEN_STATE_PREV", value: 38)
!82 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_WEIGHT", value: 39)
!83 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_RECUR_WEIGHT", value: 40)
!84 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_WEIGHT_TRANS", value: 41)
!85 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_RECUR_WEIGHT_TRANS", value: 42)
!86 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_BIAS", value: 43)
!87 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_CS", value: 44)
!88 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_REGULAR_HIDDEN_STATE", value: 45)
!89 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_INPUT", value: 46)
!90 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_CS_PREV", value: 47)
!91 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_HIDDEN_STATE_PREV", value: 48)
!92 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_WEIGHT", value: 49)
!93 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_RECUR_WEIGHT", value: 50)
!94 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_BIAS", value: 51)
!95 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_CS", value: 52)
!96 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_GRADIENT_HIDDEN_STATE", value: 53)
!97 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_INTERNAL_I", value: 54)
!98 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_INTERNAL_F", value: 55)
!99 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_INTERNAL_O", value: 56)
!100 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_INTERNAL_CI", value: 57)
!101 = !DIEnumerator(name: "LIBXSMM_DNN_RNN_INTERNAL_CO", value: 58)
!102 = !{!103, !168, !133, !138, !141, !170, !148, !128}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_optimizer", file: !4, line: 18, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_dnn_optimizer", file: !106, line: 553, size: 896, elements: !107)
!106 = !DIFile(filename: "./src/libxsmm_main.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "327f1483fde3a8c227e86e12c0467dc8")
!107 = !{!108, !127, !151, !152, !153, !158, !159, !160, !161, !162, !163, !167}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !105, file: !106, line: 554, baseType: !109, size: 320)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_optimizer_desc", file: !4, line: 36, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_dnn_optimizer_desc", file: !4, line: 25, size: 320, elements: !111)
!111 = !{!112, !114, !115, !116, !117, !119, !120, !122, !124, !125}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !110, file: !4, line: 26, baseType: !113, size: 32)
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !110, file: !4, line: 27, baseType: !113, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !110, file: !4, line: 28, baseType: !113, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "bk", scope: !110, file: !4, line: 29, baseType: !113, size: 32, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "learning_rate", scope: !110, file: !4, line: 30, baseType: !118, size: 32, offset: 128)
!118 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !110, file: !4, line: 31, baseType: !113, size: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "opt_type", scope: !110, file: !4, line: 32, baseType: !121, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_optimizer_type", file: !4, line: 22, baseType: !3)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "datatype_master", scope: !110, file: !4, line: 33, baseType: !123, size: 32, offset: 224)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_datatype", file: !9, line: 430, baseType: !8)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !110, file: !4, line: 34, baseType: !123, size: 32, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "filter_format", scope: !110, file: !4, line: 35, baseType: !126, size: 32, offset: 288)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_tensor_format", file: !9, line: 420, baseType: !17)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reg_filter", scope: !105, file: !106, line: 555, baseType: !128, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_tensor", file: !29, line: 18, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_dnn_tensor", file: !106, line: 352, size: 192, elements: !131)
!131 = !{!132, !147, !149}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !130, file: !106, line: 353, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_tensor_datalayout", file: !29, line: 172, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_dnn_tensor_datalayout", file: !29, line: 165, size: 256, elements: !136)
!136 = !{!137, !140, !142, !143, !144, !145}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dim_type", scope: !135, file: !29, line: 166, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_tensor_dimtype", file: !29, line: 41, baseType: !28)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dim_size", scope: !135, file: !29, line: 167, baseType: !141, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "num_dims", scope: !135, file: !29, line: 168, baseType: !5, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !135, file: !29, line: 169, baseType: !126, size: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !135, file: !29, line: 170, baseType: !123, size: 32, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tensor_type", scope: !135, file: !29, line: 171, baseType: !146, size: 32, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_tensor_type", file: !29, line: 161, baseType: !41)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !130, file: !106, line: 354, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "scf", scope: !130, file: !106, line: 355, baseType: !150, size: 8, offset: 128)
!150 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "grad_filter", scope: !105, file: !106, line: 556, baseType: !128, size: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "master_filter", scope: !105, file: !106, line: 557, baseType: !128, size: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "barrier", scope: !105, file: !106, line: 558, baseType: !154, size: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_barrier", file: !156, line: 766, baseType: !157)
!156 = !DIFile(filename: "include/libxsmm_sync.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "83f98b39b8b6b876fabdfb62c1483c6b")
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_barrier", file: !156, line: 766, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !105, file: !106, line: 559, baseType: !113, size: 32, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Bc", scope: !105, file: !106, line: 560, baseType: !113, size: 32, offset: 608)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bk", scope: !105, file: !106, line: 561, baseType: !113, size: 32, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Bk", scope: !105, file: !106, line: 562, baseType: !113, size: 32, offset: 672)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "fm_lp_block", scope: !105, file: !106, line: 563, baseType: !113, size: 32, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_size", scope: !105, file: !106, line: 564, baseType: !164, size: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 70, baseType: !166)
!165 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!166 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !105, file: !106, line: 565, baseType: !148, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !171, line: 90, baseType: !166)
!171 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!172 = !{i32 7, !"Dwarf Version", i32 5}
!173 = !{i32 2, !"Debug Info Version", i32 3}
!174 = !{i32 1, !"wchar_size", i32 4}
!175 = !{i32 8, !"PIC Level", i32 2}
!176 = !{i32 7, !"uwtable", i32 2}
!177 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!178 = distinct !DISubprogram(name: "libxsmm_dnn_create_optimizer", scope: !179, file: !179, line: 15, type: !180, scopeLine: 15, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !185)
!179 = !DIFile(filename: "./src/libxsmm_dnn_optimizer.c", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "2518845c77649fa3c41dfd6ea9be1b3c")
!180 = !DISubroutineType(types: !181)
!181 = !{!103, !109, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_dnn_err_t", file: !184, line: 16, baseType: !5)
!184 = !DIFile(filename: "include/libxsmm_dnn.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "a78420eba4319a1d6474d35f9855f3e6")
!185 = !{!186, !187, !188}
!186 = !DILocalVariable(name: "optimizer_desc", arg: 1, scope: !178, file: !179, line: 15, type: !109)
!187 = !DILocalVariable(name: "status", arg: 2, scope: !178, file: !179, line: 15, type: !182)
!188 = !DILocalVariable(name: "handle", scope: !178, file: !179, line: 16, type: !103)
!189 = !DILocation(line: 15, column: 92, scope: !178)
!190 = !{!191, !191, i64 0}
!191 = !{!"any pointer", !192, i64 0}
!192 = !{!"omnipotent char", !193, i64 0}
!193 = !{!"Simple C/C++ TBAA"}
!194 = !DILocation(line: 15, column: 127, scope: !178)
!195 = !DILocation(line: 16, column: 3, scope: !178)
!196 = !DILocation(line: 16, column: 26, scope: !178)
!197 = !DILocation(line: 19, column: 3, scope: !198)
!198 = distinct !DILexicalBlock(scope: !178, file: !179, line: 19, column: 3)
!199 = !{!200, !200, i64 0}
!200 = !{!"int", !192, i64 0}
!201 = !DILocation(line: 19, column: 3, scope: !178)
!202 = !DILocation(line: 21, column: 24, scope: !203)
!203 = distinct !DILexicalBlock(scope: !178, file: !179, line: 21, column: 8)
!204 = !{!205, !192, i64 32}
!205 = !{!"libxsmm_dnn_optimizer_desc", !200, i64 0, !200, i64 4, !200, i64 8, !200, i64 12, !206, i64 16, !200, i64 20, !192, i64 24, !192, i64 28, !192, i64 32, !192, i64 36}
!206 = !{!"float", !192, i64 0}
!207 = !DILocation(line: 21, column: 33, scope: !203)
!208 = !DILocation(line: 21, column: 62, scope: !203)
!209 = !DILocation(line: 21, column: 81, scope: !203)
!210 = !DILocation(line: 21, column: 90, scope: !203)
!211 = !DILocation(line: 21, column: 8, scope: !178)
!212 = !DILocation(line: 22, column: 38, scope: !213)
!213 = distinct !DILexicalBlock(scope: !203, file: !179, line: 21, column: 122)
!214 = !DILocation(line: 22, column: 12, scope: !213)
!215 = !DILocation(line: 24, column: 14, scope: !216)
!216 = distinct !DILexicalBlock(scope: !213, file: !179, line: 24, column: 9)
!217 = !DILocation(line: 24, column: 11, scope: !216)
!218 = !DILocation(line: 24, column: 9, scope: !213)
!219 = !DILocation(line: 25, column: 8, scope: !220)
!220 = distinct !DILexicalBlock(scope: !216, file: !179, line: 24, column: 22)
