; ModuleID = 'samples/309.bc'
source_filename = "examples/pmem_and_default_kind.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rlimit = type { i64, i64 }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [32 x i8] c"Usage: %s [pmem_kind_dir_path]\0A\00", align 1, !dbg !0

!60 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 45)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 49)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 47)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(scope: null, file: !2, line: 84, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 856, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 107)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 90)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(scope: null, file: !2, line: 99, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 60)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !91, isLocal: true, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 54)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !66, isLocal: true, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !66, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 3)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(scope: null, file: !2, line: 124, type: !66, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 21, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 4)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 4096)
!113 = !{i32 7, !"Dwarf Version", i32 5}
!114 = !{i32 2, !"Debug Info Version", i32 3}
!115 = !{i32 1, !"wchar_size", i32 4}
!116 = !{i32 8, !"PIC Level", i32 2}
!117 = !{i32 7, !"PIE Level", i32 2}
!118 = !{i32 7, !"uwtable", i32 2}
!119 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!120 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 24, type: !121, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !125)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !123, !124}
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!125 = !{!126, !127, !128, !133, !136, !137, !146, !147, !148, !149}
!126 = !DILocalVariable(name: "argc", arg: 1, scope: !120, file: !2, line: 24, type: !123)
!127 = !DILocalVariable(name: "argv", arg: 2, scope: !120, file: !2, line: 24, type: !124)
!128 = !DILocalVariable(name: "size", scope: !120, file: !2, line: 26, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !131, line: 70, baseType: !132)
!131 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!132 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!133 = !DILocalVariable(name: "pmem_kind", scope: !120, file: !2, line: 27, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "memkind", file: !35, line: 107, flags: DIFlagFwdDecl)
!136 = !DILocalVariable(name: "err", scope: !120, file: !2, line: 28, type: !123)
!137 = !DILocalVariable(name: "heap_limit", scope: !120, file: !2, line: 43, type: !138)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !12, line: 139, size: 128, elements: !140)
!140 = !{!141, !145}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !139, file: !12, line: 142, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !12, line: 131, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !144, line: 157, baseType: !132)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !139, file: !12, line: 144, baseType: !142, size: 64, offset: 64)
!146 = !DILocalVariable(name: "ptr_default", scope: !120, file: !2, line: 50, type: !42)
!147 = !DILocalVariable(name: "ptr_default_not_possible", scope: !120, file: !2, line: 51, type: !42)
!148 = !DILocalVariable(name: "ptr_pmem", scope: !120, file: !2, line: 52, type: !42)
!149 = !DILocalVariable(name: "status", scope: !120, file: !2, line: 60, type: !123)
!150 = !{!151, !151, i64 0}
!151 = !{!"int", !152, i64 0}
!152 = !{!"omnipotent char", !153, i64 0}
!153 = !{!"Simple C/C++ TBAA"}
!154 = !DILocation(line: 24, column: 14, scope: !120)
!155 = !{!156, !156, i64 0}
!156 = !{!"any pointer", !152, i64 0}
!157 = !DILocation(line: 24, column: 26, scope: !120)
!158 = !DILocation(line: 26, column: 5, scope: !120)
!159 = !DILocation(line: 26, column: 18, scope: !120)
!160 = !{!161, !161, i64 0}
!161 = !{!"long", !152, i64 0}
!162 = !DILocation(line: 27, column: 5, scope: !120)
!163 = !DILocation(line: 27, column: 21, scope: !120)
!164 = !DILocation(line: 28, column: 5, scope: !120)
!165 = !DILocation(line: 28, column: 9, scope: !120)
!166 = !DILocation(line: 29, column: 5, scope: !120)
!167 = !DILocation(line: 29, column: 11, scope: !120)
!168 = !DILocation(line: 31, column: 9, scope: !169)
!169 = distinct !DILexicalBlock(scope: !120, file: !2, line: 31, column: 9)
!170 = !DILocation(line: 31, column: 14, scope: !169)
!171 = !DILocation(line: 31, column: 9, scope: !120)
!172 = !DILocation(line: 32, column: 9, scope: !173)
!173 = distinct !DILexicalBlock(scope: !169, file: !2, line: 31, column: 19)
!174 = !DILocation(line: 33, column: 9, scope: !173)
!175 = !DILocation(line: 34, column: 16, scope: !176)
!176 = distinct !DILexicalBlock(scope: !169, file: !2, line: 34, column: 16)
!177 = !DILocation(line: 34, column: 21, scope: !176)
!178 = !DILocation(line: 34, column: 16, scope: !169)
!179 = !DILocation(line: 35, column: 22, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !2, line: 35, column: 13)
!181 = distinct !DILexicalBlock(scope: !176, file: !2, line: 34, column: 27)
!182 = !DILocation(line: 35, column: 13, scope: !180)
!183 = !DILocation(line: 35, column: 37, scope: !180)
!184 = !DILocation(line: 35, column: 13, scope: !181)
!185 = !DILocation(line: 36, column: 13, scope: !186)
!186 = distinct !DILexicalBlock(scope: !180, file: !2, line: 35, column: 46)
!187 = !DILocation(line: 37, column: 13, scope: !186)
!188 = !DILocation(line: 39, column: 5, scope: !181)
!189 = !DILocation(line: 43, column: 5, scope: !120)
!190 = !DILocation(line: 43, column: 25, scope: !120)
!191 = !DILocation(line: 44, column: 11, scope: !120)
!192 = !DILocation(line: 44, column: 9, scope: !120)
!193 = !DILocation(line: 45, column: 9, scope: !194)
!194 = distinct !DILexicalBlock(scope: !120, file: !2, line: 45, column: 9)
!195 = !DILocation(line: 45, column: 9, scope: !120)
!196 = !DILocation(line: 46, column: 9, scope: !197)
!197 = distinct !DILexicalBlock(scope: !194, file: !2, line: 45, column: 14)
!198 = !DILocation(line: 47, column: 9, scope: !197)
!199 = !DILocation(line: 50, column: 5, scope: !120)
!200 = !DILocation(line: 50, column: 11, scope: !120)
!201 = !DILocation(line: 51, column: 5, scope: !120)
!202 = !DILocation(line: 51, column: 11, scope: !120)
!203 = !DILocation(line: 52, column: 5, scope: !120)
!204 = !DILocation(line: 52, column: 11, scope: !120)
!205 = !DILocation(line: 54, column: 5, scope: !120)
!206 = !DILocation(line: 60, column: 5, scope: !120)
!207 = !DILocation(line: 60, column: 9, scope: !120)
!208 = !DILocation(line: 60, column: 18, scope: !120)
!209 = !DILocation(line: 61, column: 10, scope: !210)
!210 = distinct !DILexicalBlock(scope: !120, file: !2, line: 61, column: 9)
!211 = !DILocation(line: 61, column: 9, scope: !120)
!212 = !DILocation(line: 62, column: 9, scope: !213)
!213 = distinct !DILexicalBlock(scope: !210, file: !2, line: 61, column: 18)
!214 = !DILocation(line: 63, column: 5, scope: !213)
!215 = !DILocation(line: 64, column: 9, scope: !216)
!216 = distinct !DILexicalBlock(scope: !210, file: !2, line: 63, column: 12)
!217 = !DILocation(line: 68, column: 11, scope: !120)
!218 = !DILocation(line: 68, column: 9, scope: !120)
!219 = !DILocation(line: 69, column: 9, scope: !220)
!220 = distinct !DILexicalBlock(scope: !120, file: !2, line: 69, column: 9)
!221 = !DILocation(line: 69, column: 9, scope: !120)
!222 = !DILocation(line: 70, column: 27, scope: !223)
!223 = distinct !DILexicalBlock(scope: !220, file: !2, line: 69, column: 14)
!224 = !DILocation(line: 70, column: 9, scope: !223)
!225 = !DILocation(line: 71, column: 9, scope: !223)
!226 = !DILocation(line: 74, column: 42, scope: !120)
!227 = !DILocation(line: 74, column: 27, scope: !120)
!228 = !DILocation(line: 74, column: 17, scope: !120)
!229 = !DILocation(line: 75, column: 10, scope: !230)
!230 = distinct !DILexicalBlock(scope: !120, file: !2, line: 75, column: 9)
!231 = !DILocation(line: 75, column: 9, scope: !120)
!232 = !DILocation(line: 76, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !230, file: !2, line: 75, column: 23)
!234 = !DILocation(line: 77, column: 9, scope: !233)
!235 = !DILocation(line: 80, column: 5, scope: !120)
!236 = !DILocation(line: 80, column: 11, scope: !120)
!237 = !DILocation(line: 82, column: 32, scope: !120)
!238 = !DILocation(line: 82, column: 17, scope: !120)
!239 = !DILocation(line: 81, column: 30, scope: !120)
!240 = !DILocation(line: 83, column: 9, scope: !241)
!241 = distinct !DILexicalBlock(scope: !120, file: !2, line: 83, column: 9)
!242 = !DILocation(line: 83, column: 9, scope: !120)
!243 = !DILocation(line: 84, column: 9, scope: !244)
!244 = distinct !DILexicalBlock(scope: !241, file: !2, line: 83, column: 35)
!245 = !DILocation(line: 87, column: 9, scope: !244)
!246 = !DILocation(line: 89, column: 9, scope: !247)
!247 = distinct !DILexicalBlock(scope: !120, file: !2, line: 89, column: 9)
!248 = !DILocation(line: 89, column: 15, scope: !247)
!249 = !DILocation(line: 89, column: 9, scope: !120)
!250 = !DILocation(line: 90, column: 9, scope: !251)
!251 = distinct !DILexicalBlock(scope: !247, file: !2, line: 89, column: 26)
!252 = !DILocation(line: 93, column: 9, scope: !251)
!253 = !DILocation(line: 96, column: 5, scope: !120)
!254 = !DILocation(line: 96, column: 11, scope: !120)
!255 = !DILocation(line: 97, column: 39, scope: !120)
!256 = !DILocation(line: 97, column: 24, scope: !120)
!257 = !DILocation(line: 97, column: 14, scope: !120)
!258 = !DILocation(line: 98, column: 10, scope: !259)
!259 = distinct !DILexicalBlock(scope: !120, file: !2, line: 98, column: 9)
!260 = !DILocation(line: 98, column: 9, scope: !120)
!261 = !DILocation(line: 99, column: 9, scope: !262)
!262 = distinct !DILexicalBlock(scope: !259, file: !2, line: 98, column: 20)
!263 = !DILocation(line: 101, column: 9, scope: !262)
!264 = !DILocation(line: 103, column: 9, scope: !265)
!265 = distinct !DILexicalBlock(scope: !120, file: !2, line: 103, column: 9)
!266 = !DILocation(line: 103, column: 15, scope: !265)
!267 = !DILocation(line: 103, column: 9, scope: !120)
!268 = !DILocation(line: 104, column: 9, scope: !269)
!269 = distinct !DILexicalBlock(scope: !265, file: !2, line: 103, column: 21)
!270 = !DILocation(line: 106, column: 9, scope: !269)
!271 = !DILocation(line: 109, column: 5, scope: !120)
!272 = !DILocation(line: 110, column: 5, scope: !120)
!273 = !DILocation(line: 112, column: 5, scope: !120)
!274 = !DILocation(line: 113, column: 5, scope: !120)
!275 = !DILocation(line: 115, column: 18, scope: !120)
!276 = !DILocation(line: 115, column: 35, scope: !120)
!277 = !DILocation(line: 115, column: 5, scope: !120)
!278 = !DILocation(line: 116, column: 18, scope: !120)
!279 = !DILocation(line: 116, column: 29, scope: !120)
!280 = !DILocation(line: 116, column: 5, scope: !120)
!281 = !DILocation(line: 118, column: 32, scope: !120)
!282 = !DILocation(line: 118, column: 11, scope: !120)
!283 = !DILocation(line: 118, column: 9, scope: !120)
!284 = !DILocation(line: 119, column: 9, scope: !285)
!285 = distinct !DILexicalBlock(scope: !120, file: !2, line: 119, column: 9)
!286 = !DILocation(line: 119, column: 9, scope: !120)
!287 = !DILocation(line: 120, column: 27, scope: !288)
!288 = distinct !DILexicalBlock(scope: !285, file: !2, line: 119, column: 14)
!289 = !DILocation(line: 120, column: 9, scope: !288)
!290 = !DILocation(line: 121, column: 9, scope: !288)
!291 = !DILocation(line: 124, column: 5, scope: !120)
!292 = !DILocation(line: 126, column: 5, scope: !120)
!293 = !DILocation(line: 127, column: 1, scope: !120)
!294 = !DISubprogram(name: "__errno_location", scope: !295, file: !295, line: 37, type: !296, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!295 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!296 = !DISubroutineType(types: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!299 = !DISubprogram(name: "__fprintf_chk", scope: !300, file: !300, line: 93, type: !301, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!301 = !DISubroutineType(types: !302)
!302 = !{!123, !303, !123, !359, null}
!303 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !306, line: 7, baseType: !307)
!306 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !308, line: 49, size: 1728, elements: !309)
!308 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !325, !327, !328, !329, !332, !334, !336, !340, !343, !345, !348, !351, !352, !353, !354, !355}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !307, file: !308, line: 51, baseType: !123, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !307, file: !308, line: 54, baseType: !42, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !307, file: !308, line: 55, baseType: !42, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !307, file: !308, line: 56, baseType: !42, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !307, file: !308, line: 57, baseType: !42, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !307, file: !308, line: 58, baseType: !42, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !307, file: !308, line: 59, baseType: !42, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !307, file: !308, line: 60, baseType: !42, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !307, file: !308, line: 61, baseType: !42, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !307, file: !308, line: 64, baseType: !42, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !307, file: !308, line: 65, baseType: !42, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !307, file: !308, line: 66, baseType: !42, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !307, file: !308, line: 68, baseType: !323, size: 64, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !308, line: 36, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !307, file: !308, line: 70, baseType: !326, size: 64, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !307, file: !308, line: 72, baseType: !123, size: 32, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !307, file: !308, line: 73, baseType: !123, size: 32, offset: 928)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !307, file: !308, line: 74, baseType: !330, size: 64, offset: 960)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !144, line: 152, baseType: !331)
!331 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !307, file: !308, line: 77, baseType: !333, size: 16, offset: 1024)
!333 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !307, file: !308, line: 78, baseType: !335, size: 8, offset: 1040)
!335 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !307, file: !308, line: 79, baseType: !337, size: 8, offset: 1048)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 1)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !307, file: !308, line: 81, baseType: !341, size: 64, offset: 1088)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !308, line: 43, baseType: null)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !307, file: !308, line: 89, baseType: !344, size: 64, offset: 1152)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !144, line: 153, baseType: !331)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !307, file: !308, line: 91, baseType: !346, size: 64, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !308, line: 37, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !307, file: !308, line: 92, baseType: !349, size: 64, offset: 1280)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !308, line: 38, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !307, file: !308, line: 93, baseType: !326, size: 64, offset: 1344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !307, file: !308, line: 94, baseType: !41, size: 64, offset: 1408)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !307, file: !308, line: 95, baseType: !130, size: 64, offset: 1472)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !307, file: !308, line: 96, baseType: !123, size: 32, offset: 1536)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !307, file: !308, line: 98, baseType: !356, size: 160, offset: 1568)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 20)
!359 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!362 = !DISubprogram(name: "setrlimit", scope: !363, file: !363, line: 70, type: !364, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!363 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "e55940cb1bf33174af2c45f02cd69e8a")
!364 = !DISubroutineType(types: !365)
!365 = !{!123, !366, !367}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlimit_resource_t", file: !363, line: 38, baseType: !11)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!368 = !DISubprogram(name: "memkind_check_dax_path", scope: !35, file: !35, line: 659, type: !369, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!369 = !DISubroutineType(types: !370)
!370 = !{!123, !360}
!371 = !DISubprogram(name: "memkind_create_pmem", scope: !35, file: !35, line: 499, type: !372, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!372 = !DISubroutineType(types: !373)
!373 = !{!123, !360, !130, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "memkind_t", file: !35, line: 107, baseType: !134)
!376 = distinct !DISubprogram(name: "print_err_message", scope: !2, file: !2, line: 17, type: !377, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !379)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !123}
!379 = !{!380, !381}
!380 = !DILocalVariable(name: "err", arg: 1, scope: !376, file: !2, line: 17, type: !123)
!381 = !DILocalVariable(name: "error_message", scope: !376, file: !2, line: 19, type: !382)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 128)
!385 = !DILocation(line: 17, column: 35, scope: !376)
!386 = !DILocation(line: 19, column: 5, scope: !376)
!387 = !DILocation(line: 19, column: 10, scope: !376)
!388 = !DILocation(line: 20, column: 27, scope: !376)
!389 = !DILocation(line: 20, column: 32, scope: !376)
!390 = !DILocation(line: 20, column: 5, scope: !376)
!391 = !DILocation(line: 21, column: 5, scope: !376)
!392 = !DILocation(line: 22, column: 1, scope: !376)
!393 = !DISubprogram(name: "memkind_malloc", scope: !35, file: !35, line: 584, type: !394, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!394 = !DISubroutineType(types: !395)
!395 = !{!41, !375, !130}
!396 = !DISubprogram(name: "__builtin___sprintf_chk", scope: !2, file: !2, line: 109, type: !397, flags: DIFlagArtificial | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!397 = !DISubroutineType(types: !398)
!398 = !{!123, !399, !123, !132, !359, null}
!399 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !42)
!400 = !DISubprogram(name: "memkind_free", scope: !35, file: !35, line: 640, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !375, !41}
!403 = !DISubprogram(name: "memkind_destroy_kind", scope: !35, file: !35, line: 390, type: !404, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!404 = !DISubroutineType(types: !405)
!405 = !{!123, !375}
!406 = !DISubprogram(name: "memkind_error_message", scope: !35, file: !35, line: 487, type: !407, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !123, !42, !130}
