; ModuleID = 'samples/313.bc'
source_filename = "ftl_p2l.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.spdk_ftl_dev = type { %struct.spdk_ftl_conf, %struct.ftl_layout, ptr, ptr, ptr, %struct.anon.52, ptr, i64, i8, i8, i8, i8, ptr, %struct.ftl_nv_cache, ptr, ptr, ptr, %struct.ftl_trace, %struct.ftl_stats, ptr, i64, ptr, %struct.anon.60, %struct.anon.61, i64, ptr, %struct.anon.62, i64, ptr, i64, i64, i32, i32, ptr, ptr, ptr, ptr, ptr, %struct.anon.63, %struct.anon.64, %struct.anon.65, ptr, ptr, i64, i8, %struct.ftl_writer, %struct.ftl_writer, i32, i8, %struct.anon.68 }
%struct.spdk_ftl_conf = type { ptr, %struct.spdk_uuid, i64, i64, ptr, i64, [4 x i64], i32, %struct.anon.47, [4 x i8], ptr, ptr, i8, [7 x i8], i64 }
%struct.spdk_uuid = type { %union.anon.46 }
%union.anon.46 = type { [16 x i8] }
%struct.anon.47 = type { i32, i32 }
%struct.ftl_layout = type { %struct.anon.48, %struct.anon.49, %struct.anon.50, %struct.anon.51, [16 x %struct.ftl_layout_region], [16 x ptr] }
%struct.anon.48 = type { i64, i64, i64 }
%struct.anon.49 = type { i64, i64, i64, i64, i64 }
%struct.anon.50 = type { i64, i64, i64 }
%struct.anon.51 = type { i64 }
%struct.ftl_layout_region = type { ptr, i32, i32, %struct.ftl_layout_region_descriptor, %struct.ftl_layout_region_descriptor, i64, i64, i64, ptr, ptr }
%struct.ftl_layout_region_descriptor = type { i64, i64, i64, ptr }

!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "spdk_bdev_claim_type", file: !78, line: 165, baseType: !5, size: 32, elements: !79)
!78 = !DIFile(filename: "include/spdk/bdev_module.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "f3e5f69dba00acf2eaaf56f163ec4e42")
!79 = !{!80, !81}
!80 = !DIEnumerator(name: "SPDK_BDEV_CLAIM_NONE", value: 0)
!81 = !DIEnumerator(name: "SPDK_BDEV_CLAIM_EXCL_WRITE", value: 1)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftl_chunk_state", file: !83, line: 52, baseType: !5, size: 32, elements: !84)
!83 = !DIFile(filename: "./ftl_nv_cache.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "ab40a95371e7ce0e8bb4a747c54fba17")
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "FTL_CHUNK_STATE_FREE", value: 0)
!86 = !DIEnumerator(name: "FTL_CHUNK_STATE_OPEN", value: 1)
!87 = !DIEnumerator(name: "FTL_CHUNK_STATE_CLOSED", value: 2)
!88 = !DIEnumerator(name: "FTL_CHUNK_STATE_MAX", value: 3)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftl_band_state", file: !90, line: 32, baseType: !5, size: 32, elements: !91)
!90 = !DIFile(filename: "./ftl_band.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "2f90dc4b982c4db102e2fcc4c0df5efa")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99}
!92 = !DIEnumerator(name: "FTL_BAND_STATE_FREE", value: 0)
!93 = !DIEnumerator(name: "FTL_BAND_STATE_PREP", value: 1)
!94 = !DIEnumerator(name: "FTL_BAND_STATE_OPENING", value: 2)
!95 = !DIEnumerator(name: "FTL_BAND_STATE_OPEN", value: 3)
!96 = !DIEnumerator(name: "FTL_BAND_STATE_FULL", value: 4)
!97 = !DIEnumerator(name: "FTL_BAND_STATE_CLOSING", value: 5)
!98 = !DIEnumerator(name: "FTL_BAND_STATE_CLOSED", value: 6)
!99 = !DIEnumerator(name: "FTL_BAND_STATE_MAX", value: 7)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftl_band_type", file: !101, line: 41, baseType: !5, size: 32, elements: !102)
!101 = !DIFile(filename: "./ftl_internal.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "639459d74dde441eb9b190068b535de4")
!102 = !{!103, !104}
!103 = !DIEnumerator(name: "FTL_BAND_TYPE_GC", value: 1)
!104 = !DIEnumerator(name: "FTL_BAND_TYPE_COMPACTION", value: 2)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftl_md_status", file: !101, line: 46, baseType: !5, size: 32, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112}
!107 = !DIEnumerator(name: "FTL_MD_SUCCESS", value: 0)
!108 = !DIEnumerator(name: "FTL_MD_IO_FAILURE", value: 1)
!109 = !DIEnumerator(name: "FTL_MD_INVALID_VER", value: 2)
!110 = !DIEnumerator(name: "FTL_MD_NO_MD", value: 3)
!111 = !DIEnumerator(name: "FTL_MD_INVALID_CRC", value: 4)
!112 = !DIEnumerator(name: "FTL_MD_INVALID_SIZE", value: 5)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftl_io_type", file: !114, line: 34, baseType: !5, size: 32, elements: !115)
!114 = !DIFile(filename: "./ftl_io.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "dbc694b485774c77420341a94dbbe416")
!115 = !{!116, !117, !118}
!116 = !DIEnumerator(name: "FTL_IO_READ", value: 0)
!117 = !DIEnumerator(name: "FTL_IO_WRITE", value: 1)
!118 = !DIEnumerator(name: "FTL_IO_UNMAP", value: 2)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftl_stats_type", file: !120, line: 47, baseType: !5, size: 32, elements: !121)
!120 = !DIFile(filename: "include/spdk/ftl.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "39b048091f7c910e883a0ee44a4990de")
!121 = !{!122, !123, !124, !125, !126, !127, !128}
!122 = !DIEnumerator(name: "FTL_STATS_TYPE_USER", value: 0)
!123 = !DIEnumerator(name: "FTL_STATS_TYPE_CMP", value: 1)
!124 = !DIEnumerator(name: "FTL_STATS_TYPE_GC", value: 2)
!125 = !DIEnumerator(name: "FTL_STATS_TYPE_MD_BASE", value: 3)
!126 = !DIEnumerator(name: "FTL_STATS_TYPE_MD_NV_CACHE", value: 4)
!127 = !DIEnumerator(name: "FTL_STATS_TYPE_L2P", value: 5)
!128 = !DIEnumerator(name: "FTL_STATS_TYPE_MAX", value: 6)
!129 = !{!130, !131, !139}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_p2l_ckpt_page", file: !101, line: 110, size: 32768, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !132, file: !101, line: 111, baseType: !135, size: 32768)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32768, elements: !145)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_p2l_map_entry", file: !101, line: 60, size: 128, elements: !137)
!137 = !{!138, !144}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "lba", scope: !136, file: !101, line: 61, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !140, line: 27, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !142, line: 45, baseType: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!143 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "seq_id", scope: !136, file: !101, line: 62, baseType: !139, size: 64, offset: 64)
!145 = !{!146}
!146 = !DISubrange(count: 256)
!147 = !{i32 7, !"Dwarf Version", i32 5}
!148 = !{i32 2, !"Debug Info Version", i32 3}
!149 = !{i32 1, !"wchar_size", i32 4}
!150 = !{i32 8, !"PIC Level", i32 2}
!151 = !{i32 7, !"uwtable", i32 2}
!152 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!153 = distinct !DISubprogram(name: "ftl_p2l_ckpt_init", scope: !1, file: !1, line: 77, type: !154, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1792)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !157}
!156 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_ftl_dev", file: !159, line: 42, size: 30720, elements: !160)
!159 = !DIFile(filename: "./ftl_core.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "37cad5a800a858b02f32e26afc2ef2b0")
!160 = !{!161, !210, !1172, !1199, !1213, !1214, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1247, !1635, !1636, !1637, !1638, !1643, !1667, !1668, !1669, !1670, !1675, !1680, !1681, !1682, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1696, !1697, !1698, !1699, !1700, !1740, !1745, !1750, !1751, !1752, !1753, !1754, !1776, !1777, !1778, !1779}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !158, file: !159, line: 44, baseType: !162, size: 1088)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_ftl_conf", file: !120, line: 81, size: 1088, elements: !163)
!163 = !{!164, !167, !181, !182, !185, !186, !187, !191, !194, !199, !201, !202, !203, !205, !209}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !120, line: 83, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !162, file: !120, line: 86, baseType: !168, size: 128, offset: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_uuid", file: !169, line: 21, size: 128, elements: !170)
!169 = !DIFile(filename: "include/spdk/uuid.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "184998928e884963453b933bb411eaa6")
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !168, file: !169, line: 24, baseType: !172, size: 128)
!172 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !169, line: 22, size: 128, elements: !173)
!173 = !{!174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !172, file: !169, line: 23, baseType: !175, size: 128)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !179)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !140, line: 24, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !142, line: 38, baseType: !178)
!178 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!179 = !{!180}
!180 = !DISubrange(count: 16)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "overprovisioning", scope: !162, file: !120, line: 89, baseType: !139, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "l2p_dram_limit", scope: !162, file: !120, line: 92, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !184, line: 29, baseType: !143)
!184 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "core_mask", scope: !162, file: !120, line: 95, baseType: !165, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "user_io_pool_size", scope: !162, file: !120, line: 98, baseType: !183, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "limits", scope: !162, file: !120, line: 101, baseType: !188, size: 256, offset: 448)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 256, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 4)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !162, file: !120, line: 104, baseType: !192, size: 32, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !140, line: 26, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !142, line: 42, baseType: !5)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nv_cache", scope: !162, file: !120, line: 112, baseType: !195, size: 64, offset: 736)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !120, line: 106, size: 64, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_compaction_threshold", scope: !195, file: !120, line: 108, baseType: !192, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_free_target", scope: !195, file: !120, line: 111, baseType: !192, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !162, file: !120, line: 115, baseType: !200, size: 32, offset: 800)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 32, elements: !189)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "base_bdev", scope: !162, file: !120, line: 118, baseType: !165, size: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bdev", scope: !162, file: !120, line: 121, baseType: !165, size: 64, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fast_shutdown", scope: !162, file: !120, line: 124, baseType: !204, size: 8, offset: 960)
!204 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !162, file: !120, line: 127, baseType: !206, size: 56, offset: 968)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 56, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 7)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "conf_size", scope: !162, file: !120, line: 134, baseType: !183, size: 64, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !158, file: !159, line: 47, baseType: !211, size: 17152, offset: 1088)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_layout", file: !4, line: 127, size: 17152, elements: !212)
!212 = !{!213, !219, !227, !233, !237, !274}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !211, file: !4, line: 133, baseType: !214, size: 192)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !4, line: 129, size: 192, elements: !215)
!215 = !{!216, !217, !218}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "total_blocks", scope: !214, file: !4, line: 130, baseType: !139, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_usable_blocks", scope: !214, file: !4, line: 131, baseType: !139, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "user_blocks", scope: !214, file: !4, line: 132, baseType: !139, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "nvc", scope: !211, file: !4, line: 142, baseType: !220, size: 320, offset: 192)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !4, line: 136, size: 320, elements: !221)
!221 = !{!222, !223, !224, !225, !226}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "total_blocks", scope: !220, file: !4, line: 137, baseType: !139, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_data_blocks", scope: !220, file: !4, line: 138, baseType: !139, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_meta_size", scope: !220, file: !4, line: 139, baseType: !139, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_count", scope: !220, file: !4, line: 140, baseType: !139, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_tail_md_num_blocks", scope: !220, file: !4, line: 141, baseType: !139, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "l2p", scope: !211, file: !4, line: 152, baseType: !228, size: 192, offset: 512)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !4, line: 145, size: 192, elements: !229)
!229 = !{!230, !231, !232}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "addr_length", scope: !228, file: !4, line: 147, baseType: !139, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "addr_size", scope: !228, file: !4, line: 149, baseType: !139, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "lbas_in_page", scope: !228, file: !4, line: 151, baseType: !139, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "p2l", scope: !211, file: !4, line: 158, baseType: !234, size: 64, offset: 704)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !4, line: 155, size: 64, elements: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ckpt_pages", scope: !234, file: !4, line: 157, baseType: !139, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !211, file: !4, line: 160, baseType: !238, size: 15360, offset: 768)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 15360, elements: !179)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_layout_region", file: !4, line: 88, size: 960, elements: !240)
!240 = !{!241, !244, !245, !246, !264, !265, !266, !267, !268, !271}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !239, file: !4, line: 90, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !239, file: !4, line: 93, baseType: !3, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_type", scope: !239, file: !4, line: 96, baseType: !3, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !239, file: !4, line: 99, baseType: !247, size: 256, offset: 128)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_layout_region_descriptor", file: !4, line: 74, size: 256, elements: !248)
!248 = !{!249, !250, !251, !252}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !247, file: !4, line: 76, baseType: !139, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !247, file: !4, line: 79, baseType: !139, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !247, file: !4, line: 82, baseType: !139, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sb_md_reg", scope: !247, file: !4, line: 84, baseType: !253, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_superblock_md_region", file: !255, line: 48, size: 256, elements: !256)
!255 = !DIFile(filename: "./ftl_sb_common.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "4e2b3ed6e002be341073dc542da38b27")
!256 = !{!257, !258, !259, !260, !261}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !255, line: 49, baseType: !192, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !254, file: !255, line: 50, baseType: !192, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "blk_offs", scope: !254, file: !255, line: 51, baseType: !139, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "blk_sz", scope: !254, file: !255, line: 52, baseType: !139, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "df_next", scope: !254, file: !255, line: 53, baseType: !262, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_df_obj_id", file: !263, line: 12, baseType: !139)
!263 = !DIFile(filename: "./utils/ftl_df.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "52ec2517c2959b262ff51f96d4eec83e")
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !239, file: !4, line: 102, baseType: !247, size: 256, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "entry_size", scope: !239, file: !4, line: 109, baseType: !139, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !239, file: !4, line: 112, baseType: !139, size: 64, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "vss_blksz", scope: !239, file: !4, line: 115, baseType: !139, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_desc", scope: !239, file: !4, line: 118, baseType: !269, size: 64, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_desc", file: !48, line: 99, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ioch", scope: !239, file: !4, line: 121, baseType: !272, size: 64, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_io_channel", file: !48, line: 84, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !211, file: !4, line: 163, baseType: !275, size: 1024, offset: 16128)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 1024, elements: !179)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_md", file: !27, line: 28, size: 3776, elements: !278)
!278 = !{!279, !284, !289, !290, !293, !294, !295, !296, !297, !1151, !1152, !1154, !1155, !1156, !1164, !1169, !1170, !1171}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !277, file: !27, line: 36, baseType: !280, size: 128)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !277, file: !27, line: 30, size: 128, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !280, file: !27, line: 32, baseType: !130, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cb_ctx", scope: !280, file: !27, line: 35, baseType: !130, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !277, file: !27, line: 39, baseType: !285, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_md_cb", file: !27, line: 16, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !157, !276, !156}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !277, file: !27, line: 42, baseType: !157, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !277, file: !27, line: 45, baseType: !291, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !277, file: !27, line: 48, baseType: !130, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data_blocks", scope: !277, file: !27, line: 51, baseType: !139, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "vss_data", scope: !277, file: !27, line: 54, baseType: !130, size: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "entry_vss_dma_buf", scope: !277, file: !27, line: 57, baseType: !130, size: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !277, file: !27, line: 69, baseType: !298, size: 704, offset: 576)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !277, file: !27, line: 60, size: 704, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !298, file: !27, line: 61, baseType: !130, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !298, file: !27, line: 62, baseType: !130, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !298, file: !27, line: 63, baseType: !139, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !298, file: !27, line: 64, baseType: !139, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data_offset", scope: !298, file: !27, line: 65, baseType: !139, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !298, file: !27, line: 66, baseType: !156, size: 32, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !298, file: !27, line: 67, baseType: !26, size: 32, offset: 352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_io_wait", scope: !298, file: !27, line: 68, baseType: !308, size: 320, offset: 384)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_io_wait_entry", file: !48, line: 1790, size: 320, elements: !309)
!309 = !{!310, !1141, !1143, !1144}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bdev", scope: !308, file: !48, line: 1791, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev", file: !78, line: 318, size: 3648, elements: !313)
!313 = !{!314, !315, !316, !342, !343, !344, !345, !346, !347, !348, !349, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !428, !1057}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ctxt", scope: !312, file: !78, line: 320, baseType: !130, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !312, file: !78, line: 323, baseType: !165, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !312, file: !78, line: 326, baseType: !317, size: 128, offset: 128)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_aliases_list", file: !78, line: 326, size: 128, elements: !318)
!318 = !{!319, !341}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !317, file: !78, line: 326, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_alias", file: !78, line: 309, size: 448, elements: !322)
!322 = !{!323, !335}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !321, file: !78, line: 310, baseType: !324, size: 320)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_name", file: !78, line: 303, size: 320, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !78, line: 304, baseType: !165, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "bdev", scope: !324, file: !78, line: 305, baseType: !311, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !324, file: !78, line: 306, baseType: !329, size: 192, offset: 128)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !324, file: !78, line: 306, size: 192, elements: !330)
!330 = !{!331, !333, !334}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !329, file: !78, line: 306, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !329, file: !78, line: 306, baseType: !332, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !329, file: !78, line: 306, baseType: !332, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tailq", scope: !321, file: !78, line: 311, baseType: !336, size: 128, offset: 320)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !321, file: !78, line: 311, size: 128, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !336, file: !78, line: 311, baseType: !320, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !336, file: !78, line: 311, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !317, file: !78, line: 326, baseType: !340, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "product_name", scope: !312, file: !78, line: 329, baseType: !165, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "write_cache", scope: !312, file: !78, line: 332, baseType: !156, size: 32, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "blocklen", scope: !312, file: !78, line: 335, baseType: !192, size: 32, offset: 352)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "phys_blocklen", scope: !312, file: !78, line: 338, baseType: !192, size: 32, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "blockcnt", scope: !312, file: !78, line: 341, baseType: !139, size: 64, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "split_on_write_unit", scope: !312, file: !78, line: 355, baseType: !204, size: 8, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "write_unit_size", scope: !312, file: !78, line: 358, baseType: !192, size: 32, offset: 544)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "acwu", scope: !312, file: !78, line: 361, baseType: !350, size: 16, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !140, line: 25, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !142, line: 40, baseType: !352)
!352 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "required_alignment", scope: !312, file: !78, line: 370, baseType: !176, size: 8, offset: 592)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "split_on_optimal_io_boundary", scope: !312, file: !78, line: 381, baseType: !204, size: 8, offset: 600)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "optimal_io_boundary", scope: !312, file: !78, line: 386, baseType: !192, size: 32, offset: 608)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "max_segment_size", scope: !312, file: !78, line: 394, baseType: !192, size: 32, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_segments", scope: !312, file: !78, line: 397, baseType: !192, size: 32, offset: 672)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "max_unmap", scope: !312, file: !78, line: 400, baseType: !192, size: 32, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "max_unmap_segments", scope: !312, file: !78, line: 403, baseType: !192, size: 32, offset: 736)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "max_write_zeroes", scope: !312, file: !78, line: 406, baseType: !192, size: 32, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "max_copy", scope: !312, file: !78, line: 409, baseType: !192, size: 32, offset: 800)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !312, file: !78, line: 416, baseType: !168, size: 128, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "md_len", scope: !312, file: !78, line: 419, baseType: !192, size: 32, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "md_interleave", scope: !312, file: !78, line: 427, baseType: !204, size: 8, offset: 992)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dif_type", scope: !312, file: !78, line: 434, baseType: !32, size: 32, offset: 1024)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "dif_is_head_of_md", scope: !312, file: !78, line: 444, baseType: !204, size: 8, offset: 1056)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dif_check_flags", scope: !312, file: !78, line: 449, baseType: !192, size: 32, offset: 1088)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "zoned", scope: !312, file: !78, line: 454, baseType: !204, size: 8, offset: 1120)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "zone_size", scope: !312, file: !78, line: 459, baseType: !139, size: 64, offset: 1152)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "max_zone_append_size", scope: !312, file: !78, line: 464, baseType: !192, size: 32, offset: 1216)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "max_open_zones", scope: !312, file: !78, line: 469, baseType: !192, size: 32, offset: 1248)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "max_active_zones", scope: !312, file: !78, line: 474, baseType: !192, size: 32, offset: 1280)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "optimal_open_zones", scope: !312, file: !78, line: 479, baseType: !192, size: 32, offset: 1312)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "media_events", scope: !312, file: !78, line: 484, baseType: !204, size: 8, offset: 1344)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reset_io_drain_timeout", scope: !312, file: !78, line: 503, baseType: !350, size: 16, offset: 1360)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !312, file: !78, line: 508, baseType: !377, size: 64, offset: 1408)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_module", file: !78, line: 37, size: 960, elements: !379)
!379 = !{!380, !384, !388, !389, !390, !397, !398, !399, !403, !404, !405, !406, !407}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "module_init", scope: !378, file: !78, line: 44, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!156}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "init_complete", scope: !378, file: !78, line: 52, baseType: !385, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fini_start", scope: !378, file: !78, line: 64, baseType: !385, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "module_fini", scope: !378, file: !78, line: 73, baseType: !385, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "config_json", scope: !378, file: !78, line: 89, baseType: !391, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!156, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_json_write_ctx", file: !396, line: 173, flags: DIFlagFwdDecl)
!396 = !DIFile(filename: "include/spdk/json.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "2503f979e3d49afab298cb349bb94ec6")
!397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !378, file: !78, line: 92, baseType: !242, size: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "get_ctx_size", scope: !378, file: !78, line: 98, baseType: !381, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "examine_config", scope: !378, file: !78, line: 111, baseType: !400, size: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !311}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "examine_disk", scope: !378, file: !78, line: 119, baseType: !400, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "async_init", scope: !378, file: !78, line: 126, baseType: !204, size: 8, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "async_fini", scope: !378, file: !78, line: 133, baseType: !204, size: 8, offset: 584)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "async_fini_start", scope: !378, file: !78, line: 140, baseType: !204, size: 8, offset: 592)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !378, file: !78, line: 161, baseType: !408, size: 320, offset: 640)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__bdev_module_internal_fields", file: !78, line: 146, size: 320, elements: !409)
!409 = !{!410, !421, !422}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "spinlock", scope: !408, file: !78, line: 150, baseType: !411, size: 128)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_spinlock", file: !412, line: 915, size: 128, elements: !413)
!412 = !DIFile(filename: "include/spdk/thread.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "049d1606c4c83167baed644453ef96cb")
!413 = !{!414, !418}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "spinlock", scope: !411, file: !412, line: 916, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_spinlock_t", file: !416, line: 103, baseType: !417)
!416 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!417 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !156)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !411, file: !412, line: 917, baseType: !419, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_thread", file: !412, line: 40, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "action_in_progress", scope: !408, file: !78, line: 158, baseType: !192, size: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tailq", scope: !408, file: !78, line: 160, baseType: !423, size: 128, offset: 192)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !78, line: 160, size: 128, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !423, file: !78, line: 160, baseType: !377, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !423, file: !78, line: 160, baseType: !427, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fn_table", scope: !312, file: !78, line: 511, baseType: !429, size: 64, offset: 1472)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_fn_table", file: !78, line: 215, size: 704, elements: !432)
!432 = !{!433, !437, !1020, !1024, !1028, !1032, !1036, !1040, !1044, !1049, !1053}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "destruct", scope: !431, file: !78, line: 217, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!156, !130}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "submit_request", scope: !431, file: !78, line: 220, baseType: !438, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !272, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_io", file: !78, line: 644, size: 7936, elements: !443)
!443 = !{!444, !445, !446, !447, !455, !459, !922, !928, !1016}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bdev", scope: !442, file: !78, line: 646, baseType: !311, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !442, file: !78, line: 649, baseType: !176, size: 8, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "num_retries", scope: !442, file: !78, line: 652, baseType: !350, size: 16, offset: 80)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !442, file: !78, line: 655, baseType: !448, size: 128, offset: 128)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !449, line: 26, size: 128, elements: !450)
!449 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !448, file: !449, line: 28, baseType: !130, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !448, file: !449, line: 29, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !454, line: 70, baseType: !143)
!454 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!455 = !DIDerivedType(tag: DW_TAG_member, name: "child_iov", scope: !442, file: !78, line: 658, baseType: !456, size: 4096, offset: 256)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 4096, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !442, file: !78, line: 771, baseType: !460, size: 960, offset: 4352)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !442, file: !78, line: 660, size: 960, elements: !461)
!461 = !{!462, !509, !520, !524, !915}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bdev", scope: !460, file: !78, line: 727, baseType: !463, size: 960)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !78, line: 661, size: 960, elements: !464)
!464 = !{!465, !467, !468, !469, !470, !471, !472, !473, !483, !488, !489, !490, !491, !497, !501, !505}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "iovs", scope: !463, file: !78, line: 663, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "iovcnt", scope: !463, file: !78, line: 666, baseType: !156, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "fused_iovs", scope: !463, file: !78, line: 671, baseType: !466, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fused_iovcnt", scope: !463, file: !78, line: 674, baseType: !156, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "md_buf", scope: !463, file: !78, line: 677, baseType: !130, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !463, file: !78, line: 680, baseType: !139, size: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "offset_blocks", scope: !463, file: !78, line: 683, baseType: !139, size: 64, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ext_opts", scope: !463, file: !78, line: 686, baseType: !474, size: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_ext_io_opts", file: !48, line: 213, size: 256, elements: !476)
!476 = !{!477, !478, !481, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !475, file: !48, line: 215, baseType: !183, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "memory_domain", scope: !475, file: !48, line: 220, baseType: !479, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_memory_domain", file: !48, line: 220, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "memory_domain_ctx", scope: !475, file: !48, line: 222, baseType: !130, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !475, file: !48, line: 224, baseType: !130, size: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "stored_user_cb", scope: !463, file: !78, line: 689, baseType: !484, size: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "spdk_bdev_io_completion_cb", file: !48, line: 149, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !441, !204, !130}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "split_remaining_num_blocks", scope: !463, file: !78, line: 692, baseType: !139, size: 64, offset: 576)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "split_current_offset_blocks", scope: !463, file: !78, line: 695, baseType: !139, size: 64, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "split_outstanding", scope: !463, file: !78, line: 698, baseType: !192, size: 32, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "zcopy", scope: !463, file: !78, line: 709, baseType: !492, size: 8, offset: 736)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !78, line: 700, size: 8, elements: !493)
!493 = !{!494, !495, !496}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "populate", scope: !492, file: !78, line: 702, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "commit", scope: !492, file: !78, line: 705, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !492, file: !78, line: 708, baseType: !176, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "abort", scope: !463, file: !78, line: 716, baseType: !498, size: 64, offset: 768)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !78, line: 711, size: 64, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bio_cb_arg", scope: !498, file: !78, line: 715, baseType: !130, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !463, file: !78, line: 721, baseType: !502, size: 64, offset: 832)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !78, line: 718, size: 64, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !502, file: !78, line: 720, baseType: !139, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !463, file: !78, line: 726, baseType: !506, size: 64, offset: 896)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !78, line: 723, size: 64, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "src_offset_blocks", scope: !506, file: !78, line: 725, baseType: !139, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !460, file: !78, line: 737, baseType: !510, size: 192)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !78, line: 728, size: 192, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ch_ref", scope: !510, file: !78, line: 730, baseType: !272, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "wait_poller", scope: !510, file: !78, line: 736, baseType: !514, size: 128, offset: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !510, file: !78, line: 731, size: 128, elements: !515)
!515 = !{!516, !519}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !514, file: !78, line: 733, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_poller", file: !412, line: 45, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "stop_time_tsc", scope: !514, file: !78, line: 735, baseType: !139, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "abort", scope: !460, file: !78, line: 741, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !78, line: 738, size: 64, elements: !522)
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bio_to_abort", scope: !521, file: !78, line: 740, baseType: !441, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "nvme_passthru", scope: !460, file: !78, line: 757, baseType: !525, size: 768)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !78, line: 742, size: 768, elements: !526)
!526 = !{!527, !911, !912, !913, !914}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !525, file: !78, line: 744, baseType: !528, size: 512)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_nvme_cmd", file: !529, line: 1256, size: 512, elements: !530)
!529 = !DIFile(filename: "include/spdk/nvme_spec.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "3730a8a70b66ab92d6c3f7fce32e0764")
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !578, !672, !887, !908, !909, !910}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "opc", scope: !528, file: !529, line: 1258, baseType: !350, size: 8, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "fuse", scope: !528, file: !529, line: 1259, baseType: !350, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !528, file: !529, line: 1260, baseType: !350, size: 4, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "psdt", scope: !528, file: !529, line: 1261, baseType: !350, size: 2, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "cid", scope: !528, file: !529, line: 1262, baseType: !350, size: 16, offset: 16)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nsid", scope: !528, file: !529, line: 1265, baseType: !192, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !528, file: !529, line: 1268, baseType: !192, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd3", scope: !528, file: !529, line: 1269, baseType: !192, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mptr", scope: !528, file: !529, line: 1272, baseType: !139, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dptr", scope: !528, file: !529, line: 1282, baseType: !541, size: 128, offset: 192)
!541 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !529, line: 1275, size: 128, elements: !542)
!542 = !{!543, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "prp", scope: !541, file: !529, line: 1279, baseType: !544, size: 128)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !541, file: !529, line: 1276, size: 128, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "prp1", scope: !544, file: !529, line: 1277, baseType: !139, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "prp2", scope: !544, file: !529, line: 1278, baseType: !139, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sgl1", scope: !541, file: !529, line: 1281, baseType: !549, size: 128)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_nvme_sgl_descriptor", file: !529, line: 610, size: 128, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !549, file: !529, line: 611, baseType: !139, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, scope: !549, file: !529, line: 612, baseType: !553, size: 64, offset: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !549, file: !529, line: 612, size: 64, elements: !554)
!554 = !{!555, !561, !571}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !553, file: !529, line: 617, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !553, file: !529, line: 613, size: 64, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !556, file: !529, line: 614, baseType: !206, size: 56)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !556, file: !529, line: 615, baseType: !176, size: 4, offset: 56, flags: DIFlagBitField, extraData: i64 56)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !556, file: !529, line: 616, baseType: !176, size: 4, offset: 60, flags: DIFlagBitField, extraData: i64 56)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "unkeyed", scope: !553, file: !529, line: 624, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !553, file: !529, line: 619, size: 64, elements: !563)
!563 = !{!564, !565, !569, !570}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !562, file: !529, line: 620, baseType: !192, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !562, file: !529, line: 621, baseType: !566, size: 24, offset: 32)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 24, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 3)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !562, file: !529, line: 622, baseType: !176, size: 4, offset: 56, flags: DIFlagBitField, extraData: i64 56)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !562, file: !529, line: 623, baseType: !176, size: 4, offset: 60, flags: DIFlagBitField, extraData: i64 56)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "keyed", scope: !553, file: !529, line: 631, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !553, file: !529, line: 626, size: 64, elements: !573)
!573 = !{!574, !575, !576, !577}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !572, file: !529, line: 627, baseType: !139, size: 24, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !572, file: !529, line: 628, baseType: !139, size: 32, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !572, file: !529, line: 629, baseType: !139, size: 4, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !572, file: !529, line: 630, baseType: !139, size: 4, offset: 60, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, scope: !528, file: !529, line: 1285, baseType: !579, size: 32, offset: 320)
!579 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !529, line: 1285, size: 32, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "cdw10", scope: !579, file: !529, line: 1286, baseType: !192, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "cdw10_bits", scope: !579, file: !529, line: 1287, baseType: !583, size: 32)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_cmd_cdw10", file: !529, line: 1028, size: 32, elements: !584)
!584 = !{!585, !586, !592, !600, !605, !612, !617, !622, !628, !634, !639, !644, !649, !656, !664}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !583, file: !529, line: 1029, baseType: !192, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "identify", scope: !583, file: !529, line: 1036, baseType: !587, size: 32)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1030, size: 32, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "cns", scope: !587, file: !529, line: 1032, baseType: !192, size: 8, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !587, file: !529, line: 1033, baseType: !192, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cntid", scope: !587, file: !529, line: 1035, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "get_log_page", scope: !583, file: !529, line: 1048, baseType: !593, size: 32)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1038, size: 32, elements: !594)
!594 = !{!595, !596, !597, !598, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lid", scope: !593, file: !529, line: 1040, baseType: !192, size: 8, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "lsp", scope: !593, file: !529, line: 1042, baseType: !192, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !593, file: !529, line: 1043, baseType: !192, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rae", scope: !593, file: !529, line: 1045, baseType: !192, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "numdl", scope: !593, file: !529, line: 1047, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "abort", scope: !583, file: !529, line: 1055, baseType: !601, size: 32)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1050, size: 32, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sqid", scope: !601, file: !529, line: 1052, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cid", scope: !601, file: !529, line: 1054, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sec_send_recv", scope: !583, file: !529, line: 1066, baseType: !606, size: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1057, size: 32, elements: !607)
!607 = !{!608, !609, !610, !611}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "nssf", scope: !606, file: !529, line: 1059, baseType: !192, size: 8, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "spsp0", scope: !606, file: !529, line: 1061, baseType: !192, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "spsp1", scope: !606, file: !529, line: 1063, baseType: !192, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "secp", scope: !606, file: !529, line: 1065, baseType: !192, size: 8, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "create_io_q", scope: !583, file: !529, line: 1073, baseType: !613, size: 32)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1068, size: 32, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "qid", scope: !613, file: !529, line: 1070, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "qsize", scope: !613, file: !529, line: 1072, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "delete_io_q", scope: !583, file: !529, line: 1079, baseType: !618, size: 32)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1075, size: 32, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "qid", scope: !618, file: !529, line: 1077, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !618, file: !529, line: 1078, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "get_features", scope: !583, file: !529, line: 1087, baseType: !623, size: 32)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1081, size: 32, elements: !624)
!624 = !{!625, !626, !627}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !623, file: !529, line: 1083, baseType: !192, size: 8, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !623, file: !529, line: 1085, baseType: !192, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !623, file: !529, line: 1086, baseType: !192, size: 21, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "set_features", scope: !583, file: !529, line: 1095, baseType: !629, size: 32)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1089, size: 32, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !629, file: !529, line: 1091, baseType: !192, size: 8, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !629, file: !529, line: 1092, baseType: !192, size: 23, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sv", scope: !629, file: !529, line: 1094, baseType: !192, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ns_attach", scope: !583, file: !529, line: 1101, baseType: !635, size: 32)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1097, size: 32, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !635, file: !529, line: 1099, baseType: !192, size: 4, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !635, file: !529, line: 1100, baseType: !192, size: 28, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ns_manage", scope: !583, file: !529, line: 1107, baseType: !640, size: 32)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1103, size: 32, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !640, file: !529, line: 1105, baseType: !192, size: 4, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !640, file: !529, line: 1106, baseType: !192, size: 28, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dsm", scope: !583, file: !529, line: 1113, baseType: !645, size: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1109, size: 32, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !645, file: !529, line: 1111, baseType: !192, size: 8, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !645, file: !529, line: 1112, baseType: !192, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "resv_register", scope: !583, file: !529, line: 1123, baseType: !650, size: 32)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1115, size: 32, elements: !651)
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rrega", scope: !650, file: !529, line: 1117, baseType: !192, size: 3, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "iekey", scope: !650, file: !529, line: 1119, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !650, file: !529, line: 1120, baseType: !192, size: 26, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cptpl", scope: !650, file: !529, line: 1122, baseType: !192, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "resv_release", scope: !583, file: !529, line: 1134, baseType: !657, size: 32)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1125, size: 32, elements: !658)
!658 = !{!659, !660, !661, !662, !663}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rrela", scope: !657, file: !529, line: 1127, baseType: !192, size: 3, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "iekey", scope: !657, file: !529, line: 1129, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !657, file: !529, line: 1130, baseType: !192, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !657, file: !529, line: 1132, baseType: !192, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !657, file: !529, line: 1133, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "resv_acquire", scope: !583, file: !529, line: 1145, baseType: !665, size: 32)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 1136, size: 32, elements: !666)
!666 = !{!667, !668, !669, !670, !671}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "racqa", scope: !665, file: !529, line: 1138, baseType: !192, size: 3, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "iekey", scope: !665, file: !529, line: 1140, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !665, file: !529, line: 1141, baseType: !192, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !665, file: !529, line: 1143, baseType: !192, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !665, file: !529, line: 1144, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, scope: !528, file: !529, line: 1290, baseType: !673, size: 32, offset: 352)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !529, line: 1290, size: 32, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cdw11", scope: !673, file: !529, line: 1291, baseType: !192, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cdw11_bits", scope: !673, file: !529, line: 1292, baseType: !677, size: 32)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_cmd_cdw11", file: !529, line: 1149, size: 32, elements: !678)
!678 = !{!679, !680, !686, !693, !700, !706, !711, !716, !728, !738, !747, !758, !768, !777, !786, !796, !806, !815, !842, !850, !859, !871, !880}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !677, file: !529, line: 1150, baseType: !192, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "identify", scope: !677, file: !529, line: 1158, baseType: !681, size: 32)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !529, line: 1152, size: 32, elements: !682)
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nvmsetid", scope: !681, file: !529, line: 1154, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !681, file: !529, line: 1155, baseType: !192, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "csi", scope: !681, file: !529, line: 1157, baseType: !192, size: 8, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "create_io_sq", scope: !677, file: !529, line: 1168, baseType: !687, size: 32)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !529, line: 1160, size: 32, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !687, file: !529, line: 1162, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "qprio", scope: !687, file: !529, line: 1164, baseType: !192, size: 2, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !687, file: !529, line: 1165, baseType: !192, size: 13, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cqid", scope: !687, file: !529, line: 1167, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "create_io_cq", scope: !677, file: !529, line: 1178, baseType: !694, size: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !529, line: 1170, size: 32, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !694, file: !529, line: 1172, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ien", scope: !694, file: !529, line: 1174, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !694, file: !529, line: 1175, baseType: !192, size: 14, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !694, file: !529, line: 1177, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !677, file: !529, line: 1187, baseType: !701, size: 32)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !529, line: 1180, size: 32, elements: !702)
!702 = !{!703, !704, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "doper", scope: !701, file: !529, line: 1182, baseType: !192, size: 8, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !701, file: !529, line: 1184, baseType: !192, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dspec", scope: !701, file: !529, line: 1186, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "get_log_page", scope: !677, file: !529, line: 1194, baseType: !707, size: 32)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !529, line: 1189, size: 32, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "numdu", scope: !707, file: !529, line: 1191, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lsid", scope: !707, file: !529, line: 1193, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "resv_report", scope: !677, file: !529, line: 1200, baseType: !712, size: 32)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !529, line: 1196, size: 32, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "eds", scope: !712, file: !529, line: 1198, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !712, file: !529, line: 1199, baseType: !192, size: 31, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "feat_arbitration", scope: !677, file: !529, line: 1202, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_arbitration", file: !529, line: 692, size: 32, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !717, file: !529, line: 693, baseType: !192, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !717, file: !529, line: 708, baseType: !721, size: 32)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !717, file: !529, line: 694, size: 32, elements: !722)
!722 = !{!723, !724, !725, !726, !727}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ab", scope: !721, file: !529, line: 696, baseType: !192, size: 3, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !721, file: !529, line: 698, baseType: !192, size: 5, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lpw", scope: !721, file: !529, line: 701, baseType: !192, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mpw", scope: !721, file: !529, line: 704, baseType: !192, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "hpw", scope: !721, file: !529, line: 707, baseType: !192, size: 8, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "feat_power_management", scope: !677, file: !529, line: 1203, baseType: !729, size: 32)
!729 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_power_management", file: !529, line: 717, size: 32, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !729, file: !529, line: 718, baseType: !192, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !729, file: !529, line: 727, baseType: !733, size: 32)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !729, file: !529, line: 719, size: 32, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !733, file: !529, line: 721, baseType: !192, size: 5, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "wh", scope: !733, file: !529, line: 724, baseType: !192, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !733, file: !529, line: 726, baseType: !192, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "feat_lba_range_type", scope: !677, file: !529, line: 1204, baseType: !739, size: 32)
!739 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_lba_range_type", file: !529, line: 734, size: 32, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !739, file: !529, line: 735, baseType: !192, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !739, file: !529, line: 741, baseType: !743, size: 32)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !739, file: !529, line: 736, size: 32, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !743, file: !529, line: 738, baseType: !192, size: 6, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !743, file: !529, line: 740, baseType: !192, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "feat_temp_threshold", scope: !677, file: !529, line: 1205, baseType: !748, size: 32)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_temperature_threshold", file: !529, line: 748, size: 32, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !748, file: !529, line: 749, baseType: !192, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !748, file: !529, line: 761, baseType: !752, size: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !748, file: !529, line: 750, size: 32, elements: !753)
!753 = !{!754, !755, !756, !757}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tmpth", scope: !752, file: !529, line: 752, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "tmpsel", scope: !752, file: !529, line: 755, baseType: !192, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "thsel", scope: !752, file: !529, line: 758, baseType: !192, size: 2, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !752, file: !529, line: 760, baseType: !192, size: 10, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "feat_error_recovery", scope: !677, file: !529, line: 1206, baseType: !759, size: 32)
!759 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_error_recovery", file: !529, line: 768, size: 32, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !759, file: !529, line: 769, baseType: !192, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !759, file: !529, line: 778, baseType: !763, size: 32)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !759, file: !529, line: 770, size: 32, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tler", scope: !763, file: !529, line: 772, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dulbe", scope: !763, file: !529, line: 775, baseType: !192, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !763, file: !529, line: 777, baseType: !192, size: 15, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "feat_volatile_write_cache", scope: !677, file: !529, line: 1207, baseType: !769, size: 32)
!769 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_volatile_write_cache", file: !529, line: 785, size: 32, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !769, file: !529, line: 786, baseType: !192, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !769, file: !529, line: 792, baseType: !773, size: 32)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !769, file: !529, line: 787, size: 32, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "wce", scope: !773, file: !529, line: 789, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !773, file: !529, line: 791, baseType: !192, size: 31, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "feat_num_of_queues", scope: !677, file: !529, line: 1208, baseType: !778, size: 32)
!778 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_number_of_queues", file: !529, line: 799, size: 32, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !778, file: !529, line: 800, baseType: !192, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !778, file: !529, line: 807, baseType: !782, size: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !778, file: !529, line: 801, size: 32, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nsqr", scope: !782, file: !529, line: 803, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ncqr", scope: !782, file: !529, line: 806, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "feat_interrupt_coalescing", scope: !677, file: !529, line: 1209, baseType: !787, size: 32)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_interrupt_coalescing", file: !529, line: 814, size: 32, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !787, file: !529, line: 815, baseType: !192, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !787, file: !529, line: 824, baseType: !791, size: 32)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !787, file: !529, line: 816, size: 32, elements: !792)
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "thr", scope: !791, file: !529, line: 818, baseType: !192, size: 8, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !791, file: !529, line: 821, baseType: !192, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !791, file: !529, line: 823, baseType: !192, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "feat_interrupt_vector_configuration", scope: !677, file: !529, line: 1210, baseType: !797, size: 32)
!797 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_interrupt_vector_configuration", file: !529, line: 831, size: 32, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !797, file: !529, line: 832, baseType: !192, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !797, file: !529, line: 841, baseType: !801, size: 32)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !797, file: !529, line: 833, size: 32, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !801, file: !529, line: 835, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !801, file: !529, line: 838, baseType: !192, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !801, file: !529, line: 840, baseType: !192, size: 15, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "feat_write_atomicity", scope: !677, file: !529, line: 1211, baseType: !807, size: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_write_atomicity", file: !529, line: 849, size: 32, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !807, file: !529, line: 850, baseType: !192, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !807, file: !529, line: 856, baseType: !811, size: 32)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !807, file: !529, line: 851, size: 32, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dn", scope: !811, file: !529, line: 853, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !811, file: !529, line: 855, baseType: !192, size: 31, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "feat_async_event_cfg", scope: !677, file: !529, line: 1212, baseType: !816, size: 32)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_async_event_configuration", file: !529, line: 877, size: 32, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !816, file: !529, line: 878, baseType: !192, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !816, file: !529, line: 889, baseType: !820, size: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !529, line: 879, size: 32, elements: !821)
!821 = !{!822, !835, !836, !837, !838, !839, !840, !841}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "crit_warn", scope: !820, file: !529, line: 880, baseType: !823, size: 8)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_critical_warning_state", file: !529, line: 860, size: 8, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !823, file: !529, line: 861, baseType: !176, size: 8)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !823, file: !529, line: 870, baseType: !827, size: 8)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !529, line: 863, size: 8, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "available_spare", scope: !827, file: !529, line: 864, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "temperature", scope: !827, file: !529, line: 865, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "device_reliability", scope: !827, file: !529, line: 866, baseType: !176, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "read_only", scope: !827, file: !529, line: 867, baseType: !176, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_memory_backup", scope: !827, file: !529, line: 868, baseType: !176, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !827, file: !529, line: 869, baseType: !176, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ns_attr_notice", scope: !820, file: !529, line: 881, baseType: !176, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "fw_activation_notice", scope: !820, file: !529, line: 882, baseType: !176, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "telemetry_log_notice", scope: !820, file: !529, line: 883, baseType: !176, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 8)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ana_change_notice", scope: !820, file: !529, line: 884, baseType: !176, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !820, file: !529, line: 885, baseType: !176, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 8)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !820, file: !529, line: 886, baseType: !350, size: 15, offset: 16, flags: DIFlagBitField, extraData: i64 8)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "discovery_log_change_notice", scope: !820, file: !529, line: 888, baseType: !350, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 8)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "feat_keep_alive_timer", scope: !677, file: !529, line: 1213, baseType: !843, size: 32)
!843 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_keep_alive_timer", file: !529, line: 928, size: 32, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !843, file: !529, line: 929, baseType: !192, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !843, file: !529, line: 933, baseType: !847, size: 32)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !843, file: !529, line: 930, size: 32, elements: !848)
!848 = !{!849}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "kato", scope: !847, file: !529, line: 932, baseType: !192, size: 32, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "feat_host_identifier", scope: !677, file: !529, line: 1214, baseType: !851, size: 32)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_host_identifier", file: !529, line: 985, size: 32, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !851, file: !529, line: 986, baseType: !192, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !851, file: !529, line: 992, baseType: !855, size: 32)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !851, file: !529, line: 987, size: 32, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "exhid", scope: !855, file: !529, line: 989, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !855, file: !529, line: 991, baseType: !192, size: 31, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "feat_rsv_notification_mask", scope: !677, file: !529, line: 1215, baseType: !860, size: 32)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_reservation_notification_mask", file: !529, line: 999, size: 32, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !860, file: !529, line: 1000, baseType: !192, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !860, file: !529, line: 1010, baseType: !864, size: 32)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !529, line: 1001, size: 32, elements: !865)
!865 = !{!866, !867, !868, !869, !870}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !864, file: !529, line: 1002, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "regpre", scope: !864, file: !529, line: 1004, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "resrel", scope: !864, file: !529, line: 1006, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "respre", scope: !864, file: !529, line: 1008, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !864, file: !529, line: 1009, baseType: !192, size: 28, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "feat_rsv_persistence", scope: !677, file: !529, line: 1216, baseType: !872, size: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_feat_reservation_persistence", file: !529, line: 1018, size: 32, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !872, file: !529, line: 1019, baseType: !192, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !872, file: !529, line: 1024, baseType: !876, size: 32)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !872, file: !529, line: 1020, size: 32, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ptpl", scope: !876, file: !529, line: 1022, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !876, file: !529, line: 1023, baseType: !192, size: 31, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "dsm", scope: !677, file: !529, line: 1226, baseType: !881, size: 32)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !529, line: 1218, size: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "idr", scope: !881, file: !529, line: 1220, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "idw", scope: !881, file: !529, line: 1222, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !881, file: !529, line: 1224, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !881, file: !529, line: 1225, baseType: !192, size: 29, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, scope: !528, file: !529, line: 1295, baseType: !888, size: 32, offset: 384)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !529, line: 1295, size: 32, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "cdw12", scope: !888, file: !529, line: 1296, baseType: !192, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "cdw12_bits", scope: !888, file: !529, line: 1297, baseType: !892, size: 32)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "spdk_nvme_cmd_cdw12", file: !529, line: 1230, size: 32, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !892, file: !529, line: 1231, baseType: !192, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !892, file: !529, line: 1252, baseType: !896, size: 32)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !892, file: !529, line: 1233, size: 32, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !906, !907}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !896, file: !529, line: 1235, baseType: !192, size: 8, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "df", scope: !896, file: !529, line: 1237, baseType: !192, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "prinfor", scope: !896, file: !529, line: 1239, baseType: !192, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !896, file: !529, line: 1240, baseType: !192, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !896, file: !529, line: 1242, baseType: !192, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "stcw", scope: !896, file: !529, line: 1244, baseType: !192, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !896, file: !529, line: 1245, baseType: !192, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "prinfow", scope: !896, file: !529, line: 1247, baseType: !192, size: 4, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fua", scope: !896, file: !529, line: 1249, baseType: !192, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lr", scope: !896, file: !529, line: 1251, baseType: !192, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "cdw13", scope: !528, file: !529, line: 1300, baseType: !192, size: 32, offset: 416)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "cdw14", scope: !528, file: !529, line: 1301, baseType: !192, size: 32, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "cdw15", scope: !528, file: !529, line: 1302, baseType: !192, size: 32, offset: 480)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !525, file: !78, line: 747, baseType: !130, size: 64, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !525, file: !78, line: 750, baseType: !183, size: 64, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "md_buf", scope: !525, file: !78, line: 753, baseType: !130, size: 64, offset: 640)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "md_len", scope: !525, file: !78, line: 756, baseType: !183, size: 64, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "zone_mgmt", scope: !460, file: !78, line: 770, baseType: !916, size: 192)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !78, line: 758, size: 192, elements: !917)
!917 = !{!918, !919, !920, !921}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "zone_id", scope: !916, file: !78, line: 760, baseType: !139, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "num_zones", scope: !916, file: !78, line: 763, baseType: !192, size: 32, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "zone_action", scope: !916, file: !78, line: 766, baseType: !39, size: 32, offset: 96)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !916, file: !78, line: 769, baseType: !130, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "module_link", scope: !442, file: !78, line: 774, baseType: !923, size: 128, offset: 5312)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !78, line: 774, size: 128, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !923, file: !78, line: 774, baseType: !441, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !923, file: !78, line: 774, baseType: !927, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !442, file: !78, line: 877, baseType: !929, size: 2496, offset: 5440)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__bdev_io_internal_fields", file: !78, line: 780, size: 2496, elements: !930)
!930 = !{!931, !934, !935, !936, !937, !938, !939, !956, !957, !962, !963, !964, !965, !966, !967, !968, !969, !974, !979, !984, !988, !993, !1009, !1010, !1011, !1012}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !929, file: !78, line: 782, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_channel", file: !78, line: 782, flags: DIFlagFwdDecl)
