; ModuleID = 'samples/318.bc'
source_filename = "objs/ngx_modules.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }

@ngx_core_module = external global %struct.ngx_module_s, align 8
@ngx_errlog_module = external global %struct.ngx_module_s, align 8
@ngx_conf_module = external global %struct.ngx_module_s, align 8
@ngx_openssl_module = external global %struct.ngx_module_s, align 8
@ngx_regex_module = external global %struct.ngx_module_s, align 8
@ngx_events_module = external global %struct.ngx_module_s, align 8
@ngx_event_core_module = external global %struct.ngx_module_s, align 8
@ngx_epoll_module = external global %struct.ngx_module_s, align 8
@ngx_http_module = external global %struct.ngx_module_s, align 8
@ngx_http_core_module = external global %struct.ngx_module_s, align 8
@ngx_http_log_module = external global %struct.ngx_module_s, align 8
@ngx_http_upstream_module = external global %struct.ngx_module_s, align 8
@ngx_http_static_module = external global %struct.ngx_module_s, align 8
@ngx_http_autoindex_module = external global %struct.ngx_module_s, align 8
@ngx_http_index_module = external global %struct.ngx_module_s, align 8
@ngx_http_mirror_module = external global %struct.ngx_module_s, align 8

!128 = distinct !DIGlobalVariable(scope: null, file: !3, line: 156, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 32)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !3, line: 157, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 280, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 35)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !3, line: 158, type: !89, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !3, line: 159, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 232, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 29)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !3, line: 160, type: !89, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !3, line: 161, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 248, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 31)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(scope: null, file: !3, line: 162, type: !124, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !3, line: 163, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 224, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 28)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !3, line: 164, type: !129, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !3, line: 165, type: !74, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !3, line: 166, type: !148, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !3, line: 167, type: !89, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !3, line: 168, type: !148, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !3, line: 169, type: !155, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !3, line: 170, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 272, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 34)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !3, line: 171, type: !124, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "ngx_module_names", scope: !2, file: !3, line: 118, type: !179, isLocal: false, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 3456, elements: !181)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!181 = !{!182}
!182 = !DISubrange(count: 54)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 3456, elements: !181)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !186, line: 15, baseType: !187)
!186 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "20a149d22b95b5c7a0a8830d485b97ae")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !188, line: 222, size: 1600, elements: !189)
!188 = !DIFile(filename: "src/core/ngx_module.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "9061a5345279c977548e41d1c550ac28")
!189 = !{!190, !196, !197, !198, !199, !200, !201, !204, !205, !729, !730, !734, !738, !739, !740, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !187, file: !188, line: 223, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !192, line: 79, baseType: !193)
!192 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !194, line: 90, baseType: !195)
!194 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!195 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !187, file: !188, line: 224, baseType: !191, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !188, line: 226, baseType: !180, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !187, file: !188, line: 228, baseType: !191, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !187, file: !188, line: 229, baseType: !191, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !187, file: !188, line: 231, baseType: !191, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !187, file: !188, line: 232, baseType: !202, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !187, file: !188, line: 234, baseType: !5, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !187, file: !188, line: 235, baseType: !206, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !186, line: 22, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !209, line: 77, size: 448, elements: !210)
!209 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "b737d189253ca17c55f83e424debf52b")
!210 = !{!211, !226, !227, !726, !727, !728}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !209, line: 78, baseType: !212, size: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !213, line: 19, baseType: !214)
!213 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2f3ab61eca09df707b083ffd5eafea4f")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 16, size: 128, elements: !215)
!215 = !{!216, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !214, file: !213, line: 17, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !218, line: 29, baseType: !195)
!218 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !213, line: 18, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !222, line: 33, baseType: !223)
!222 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !224, line: 31, baseType: !225)
!224 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!225 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !208, file: !209, line: 79, baseType: !191, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !208, file: !209, line: 80, baseType: !228, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!180, !231, !206, !5}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !186, line: 16, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !209, line: 116, size: 768, elements: !234)
!234 = !{!235, !236, !412, !708, !709, !710, !719, !720, !721, !722, !723, !725}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !209, line: 117, baseType: !180, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !233, file: !209, line: 118, baseType: !237, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !239, line: 22, baseType: !240)
!239 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 16, size: 320, elements: !241)
!241 = !{!242, !243, !244, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !240, file: !239, line: 17, baseType: !5, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !240, file: !239, line: 18, baseType: !191, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !240, file: !239, line: 19, baseType: !217, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !240, file: !239, line: 20, baseType: !191, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !240, file: !239, line: 21, baseType: !247, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !186, line: 18, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !250, line: 57, size: 640, elements: !251)
!250 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!251 = !{!252, !260, !261, !262, !392, !399, !411}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !249, file: !250, line: 58, baseType: !253, size: 256)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !250, line: 54, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !250, line: 49, size: 256, elements: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !254, file: !250, line: 50, baseType: !220, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !254, file: !250, line: 51, baseType: !220, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !250, line: 52, baseType: !247, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !254, file: !250, line: 53, baseType: !191, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !249, file: !250, line: 59, baseType: !217, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !249, file: !250, line: 60, baseType: !247, size: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !249, file: !250, line: 61, baseType: !263, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !186, line: 19, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !266, line: 59, size: 128, elements: !267)
!266 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6333220b53b7706731e71ee9d0416317")
!267 = !{!268, !391}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !265, file: !266, line: 60, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !266, line: 18, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !266, line: 20, size: 640, elements: !272)
!272 = !{!273, !274, !275, !279, !280, !281, !282, !284, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !271, file: !266, line: 21, baseType: !220, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !271, file: !266, line: 22, baseType: !220, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !271, file: !266, line: 23, baseType: !276, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !222, line: 87, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !224, line: 153, baseType: !278)
!278 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !271, file: !266, line: 24, baseType: !276, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !271, file: !266, line: 26, baseType: !220, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !271, file: !266, line: 27, baseType: !220, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !271, file: !266, line: 28, baseType: !283, size: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !266, line: 16, baseType: !5)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !271, file: !266, line: 29, baseType: !285, size: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !186, line: 23, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !288, line: 16, size: 1600, elements: !289)
!288 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!289 = !{!290, !294, !295, !335, !336, !337, !376, !377}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !287, file: !288, line: 17, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !292, line: 16, baseType: !293)
!292 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "5c6995d5f659dd97ea6d10eff0ad0f12")
!293 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !287, file: !288, line: 18, baseType: !212, size: 128, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !287, file: !288, line: 19, baseType: !296, size: 1152, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !292, line: 17, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !298, line: 26, size: 1152, elements: !299)
!298 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!299 = !{!300, !302, !304, !306, !309, !311, !313, !314, !315, !317, !319, !321, !329, !330, !331}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !297, file: !298, line: 31, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !224, line: 145, baseType: !195)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !297, file: !298, line: 36, baseType: !303, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !224, line: 148, baseType: !195)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !297, file: !298, line: 44, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !224, line: 151, baseType: !195)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !297, file: !298, line: 45, baseType: !307, size: 32, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !224, line: 150, baseType: !308)
!308 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !297, file: !298, line: 47, baseType: !310, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !224, line: 146, baseType: !308)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !297, file: !298, line: 48, baseType: !312, size: 32, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !224, line: 147, baseType: !308)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !297, file: !298, line: 50, baseType: !293, size: 32, offset: 288)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !297, file: !298, line: 52, baseType: !301, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !297, file: !298, line: 57, baseType: !316, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !224, line: 152, baseType: !278)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !297, file: !298, line: 61, baseType: !318, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !224, line: 175, baseType: !278)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !297, file: !298, line: 63, baseType: !320, size: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !224, line: 180, baseType: !278)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !297, file: !298, line: 74, baseType: !322, size: 128, offset: 576)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !323, line: 11, size: 128, elements: !324)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!324 = !{!325, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !322, file: !323, line: 16, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !224, line: 160, baseType: !278)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !322, file: !323, line: 21, baseType: !328, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !224, line: 197, baseType: !278)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !297, file: !298, line: 75, baseType: !322, size: 128, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !297, file: !298, line: 76, baseType: !322, size: 128, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !297, file: !298, line: 89, baseType: !332, size: 192, offset: 960)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 192, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 3)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !287, file: !288, line: 21, baseType: !276, size: 64, offset: 1344)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !287, file: !288, line: 22, baseType: !276, size: 64, offset: 1408)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !287, file: !288, line: 24, baseType: !338, size: 64, offset: 1472)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !186, line: 20, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !341, line: 50, size: 640, elements: !342)
!341 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "81257099415bdc5e18cdef9b4461d934")
!342 = !{!343, !344, !356, !359, !362, !367, !368, !373, !374, !375}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !340, file: !341, line: 51, baseType: !191, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !340, file: !341, line: 52, baseType: !345, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !186, line: 21, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !209, line: 89, size: 320, elements: !348)
!348 = !{!349, !350, !351, !355}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !347, file: !209, line: 90, baseType: !291, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !347, file: !209, line: 91, baseType: !212, size: 128, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !347, file: !209, line: 93, baseType: !352, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !345, !338}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !209, line: 94, baseType: !5, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !340, file: !341, line: 54, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !358, line: 48, baseType: !195)
!358 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "5d14beceab1860bcc051d3b7a146b2a2")
!359 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !340, file: !341, line: 56, baseType: !360, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !361, line: 10, baseType: !326)
!361 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!362 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !340, file: !341, line: 58, baseType: !363, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !341, line: 45, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!220, !338, !220, !217}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !340, file: !341, line: 59, baseType: !5, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !340, file: !341, line: 61, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !341, line: 46, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !338, !191, !220, !217}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !340, file: !341, line: 62, baseType: !5, size: 64, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !340, file: !341, line: 70, baseType: !180, size: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !341, line: 72, baseType: !338, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !287, file: !288, line: 37, baseType: !308, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !287, file: !288, line: 38, baseType: !308, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !271, file: !266, line: 30, baseType: !269, size: 64, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !271, file: !266, line: 34, baseType: !308, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !271, file: !266, line: 40, baseType: !308, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !271, file: !266, line: 43, baseType: !308, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !271, file: !266, line: 45, baseType: !308, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !271, file: !266, line: 46, baseType: !308, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !271, file: !266, line: 47, baseType: !308, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !271, file: !266, line: 48, baseType: !308, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !271, file: !266, line: 49, baseType: !308, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !271, file: !266, line: 50, baseType: !308, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !271, file: !266, line: 52, baseType: !308, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !271, file: !266, line: 53, baseType: !308, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !271, file: !266, line: 55, baseType: !293, size: 32, offset: 608)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !266, line: 61, baseType: !263, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !249, file: !250, line: 62, baseType: !393, size: 64, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !250, line: 41, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !250, line: 43, size: 128, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !395, file: !250, line: 44, baseType: !393, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !395, file: !250, line: 45, baseType: !5, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !249, file: !250, line: 63, baseType: !400, size: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !250, line: 32, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !250, line: 34, size: 192, elements: !403)
!403 = !{!404, !409, !410}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !402, file: !250, line: 35, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !250, line: 30, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !5}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !402, file: !250, line: 36, baseType: !5, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !402, file: !250, line: 37, baseType: !400, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !249, file: !250, line: 64, baseType: !338, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !233, file: !209, line: 120, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !186, line: 17, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !416, line: 39, size: 5184, elements: !417)
!416 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "44a673836137b8263e2cfd875033292f")
!417 = !{!418, !422, !423, !424, !425, !426, !663, !664, !665, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !415, file: !416, line: 40, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !415, file: !416, line: 41, baseType: !247, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !415, file: !416, line: 43, baseType: !338, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !415, file: !416, line: 44, baseType: !339, size: 640, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !415, file: !416, line: 46, baseType: !191, size: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !415, file: !416, line: 48, baseType: !427, size: 64, offset: 896)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !186, line: 26, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !431, line: 122, size: 1856, elements: !432)
!431 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "212f2f4879dcb10799877db6a93ee4ed")
!432 = !{!433, !434, !438, !439, !442, !450, !452, !457, !462, !550, !551, !552, !553, !554, !555, !556, !557, !573, !627, !631, !632, !633, !634, !642, !643, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !430, file: !431, line: 123, baseType: !5, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !430, file: !431, line: 124, baseType: !435, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !186, line: 24, baseType: !437)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !186, line: 24, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !430, file: !431, line: 125, baseType: !435, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !430, file: !431, line: 127, baseType: !440, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !441, line: 17, baseType: !293)
!441 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3294ca407f098b2e2906f1b2d90752a2")
!442 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !430, file: !431, line: 129, baseType: !443, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !444, line: 19, baseType: !445)
!444 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !428, !220, !217}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !222, line: 108, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !224, line: 194, baseType: !278)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !430, file: !431, line: 130, baseType: !451, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !444, line: 22, baseType: !445)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !430, file: !431, line: 131, baseType: !453, size: 64, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !444, line: 20, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!448, !428, !263, !276}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !430, file: !431, line: 132, baseType: !458, size: 64, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !444, line: 23, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!263, !428, !263, !276}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !430, file: !431, line: 134, baseType: !463, size: 64, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !431, line: 16, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !431, line: 18, size: 2368, elements: !466)
!466 = !{!467, !468, !481, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !499, !500, !501, !502, !503, !504, !505, !506, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !465, file: !431, line: 19, baseType: !440, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !465, file: !431, line: 21, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !471, line: 180, size: 128, elements: !472)
!471 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!472 = !{!473, !477}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !470, file: !471, line: 182, baseType: !474, size: 16)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !475, line: 28, baseType: !476)
!475 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!476 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !470, file: !471, line: 183, baseType: !478, size: 112, offset: 16)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 112, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 14)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !465, file: !431, line: 22, baseType: !482, size: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !483, line: 274, baseType: !484)
!483 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !224, line: 210, baseType: !308)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !465, file: !431, line: 23, baseType: !217, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !465, file: !431, line: 24, baseType: !212, size: 128, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !431, line: 26, baseType: !293, size: 32, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !465, file: !431, line: 28, baseType: !293, size: 32, offset: 416)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !465, file: !431, line: 29, baseType: !293, size: 32, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !465, file: !431, line: 30, baseType: !293, size: 32, offset: 480)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !465, file: !431, line: 32, baseType: !293, size: 32, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !465, file: !431, line: 33, baseType: !293, size: 32, offset: 544)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !465, file: !431, line: 34, baseType: !293, size: 32, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !465, file: !431, line: 38, baseType: !495, size: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !186, line: 34, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !428}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !465, file: !431, line: 40, baseType: !5, size: 64, offset: 704)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !465, file: !431, line: 42, baseType: !339, size: 640, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !465, file: !431, line: 43, baseType: !338, size: 64, offset: 1408)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !465, file: !431, line: 45, baseType: !217, size: 64, offset: 1472)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !465, file: !431, line: 47, baseType: !217, size: 64, offset: 1536)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !465, file: !431, line: 49, baseType: !463, size: 64, offset: 1600)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !465, file: !431, line: 50, baseType: !428, size: 64, offset: 1664)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !465, file: !431, line: 52, baseType: !507, size: 192, offset: 1728)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !508, line: 32, baseType: !509)
!508 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3e0aca9b19636f12ab4dbc16c3f8a0a1")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !508, line: 37, size: 192, elements: !510)
!510 = !{!511, !523, !524}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !509, file: !508, line: 38, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !508, line: 20, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !508, line: 22, size: 320, elements: !515)
!515 = !{!516, !518, !519, !520, !521, !522}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !514, file: !508, line: 23, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !508, line: 16, baseType: !191)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !514, file: !508, line: 24, baseType: !512, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !514, file: !508, line: 25, baseType: !512, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !514, file: !508, line: 26, baseType: !512, size: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !514, file: !508, line: 27, baseType: !221, size: 8, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !514, file: !508, line: 28, baseType: !221, size: 8, offset: 264)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !509, file: !508, line: 39, baseType: !512, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !509, file: !508, line: 40, baseType: !525, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !508, line: 34, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !512, !512, !512}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !465, file: !431, line: 53, baseType: !513, size: 320, offset: 1920)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !465, file: !431, line: 55, baseType: !191, size: 64, offset: 2240)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !465, file: !431, line: 57, baseType: !308, size: 1, offset: 2304, flags: DIFlagBitField, extraData: i64 2304)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !465, file: !431, line: 58, baseType: !308, size: 1, offset: 2305, flags: DIFlagBitField, extraData: i64 2304)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !465, file: !431, line: 59, baseType: !308, size: 1, offset: 2306, flags: DIFlagBitField, extraData: i64 2304)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !465, file: !431, line: 61, baseType: !308, size: 1, offset: 2307, flags: DIFlagBitField, extraData: i64 2304)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !465, file: !431, line: 62, baseType: !308, size: 1, offset: 2308, flags: DIFlagBitField, extraData: i64 2304)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !465, file: !431, line: 63, baseType: !308, size: 1, offset: 2309, flags: DIFlagBitField, extraData: i64 2304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !465, file: !431, line: 64, baseType: !308, size: 1, offset: 2310, flags: DIFlagBitField, extraData: i64 2304)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !465, file: !431, line: 65, baseType: !308, size: 1, offset: 2311, flags: DIFlagBitField, extraData: i64 2304)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !465, file: !431, line: 66, baseType: !308, size: 1, offset: 2312, flags: DIFlagBitField, extraData: i64 2304)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !465, file: !431, line: 67, baseType: !308, size: 1, offset: 2313, flags: DIFlagBitField, extraData: i64 2304)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !465, file: !431, line: 68, baseType: !308, size: 1, offset: 2314, flags: DIFlagBitField, extraData: i64 2304)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !465, file: !431, line: 71, baseType: !308, size: 1, offset: 2315, flags: DIFlagBitField, extraData: i64 2304)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !465, file: !431, line: 73, baseType: !308, size: 1, offset: 2316, flags: DIFlagBitField, extraData: i64 2304)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !465, file: !431, line: 74, baseType: !308, size: 1, offset: 2317, flags: DIFlagBitField, extraData: i64 2304)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !465, file: !431, line: 75, baseType: !308, size: 2, offset: 2318, flags: DIFlagBitField, extraData: i64 2304)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !465, file: !431, line: 77, baseType: !308, size: 1, offset: 2320, flags: DIFlagBitField, extraData: i64 2304)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !465, file: !431, line: 78, baseType: !308, size: 1, offset: 2321, flags: DIFlagBitField, extraData: i64 2304)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !465, file: !431, line: 79, baseType: !308, size: 1, offset: 2322, flags: DIFlagBitField, extraData: i64 2304)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !465, file: !431, line: 88, baseType: !293, size: 32, offset: 2336)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !430, file: !431, line: 136, baseType: !276, size: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !430, file: !431, line: 138, baseType: !338, size: 64, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !430, file: !431, line: 140, baseType: !247, size: 64, offset: 704)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !430, file: !431, line: 142, baseType: !293, size: 32, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !430, file: !431, line: 144, baseType: !469, size: 64, offset: 832)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !430, file: !431, line: 145, baseType: !482, size: 32, offset: 896)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !430, file: !431, line: 146, baseType: !212, size: 128, offset: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol", scope: !430, file: !431, line: 148, baseType: !558, size: 64, offset: 1088)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_proxy_protocol_t", file: !186, line: 29, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_proxy_protocol_s", file: !561, line: 20, size: 448, elements: !562)
!561 = !DIFile(filename: "src/core/ngx_proxy_protocol.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2f709b54741e3446706b44243689209d")
!562 = !{!563, !564, !565, !571, !572}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !560, file: !561, line: 21, baseType: !212, size: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr", scope: !560, file: !561, line: 22, baseType: !212, size: 128, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !560, file: !561, line: 23, baseType: !566, size: 16, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !567, line: 123, baseType: !568)
!567 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !569, line: 25, baseType: !570)
!569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !224, line: 40, baseType: !476)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !560, file: !561, line: 24, baseType: !566, size: 16, offset: 272)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tlvs", scope: !560, file: !561, line: 25, baseType: !212, size: 128, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !430, file: !431, line: 151, baseType: !574, size: 64, offset: 1152)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !186, line: 30, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !577, line: 88, size: 768, elements: !578)
!577 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3af21306d729871437c56397859c5d10")
!578 = !{!579, !584, !588, !592, !593, !594, !595, !600, !601, !606, !607, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !576, file: !577, line: 89, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !582, line: 187, baseType: !583)
!582 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/openssl-3.1.3-t2z4gdp5gh6gi55dbaqbl32ceazzcooa/include/openssl/types.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build", checksumkind: CSK_MD5, checksum: "b6649ae9fb159d98e26ef5156a06b00d")
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !582, line: 187, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !576, file: !577, line: 90, baseType: !585, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !582, line: 188, baseType: !587)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !582, line: 188, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !576, file: !577, line: 92, baseType: !589, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !192, line: 78, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !483, line: 267, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !224, line: 207, baseType: !278)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !576, file: !577, line: 93, baseType: !269, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !576, file: !577, line: 94, baseType: !217, size: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !576, file: !577, line: 96, baseType: !495, size: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !576, file: !577, line: 98, baseType: !596, size: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !598, line: 234, baseType: !599)
!598 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/openssl-3.1.3-t2z4gdp5gh6gi55dbaqbl32ceazzcooa/include/openssl/ssl.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build", checksumkind: CSK_MD5, checksum: "b3965e72168556c434721fcea95f586f")
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !598, line: 234, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !576, file: !577, line: 99, baseType: !495, size: 64, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !576, file: !577, line: 101, baseType: !602, size: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !186, line: 33, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !435}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !576, file: !577, line: 102, baseType: !602, size: 64, offset: 576)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ocsp", scope: !576, file: !577, line: 104, baseType: !608, size: 64, offset: 640)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_ocsp_t", file: !577, line: 78, baseType: !610)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_ocsp_s", file: !577, line: 78, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !576, file: !577, line: 106, baseType: !221, size: 8, offset: 704)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !576, file: !577, line: 108, baseType: !308, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_rejected", scope: !576, file: !577, line: 109, baseType: !308, size: 1, offset: 713, flags: DIFlagBitField, extraData: i64 712)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !576, file: !577, line: 110, baseType: !308, size: 1, offset: 714, flags: DIFlagBitField, extraData: i64 712)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !576, file: !577, line: 111, baseType: !308, size: 1, offset: 715, flags: DIFlagBitField, extraData: i64 712)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !576, file: !577, line: 112, baseType: !308, size: 1, offset: 716, flags: DIFlagBitField, extraData: i64 712)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !576, file: !577, line: 113, baseType: !308, size: 1, offset: 717, flags: DIFlagBitField, extraData: i64 712)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !576, file: !577, line: 114, baseType: !308, size: 1, offset: 718, flags: DIFlagBitField, extraData: i64 712)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_without_free", scope: !576, file: !577, line: 115, baseType: !308, size: 1, offset: 719, flags: DIFlagBitField, extraData: i64 712)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !576, file: !577, line: 116, baseType: !308, size: 1, offset: 720, flags: DIFlagBitField, extraData: i64 712)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "session_timeout_set", scope: !576, file: !577, line: 117, baseType: !308, size: 1, offset: 721, flags: DIFlagBitField, extraData: i64 712)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !576, file: !577, line: 118, baseType: !308, size: 1, offset: 722, flags: DIFlagBitField, extraData: i64 712)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !576, file: !577, line: 119, baseType: !308, size: 1, offset: 723, flags: DIFlagBitField, extraData: i64 712)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "in_ocsp", scope: !576, file: !577, line: 120, baseType: !308, size: 1, offset: 724, flags: DIFlagBitField, extraData: i64 712)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !576, file: !577, line: 121, baseType: !308, size: 1, offset: 725, flags: DIFlagBitField, extraData: i64 712)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !576, file: !577, line: 122, baseType: !308, size: 1, offset: 726, flags: DIFlagBitField, extraData: i64 712)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !430, file: !431, line: 154, baseType: !628, size: 64, offset: 1216)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !186, line: 31, baseType: !630)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !186, line: 31, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !430, file: !431, line: 156, baseType: !469, size: 64, offset: 1280)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !430, file: !431, line: 157, baseType: !482, size: 32, offset: 1344)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !430, file: !431, line: 159, baseType: !269, size: 64, offset: 1408)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !430, file: !431, line: 161, baseType: !635, size: 128, offset: 1472)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !636, line: 16, baseType: !637)
!636 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !636, line: 18, size: 128, elements: !638)
!638 = !{!639, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !637, file: !636, line: 19, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !636, line: 20, baseType: !640, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !430, file: !431, line: 163, baseType: !357, size: 64, offset: 1600)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !430, file: !431, line: 165, baseType: !644, size: 64, offset: 1664)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !645, line: 16, baseType: !517)
!645 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!646 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !430, file: !431, line: 166, baseType: !191, size: 64, offset: 1728)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !430, file: !431, line: 168, baseType: !308, size: 8, offset: 1792, flags: DIFlagBitField, extraData: i64 1792)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !430, file: !431, line: 170, baseType: !308, size: 3, offset: 1800, flags: DIFlagBitField, extraData: i64 1792)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !430, file: !431, line: 172, baseType: !308, size: 1, offset: 1803, flags: DIFlagBitField, extraData: i64 1792)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !430, file: !431, line: 173, baseType: !308, size: 1, offset: 1804, flags: DIFlagBitField, extraData: i64 1792)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !430, file: !431, line: 174, baseType: !308, size: 1, offset: 1805, flags: DIFlagBitField, extraData: i64 1792)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pipeline", scope: !430, file: !431, line: 175, baseType: !308, size: 1, offset: 1806, flags: DIFlagBitField, extraData: i64 1792)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !430, file: !431, line: 177, baseType: !308, size: 1, offset: 1807, flags: DIFlagBitField, extraData: i64 1792)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !430, file: !431, line: 178, baseType: !308, size: 1, offset: 1808, flags: DIFlagBitField, extraData: i64 1792)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !430, file: !431, line: 179, baseType: !308, size: 1, offset: 1809, flags: DIFlagBitField, extraData: i64 1792)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !430, file: !431, line: 180, baseType: !308, size: 1, offset: 1810, flags: DIFlagBitField, extraData: i64 1792)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !430, file: !431, line: 182, baseType: !308, size: 1, offset: 1811, flags: DIFlagBitField, extraData: i64 1792)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !430, file: !431, line: 183, baseType: !308, size: 1, offset: 1812, flags: DIFlagBitField, extraData: i64 1792)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !430, file: !431, line: 184, baseType: !308, size: 2, offset: 1813, flags: DIFlagBitField, extraData: i64 1792)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !430, file: !431, line: 185, baseType: !308, size: 2, offset: 1815, flags: DIFlagBitField, extraData: i64 1792)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !430, file: !431, line: 187, baseType: !308, size: 1, offset: 1817, flags: DIFlagBitField, extraData: i64 1792)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "need_flush_buf", scope: !430, file: !431, line: 188, baseType: !308, size: 1, offset: 1818, flags: DIFlagBitField, extraData: i64 1792)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !415, file: !416, line: 49, baseType: !428, size: 64, offset: 960)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !415, file: !416, line: 50, baseType: !191, size: 64, offset: 1024)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !415, file: !416, line: 52, baseType: !666, size: 64, offset: 1088)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !415, file: !416, line: 53, baseType: !191, size: 64, offset: 1152)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !415, file: !416, line: 54, baseType: !191, size: 64, offset: 1216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !415, file: !416, line: 56, baseType: !635, size: 128, offset: 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !415, file: !416, line: 57, baseType: !191, size: 64, offset: 1408)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "connections_reuse_time", scope: !415, file: !416, line: 58, baseType: !360, size: 64, offset: 1472)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !415, file: !416, line: 60, baseType: !238, size: 320, offset: 1536)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !415, file: !416, line: 61, baseType: !238, size: 320, offset: 1856)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !415, file: !416, line: 63, baseType: !238, size: 320, offset: 2176)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !415, file: !416, line: 64, baseType: !507, size: 192, offset: 2496)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !415, file: !416, line: 65, baseType: !513, size: 320, offset: 2688)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !415, file: !416, line: 67, baseType: !678, size: 448, offset: 3008)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !679, line: 31, baseType: !680)
!679 = !DIFile(filename: "src/core/ngx_list.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "580525d954b127a1c35170a83ca4d8b1")
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !679, line: 25, size: 448, elements: !681)
!681 = !{!682, !690, !691, !692, !693}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !680, file: !679, line: 26, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !679, line: 16, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !679, line: 18, size: 192, elements: !686)
!686 = !{!687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !685, file: !679, line: 19, baseType: !5, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !685, file: !679, line: 20, baseType: !191, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !685, file: !679, line: 21, baseType: !683, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !680, file: !679, line: 27, baseType: !684, size: 192, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !680, file: !679, line: 28, baseType: !217, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !680, file: !679, line: 29, baseType: !191, size: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !680, file: !679, line: 30, baseType: !247, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !415, file: !416, line: 68, baseType: !678, size: 448, offset: 3456)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !415, file: !416, line: 70, baseType: !191, size: 64, offset: 3904)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !415, file: !416, line: 71, baseType: !191, size: 64, offset: 3968)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !415, file: !416, line: 73, baseType: !428, size: 64, offset: 4032)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !415, file: !416, line: 74, baseType: !435, size: 64, offset: 4096)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !415, file: !416, line: 75, baseType: !435, size: 64, offset: 4160)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !415, file: !416, line: 77, baseType: !413, size: 64, offset: 4224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !415, file: !416, line: 79, baseType: !212, size: 128, offset: 4288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !415, file: !416, line: 80, baseType: !212, size: 128, offset: 4416)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !415, file: !416, line: 81, baseType: !212, size: 128, offset: 4544)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !415, file: !416, line: 82, baseType: !212, size: 128, offset: 4672)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "error_log", scope: !415, file: !416, line: 83, baseType: !212, size: 128, offset: 4800)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !415, file: !416, line: 84, baseType: !212, size: 128, offset: 4928)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !415, file: !416, line: 85, baseType: !212, size: 128, offset: 5056)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !233, file: !209, line: 121, baseType: !247, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !233, file: !209, line: 122, baseType: !247, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !233, file: !209, line: 123, baseType: !711, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !209, line: 103, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 98, size: 1792, elements: !714)
!714 = !{!715, !716, !717, !718}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !713, file: !209, line: 99, baseType: !286, size: 1600)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !713, file: !209, line: 100, baseType: !269, size: 64, offset: 1600)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !713, file: !209, line: 101, baseType: !269, size: 64, offset: 1664)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !713, file: !209, line: 102, baseType: !191, size: 64, offset: 1728)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !233, file: !209, line: 124, baseType: !338, size: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !233, file: !209, line: 126, baseType: !5, size: 64, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !233, file: !209, line: 127, baseType: !191, size: 64, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !233, file: !209, line: 128, baseType: !191, size: 64, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !233, file: !209, line: 130, baseType: !724, size: 64, offset: 640)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !209, line: 112, baseType: !228)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !233, file: !209, line: 131, baseType: !5, size: 64, offset: 704)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !208, file: !209, line: 81, baseType: !191, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !208, file: !209, line: 82, baseType: !191, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !208, file: !209, line: 83, baseType: !5, size: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !187, file: !188, line: 236, baseType: !191, size: 64, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !187, file: !188, line: 238, baseType: !731, size: 64, offset: 640)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!589, !338}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !187, file: !188, line: 240, baseType: !735, size: 64, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!589, !413}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !187, file: !188, line: 242, baseType: !735, size: 64, offset: 768)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !187, file: !188, line: 243, baseType: !735, size: 64, offset: 832)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !187, file: !188, line: 244, baseType: !741, size: 64, offset: 896)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !413}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !187, file: !188, line: 245, baseType: !741, size: 64, offset: 960)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !187, file: !188, line: 247, baseType: !741, size: 64, offset: 1024)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !187, file: !188, line: 249, baseType: !193, size: 64, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !187, file: !188, line: 250, baseType: !193, size: 64, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !187, file: !188, line: 251, baseType: !193, size: 64, offset: 1216)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !187, file: !188, line: 252, baseType: !193, size: 64, offset: 1280)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !187, file: !188, line: 253, baseType: !193, size: 64, offset: 1344)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !187, file: !188, line: 254, baseType: !193, size: 64, offset: 1408)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !187, file: !188, line: 255, baseType: !193, size: 64, offset: 1472)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !187, file: !188, line: 256, baseType: !193, size: 64, offset: 1536)
!754 = !{i32 7, !"Dwarf Version", i32 5}
!755 = !{i32 2, !"Debug Info Version", i32 3}
!756 = !{i32 1, !"wchar_size", i32 4}
!757 = !{i32 8, !"PIC Level", i32 2}
!758 = !{i32 7, !"PIE Level", i32 2}
!759 = !{i32 7, !"uwtable", i32 2}
!760 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
