; ModuleID = 'samples/338.bc'
source_filename = "cram/open_trace_file.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !0
@.str.1 = private unnamed_addr constant [8 x i8] c"RAWDATA\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [4 x i8] c".gz\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [5 x i8] c".bz2\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [4 x i8] c".sz\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [3 x i8] c".Z\00", align 1, !dbg !24
@__const.open_path_mfile.suffix = private unnamed_addr constant [6 x ptr] [ptr @.str, ptr @.str.2, ptr @.str.3, ptr @.str.4, ptr @.str.5, ptr @.str.3], align 16
@.str.6 = private unnamed_addr constant [5 x i8] c"%s%s\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [3 x i8] c"%s\00", align 1, !dbg !31
@.str.8 = private unnamed_addr constant [3 x i8] c"rb\00", align 1, !dbg !33

; Function Attrs: nounwind uwtable
define dso_local ptr @tokenise_search_path(ptr noundef %searchpath) #0 !dbg !47 {
entry:
  %retval = alloca ptr, align 8
  %searchpath.addr = alloca ptr, align 8
  %newsearch = alloca ptr, align 8
  %i = alloca i32, align 4
  %j = alloca i32, align 4
  %len = alloca i64, align 8
  %path_sep = alloca i8, align 1
  %cleanup.dest.slot = alloca i32, align 4

!121 = distinct !DILexicalBlock(scope: !105, file: !2, line: 114, column: 67)
!122 = !DILocation(line: 115, column: 17, scope: !121)
!123 = !DILocation(line: 115, column: 21, scope: !121)
!124 = !DILocation(line: 116, column: 7, scope: !121)
!125 = !DILocation(line: 117, column: 6, scope: !121)
!126 = !DILocation(line: 120, column: 6, scope: !127)
!127 = distinct !DILexicalBlock(scope: !106, file: !2, line: 120, column: 6)
!128 = !DILocation(line: 120, column: 17, scope: !127)
!129 = !DILocation(line: 120, column: 23, scope: !127)
!130 = !DILocation(line: 120, column: 20, scope: !127)
!131 = !DILocation(line: 120, column: 6, scope: !106)
!132 = !DILocation(line: 122, column: 10, scope: !133)
!133 = distinct !DILexicalBlock(scope: !134, file: !2, line: 122, column: 10)
!134 = distinct !DILexicalBlock(scope: !127, file: !2, line: 120, column: 33)
!135 = !DILocation(line: 122, column: 12, scope: !133)
!136 = !DILocation(line: 122, column: 15, scope: !133)
!137 = !DILocation(line: 122, column: 25, scope: !133)
!138 = !DILocation(line: 122, column: 26, scope: !133)
!139 = !DILocation(line: 122, column: 30, scope: !133)
!140 = !DILocation(line: 122, column: 10, scope: !134)
!141 = !DILocation(line: 123, column: 3, scope: !133)
!142 = !DILocation(line: 123, column: 14, scope: !133)
!143 = !DILocation(line: 123, column: 18, scope: !133)
!144 = !DILocation(line: 124, column: 2, scope: !134)
!145 = !DILocation(line: 125, column: 23, scope: !146)
!146 = distinct !DILexicalBlock(scope: !127, file: !2, line: 124, column: 9)
!147 = !DILocation(line: 125, column: 34, scope: !146)
!148 = !DILocation(line: 125, column: 6, scope: !146)
!149 = !DILocation(line: 125, column: 17, scope: !146)
!150 = !DILocation(line: 125, column: 21, scope: !146)
!151 = !DILocation(line: 127, column: 5, scope: !106)
!152 = !DILocation(line: 112, column: 34, scope: !100)
!153 = !DILocation(line: 112, column: 5, scope: !100)
!154 = distinct !{!154, !103, !155, !156}
!155 = !DILocation(line: 127, column: 5, scope: !94)
!156 = !{!"llvm.loop.mustprogress"}
!157 = !DILocation(line: 129, column: 9, scope: !158)
!158 = distinct !DILexicalBlock(scope: !47, file: !2, line: 129, column: 9)
!159 = !DILocation(line: 129, column: 9, scope: !47)
!160 = !DILocation(line: 130, column: 2, scope: !158)
!161 = !DILocation(line: 130, column: 13, scope: !158)
!162 = !DILocation(line: 130, column: 17, scope: !158)
!163 = !DILocation(line: 131, column: 5, scope: !47)
!164 = !DILocation(line: 131, column: 16, scope: !47)
!165 = !DILocation(line: 131, column: 20, scope: !47)
!166 = !DILocation(line: 132, column: 5, scope: !47)
!167 = !DILocation(line: 132, column: 16, scope: !47)
!168 = !DILocation(line: 132, column: 20, scope: !47)
!169 = !DILocation(line: 133, column: 5, scope: !47)
!170 = !DILocation(line: 133, column: 16, scope: !47)
!171 = !DILocation(line: 133, column: 20, scope: !47)
!172 = !DILocation(line: 134, column: 5, scope: !47)
!173 = !DILocation(line: 134, column: 16, scope: !47)
!174 = !DILocation(line: 134, column: 20, scope: !47)
!175 = !DILocation(line: 136, column: 12, scope: !47)
!176 = !DILocation(line: 136, column: 5, scope: !47)
!177 = !DILocation(line: 137, column: 1, scope: !47)
!178 = !DISubprogram(name: "malloc", scope: !179, file: !179, line: 540, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!179 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!180 = !DISubroutineType(types: !181)
!181 = !{!38, !57}
!182 = !DISubprogram(name: "strlen", scope: !183, file: !183, line: 407, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!183 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!184 = !DISubroutineType(types: !185)
!185 = !{!59, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!188 = distinct !DISubprogram(name: "open_path_mfile", scope: !2, file: !2, line: 319, type: !189, scopeLine: 319, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !35, retainedNodes: !258)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !37, !37, !37}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "mFILE", file: !193, line: 49, baseType: !194)
!193 = !DIFile(filename: "./cram/mFILE.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "34bb4c2e7e35942a2f2bfc641b53e02c")
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !193, line: 40, size: 448, elements: !195)
!195 = !{!196, !251, !252, !253, !254, !255, !256, !257}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !194, file: !193, line: 41, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !199, line: 7, baseType: !200)
!199 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !201, line: 49, size: 1728, elements: !202)
!201 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!202 = !{!203, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !219, !221, !222, !223, !227, !229, !231, !232, !235, !237, !240, !243, !244, !245, !246, !247}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !200, file: !201, line: 51, baseType: !204, size: 32)
!204 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !200, file: !201, line: 54, baseType: !37, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !200, file: !201, line: 55, baseType: !37, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !200, file: !201, line: 56, baseType: !37, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !200, file: !201, line: 57, baseType: !37, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !200, file: !201, line: 58, baseType: !37, size: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !200, file: !201, line: 59, baseType: !37, size: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !200, file: !201, line: 60, baseType: !37, size: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !200, file: !201, line: 61, baseType: !37, size: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !200, file: !201, line: 64, baseType: !37, size: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !200, file: !201, line: 65, baseType: !37, size: 64, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !200, file: !201, line: 66, baseType: !37, size: 64, offset: 704)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !200, file: !201, line: 68, baseType: !217, size: 64, offset: 768)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !201, line: 36, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !200, file: !201, line: 70, baseType: !220, size: 64, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !200, file: !201, line: 72, baseType: !204, size: 32, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !200, file: !201, line: 73, baseType: !204, size: 32, offset: 928)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !200, file: !201, line: 74, baseType: !224, size: 64, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !225, line: 152, baseType: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!226 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !200, file: !201, line: 77, baseType: !228, size: 16, offset: 1024)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !200, file: !201, line: 78, baseType: !230, size: 8, offset: 1040)
!230 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !200, file: !201, line: 79, baseType: !3, size: 8, offset: 1048)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !200, file: !201, line: 81, baseType: !233, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !201, line: 43, baseType: null)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !200, file: !201, line: 89, baseType: !236, size: 64, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !225, line: 153, baseType: !226)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !200, file: !201, line: 91, baseType: !238, size: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !201, line: 37, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !200, file: !201, line: 92, baseType: !241, size: 64, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !201, line: 38, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !200, file: !201, line: 93, baseType: !220, size: 64, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !200, file: !201, line: 94, baseType: !38, size: 64, offset: 1408)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !200, file: !201, line: 95, baseType: !57, size: 64, offset: 1472)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !200, file: !201, line: 96, baseType: !204, size: 32, offset: 1536)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !200, file: !201, line: 98, baseType: !248, size: 160, offset: 1568)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 20)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !193, line: 42, baseType: !37, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "alloced", scope: !194, file: !193, line: 43, baseType: !57, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !194, file: !193, line: 44, baseType: !204, size: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !194, file: !193, line: 45, baseType: !204, size: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !194, file: !193, line: 46, baseType: !57, size: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !194, file: !193, line: 47, baseType: !57, size: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flush_pos", scope: !194, file: !193, line: 48, baseType: !57, size: 64, offset: 384)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !269, !273, !280, !281, !282, !285}
!259 = !DILocalVariable(name: "file", arg: 1, scope: !188, file: !2, line: 319, type: !37)
!260 = !DILocalVariable(name: "path", arg: 2, scope: !188, file: !2, line: 319, type: !37)
!261 = !DILocalVariable(name: "relative_to", arg: 3, scope: !188, file: !2, line: 319, type: !37)
!262 = !DILocalVariable(name: "newsearch", scope: !188, file: !2, line: 320, type: !37)
!263 = !DILocalVariable(name: "ele", scope: !188, file: !2, line: 321, type: !37)
!264 = !DILocalVariable(name: "fp", scope: !188, file: !2, line: 322, type: !191)
!265 = !DILocalVariable(name: "i", scope: !266, file: !2, line: 336, type: !204)
!266 = distinct !DILexicalBlock(scope: !267, file: !2, line: 335, column: 55)
!267 = distinct !DILexicalBlock(scope: !268, file: !2, line: 335, column: 5)
!268 = distinct !DILexicalBlock(scope: !188, file: !2, line: 335, column: 5)
!269 = !DILocalVariable(name: "suffix", scope: !266, file: !2, line: 337, type: !270)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 384, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 6)
!273 = !DILocalVariable(name: "file2", scope: !274, file: !2, line: 339, type: !277)
!274 = distinct !DILexicalBlock(scope: !275, file: !2, line: 338, column: 26)
!275 = distinct !DILexicalBlock(scope: !276, file: !2, line: 338, column: 2)
!276 = distinct !DILexicalBlock(scope: !266, file: !2, line: 338, column: 2)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 1024)
!280 = !DILocalVariable(name: "ele2", scope: !274, file: !2, line: 340, type: !37)
!281 = !DILocalVariable(name: "valid", scope: !274, file: !2, line: 341, type: !204)
!282 = !DILocalVariable(name: "cp", scope: !283, file: !2, line: 376, type: !37)
!283 = distinct !DILexicalBlock(scope: !284, file: !2, line: 375, column: 22)
!284 = distinct !DILexicalBlock(scope: !188, file: !2, line: 375, column: 9)
!285 = !DILocalVariable(name: "relative_path", scope: !283, file: !2, line: 377, type: !286)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32776, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 4097)
!289 = !DILocation(line: 319, column: 30, scope: !188)
!290 = !DILocation(line: 319, column: 42, scope: !188)
!291 = !DILocation(line: 319, column: 54, scope: !188)
!292 = !DILocation(line: 320, column: 5, scope: !188)
!293 = !DILocation(line: 320, column: 11, scope: !188)
!294 = !DILocation(line: 321, column: 5, scope: !188)
!295 = !DILocation(line: 321, column: 11, scope: !188)
!296 = !DILocation(line: 322, column: 5, scope: !188)
!297 = !DILocation(line: 322, column: 12, scope: !188)
!298 = !DILocation(line: 325, column: 10, scope: !299)
!299 = distinct !DILexicalBlock(scope: !188, file: !2, line: 325, column: 9)
!300 = !DILocation(line: 325, column: 9, scope: !188)
!301 = !DILocation(line: 326, column: 9, scope: !299)
!302 = !DILocation(line: 326, column: 7, scope: !299)
!303 = !DILocation(line: 326, column: 2, scope: !299)
!304 = !DILocation(line: 327, column: 51, scope: !305)
!305 = distinct !DILexicalBlock(scope: !188, file: !2, line: 327, column: 9)
!306 = !DILocation(line: 327, column: 30, scope: !305)
!307 = !DILocation(line: 327, column: 28, scope: !305)
!308 = !DILocation(line: 327, column: 14, scope: !305)
!309 = !DILocation(line: 327, column: 9, scope: !188)
!310 = !DILocation(line: 328, column: 2, scope: !305)
!311 = !DILocation(line: 335, column: 16, scope: !268)
!312 = !DILocation(line: 335, column: 14, scope: !268)
!313 = !DILocation(line: 335, column: 10, scope: !268)
!314 = !DILocation(line: 335, column: 28, scope: !267)
!315 = !DILocation(line: 335, column: 27, scope: !267)
!316 = !DILocation(line: 335, column: 5, scope: !268)
!317 = !DILocation(line: 336, column: 2, scope: !266)
