; ModuleID = 'samples/341.bc'
source_filename = "lisp/string.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._LispMac = type { %struct.anon.15, %struct.anon.16, %struct.anon.17, %struct.anon.18, ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct.anon.19, [1 x %struct.__jmp_buf_tag], %struct.anon.20, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, %struct.anon.21, ptr, ptr, ptr, ptr, ptr, ptr, ptr, [3 x ptr], [3 x ptr], ptr, ptr, ptr, i32, i32, i32, ptr, i32 }
%struct.anon.15 = type { ptr, i32, i32, i32 }
%struct.anon.16 = type { ptr, ptr, i32, i32, i32, i32 }
%struct.anon.17 = type { ptr, i32 }
%struct.anon.18 = type { ptr, i32, i32 }
%struct.anon.19 = type { i32, i32, ptr, ptr }
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.anon.20 = type { i8, i32, i64, i32 }
%struct.anon.21 = type { i32, i32, i32, ptr }
%struct._LispBuiltin = type { i32, ptr, ptr, i32, i32, ptr, ptr }
%struct._LispObj = type { i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { ptr, i64, i8 }
%struct._LispAtom = type { ptr, ptr, i16, ptr, i32, ptr, ptr, ptr, ptr, [5 x ptr] }
%struct._hash_key = type { ptr, i32 }
%struct.anon.3 = type { ptr, ptr }
%struct.anon.7 = type { %union.anon.8, ptr, i8 }
%union.anon.8 = type { ptr }

!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(scope: null, file: !2, line: 765, type: !51, isLocal: true, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 28)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1367, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !2, line: 794, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 25)
!64 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !65, retainedTypes: !124, globals: !485, splitDebugInlining: false, nameTableKind: None)
!65 = !{!66, !97, !103, !109}
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_LispType", file: !67, line: 496, baseType: !68, size: 32, elements: !69)
!67 = !DIFile(filename: "./lisp/internal.h", directory: "/local-ssd/xedit-dhuehljb5hvbgi4rpzwcjdfs76jnrafe-build/aidengro/spack-stage-xedit-1.2.3-dhuehljb5hvbgi4rpzwcjdfs76jnrafe/spack-src", checksumkind: CSK_MD5, checksum: "1b851b5a43254ef7f342dbdef3a0d76a")
!68 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!70 = !DIEnumerator(name: "LispNil_t", value: 1)
!71 = !DIEnumerator(name: "LispFixnum_t", value: 3)
!72 = !DIEnumerator(name: "LispSChar_t", value: 5)
!73 = !DIEnumerator(name: "LispInteger_t", value: 16)
!74 = !DIEnumerator(name: "LispDFloat_t", value: 17)
!75 = !DIEnumerator(name: "LispString_t", value: 18)
!76 = !DIEnumerator(name: "LispRatio_t", value: 19)
!77 = !DIEnumerator(name: "LispOpaque_t", value: 20)
!78 = !DIEnumerator(name: "LispBignum_t", value: 21)
!79 = !DIEnumerator(name: "LispBigratio_t", value: 22)
!80 = !DIEnumerator(name: "LispAtom_t", value: 23)
!81 = !DIEnumerator(name: "LispFunction_t", value: 24)
!82 = !DIEnumerator(name: "LispFunctionQuote_t", value: 25)
!83 = !DIEnumerator(name: "LispLambda_t", value: 26)
!84 = !DIEnumerator(name: "LispComplex_t", value: 27)
!85 = !DIEnumerator(name: "LispCons_t", value: 28)
!86 = !DIEnumerator(name: "LispQuote_t", value: 29)
!87 = !DIEnumerator(name: "LispArray_t", value: 30)
!88 = !DIEnumerator(name: "LispStruct_t", value: 31)
!89 = !DIEnumerator(name: "LispStream_t", value: 32)
!90 = !DIEnumerator(name: "LispBackquote_t", value: 33)
!91 = !DIEnumerator(name: "LispComma_t", value: 34)
!92 = !DIEnumerator(name: "LispPathname_t", value: 35)
!93 = !DIEnumerator(name: "LispPackage_t", value: 36)
!94 = !DIEnumerator(name: "LispRegex_t", value: 37)
!95 = !DIEnumerator(name: "LispBytecode_t", value: 38)
!96 = !DIEnumerator(name: "LispHashTable_t", value: 39)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_LispFunType", file: !67, line: 534, baseType: !68, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102}
!99 = !DIEnumerator(name: "LispLambda", value: 0)
!100 = !DIEnumerator(name: "LispFunction", value: 1)
!101 = !DIEnumerator(name: "LispMacro", value: 2)
!102 = !DIEnumerator(name: "LispSetf", value: 3)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_LispStreamType", file: !67, line: 541, baseType: !68, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIEnumerator(name: "LispStreamString", value: 0)
!106 = !DIEnumerator(name: "LispStreamFile", value: 1)
!107 = !DIEnumerator(name: "LispStreamStandard", value: 2)
!108 = !DIEnumerator(name: "LispStreamPipe", value: 3)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 46, baseType: !68, size: 32, elements: !111)
!110 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!112 = !DIEnumerator(name: "_ISupper", value: 256)
!113 = !DIEnumerator(name: "_ISlower", value: 512)
!114 = !DIEnumerator(name: "_ISalpha", value: 1024)
!115 = !DIEnumerator(name: "_ISdigit", value: 2048)
!116 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!117 = !DIEnumerator(name: "_ISspace", value: 8192)
!118 = !DIEnumerator(name: "_ISprint", value: 16384)
!119 = !DIEnumerator(name: "_ISgraph", value: 32768)
!120 = !DIEnumerator(name: "_ISblank", value: 1)
!121 = !DIEnumerator(name: "_IScntrl", value: 2)
!122 = !DIEnumerator(name: "_ISpunct", value: 4)
!123 = !DIEnumerator(name: "_ISalnum", value: 8)
!124 = !{!125, !126, !127, !129, !173, !483, !439, !155, !484}
!125 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!126 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispObj", file: !67, line: 481, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispObj", file: !67, line: 562, size: 256, elements: !132)
!132 = !{!133, !135, !136, !137, !139}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !67, line: 563, baseType: !134, size: 6, flags: DIFlagBitField, extraData: i64 0)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispType", file: !67, line: 532, baseType: !66)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !131, file: !67, line: 564, baseType: !68, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !131, file: !67, line: 565, baseType: !68, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "funtype", scope: !131, file: !67, line: 566, baseType: !138, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispFunType", file: !67, line: 539, baseType: !97)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !67, line: 652, baseType: !140, size: 192, offset: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !67, line: 567, size: 192, elements: !141)
!141 = !{!142, !302, !308, !309, !311, !312, !313, !318, !339, !344, !349, !355, !363, !368, !435, !441, !446, !452, !466, !475}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !140, file: !67, line: 568, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispAtom", file: !67, line: 482, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispAtom", file: !146, line: 195, size: 896, elements: !147)
!146 = !DIFile(filename: "./lisp/private.h", directory: "/local-ssd/xedit-dhuehljb5hvbgi4rpzwcjdfs76jnrafe-build/aidengro/spack-stage-xedit-1.2.3-dhuehljb5hvbgi4rpzwcjdfs76jnrafe/spack-src", checksumkind: CSK_MD5, checksum: "90e1ca13cd32dba55a2a656b67d463f4")
!147 = !{!148, !157, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !174, !175, !176, !177, !298}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !145, file: !146, line: 196, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_key", file: !151, line: 34, baseType: !152)
!151 = !DIFile(filename: "./util.h", directory: "/local-ssd/xedit-dhuehljb5hvbgi4rpzwcjdfs76jnrafe-build/aidengro/spack-stage-xedit-1.2.3-dhuehljb5hvbgi4rpzwcjdfs76jnrafe/spack-src", checksumkind: CSK_MD5, checksum: "1e139f1aa84cdd5018400c780a62640c")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_hash_key", file: !151, line: 39, size: 128, elements: !153)
!153 = !{!154, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !152, file: !151, line: 40, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !152, file: !151, line: 41, baseType: !68, size: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !146, line: 197, baseType: !158, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dyn", scope: !145, file: !146, line: 200, baseType: !68, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "a_object", scope: !145, file: !146, line: 203, baseType: !68, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "a_function", scope: !145, file: !146, line: 205, baseType: !68, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "a_builtin", scope: !145, file: !146, line: 207, baseType: !68, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "a_compiled", scope: !145, file: !146, line: 209, baseType: !68, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "a_property", scope: !145, file: !146, line: 211, baseType: !68, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "a_defsetf", scope: !145, file: !146, line: 213, baseType: !68, size: 1, offset: 134, flags: DIFlagBitField, extraData: i64 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "a_defstruct", scope: !145, file: !146, line: 215, baseType: !68, size: 1, offset: 135, flags: DIFlagBitField, extraData: i64 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !145, file: !146, line: 218, baseType: !68, size: 1, offset: 136, flags: DIFlagBitField, extraData: i64 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "unreadable", scope: !145, file: !146, line: 221, baseType: !68, size: 1, offset: 137, flags: DIFlagBitField, extraData: i64 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "watch", scope: !145, file: !146, line: 224, baseType: !68, size: 1, offset: 138, flags: DIFlagBitField, extraData: i64 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !145, file: !146, line: 227, baseType: !68, size: 1, offset: 139, flags: DIFlagBitField, extraData: i64 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !145, file: !146, line: 229, baseType: !129, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !145, file: !146, line: 230, baseType: !173, size: 32, offset: 256)
!173 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !145, file: !146, line: 231, baseType: !129, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !145, file: !146, line: 232, baseType: !129, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !146, line: 233, baseType: !129, size: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !145, file: !146, line: 234, baseType: !178, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispProperty", file: !146, line: 97, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispProperty", file: !146, line: 158, size: 640, elements: !181)
!181 = !{!182, !183, !222, !223, !252, !290, !291, !292, !293}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !180, file: !146, line: 160, baseType: !68, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !180, file: !146, line: 163, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispPackage", file: !67, line: 487, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispPackage", file: !146, line: 245, size: 320, elements: !187)
!187 = !{!188, !196, !197}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "glb", scope: !186, file: !146, line: 246, baseType: !189, size: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispObjList", file: !146, line: 98, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispObjList", file: !146, line: 239, size: 128, elements: !191)
!191 = !{!192, !194, !195}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pairs", scope: !190, file: !146, line: 240, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !190, file: !146, line: 241, baseType: !173, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !190, file: !146, line: 242, baseType: !173, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !186, file: !146, line: 247, baseType: !189, size: 128, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !186, file: !146, line: 248, baseType: !198, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !151, line: 36, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_hash_table", file: !151, line: 49, size: 320, elements: !201)
!201 = !{!202, !210, !211, !212, !217}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !200, file: !151, line: 50, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_entry", file: !151, line: 35, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_hash_entry", file: !151, line: 44, size: 128, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !206, file: !151, line: 45, baseType: !149, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !151, line: 46, baseType: !204, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !200, file: !151, line: 51, baseType: !68, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !200, file: !151, line: 52, baseType: !68, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !200, file: !151, line: 53, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_compare", file: !151, line: 37, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!173, !149, !149}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !200, file: !151, line: 58, baseType: !218, size: 128, offset: 192)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !200, file: !151, line: 55, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !218, file: !151, line: 56, baseType: !173, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !218, file: !151, line: 57, baseType: !204, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !180, file: !146, line: 166, baseType: !129, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !180, file: !146, line: 173, baseType: !224, size: 64, offset: 192)
!224 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !146, line: 168, size: 64, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !224, file: !146, line: 170, baseType: !129, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !224, file: !146, line: 172, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispBuiltin", file: !67, line: 483, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispBuiltin", file: !67, line: 663, size: 384, elements: !231)
!231 = !{!232, !233, !238, !241, !242, !243, !251}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !230, file: !67, line: 665, baseType: !138, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !230, file: !67, line: 666, baseType: !234, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispFunPtr", file: !67, line: 660, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!129, !228}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "declaration", scope: !230, file: !67, line: 667, baseType: !239, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "multiple_values", scope: !230, file: !67, line: 670, baseType: !173, size: 32, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !230, file: !67, line: 673, baseType: !173, size: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "compile", scope: !230, file: !67, line: 676, baseType: !244, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispComPtr", file: !67, line: 661, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !248, !228}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispCom", file: !67, line: 492, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LispCom", file: !67, line: 492, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !230, file: !67, line: 679, baseType: !129, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "alist", scope: !180, file: !146, line: 175, baseType: !253, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispArgList", file: !146, line: 148, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispArgList", file: !146, line: 140, size: 1088, elements: !256)
!256 = !{!257, !263, !271, !280, !281, !288, !289}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "normals", scope: !255, file: !146, line: 141, baseType: !258, size: 128)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispNormalArgs", file: !146, line: 107, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispNormalArgs", file: !146, line: 104, size: 128, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "num_symbols", scope: !259, file: !146, line: 105, baseType: !173, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !259, file: !146, line: 106, baseType: !193, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "optionals", scope: !255, file: !146, line: 142, baseType: !264, size: 256, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispOptionalArgs", file: !146, line: 115, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispOptionalArgs", file: !146, line: 110, size: 256, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_symbols", scope: !265, file: !146, line: 111, baseType: !173, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !265, file: !146, line: 112, baseType: !193, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !265, file: !146, line: 113, baseType: !193, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sforms", scope: !265, file: !146, line: 114, baseType: !193, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !255, file: !146, line: 143, baseType: !272, size: 320, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispKeyArgs", file: !146, line: 124, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispKeyArgs", file: !146, line: 118, size: 320, elements: !274)
!274 = !{!275, !276, !277, !278, !279}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_symbols", scope: !273, file: !146, line: 119, baseType: !173, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !273, file: !146, line: 120, baseType: !193, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !273, file: !146, line: 121, baseType: !193, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sforms", scope: !273, file: !146, line: 122, baseType: !193, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !273, file: !146, line: 123, baseType: !193, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rest", scope: !255, file: !146, line: 144, baseType: !129, size: 64, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "auxs", scope: !255, file: !146, line: 145, baseType: !282, size: 192, offset: 768)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispAuxArgs", file: !146, line: 131, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispAuxArgs", file: !146, line: 127, size: 192, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "num_symbols", scope: !283, file: !146, line: 128, baseType: !173, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !283, file: !146, line: 129, baseType: !193, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "initials", scope: !283, file: !146, line: 130, baseType: !193, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num_arguments", scope: !255, file: !146, line: 146, baseType: !173, size: 32, offset: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !255, file: !146, line: 147, baseType: !155, size: 64, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !180, file: !146, line: 178, baseType: !129, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "setf", scope: !180, file: !146, line: 181, baseType: !129, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "salist", scope: !180, file: !146, line: 183, baseType: !253, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !180, file: !146, line: 192, baseType: !294, size: 128, offset: 512)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !180, file: !146, line: 186, size: 128, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "definition", scope: !294, file: !146, line: 187, baseType: !129, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !294, file: !146, line: 191, baseType: !173, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "documentation", scope: !145, file: !146, line: 236, baseType: !299, size: 320, offset: 576)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 320, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 5)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !140, file: !67, line: 573, baseType: !303, size: 192)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 569, size: 192, elements: !304)
!304 = !{!305, !306, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !303, file: !67, line: 570, baseType: !155, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !303, file: !67, line: 571, baseType: !126, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "writable", scope: !303, file: !67, line: 572, baseType: !68, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !140, file: !67, line: 574, baseType: !126, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dfloat", scope: !140, file: !67, line: 575, baseType: !310, size: 64)
!310 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !140, file: !67, line: 576, baseType: !129, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !140, file: !67, line: 577, baseType: !129, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ratio", scope: !140, file: !67, line: 582, baseType: !314, size: 128)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 579, size: 128, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "numerator", scope: !314, file: !67, line: 580, baseType: !126, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "denominator", scope: !314, file: !67, line: 581, baseType: !126, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !140, file: !67, line: 586, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !140, file: !67, line: 583, size: 64, elements: !320)
!320 = !{!321, !332}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !319, file: !67, line: 584, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpi", file: !324, line: 119, baseType: !325)
!324 = !DIFile(filename: "./lisp/mp/mp.h", directory: "/local-ssd/xedit-dhuehljb5hvbgi4rpzwcjdfs76jnrafe-build/aidengro/spack-stage-xedit-1.2.3-dhuehljb5hvbgi4rpzwcjdfs76jnrafe/spack-src", checksumkind: CSK_MD5, checksum: "c8e1682473a380849e8707431cf59f36")
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mpi", file: !324, line: 114, size: 192, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !325, file: !324, line: 115, baseType: !68, size: 31, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !325, file: !324, line: 116, baseType: !68, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !325, file: !324, line: 117, baseType: !125, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "digs", scope: !325, file: !324, line: 118, baseType: !331, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ratio", scope: !319, file: !67, line: 585, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpr", file: !324, line: 124, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mpr", file: !324, line: 121, size: 384, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !335, file: !324, line: 122, baseType: !323, size: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !335, file: !324, line: 123, baseType: !323, size: 192, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !140, file: !67, line: 590, baseType: !340, size: 128)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 587, size: 128, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !340, file: !67, line: 588, baseType: !129, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !340, file: !67, line: 589, baseType: !129, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cons", scope: !140, file: !67, line: 594, baseType: !345, size: 128)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 591, size: 128, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "car", scope: !345, file: !67, line: 592, baseType: !129, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "cdr", scope: !345, file: !67, line: 593, baseType: !129, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !140, file: !67, line: 599, baseType: !350, size: 192)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 595, size: 192, elements: !351)
!351 = !{!352, !353, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !350, file: !67, line: 596, baseType: !129, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !350, file: !67, line: 597, baseType: !129, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !350, file: !67, line: 598, baseType: !129, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !140, file: !67, line: 609, baseType: !356, size: 192)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 600, size: 192, elements: !357)
!357 = !{!358, !359, !360, !361, !362}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !356, file: !67, line: 601, baseType: !129, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !356, file: !67, line: 602, baseType: !129, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !356, file: !67, line: 603, baseType: !68, size: 8, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !356, file: !67, line: 604, baseType: !68, size: 7, offset: 136, flags: DIFlagBitField, extraData: i64 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !356, file: !67, line: 607, baseType: !68, size: 1, offset: 143, flags: DIFlagBitField, extraData: i64 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "struc", scope: !140, file: !67, line: 613, baseType: !364, size: 128)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 610, size: 128, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !364, file: !67, line: 611, baseType: !129, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !364, file: !67, line: 612, baseType: !129, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !140, file: !67, line: 624, baseType: !369, size: 192)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 614, size: 192, elements: !370)
!370 = !{!371, !430, !431, !433, !434}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !369, file: !67, line: 619, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !67, line: 615, size: 64, elements: !373)
!373 = !{!374, !407, !416}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !372, file: !67, line: 616, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispFile", file: !67, line: 485, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispFile", file: !378, line: 50, size: 320, elements: !379)
!378 = !DIFile(filename: "./lisp/io.h", directory: "/local-ssd/xedit-dhuehljb5hvbgi4rpzwcjdfs76jnrafe-build/aidengro/spack-stage-xedit-1.2.3-dhuehljb5hvbgi4rpzwcjdfs76jnrafe/spack-src", checksumkind: CSK_MD5, checksum: "e1cc0f49364109d3f81381a34f801d0f")
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !377, file: !378, line: 51, baseType: !155, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !377, file: !378, line: 52, baseType: !173, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !377, file: !378, line: 53, baseType: !173, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !377, file: !378, line: 54, baseType: !173, size: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !377, file: !378, line: 55, baseType: !173, size: 32, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !377, file: !378, line: 56, baseType: !173, size: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "unget", scope: !377, file: !378, line: 57, baseType: !173, size: 8, offset: 224, flags: DIFlagBitField, extraData: i64 224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "readable", scope: !377, file: !378, line: 58, baseType: !68, size: 1, offset: 232, flags: DIFlagBitField, extraData: i64 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "writable", scope: !377, file: !378, line: 59, baseType: !68, size: 1, offset: 233, flags: DIFlagBitField, extraData: i64 224)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "regular", scope: !377, file: !378, line: 60, baseType: !68, size: 1, offset: 234, flags: DIFlagBitField, extraData: i64 224)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !377, file: !378, line: 61, baseType: !68, size: 1, offset: 235, flags: DIFlagBitField, extraData: i64 224)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !377, file: !378, line: 62, baseType: !68, size: 1, offset: 236, flags: DIFlagBitField, extraData: i64 224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", scope: !377, file: !378, line: 63, baseType: !68, size: 1, offset: 237, flags: DIFlagBitField, extraData: i64 224)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "binary", scope: !377, file: !378, line: 64, baseType: !68, size: 1, offset: 238, flags: DIFlagBitField, extraData: i64 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !377, file: !378, line: 65, baseType: !395, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_write_fn", file: !378, line: 48, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!399, !173, !403, !405}
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !400, line: 108, baseType: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !402, line: 194, baseType: !126)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !406, line: 70, baseType: !125)
!406 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!407 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !372, file: !67, line: 617, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispPipe", file: !67, line: 553, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 548, size: 256, elements: !411)
!411 = !{!412, !413, !414, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !410, file: !67, line: 549, baseType: !173, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !410, file: !67, line: 550, baseType: !375, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !410, file: !67, line: 551, baseType: !375, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "errorp", scope: !410, file: !67, line: 552, baseType: !129, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !372, file: !67, line: 618, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispString", file: !67, line: 486, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LispString", file: !378, line: 68, size: 320, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !419, file: !378, line: 69, baseType: !155, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !419, file: !378, line: 70, baseType: !173, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !419, file: !378, line: 71, baseType: !173, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !419, file: !378, line: 72, baseType: !173, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !419, file: !378, line: 73, baseType: !173, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !419, file: !378, line: 74, baseType: !173, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !419, file: !378, line: 75, baseType: !173, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !419, file: !378, line: 76, baseType: !68, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "binary", scope: !419, file: !378, line: 77, baseType: !68, size: 1, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !369, file: !67, line: 620, baseType: !129, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !67, line: 621, baseType: !432, size: 6, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispStreamType", file: !67, line: 546, baseType: !103)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "readable", scope: !369, file: !67, line: 622, baseType: !68, size: 1, offset: 134, flags: DIFlagBitField, extraData: i64 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "writable", scope: !369, file: !67, line: 623, baseType: !68, size: 1, offset: 135, flags: DIFlagBitField, extraData: i64 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !140, file: !67, line: 628, baseType: !436, size: 128)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 625, size: 128, elements: !437)
!437 = !{!438, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !436, file: !67, line: 626, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !67, line: 627, baseType: !173, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "comma", scope: !140, file: !67, line: 632, baseType: !442, size: 128)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 629, size: 128, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !442, file: !67, line: 630, baseType: !129, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "atlist", scope: !442, file: !67, line: 631, baseType: !173, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !140, file: !67, line: 637, baseType: !447, size: 192)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 633, size: 192, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !67, line: 634, baseType: !129, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nicknames", scope: !447, file: !67, line: 635, baseType: !129, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !447, file: !67, line: 636, baseType: !184, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "regex", scope: !140, file: !67, line: 642, baseType: !453, size: 192)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 638, size: 192, elements: !454)
!454 = !{!455, !464, !465}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "regex", scope: !453, file: !67, line: 639, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_cod", file: !458, line: 101, baseType: !459)
!458 = !DIFile(filename: "./lisp/re/re.h", directory: "/local-ssd/xedit-dhuehljb5hvbgi4rpzwcjdfs76jnrafe-build/aidengro/spack-stage-xedit-1.2.3-dhuehljb5hvbgi4rpzwcjdfs76jnrafe/spack-src", checksumkind: CSK_MD5, checksum: "3383ac1886bf39bb465aad3f182925ce")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_re_cod", file: !458, line: 97, size: 192, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !459, file: !458, line: 98, baseType: !127, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !459, file: !458, line: 99, baseType: !173, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "re_endp", scope: !459, file: !458, line: 100, baseType: !239, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !453, file: !67, line: 640, baseType: !129, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !453, file: !67, line: 641, baseType: !173, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !140, file: !67, line: 647, baseType: !467, size: 192)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 643, size: 192, elements: !468)
!468 = !{!469, !473, !474}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !467, file: !67, line: 644, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispBytecode", file: !67, line: 488, baseType: !472)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LispBytecode", file: !67, line: 488, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !467, file: !67, line: 645, baseType: !129, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !467, file: !67, line: 646, baseType: !129, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !140, file: !67, line: 651, baseType: !476, size: 128)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !67, line: 648, size: 128, elements: !477)
!477 = !{!478, !482}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !476, file: !67, line: 649, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "LispHashTable", file: !67, line: 489, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LispHashTable", file: !67, line: 489, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !476, file: !67, line: 650, baseType: !129, size: 64, offset: 64)
!483 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!485 = !{!0, !7, !12, !17, !22, !27, !32, !34, !39, !44, !49, !54, !59}
!486 = !{i32 7, !"Dwarf Version", i32 5}
!487 = !{i32 2, !"Debug Info Version", i32 3}
!488 = !{i32 1, !"wchar_size", i32 4}
!489 = !{i32 8, !"PIC Level", i32 2}
!490 = !{i32 7, !"PIE Level", i32 2}
!491 = !{i32 7, !"uwtable", i32 2}
!492 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!493 = distinct !DISubprogram(name: "Lisp_CharLess", scope: !2, file: !2, line: 142, type: !236, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !494)
!494 = !{!495}
!495 = !DILocalVariable(name: "builtin", arg: 1, scope: !493, file: !2, line: 142, type: !228)
!496 = !DILocation(line: 142, column: 28, scope: !493)
!497 = !DILocation(line: 147, column: 29, scope: !493)
!498 = !DILocation(line: 147, column: 13, scope: !493)
!499 = !DILocation(line: 147, column: 5, scope: !493)
!500 = distinct !DISubprogram(name: "LispCharCompare", scope: !2, file: !2, line: 74, type: !501, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !503)
!501 = !DISubroutineType(types: !502)
!502 = !{!129, !228, !173, !173}
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !516, !521, !530, !535, !538, !543, !549}
!504 = !DILocalVariable(name: "builtin", arg: 1, scope: !500, file: !2, line: 74, type: !228)
!505 = !DILocalVariable(name: "operation", arg: 2, scope: !500, file: !2, line: 74, type: !173)
!506 = !DILocalVariable(name: "ignore_case", arg: 3, scope: !500, file: !2, line: 74, type: !173)
!507 = !DILocalVariable(name: "object", scope: !500, file: !2, line: 76, type: !129)
!508 = !DILocalVariable(name: "cmp", scope: !500, file: !2, line: 77, type: !173)
!509 = !DILocalVariable(name: "value", scope: !500, file: !2, line: 77, type: !173)
!510 = !DILocalVariable(name: "next_value", scope: !500, file: !2, line: 77, type: !173)
!511 = !DILocalVariable(name: "character", scope: !500, file: !2, line: 79, type: !129)
!512 = !DILocalVariable(name: "more_characters", scope: !500, file: !2, line: 79, type: !129)
!513 = !DILocalVariable(name: "__res", scope: !514, file: !2, line: 87, type: !173)
!514 = distinct !DILexicalBlock(scope: !515, file: !2, line: 87, column: 10)
!515 = distinct !DILexicalBlock(scope: !500, file: !2, line: 86, column: 9)
!516 = !DILocalVariable(name: "__c", scope: !517, file: !2, line: 87, type: !173)
!517 = distinct !DILexicalBlock(scope: !518, file: !2, line: 87, column: 10)
!518 = distinct !DILexicalBlock(scope: !519, file: !2, line: 87, column: 10)
!519 = distinct !DILexicalBlock(scope: !520, file: !2, line: 87, column: 10)
!520 = distinct !DILexicalBlock(scope: !514, file: !2, line: 87, column: 10)
!521 = !DILocalVariable(name: "__res", scope: !522, file: !2, line: 104, type: !173)
!522 = distinct !DILexicalBlock(scope: !523, file: !2, line: 104, column: 20)
!523 = distinct !DILexicalBlock(scope: !524, file: !2, line: 103, column: 7)
!524 = distinct !DILexicalBlock(scope: !525, file: !2, line: 100, column: 74)
!525 = distinct !DILexicalBlock(scope: !526, file: !2, line: 100, column: 6)
!526 = distinct !DILexicalBlock(scope: !527, file: !2, line: 100, column: 6)
!527 = distinct !DILexicalBlock(scope: !528, file: !2, line: 99, column: 5)
!528 = distinct !DILexicalBlock(scope: !529, file: !2, line: 97, column: 38)
!529 = distinct !DILexicalBlock(scope: !500, file: !2, line: 97, column: 9)
!530 = !DILocalVariable(name: "__c", scope: !531, file: !2, line: 104, type: !173)
