; ModuleID = 'samples/347.bc'
source_filename = "src/match/pck-count-nodes.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtStackNodecount = type { i64, i64, i64, i64, i64, [256 x %struct.Nodecount_tag], ptr, ptr }
%struct.Nodecount_tag = type { i64, i64, i64, i64, i32, i8, i8 }
%struct.Mbtab = type { i64, i64 }

@.str = private unnamed_addr constant [28 x i8] c"src/match/pck-count-nodes.c\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [43 x i8] c"on root:\0A %lu branching nodes\0A %lu leaves\0A\00", align 1, !dbg !7
@stderr = external global ptr, align 8
@.str.2 = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [30 x i8] c"parent->lower < parent->upper\00", align 1, !dbg !17
@__func__.visit_count_children = private unnamed_addr constant [21 x i8] c"visit_count_children\00", align 1, !dbg !22
@.str.4 = private unnamed_addr constant [34 x i8] c"rangesize <= (GtUword) numofchars\00", align 1, !dbg !28

; Function Attrs: nounwind uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 123, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/match/pck-count-nodes.c", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "b50e495b28e6cfa2c856283afda0af95")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 28)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 43)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2376, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 297)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 30)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 168, elements: !26)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!26 = !{!27}
!27 = !DISubrange(count: 21)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 34)
!33 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !34, globals: !40, splitDebugInlining: false, nameTableKind: None)
!34 = !{!35, !38, !39}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !36, line: 83, baseType: !37)
!36 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!37 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!40 = !{!0, !7, !12, !17, !22, !28}
!41 = !{i32 7, !"Dwarf Version", i32 5}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{i32 8, !"PIC Level", i32 2}
!45 = !{i32 7, !"uwtable", i32 2}
!46 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!47 = distinct !DISubprogram(name: "gt_pck_count_nodes_dfs", scope: !2, file: !2, line: 110, type: !48, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !55)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, !35, !39}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FMindex", file: !53, line: 30, baseType: !54)
!53 = !DIFile(filename: "src/match/eis-voiditf.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "28c22f98c48c01d2533a10e2c5982f6c")
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "FMindex", file: !53, line: 30, flags: DIFlagFwdDecl)
!55 = !{!56, !57, !58, !59, !91, !92, !93, !100, !102, !103, !106, !111, !112}
!56 = !DILocalVariable(name: "index", arg: 1, scope: !47, file: !2, line: 110, type: !50)
!57 = !DILocalVariable(name: "totallength", arg: 2, scope: !47, file: !2, line: 111, type: !35)
!58 = !DILocalVariable(name: "numofchars", arg: 3, scope: !47, file: !2, line: 112, type: !39)
!59 = !DILocalVariable(name: "stack", scope: !47, file: !2, line: 114, type: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStackNodecount", file: !61, line: 33, baseType: !62)
!61 = !DIFile(filename: "src/match/pck-count-nodes.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "6342c489046b02a849c9fe58175b776b")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 33, size: 82368, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !84, !86}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !62, file: !61, line: 33, baseType: !35, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !62, file: !61, line: 33, baseType: !35, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !62, file: !61, line: 33, baseType: !35, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "staticsize", scope: !62, file: !61, line: 33, baseType: !35, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sizeincrement", scope: !62, file: !61, line: 33, baseType: !35, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "staticspace", scope: !62, file: !61, line: 33, baseType: !70, size: 81920, offset: 320)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 81920, elements: !82)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nodecount", file: !61, line: 31, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Nodecount_tag", file: !61, line: 27, size: 320, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !81}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "leaves", scope: !72, file: !61, line: 28, baseType: !35, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "branching", scope: !72, file: !61, line: 28, baseType: !35, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !72, file: !61, line: 28, baseType: !35, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !72, file: !61, line: 28, baseType: !35, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "parentOffset", scope: !72, file: !61, line: 29, baseType: !39, size: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !72, file: !61, line: 30, baseType: !80, size: 8, offset: 288)
!80 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "on_branch", scope: !72, file: !61, line: 30, baseType: !80, size: 8, offset: 296)
!82 = !{!83}
!83 = !DISubrange(count: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !62, file: !61, line: 33, baseType: !85, size: 64, offset: 82240)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "initialiseelement", scope: !62, file: !61, line: 33, baseType: !87, size: 64, offset: 82304)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !38}
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DILocalVariable(name: "root", scope: !47, file: !2, line: 115, type: !71)
!92 = !DILocalVariable(name: "current", scope: !47, file: !2, line: 116, type: !85)
!93 = !DILocalVariable(name: "tmpmbtab", scope: !47, file: !2, line: 117, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mbtab", file: !53, line: 124, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 121, size: 128, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "lowerbound", scope: !96, file: !53, line: 123, baseType: !35, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "upperbound", scope: !96, file: !53, line: 123, baseType: !35, size: 64, offset: 64)
!100 = !DILocalVariable(name: "rangeOccs", scope: !47, file: !2, line: 118, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!102 = !DILocalVariable(name: "resize", scope: !47, file: !2, line: 119, type: !35)
!103 = !DILocalVariable(name: "stackidx", scope: !104, file: !2, line: 122, type: !35)
!104 = distinct !DILexicalBlock(scope: !105, file: !2, line: 122, column: 3)
!105 = distinct !DILexicalBlock(scope: !47, file: !2, line: 122, column: 3)
!106 = !DILocalVariable(name: "sizeoftype", scope: !107, file: !2, line: 134, type: !109)
!107 = distinct !DILexicalBlock(scope: !108, file: !2, line: 134, column: 3)
!108 = distinct !DILexicalBlock(scope: !47, file: !2, line: 134, column: 3)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 70, baseType: !37)
!110 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!111 = !DILocalVariable(name: "allocsize", scope: !107, file: !2, line: 134, type: !109)
!112 = !DILocalVariable(name: "stackidx", scope: !113, file: !2, line: 134, type: !35)
!113 = distinct !DILexicalBlock(scope: !114, file: !2, line: 134, column: 3)
!114 = distinct !DILexicalBlock(scope: !107, file: !2, line: 134, column: 3)
!115 = !{!116, !116, i64 0}
!116 = !{!"any pointer", !117, i64 0}
!117 = !{!"omnipotent char", !118, i64 0}
!118 = !{!"Simple C/C++ TBAA"}
!119 = !DILocation(line: 110, column: 44, scope: !47)
!120 = !{!121, !121, i64 0}
!121 = !{!"long", !117, i64 0}
!122 = !DILocation(line: 111, column: 33, scope: !47)
!123 = !{!124, !124, i64 0}
!124 = !{!"int", !117, i64 0}
!125 = !DILocation(line: 112, column: 38, scope: !47)
!126 = !DILocation(line: 114, column: 3, scope: !47)
!127 = !DILocation(line: 114, column: 20, scope: !47)
!128 = !DILocation(line: 115, column: 3, scope: !47)
!129 = !DILocation(line: 115, column: 13, scope: !47)
!130 = !DILocation(line: 116, column: 3, scope: !47)
!131 = !DILocation(line: 116, column: 14, scope: !47)
!132 = !DILocation(line: 117, column: 3, scope: !47)
!133 = !DILocation(line: 117, column: 10, scope: !47)
!134 = !DILocation(line: 118, column: 3, scope: !47)
!135 = !DILocation(line: 118, column: 12, scope: !47)
!136 = !DILocation(line: 119, column: 3, scope: !47)
!137 = !DILocation(line: 119, column: 11, scope: !47)
!138 = !DILocation(line: 122, column: 3, scope: !47)
!139 = !{!140, !121, i64 24}
!140 = !{!"", !121, i64 0, !121, i64 8, !121, i64 16, !121, i64 24, !121, i64 32, !117, i64 40, !116, i64 10280, !116, i64 10288}
!141 = !{!140, !121, i64 32}
!142 = !{!140, !121, i64 0}
!143 = !{!140, !121, i64 16}
!144 = !{!140, !121, i64 8}
!145 = !{!140, !116, i64 10280}
!146 = !{!140, !116, i64 10288}
!147 = !DILocation(line: 122, column: 3, scope: !105)
!148 = !DILocation(line: 122, column: 3, scope: !104)
!149 = !DILocation(line: 122, column: 3, scope: !150)
!150 = distinct !DILexicalBlock(scope: !104, file: !2, line: 122, column: 3)
!151 = !DILocation(line: 122, column: 3, scope: !152)
!152 = distinct !DILexicalBlock(scope: !150, file: !2, line: 122, column: 3)
!153 = !DILocation(line: 122, column: 3, scope: !154)
!154 = distinct !DILexicalBlock(scope: !152, file: !2, line: 122, column: 3)
!155 = distinct !{!155, !149, !149, !156}
!156 = !{!"llvm.loop.mustprogress"}
!157 = !DILocation(line: 123, column: 15, scope: !47)
!158 = !DILocation(line: 123, column: 13, scope: !47)
!159 = !DILocation(line: 124, column: 14, scope: !47)
!160 = !DILocation(line: 124, column: 12, scope: !47)
!161 = !DILocation(line: 126, column: 8, scope: !47)
!162 = !DILocation(line: 126, column: 14, scope: !47)
!163 = !{!164, !121, i64 16}
!164 = !{!"Nodecount_tag", !121, i64 0, !121, i64 8, !121, i64 16, !121, i64 24, !124, i64 32, !165, i64 36, !165, i64 37}
!165 = !{!"_Bool", !117, i64 0}
!166 = !DILocation(line: 127, column: 16, scope: !47)
!167 = !DILocation(line: 127, column: 28, scope: !47)
!168 = !DILocation(line: 127, column: 8, scope: !47)
!169 = !DILocation(line: 127, column: 14, scope: !47)
!170 = !{!164, !121, i64 24}
!171 = !DILocation(line: 128, column: 8, scope: !47)
!172 = !DILocation(line: 128, column: 15, scope: !47)
!173 = !{!164, !121, i64 0}
!174 = !DILocation(line: 129, column: 8, scope: !47)
!175 = !DILocation(line: 129, column: 18, scope: !47)
!176 = !{!164, !121, i64 8}
!177 = !DILocation(line: 130, column: 8, scope: !47)
!178 = !DILocation(line: 130, column: 21, scope: !47)
!179 = !{!164, !124, i64 32}
!180 = !DILocation(line: 131, column: 8, scope: !47)
!181 = !DILocation(line: 131, column: 16, scope: !47)
!182 = !{!164, !165, i64 36}
!183 = !DILocation(line: 132, column: 8, scope: !47)
!184 = !DILocation(line: 132, column: 18, scope: !47)
!185 = !{!164, !165, i64 37}
!186 = !DILocation(line: 134, column: 3, scope: !108)
!187 = !DILocation(line: 134, column: 3, scope: !47)
!188 = !DILocation(line: 134, column: 3, scope: !107)
!189 = !DILocation(line: 134, column: 3, scope: !190)
!190 = distinct !DILexicalBlock(scope: !107, file: !2, line: 134, column: 3)
!191 = !DILocation(line: 134, column: 3, scope: !192)
!192 = distinct !DILexicalBlock(scope: !190, file: !2, line: 134, column: 3)
!193 = !DILocation(line: 134, column: 3, scope: !114)
!194 = !DILocation(line: 134, column: 3, scope: !113)
!195 = !DILocation(line: 134, column: 3, scope: !196)
!196 = distinct !DILexicalBlock(scope: !113, file: !2, line: 134, column: 3)
!197 = !DILocation(line: 134, column: 3, scope: !198)
!198 = distinct !DILexicalBlock(scope: !196, file: !2, line: 134, column: 3)
!199 = !DILocation(line: 134, column: 3, scope: !200)
!200 = distinct !DILexicalBlock(scope: !198, file: !2, line: 134, column: 3)
!201 = distinct !{!201, !195, !195, !156}
!202 = !{i64 0, i64 8, !120, i64 8, i64 8, !120, i64 16, i64 8, !120, i64 24, i64 8, !120, i64 32, i64 4, !123, i64 36, i64 1, !203, i64 37, i64 1, !203}
!203 = !{!165, !165, i64 0}
!204 = !DILocation(line: 134, column: 3, scope: !205)
!205 = distinct !DILexicalBlock(scope: !47, file: !2, line: 134, column: 3)
!206 = !DILocation(line: 134, column: 3, scope: !207)
!207 = distinct !DILexicalBlock(scope: !205, file: !2, line: 134, column: 3)
!208 = !DILocation(line: 136, column: 3, scope: !47)
!209 = !DILocation(line: 136, column: 11, scope: !47)
!210 = !DILocation(line: 136, column: 10, scope: !47)
!211 = !DILocation(line: 138, column: 23, scope: !212)
!212 = distinct !DILexicalBlock(scope: !47, file: !2, line: 137, column: 3)
!213 = !DILocation(line: 138, column: 35, scope: !212)
!214 = !DILocation(line: 138, column: 44, scope: !212)
!215 = !DILocation(line: 138, column: 17, scope: !212)
!216 = !DILocation(line: 138, column: 13, scope: !212)
!217 = !DILocation(line: 139, column: 9, scope: !218)
!218 = distinct !DILexicalBlock(scope: !212, file: !2, line: 139, column: 9)
!219 = !DILocation(line: 139, column: 18, scope: !218)
!220 = !{i8 0, i8 2}
!221 = !{}
!222 = !DILocation(line: 139, column: 9, scope: !212)
!223 = !DILocation(line: 141, column: 19, scope: !224)
!224 = distinct !DILexicalBlock(scope: !218, file: !2, line: 140, column: 5)
!225 = !DILocation(line: 141, column: 15, scope: !224)
!226 = !DILocation(line: 142, column: 10, scope: !227)
!227 = distinct !DILexicalBlock(scope: !224, file: !2, line: 142, column: 10)
!228 = !DILocation(line: 142, column: 10, scope: !224)
!229 = !DILocation(line: 146, column: 12, scope: !230)
!230 = distinct !DILexicalBlock(scope: !227, file: !2, line: 143, column: 7)
!231 = !DILocation(line: 146, column: 21, scope: !230)
!232 = !DILocation(line: 146, column: 32, scope: !230)
!233 = !DILocation(line: 146, column: 41, scope: !230)
!234 = !DILocation(line: 145, column: 9, scope: !230)
!235 = !DILocation(line: 147, column: 7, scope: !230)
!236 = !DILocation(line: 150, column: 36, scope: !237)
!237 = distinct !DILexicalBlock(scope: !227, file: !2, line: 149, column: 7)
!238 = !DILocation(line: 150, column: 9, scope: !237)
!239 = !DILocation(line: 152, column: 5, scope: !224)
!240 = !DILocation(line: 155, column: 28, scope: !241)
!241 = distinct !DILexicalBlock(scope: !218, file: !2, line: 154, column: 5)
!242 = !DILocation(line: 155, column: 35, scope: !241)
!243 = !DILocation(line: 156, column: 22, scope: !241)
!244 = !DILocation(line: 156, column: 32, scope: !241)
!245 = !DILocation(line: 156, column: 43, scope: !241)
!246 = !DILocation(line: 155, column: 7, scope: !241)
!247 = !DILocation(line: 157, column: 7, scope: !241)
!248 = !DILocation(line: 157, column: 16, scope: !241)
!249 = !DILocation(line: 157, column: 24, scope: !241)
!250 = distinct !{!250, !208, !251, !156}
!251 = !DILocation(line: 159, column: 3, scope: !47)
!252 = !DILocation(line: 160, column: 3, scope: !47)
!253 = !DILocation(line: 161, column: 3, scope: !47)
!254 = !DILocation(line: 162, column: 3, scope: !255)
!255 = distinct !DILexicalBlock(scope: !47, file: !2, line: 162, column: 3)
!256 = !DILocation(line: 162, column: 3, scope: !47)
!257 = !DILocation(line: 162, column: 3, scope: !258)
!258 = distinct !DILexicalBlock(scope: !255, file: !2, line: 162, column: 3)
!259 = !DILocation(line: 163, column: 1, scope: !47)
!260 = !DISubprogram(name: "gt_malloc_mem", scope: !261, file: !261, line: 56, type: !262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!262 = !DISubroutineType(types: !263)
!263 = !{!38, !109, !264, !90}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!265 = !DISubprogram(name: "gt_realloc_mem", scope: !261, file: !261, line: 69, type: !266, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!266 = !DISubroutineType(types: !267)
!267 = !{!38, !38, !109, !264, !90}
!268 = !DISubprogram(name: "gt_log_log", scope: !269, file: !269, line: 36, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!269 = !DIFile(filename: "src/core/log_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "f7489f6cc14a3d4074f12f5a7e69a42f")
!270 = !DISubroutineType(types: !271)
!271 = !{null, !264, null}
!272 = distinct !DISubprogram(name: "process_count_node", scope: !2, file: !2, line: 100, type: !273, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !276)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !275, !85}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!276 = !{!277, !278, !279}
!277 = !DILocalVariable(name: "stack", arg: 1, scope: !272, file: !2, line: 100, type: !275)
!278 = !DILocalVariable(name: "current", arg: 2, scope: !272, file: !2, line: 101, type: !85)
!279 = !DILocalVariable(name: "parent", scope: !272, file: !2, line: 103, type: !85)
!280 = !DILocation(line: 100, column: 50, scope: !272)
!281 = !DILocation(line: 101, column: 37, scope: !272)
!282 = !DILocation(line: 103, column: 3, scope: !272)
!283 = !DILocation(line: 103, column: 14, scope: !272)
!284 = !DILocation(line: 105, column: 14, scope: !272)
!285 = !DILocation(line: 105, column: 21, scope: !272)
!286 = !DILocation(line: 105, column: 27, scope: !272)
!287 = !DILocation(line: 105, column: 34, scope: !272)
!288 = !DILocation(line: 105, column: 45, scope: !272)
!289 = !DILocation(line: 105, column: 54, scope: !272)
!290 = !DILocation(line: 105, column: 43, scope: !272)
!291 = !DILocation(line: 105, column: 10, scope: !272)
!292 = !DILocation(line: 106, column: 21, scope: !272)
!293 = !DILocation(line: 106, column: 30, scope: !272)
!294 = !DILocation(line: 106, column: 3, scope: !272)
!295 = !DILocation(line: 106, column: 11, scope: !272)
!296 = !DILocation(line: 106, column: 18, scope: !272)
!297 = !DILocation(line: 107, column: 24, scope: !272)
!298 = !DILocation(line: 107, column: 33, scope: !272)
!299 = !DILocation(line: 107, column: 3, scope: !272)
!300 = !DILocation(line: 107, column: 11, scope: !272)
!301 = !DILocation(line: 107, column: 21, scope: !272)
!302 = !DILocation(line: 108, column: 1, scope: !272)
!303 = distinct !DISubprogram(name: "visit_count_children", scope: !2, file: !2, line: 32, type: !304, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !306)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !50, !85, !275, !94, !101, !39}
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !326, !327, !330, !338, !339}
!307 = !DILocalVariable(name: "index", arg: 1, scope: !303, file: !2, line: 32, type: !50)
!308 = !DILocalVariable(name: "parent", arg: 2, scope: !303, file: !2, line: 33, type: !85)
!309 = !DILocalVariable(name: "stack", arg: 3, scope: !303, file: !2, line: 34, type: !275)
!310 = !DILocalVariable(name: "tmpmbtab", arg: 4, scope: !303, file: !2, line: 35, type: !94)
!311 = !DILocalVariable(name: "rangeOccs", arg: 5, scope: !303, file: !2, line: 36, type: !101)
!312 = !DILocalVariable(name: "numofchars", arg: 6, scope: !303, file: !2, line: 37, type: !39)
!313 = !DILocalVariable(name: "rangesize", scope: !303, file: !2, line: 39, type: !35)
!314 = !DILocalVariable(name: "idx", scope: !303, file: !2, line: 39, type: !35)
!315 = !DILocalVariable(name: "num_special", scope: !303, file: !2, line: 39, type: !35)
!316 = !DILocalVariable(name: "offset", scope: !303, file: !2, line: 40, type: !39)
!317 = !DILocalVariable(name: "child", scope: !303, file: !2, line: 41, type: !71)
!318 = !DILocalVariable(name: "sizeoftype", scope: !319, file: !2, line: 69, type: !109)
!319 = distinct !DILexicalBlock(scope: !320, file: !2, line: 69, column: 7)
!320 = distinct !DILexicalBlock(scope: !321, file: !2, line: 69, column: 7)
!321 = distinct !DILexicalBlock(scope: !322, file: !2, line: 65, column: 5)
!322 = distinct !DILexicalBlock(scope: !323, file: !2, line: 64, column: 9)
!323 = distinct !DILexicalBlock(scope: !324, file: !2, line: 54, column: 3)
!324 = distinct !DILexicalBlock(scope: !325, file: !2, line: 53, column: 3)
!325 = distinct !DILexicalBlock(scope: !303, file: !2, line: 53, column: 3)
!326 = !DILocalVariable(name: "allocsize", scope: !319, file: !2, line: 69, type: !109)
!327 = !DILocalVariable(name: "stackidx", scope: !328, file: !2, line: 69, type: !35)
!328 = distinct !DILexicalBlock(scope: !329, file: !2, line: 69, column: 7)
!329 = distinct !DILexicalBlock(scope: !319, file: !2, line: 69, column: 7)
!330 = !DILocalVariable(name: "sizeoftype", scope: !331, file: !2, line: 90, type: !109)
!331 = distinct !DILexicalBlock(scope: !332, file: !2, line: 90, column: 11)
!332 = distinct !DILexicalBlock(scope: !333, file: !2, line: 90, column: 11)
!333 = distinct !DILexicalBlock(scope: !334, file: !2, line: 89, column: 9)
!334 = distinct !DILexicalBlock(scope: !335, file: !2, line: 84, column: 13)
!335 = distinct !DILexicalBlock(scope: !336, file: !2, line: 83, column: 7)
!336 = distinct !DILexicalBlock(scope: !337, file: !2, line: 76, column: 11)
!337 = distinct !DILexicalBlock(scope: !322, file: !2, line: 74, column: 5)
!338 = !DILocalVariable(name: "allocsize", scope: !331, file: !2, line: 90, type: !109)
!339 = !DILocalVariable(name: "stackidx", scope: !340, file: !2, line: 90, type: !35)
!340 = distinct !DILexicalBlock(scope: !341, file: !2, line: 90, column: 11)
!341 = distinct !DILexicalBlock(scope: !331, file: !2, line: 90, column: 11)
!342 = !DILocation(line: 32, column: 49, scope: !303)
!343 = !DILocation(line: 33, column: 39, scope: !303)
!344 = !DILocation(line: 34, column: 46, scope: !303)
!345 = !DILocation(line: 35, column: 35, scope: !303)
!346 = !DILocation(line: 36, column: 37, scope: !303)
!347 = !DILocation(line: 37, column: 51, scope: !303)
!348 = !DILocation(line: 39, column: 3, scope: !303)
!349 = !DILocation(line: 39, column: 11, scope: !303)
!350 = !DILocation(line: 39, column: 22, scope: !303)
!351 = !DILocation(line: 39, column: 27, scope: !303)
!352 = !DILocation(line: 40, column: 3, scope: !303)
!353 = !DILocation(line: 40, column: 16, scope: !303)
!354 = !DILocation(line: 41, column: 3, scope: !303)
!355 = !DILocation(line: 41, column: 13, scope: !303)
!356 = !DILocation(line: 43, column: 3, scope: !303)
!357 = !DILocation(line: 43, column: 3, scope: !358)
!358 = distinct !DILexicalBlock(scope: !359, file: !2, line: 43, column: 3)
!359 = distinct !DILexicalBlock(scope: !303, file: !2, line: 43, column: 3)
!360 = !DILocation(line: 43, column: 3, scope: !359)
!361 = !DILocation(line: 43, column: 3, scope: !362)
!362 = distinct !DILexicalBlock(scope: !358, file: !2, line: 43, column: 3)
!363 = !DILocation(line: 44, column: 49, scope: !303)
!364 = !DILocation(line: 45, column: 46, scope: !303)
!365 = !DILocation(line: 46, column: 46, scope: !303)
!366 = !DILocation(line: 47, column: 46, scope: !303)
!367 = !DILocation(line: 47, column: 54, scope: !303)
!368 = !DILocation(line: 48, column: 46, scope: !303)
!369 = !DILocation(line: 48, column: 54, scope: !303)
!370 = !DILocation(line: 44, column: 15, scope: !303)
!371 = !DILocation(line: 44, column: 13, scope: !303)
!372 = !DILocation(line: 49, column: 3, scope: !303)
!373 = !DILocation(line: 49, column: 3, scope: !374)
!374 = distinct !DILexicalBlock(scope: !375, file: !2, line: 49, column: 3)
!375 = distinct !DILexicalBlock(scope: !303, file: !2, line: 49, column: 3)
!376 = !DILocation(line: 49, column: 3, scope: !375)
!377 = !DILocation(line: 49, column: 3, scope: !378)
!378 = distinct !DILexicalBlock(scope: !374, file: !2, line: 49, column: 3)
!379 = !DILocation(line: 51, column: 10, scope: !303)
!380 = !DILocation(line: 52, column: 17, scope: !303)
!381 = !DILocation(line: 52, column: 25, scope: !303)
!382 = !DILocation(line: 52, column: 33, scope: !303)
!383 = !DILocation(line: 52, column: 41, scope: !303)
!384 = !DILocation(line: 52, column: 31, scope: !303)
!385 = !DILocation(line: 52, column: 15, scope: !303)
!386 = !DILocation(line: 53, column: 12, scope: !325)
!387 = !DILocation(line: 53, column: 8, scope: !325)
!388 = !DILocation(line: 53, column: 17, scope: !324)
!389 = !DILocation(line: 53, column: 23, scope: !324)
!390 = !DILocation(line: 53, column: 21, scope: !324)
!391 = !DILocation(line: 53, column: 3, scope: !325)
!392 = !DILocation(line: 55, column: 19, scope: !323)
!393 = !DILocation(line: 55, column: 28, scope: !323)
!394 = !DILocation(line: 55, column: 33, scope: !323)
!395 = !{!396, !121, i64 0}
!396 = !{!"", !121, i64 0, !121, i64 8}
!397 = !DILocation(line: 55, column: 11, scope: !323)
!398 = !DILocation(line: 55, column: 17, scope: !323)
!399 = !DILocation(line: 56, column: 19, scope: !323)
!400 = !DILocation(line: 56, column: 28, scope: !323)
!401 = !DILocation(line: 56, column: 33, scope: !323)
!402 = !{!396, !121, i64 8}
!403 = !DILocation(line: 56, column: 11, scope: !323)
!404 = !DILocation(line: 56, column: 17, scope: !323)
!405 = !DILocation(line: 57, column: 11, scope: !323)
!406 = !DILocation(line: 57, column: 18, scope: !323)
!407 = !DILocation(line: 58, column: 11, scope: !323)
!408 = !DILocation(line: 58, column: 21, scope: !323)
!409 = !DILocation(line: 59, column: 26, scope: !323)
!410 = !DILocation(line: 59, column: 33, scope: !323)
!411 = !DILocation(line: 59, column: 11, scope: !323)
!412 = !DILocation(line: 59, column: 24, scope: !323)
!413 = !DILocation(line: 60, column: 11, scope: !323)
!414 = !DILocation(line: 60, column: 19, scope: !323)
!415 = !DILocation(line: 61, column: 11, scope: !323)
!416 = !DILocation(line: 61, column: 21, scope: !323)
!417 = !DILocation(line: 64, column: 15, scope: !322)
!418 = !DILocation(line: 64, column: 29, scope: !322)
!419 = !DILocation(line: 64, column: 21, scope: !322)
!420 = !DILocation(line: 64, column: 38, scope: !322)
!421 = !DILocation(line: 64, column: 46, scope: !322)
!422 = !DILocation(line: 64, column: 54, scope: !322)
!423 = !DILocation(line: 64, column: 62, scope: !322)
!424 = !DILocation(line: 64, column: 52, scope: !322)
!425 = !DILocation(line: 64, column: 35, scope: !322)
!426 = !DILocation(line: 64, column: 9, scope: !323)
!427 = !DILocation(line: 67, column: 13, scope: !321)
!428 = !DILocation(line: 67, column: 23, scope: !321)
!429 = !DILocation(line: 68, column: 7, scope: !321)
!430 = !DILocation(line: 68, column: 15, scope: !321)
!431 = !DILocation(line: 68, column: 24, scope: !321)
!432 = !DILocation(line: 69, column: 7, scope: !320)
!433 = !DILocation(line: 69, column: 7, scope: !321)
!434 = !DILocation(line: 69, column: 7, scope: !319)
!435 = !DILocation(line: 69, column: 7, scope: !436)
!436 = distinct !DILexicalBlock(scope: !319, file: !2, line: 69, column: 7)
!437 = !DILocation(line: 69, column: 7, scope: !438)
!438 = distinct !DILexicalBlock(scope: !436, file: !2, line: 69, column: 7)
!439 = !DILocation(line: 69, column: 7, scope: !329)
!440 = !DILocation(line: 69, column: 7, scope: !328)
!441 = !DILocation(line: 69, column: 7, scope: !442)
!442 = distinct !DILexicalBlock(scope: !328, file: !2, line: 69, column: 7)
!443 = !DILocation(line: 69, column: 7, scope: !444)
!444 = distinct !DILexicalBlock(scope: !442, file: !2, line: 69, column: 7)
!445 = !DILocation(line: 69, column: 7, scope: !446)
!446 = distinct !DILexicalBlock(scope: !444, file: !2, line: 69, column: 7)
!447 = distinct !{!447, !441, !441, !156}
!448 = !DILocation(line: 69, column: 7, scope: !449)
!449 = distinct !DILexicalBlock(scope: !321, file: !2, line: 69, column: 7)
!450 = !DILocation(line: 69, column: 7, scope: !451)
!451 = distinct !DILexicalBlock(scope: !449, file: !2, line: 69, column: 7)
!452 = !DILocation(line: 70, column: 19, scope: !321)
!453 = !DILocation(line: 71, column: 13, scope: !321)
!454 = !DILocation(line: 72, column: 5, scope: !321)
!455 = !DILocation(line: 76, column: 17, scope: !336)
!456 = !DILocation(line: 76, column: 23, scope: !336)
!457 = !DILocation(line: 76, column: 36, scope: !336)
!458 = !DILocation(line: 76, column: 27, scope: !336)
!459 = !DILocation(line: 76, column: 11, scope: !337)
!460 = !DILocation(line: 78, column: 9, scope: !461)
!461 = distinct !DILexicalBlock(scope: !336, file: !2, line: 77, column: 7)
!462 = !DILocation(line: 78, column: 17, scope: !461)
!463 = !DILocation(line: 78, column: 23, scope: !461)
!464 = !DILocation(line: 79, column: 20, scope: !461)
!465 = !DILocation(line: 80, column: 7, scope: !461)
!466 = !DILocation(line: 84, column: 19, scope: !334)
!467 = !DILocation(line: 84, column: 34, scope: !334)
!468 = !DILocation(line: 84, column: 25, scope: !334)
!469 = !DILocation(line: 84, column: 13, scope: !335)
!470 = !DILocation(line: 87, column: 9, scope: !471)
!471 = distinct !DILexicalBlock(scope: !334, file: !2, line: 85, column: 9)
!472 = !DILocation(line: 90, column: 11, scope: !332)
!473 = !DILocation(line: 90, column: 11, scope: !333)
!474 = !DILocation(line: 90, column: 11, scope: !331)
!475 = !DILocation(line: 90, column: 11, scope: !476)
!476 = distinct !DILexicalBlock(scope: !331, file: !2, line: 90, column: 11)
!477 = !DILocation(line: 90, column: 11, scope: !478)
!478 = distinct !DILexicalBlock(scope: !476, file: !2, line: 90, column: 11)
!479 = !DILocation(line: 90, column: 11, scope: !341)
!480 = !DILocation(line: 90, column: 11, scope: !340)
!481 = !DILocation(line: 90, column: 11, scope: !482)
!482 = distinct !DILexicalBlock(scope: !340, file: !2, line: 90, column: 11)
!483 = !DILocation(line: 90, column: 11, scope: !484)
!484 = distinct !DILexicalBlock(scope: !482, file: !2, line: 90, column: 11)
!485 = !DILocation(line: 90, column: 11, scope: !486)
!486 = distinct !DILexicalBlock(scope: !484, file: !2, line: 90, column: 11)
!487 = distinct !{!487, !481, !481, !156}
!488 = !DILocation(line: 90, column: 11, scope: !489)
!489 = distinct !DILexicalBlock(scope: !333, file: !2, line: 90, column: 11)
!490 = !DILocation(line: 90, column: 11, scope: !491)
!491 = distinct !DILexicalBlock(scope: !489, file: !2, line: 90, column: 11)
!492 = !DILocation(line: 91, column: 17, scope: !333)
!493 = !DILocation(line: 92, column: 33, scope: !333)
!494 = !DILocation(line: 92, column: 47, scope: !333)
!495 = !DILocation(line: 92, column: 39, scope: !333)
!496 = !DILocation(line: 92, column: 23, scope: !333)
!497 = !DILocation(line: 96, column: 3, scope: !323)
!498 = !DILocation(line: 53, column: 37, scope: !324)
!499 = !DILocation(line: 53, column: 3, scope: !324)
!500 = distinct !{!500, !391, !501, !156}
!501 = !DILocation(line: 96, column: 3, scope: !325)
!502 = !DILocation(line: 97, column: 21, scope: !303)
!503 = !DILocation(line: 97, column: 3, scope: !303)
!504 = !DILocation(line: 97, column: 11, scope: !303)
!505 = !DILocation(line: 97, column: 18, scope: !303)
!506 = !DILocation(line: 98, column: 1, scope: !303)
!507 = !DISubprogram(name: "gt_free_mem", scope: !261, file: !261, line: 75, type: !508, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !38, !264, !90}
!510 = !DISubprogram(name: "fprintf", scope: !511, file: !511, line: 350, type: !512, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!511 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!512 = !DISubroutineType(types: !513)
!513 = !{!90, !514, !572, null}
!514 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !517, line: 7, baseType: !518)
!517 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !519, line: 49, size: 1728, elements: !520)
!519 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!520 = !{!521, !522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !537, !539, !540, !541, !545, !547, !549, !553, !556, !558, !561, !564, !565, !566, !567, !568}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !518, file: !519, line: 51, baseType: !90, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !518, file: !519, line: 54, baseType: !523, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !518, file: !519, line: 55, baseType: !523, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !518, file: !519, line: 56, baseType: !523, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !518, file: !519, line: 57, baseType: !523, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !518, file: !519, line: 58, baseType: !523, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !518, file: !519, line: 59, baseType: !523, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !518, file: !519, line: 60, baseType: !523, size: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !518, file: !519, line: 61, baseType: !523, size: 64, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !518, file: !519, line: 64, baseType: !523, size: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !518, file: !519, line: 65, baseType: !523, size: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !518, file: !519, line: 66, baseType: !523, size: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !518, file: !519, line: 68, baseType: !535, size: 64, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !519, line: 36, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !518, file: !519, line: 70, baseType: !538, size: 64, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !518, file: !519, line: 72, baseType: !90, size: 32, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !518, file: !519, line: 73, baseType: !90, size: 32, offset: 928)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !518, file: !519, line: 74, baseType: !542, size: 64, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !543, line: 152, baseType: !544)
!543 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!544 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !518, file: !519, line: 77, baseType: !546, size: 16, offset: 1024)
!546 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !518, file: !519, line: 78, baseType: !548, size: 8, offset: 1040)
!548 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !518, file: !519, line: 79, baseType: !550, size: 8, offset: 1048)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 1)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !518, file: !519, line: 81, baseType: !554, size: 64, offset: 1088)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !519, line: 43, baseType: null)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !518, file: !519, line: 89, baseType: !557, size: 64, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !543, line: 153, baseType: !544)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !518, file: !519, line: 91, baseType: !559, size: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !519, line: 37, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !518, file: !519, line: 92, baseType: !562, size: 64, offset: 1280)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !519, line: 38, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !518, file: !519, line: 93, baseType: !538, size: 64, offset: 1344)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !518, file: !519, line: 94, baseType: !38, size: 64, offset: 1408)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !518, file: !519, line: 95, baseType: !109, size: 64, offset: 1472)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !518, file: !519, line: 96, baseType: !90, size: 32, offset: 1536)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !518, file: !519, line: 98, baseType: !569, size: 160, offset: 1568)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 20)
!572 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !264)
!573 = !DISubprogram(name: "abort", scope: !574, file: !574, line: 598, type: !575, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!574 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!575 = !DISubroutineType(types: !576)
!576 = !{null}
!577 = !DISubprogram(name: "gt_bwtrangesplitallwithoutspecial", scope: !53, file: !53, line: 126, type: !578, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!578 = !DISubroutineType(types: !579)
!579 = !{!35, !94, !101, !50, !35, !35}
