; ModuleID = 'samples/350.bc'
source_filename = "pfmlib_intel_tmt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.intel_x86_entry_t = type { ptr, ptr, ptr, i64, i32, i32, i32, i32, i32, i16, i16, ptr }
%struct.pfmlib_attr_desc_t = type { ptr, ptr, i32 }
%struct.pfmlib_pmu = type { ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, [3 x ptr], [3 x ptr], [3 x ptr], ptr, ptr, ptr, ptr }
%struct.intel_x86_umask_t = type { ptr, ptr, ptr, i64, i64, [2 x i64], i32, i16, i16, i32, i32 }
%struct.pfm_intel_x86_config_t = type { i32, i32, i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"Intel Tremont\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c"tmt\00", align 1, !dbg !7

!513 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL3_L3C5", value: 493)
!514 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL3_L3C6", value: 494)
!515 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL3_L3C7", value: 495)
!516 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C24", value: 496)
!517 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C25", value: 497)
!518 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C26", value: 498)
!519 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C27", value: 499)
!520 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C28", value: 500)
!521 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C29", value: 501)
!522 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C30", value: 502)
!523 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C31", value: 503)
!524 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C16", value: 504)
!525 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C17", value: 505)
!526 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C18", value: 506)
!527 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C19", value: 507)
!528 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C20", value: 508)
!529 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C21", value: 509)
!530 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C22", value: 510)
!531 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C23", value: 511)
!532 = !DIEnumerator(name: "PFM_PMU_INTEL_SPR", value: 512)
!533 = !DIEnumerator(name: "PFM_PMU_POWER10", value: 513)
!534 = !DIEnumerator(name: "PFM_PMU_AMD64_FAM19H_ZEN4", value: 514)
!535 = !DIEnumerator(name: "PFM_PMU_ARM_V1", value: 515)
!536 = !DIEnumerator(name: "PFM_PMU_ARM_V2", value: 516)
!537 = !DIEnumerator(name: "PFM_PMU_MAX", value: 517)
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 647, baseType: !18, size: 32, elements: !539)
!539 = !{!540, !541, !542, !543, !544}
!540 = !DIEnumerator(name: "PFM_PMU_TYPE_UNKNOWN", value: 0)
!541 = !DIEnumerator(name: "PFM_PMU_TYPE_CORE", value: 1)
!542 = !DIEnumerator(name: "PFM_PMU_TYPE_UNCORE", value: 2)
!543 = !DIEnumerator(name: "PFM_PMU_TYPE_OS_GENERIC", value: 3)
!544 = !DIEnumerator(name: "PFM_PMU_TYPE_MAX", value: 4)
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 655, baseType: !18, size: 32, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552}
!547 = !DIEnumerator(name: "PFM_ATTR_NONE", value: 0)
!548 = !DIEnumerator(name: "PFM_ATTR_UMASK", value: 1)
!549 = !DIEnumerator(name: "PFM_ATTR_MOD_BOOL", value: 2)
!550 = !DIEnumerator(name: "PFM_ATTR_MOD_INTEGER", value: 3)
!551 = !DIEnumerator(name: "PFM_ATTR_RAW_UMASK", value: 4)
!552 = !DIEnumerator(name: "PFM_ATTR_MAX", value: 5)
!553 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 669, baseType: !18, size: 32, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562}
!555 = !DIEnumerator(name: "PFM_DTYPE_UNKNOWN", value: 0)
!556 = !DIEnumerator(name: "PFM_DTYPE_UINT64", value: 1)
!557 = !DIEnumerator(name: "PFM_DTYPE_INT64", value: 2)
!558 = !DIEnumerator(name: "PFM_DTYPE_DOUBLE", value: 3)
!559 = !DIEnumerator(name: "PFM_DTYPE_FIXED", value: 4)
!560 = !DIEnumerator(name: "PFM_DTYPE_RATIO", value: 5)
!561 = !DIEnumerator(name: "PFM_DTYPE_CHAR8", value: 6)
!562 = !DIEnumerator(name: "PFM_DTYPE_MAX", value: 7)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 685, baseType: !18, size: 32, elements: !564)
!564 = !{!565, !566, !567, !568}
!565 = !DIEnumerator(name: "PFM_ATTR_CTRL_UNKNOWN", value: 0)
!566 = !DIEnumerator(name: "PFM_ATTR_CTRL_PMU", value: 1)
!567 = !DIEnumerator(name: "PFM_ATTR_CTRL_PERF_EVENT", value: 2)
!568 = !DIEnumerator(name: "PFM_ATTR_CTRL_MAX", value: 3)
!569 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 697, baseType: !18, size: 32, elements: !570)
!570 = !{!571, !572, !573, !574}
!571 = !DIEnumerator(name: "PFM_OS_NONE", value: 0)
!572 = !DIEnumerator(name: "PFM_OS_PERF_EVENT", value: 1)
!573 = !DIEnumerator(name: "PFM_OS_PERF_EVENT_EXT", value: 2)
!574 = !DIEnumerator(name: "PFM_OS_MAX", value: 3)
!575 = !{!0, !7, !576, !822, !828, !833, !838, !840, !842, !847, !849, !854, !856, !861, !866, !868, !873, !878, !883, !888, !893, !898, !900, !905, !907, !909, !914, !919, !924, !929, !934, !939, !944, !946, !951, !956, !958, !963, !965, !970, !972, !12, !974, !976, !981, !986, !991, !996, !999, !1004, !1026, !1031, !1036, !1038, !1043, !1045, !1047, !1049, !1054, !1056, !1059, !1064, !1066, !1071, !1074, !1076, !1079, !1084, !1086, !1088, !1090, !1092, !1097, !1099, !1101, !1106, !1108, !1113, !1118, !1120, !1122, !1127, !1129, !1131, !1136, !1138, !1140, !1142, !1144, !1146, !1148, !1150, !1155, !1157, !1159, !1164, !1166}
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "intel_tmt_support", scope: !14, file: !2, line: 43, type: !578, isLocal: false, isDefinition: true)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfmlib_pmu_t", file: !579, line: 173, baseType: !580)
!579 = !DIFile(filename: "./pfmlib_priv.h", directory: "/local-ssd/libpfm4-eymjeez6kzzocrqb5p6y26hpb2o7cj4q-build/aidengro/spack-stage-libpfm4-4.13.0-eymjeez6kzzocrqb5p6y26hpb2o7cj4q/spack-src/lib", checksumkind: CSK_MD5, checksum: "ac9ad89eb80b3c522b78dc9cc620bd5b")
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pfmlib_pmu", file: !579, line: 130, size: 2240, elements: !581)
!581 = !{!582, !585, !586, !587, !589, !591, !592, !593, !594, !595, !596, !597, !599, !602, !612, !614, !616, !621, !622, !626, !627, !631, !664, !668, !669, !673, !705, !747, !752, !754, !813, !814, !818}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !580, file: !579, line: 131, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !580, file: !579, line: 132, baseType: !583, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "perf_name", scope: !580, file: !579, line: 133, baseType: !583, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pmu", scope: !580, file: !579, line: 134, baseType: !588, size: 32, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_pmu_t", file: !17, line: 645, baseType: !16)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pme_count", scope: !580, file: !579, line: 135, baseType: !590, size: 32, offset: 224)
!590 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "max_encoding", scope: !580, file: !579, line: 136, baseType: !590, size: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !580, file: !579, line: 137, baseType: !590, size: 32, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pmu_rev", scope: !580, file: !579, line: 138, baseType: !590, size: 32, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "num_cntrs", scope: !580, file: !579, line: 139, baseType: !590, size: 32, offset: 352)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "num_fixed_cntrs", scope: !580, file: !579, line: 140, baseType: !590, size: 32, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "supported_plm", scope: !580, file: !579, line: 141, baseType: !590, size: 32, offset: 416)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !580, file: !579, line: 143, baseType: !598, size: 32, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_pmu_type_t", file: !17, line: 653, baseType: !538)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !580, file: !579, line: 144, baseType: !600, size: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "atdesc", scope: !580, file: !579, line: 146, baseType: !603, size: 64, offset: 576)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfmlib_attr_desc_t", file: !579, line: 60, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !579, line: 56, size: 192, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !606, file: !579, line: 57, baseType: !583, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !606, file: !579, line: 58, baseType: !583, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !606, file: !579, line: 59, baseType: !611, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_attr_t", file: !17, line: 663, baseType: !545)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_family", scope: !580, file: !579, line: 148, baseType: !613, size: 32, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_models", scope: !580, file: !579, line: 149, baseType: !615, size: 64, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pmu_detect", scope: !580, file: !579, line: 151, baseType: !617, size: 64, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!590, !620}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pmu_init", scope: !580, file: !579, line: 152, baseType: !617, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pmu_terminate", scope: !580, file: !579, line: 153, baseType: !623, size: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !620}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_first", scope: !580, file: !579, line: 154, baseType: !617, size: 64, offset: 960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_next", scope: !580, file: !579, line: 155, baseType: !628, size: 64, offset: 1024)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!590, !620, !590}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_info", scope: !580, file: !579, line: 156, baseType: !632, size: 64, offset: 1088)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!590, !620, !590, !635}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_event_info_t", file: !17, line: 768, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 751, size: 512, elements: !638)
!638 = !{!639, !640, !641, !642, !646, !651, !652, !654, !655, !656, !657}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !637, file: !17, line: 752, baseType: !583, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !637, file: !17, line: 753, baseType: !583, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "equiv", scope: !637, file: !17, line: 754, baseType: !583, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !637, file: !17, line: 755, baseType: !643, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !644, line: 70, baseType: !645)
!644 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!645 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !637, file: !17, line: 756, baseType: !647, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !648, line: 27, baseType: !649)
!648 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !650, line: 45, baseType: !645)
!650 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pmu", scope: !637, file: !17, line: 757, baseType: !588, size: 32, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !637, file: !17, line: 758, baseType: !653, size: 32, offset: 352)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_dtype_t", file: !17, line: 679, baseType: !553)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !637, file: !17, line: 759, baseType: !590, size: 32, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nattrs", scope: !637, file: !17, line: 760, baseType: !590, size: 32, offset: 416)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !637, file: !17, line: 761, baseType: !590, size: 32, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, scope: !637, file: !17, line: 762, baseType: !658, size: 32, offset: 480)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !637, file: !17, line: 762, size: 32, elements: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "is_precise", scope: !658, file: !17, line: 763, baseType: !18, size: 1, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "is_speculative", scope: !658, file: !17, line: 764, baseType: !18, size: 2, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "support_hw_smpl", scope: !658, file: !17, line: 765, baseType: !18, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bits", scope: !658, file: !17, line: 766, baseType: !18, size: 28, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_nattrs", scope: !580, file: !579, line: 157, baseType: !665, size: 64, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!18, !620, !590}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "event_is_valid", scope: !580, file: !579, line: 158, baseType: !628, size: 64, offset: 1216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "can_auto_encode", scope: !580, file: !579, line: 159, baseType: !670, size: 64, offset: 1280)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!590, !620, !590, !590}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_attr_info", scope: !580, file: !579, line: 161, baseType: !674, size: 64, offset: 1344)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!590, !620, !590, !590, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfmlib_event_attr_info_t", file: !579, line: 86, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !579, line: 62, size: 576, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !689, !690, !698}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !679, file: !579, line: 63, baseType: !583, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !679, file: !579, line: 64, baseType: !583, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "equiv", scope: !679, file: !579, line: 65, baseType: !583, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !679, file: !579, line: 66, baseType: !643, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !679, file: !579, line: 67, baseType: !647, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !679, file: !579, line: 68, baseType: !611, size: 32, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !679, file: !579, line: 69, baseType: !688, size: 32, offset: 352)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_attr_ctrl_t", file: !17, line: 691, baseType: !563)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !679, file: !579, line: 71, baseType: !647, size: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !579, line: 73, baseType: !691, size: 32, offset: 448)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !679, file: !579, line: 73, size: 32, elements: !692)
!692 = !{!693, !694, !695, !696, !697}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "is_dfl", scope: !691, file: !579, line: 74, baseType: !18, size: 1, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "is_precise", scope: !691, file: !579, line: 75, baseType: !18, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "is_speculative", scope: !691, file: !579, line: 76, baseType: !18, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "support_hw_smpl", scope: !691, file: !579, line: 77, baseType: !18, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bits", scope: !691, file: !579, line: 78, baseType: !18, size: 27, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !579, line: 80, baseType: !699, size: 64, offset: 512)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !679, file: !579, line: 80, size: 64, elements: !700)
!700 = !{!701, !702, !703, !704}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dfl_val64", scope: !699, file: !579, line: 81, baseType: !647, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dfl_str", scope: !699, file: !579, line: 82, baseType: !583, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dfl_bool", scope: !699, file: !579, line: 83, baseType: !590, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dfl_int", scope: !699, file: !579, line: 84, baseType: !590, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_encoding", scope: !580, file: !579, line: 162, baseType: !706, size: 192, offset: 1408)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 192, elements: !745)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!590, !620, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfmlib_event_desc_t", file: !579, line: 126, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !579, line: 112, size: 10880, elements: !713)
!713 = !{!714, !716, !717, !718, !719, !720, !722, !723, !737, !738, !742, !744}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pmu", scope: !712, file: !579, line: 113, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dfl_plm", scope: !712, file: !579, line: 114, baseType: !590, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !712, file: !579, line: 115, baseType: !590, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "npattrs", scope: !712, file: !579, line: 116, baseType: !590, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nattrs", scope: !712, file: !579, line: 117, baseType: !590, size: 32, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "osid", scope: !712, file: !579, line: 118, baseType: !721, size: 32, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_os_t", file: !17, line: 703, baseType: !569)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !712, file: !579, line: 119, baseType: !590, size: 32, offset: 224)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !712, file: !579, line: 120, baseType: !724, size: 8192, offset: 256)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 8192, elements: !735)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfmlib_attr_t", file: !579, line: 97, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !579, line: 91, size: 128, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !726, file: !579, line: 92, baseType: !590, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, scope: !726, file: !579, line: 93, baseType: !730, size: 64, offset: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !726, file: !579, line: 93, size: 64, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ival", scope: !730, file: !579, line: 94, baseType: !647, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "sval", scope: !730, file: !579, line: 95, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!735 = !{!736}
!736 = !DISubrange(count: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pattrs", scope: !712, file: !579, line: 122, baseType: !677, size: 64, offset: 8448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fstr", scope: !712, file: !579, line: 123, baseType: !739, size: 2048, offset: 8512)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "codes", scope: !712, file: !579, line: 124, baseType: !743, size: 256, offset: 10560)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 256, elements: !10)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "os_data", scope: !712, file: !579, line: 125, baseType: !620, size: 64, offset: 10816)
!745 = !{!746}
!746 = !DISubrange(count: 3)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "validate_pattrs", scope: !580, file: !579, line: 164, baseType: !748, size: 192, offset: 1600)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 192, elements: !745)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !620, !710}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "os_detect", scope: !580, file: !579, line: 165, baseType: !753, size: 192, offset: 1792)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 192, elements: !745)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "validate_table", scope: !580, file: !579, line: 166, baseType: !755, size: 64, offset: 1984)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!590, !620, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !760, line: 7, baseType: !761)
!760 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !762, line: 49, size: 1728, elements: !763)
!762 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !779, !781, !782, !783, !786, !788, !790, !794, !797, !799, !802, !805, !806, !807, !808, !809}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !761, file: !762, line: 51, baseType: !590, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !761, file: !762, line: 54, baseType: !734, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !761, file: !762, line: 55, baseType: !734, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !761, file: !762, line: 56, baseType: !734, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !761, file: !762, line: 57, baseType: !734, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !761, file: !762, line: 58, baseType: !734, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !761, file: !762, line: 59, baseType: !734, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !761, file: !762, line: 60, baseType: !734, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !761, file: !762, line: 61, baseType: !734, size: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !761, file: !762, line: 64, baseType: !734, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !761, file: !762, line: 65, baseType: !734, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !761, file: !762, line: 66, baseType: !734, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !761, file: !762, line: 68, baseType: !777, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !762, line: 36, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !761, file: !762, line: 70, baseType: !780, size: 64, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !761, file: !762, line: 72, baseType: !590, size: 32, offset: 896)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !761, file: !762, line: 73, baseType: !590, size: 32, offset: 928)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !761, file: !762, line: 74, baseType: !784, size: 64, offset: 960)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !650, line: 152, baseType: !785)
!785 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !761, file: !762, line: 77, baseType: !787, size: 16, offset: 1024)
!787 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !761, file: !762, line: 78, baseType: !789, size: 8, offset: 1040)
!789 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !761, file: !762, line: 79, baseType: !791, size: 8, offset: 1048)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 1)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !761, file: !762, line: 81, baseType: !795, size: 64, offset: 1088)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !762, line: 43, baseType: null)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !761, file: !762, line: 89, baseType: !798, size: 64, offset: 1152)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !650, line: 153, baseType: !785)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !761, file: !762, line: 91, baseType: !800, size: 64, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !762, line: 37, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !761, file: !762, line: 92, baseType: !803, size: 64, offset: 1280)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !762, line: 38, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !761, file: !762, line: 93, baseType: !780, size: 64, offset: 1344)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !761, file: !762, line: 94, baseType: !620, size: 64, offset: 1408)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !761, file: !762, line: 95, baseType: !643, size: 64, offset: 1472)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !761, file: !762, line: 96, baseType: !590, size: 32, offset: 1536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !761, file: !762, line: 98, baseType: !810, size: 160, offset: 1568)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 20)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "get_num_events", scope: !580, file: !579, line: 170, baseType: !617, size: 64, offset: 2048)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "display_reg", scope: !580, file: !579, line: 171, baseType: !815, size: 64, offset: 2112)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !620, !710, !620}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "match_event", scope: !580, file: !579, line: 172, baseType: !819, size: 64, offset: 2176)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!590, !620, !710, !583, !583}
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !824, line: 235, type: !825, isLocal: true, isDefinition: true)
!824 = !DIFile(filename: "./events/intel_tmt_events.h", directory: "/local-ssd/libpfm4-eymjeez6kzzocrqb5p6y26hpb2o7cj4q-build/aidengro/spack-stage-libpfm4-4.13.0-eymjeez6kzzocrqb5p6y26hpb2o7cj4q/spack-src/lib", checksumkind: CSK_MD5, checksum: "495671df97c4874f5ea371f1a831e244")
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 21)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !824, line: 236, type: !830, isLocal: true, isDefinition: true)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 760, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 95)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !824, line: 241, type: !835, isLocal: true, isDefinition: true)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 26)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !824, line: 242, type: !835, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !824, line: 248, type: !810, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !824, line: 249, type: !844, isLocal: true, isDefinition: true)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 37)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !824, line: 254, type: !825, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !824, line: 255, type: !851, isLocal: true, isDefinition: true)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 41)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !824, line: 261, type: !9, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !824, line: 262, type: !858, isLocal: true, isDefinition: true)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 54)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !824, line: 263, type: !863, isLocal: true, isDefinition: true)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 19)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !824, line: 282, type: !863, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !824, line: 292, type: !870, isLocal: true, isDefinition: true)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 22)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !824, line: 293, type: !875, isLocal: true, isDefinition: true)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 71)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !824, line: 302, type: !880, isLocal: true, isDefinition: true)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 17)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !824, line: 303, type: !885, isLocal: true, isDefinition: true)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 40)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !824, line: 312, type: !890, isLocal: true, isDefinition: true)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 16)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !824, line: 313, type: !895, isLocal: true, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1040, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 130)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !824, line: 322, type: !890, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !824, line: 323, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 63)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !824, line: 332, type: !890, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !824, line: 333, type: !875, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !824, line: 342, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 15)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !824, line: 343, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1000, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 125)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !824, line: 352, type: !921, isLocal: true, isDefinition: true)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 12)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !824, line: 353, type: !926, isLocal: true, isDefinition: true)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 62)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !824, line: 362, type: !931, isLocal: true, isDefinition: true)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 5)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !824, line: 363, type: !936, isLocal: true, isDefinition: true)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 784, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 98)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !824, line: 372, type: !941, isLocal: true, isDefinition: true)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 7)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !824, line: 373, type: !895, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !824, line: 382, type: !948, isLocal: true, isDefinition: true)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 18)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !824, line: 383, type: !953, isLocal: true, isDefinition: true)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 61)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !824, line: 392, type: !948, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !824, line: 393, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1352, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 169)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !824, line: 402, type: !880, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !824, line: 403, type: !967, isLocal: true, isDefinition: true)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 55)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !824, line: 412, type: !880, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !824, line: 413, type: !902, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !824, line: 29, type: !863, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !824, line: 30, type: !978, isLocal: true, isDefinition: true)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1264, elements: !979)
!979 = !{!980}
!980 = !DISubrange(count: 158)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !824, line: 34, type: !983, isLocal: true, isDefinition: true)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 24)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !824, line: 35, type: !988, isLocal: true, isDefinition: true)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1184, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 148)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !824, line: 39, type: !993, isLocal: true, isDefinition: true)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 23)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !824, line: 40, type: !998, isLocal: true, isDefinition: true)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !735)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !824, line: 44, type: !1001, isLocal: true, isDefinition: true)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 28)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "intel_tmt_ocr", scope: !14, file: !824, line: 28, type: !1006, isLocal: true, isDefinition: true)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 2304, elements: !10)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "intel_x86_umask_t", file: !1009, line: 59, baseType: !1010)
!1009 = !DIFile(filename: "./pfmlib_intel_x86_priv.h", directory: "/local-ssd/libpfm4-eymjeez6kzzocrqb5p6y26hpb2o7cj4q-build/aidengro/spack-stage-libpfm4-4.13.0-eymjeez6kzzocrqb5p6y26hpb2o7cj4q/spack-src/lib", checksumkind: CSK_MD5, checksum: "809af466a24857bdd89f02c5468d86f0")
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1009, line: 42, size: 576, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1021, !1022, !1023, !1024, !1025}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !1010, file: !1009, line: 43, baseType: !583, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "udesc", scope: !1010, file: !1009, line: 44, baseType: !583, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "uequiv", scope: !1010, file: !1009, line: 45, baseType: !583, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ucntmsk", scope: !1010, file: !1009, line: 46, baseType: !647, size: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ucode", scope: !1010, file: !1009, line: 47, baseType: !647, size: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ufilters", scope: !1010, file: !1009, line: 53, baseType: !1018, size: 128, offset: 320)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 128, elements: !1019)
!1019 = !{!1020}
!1020 = !DISubrange(count: 2)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "uflags", scope: !1010, file: !1009, line: 54, baseType: !18, size: 32, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "umodel", scope: !1010, file: !1009, line: 55, baseType: !787, size: 16, offset: 480)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "grpid", scope: !1010, file: !1009, line: 56, baseType: !787, size: 16, offset: 496)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "modhw", scope: !1010, file: !1009, line: 57, baseType: !18, size: 32, offset: 512)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "umodmsk_req", scope: !1010, file: !1009, line: 58, baseType: !18, size: 32, offset: 544)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(scope: null, file: !824, line: 52, type: !1028, isLocal: true, isDefinition: true)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 8)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !824, line: 53, type: !1033, isLocal: true, isDefinition: true)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 70)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !824, line: 57, type: !1028, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !824, line: 58, type: !1040, isLocal: true, isDefinition: true)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !1041)
!1041 = !{!1042}
!1042 = !DISubrange(count: 75)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !824, line: 62, type: !941, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !824, line: 63, type: !1033, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !824, line: 67, type: !941, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !824, line: 68, type: !1051, isLocal: true, isDefinition: true)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !1052)
!1052 = !{!1053}
!1053 = !DISubrange(count: 69)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !824, line: 72, type: !941, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(name: "intel_tmt_mem_load_uops_retired", scope: !14, file: !824, line: 51, type: !1058, isLocal: true, isDefinition: true)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 2880, elements: !932)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !824, line: 80, type: !1061, isLocal: true, isDefinition: true)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 11)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(scope: null, file: !824, line: 81, type: !851, isLocal: true, isDefinition: true)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(scope: null, file: !824, line: 85, type: !1068, isLocal: true, isDefinition: true)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 10)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(name: "intel_tmt_mem_uops_retired", scope: !14, file: !824, line: 79, type: !1073, isLocal: true, isDefinition: true)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 1152, elements: !1019)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !824, line: 93, type: !9, isLocal: true, isDefinition: true)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(name: "intel_tmt_cycles_div_busy", scope: !14, file: !824, line: 92, type: !1078, isLocal: true, isDefinition: true)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 576, elements: !792)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(scope: null, file: !824, line: 101, type: !1081, isLocal: true, isDefinition: true)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 13)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(name: "intel_tmt_br_misp_retired", scope: !14, file: !824, line: 100, type: !1078, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(name: "intel_tmt_br_inst_retired", scope: !14, file: !824, line: 108, type: !1078, isLocal: true, isDefinition: true)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(name: "intel_tmt_machine_clears", scope: !14, file: !824, line: 116, type: !1078, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !824, line: 125, type: !825, isLocal: true, isDefinition: true)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !824, line: 126, type: !1094, isLocal: true, isDefinition: true)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 544, elements: !1095)
!1095 = !{!1096}
!1096 = !DISubrange(count: 68)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !824, line: 130, type: !948, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "intel_tmt_itlb_misses", scope: !14, file: !824, line: 124, type: !1073, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !824, line: 138, type: !1103, isLocal: true, isDefinition: true)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !1104)
!1104 = !{!1105}
!1105 = !DISubrange(count: 6)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "intel_tmt_itlb", scope: !14, file: !824, line: 137, type: !1078, isLocal: true, isDefinition: true)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(scope: null, file: !824, line: 146, type: !1110, isLocal: true, isDefinition: true)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !1111)
!1111 = !{!1112}
!1112 = !DISubrange(count: 9)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !824, line: 147, type: !1115, isLocal: true, isDefinition: true)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 672, elements: !1116)
!1116 = !{!1117}
!1117 = !DISubrange(count: 84)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !824, line: 151, type: !941, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(name: "intel_tmt_icache", scope: !14, file: !824, line: 145, type: !1073, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !824, line: 160, type: !1124, isLocal: true, isDefinition: true)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !1125)
!1125 = !{!1126}
!1126 = !DISubrange(count: 67)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(name: "intel_tmt_dtlb_store_misses", scope: !14, file: !824, line: 158, type: !1073, isLocal: true, isDefinition: true)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(scope: null, file: !824, line: 172, type: !1068, isLocal: true, isDefinition: true)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !824, line: 173, type: !1133, isLocal: true, isDefinition: true)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1496, elements: !1134)
!1134 = !{!1135}
!1135 = !DISubrange(count: 187)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !824, line: 177, type: !931, isLocal: true, isDefinition: true)
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(name: "intel_tmt_longest_lat_cache", scope: !14, file: !824, line: 171, type: !1073, isLocal: true, isDefinition: true)
!1140 = !DIGlobalVariableExpression(var: !1141, expr: !DIExpression())
!1141 = distinct !DIGlobalVariable(scope: null, file: !824, line: 186, type: !953, isLocal: true, isDefinition: true)
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(name: "intel_tmt_dtlb_load_misses", scope: !14, file: !824, line: 184, type: !1073, isLocal: true, isDefinition: true)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(scope: null, file: !824, line: 198, type: !9, isLocal: true, isDefinition: true)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(scope: null, file: !824, line: 199, type: !875, isLocal: true, isDefinition: true)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(scope: null, file: !824, line: 203, type: !941, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(scope: null, file: !824, line: 204, type: !1152, isLocal: true, isDefinition: true)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !1153)
!1153 = !{!1154}
!1154 = !DISubrange(count: 49)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(scope: null, file: !824, line: 208, type: !931, isLocal: true, isDefinition: true)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !824, line: 214, type: !1028, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !824, line: 215, type: !1161, isLocal: true, isDefinition: true)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 680, elements: !1162)
!1162 = !{!1163}
!1163 = !DISubrange(count: 85)
!1164 = !DIGlobalVariableExpression(var: !1165, expr: !DIExpression())
!1165 = distinct !DIGlobalVariable(name: "intel_tmt_cpu_clk_unhalted", scope: !14, file: !824, line: 197, type: !1006, isLocal: true, isDefinition: true)
!1166 = !DIGlobalVariableExpression(var: !1167, expr: !DIExpression())
!1167 = distinct !DIGlobalVariable(name: "tmt_models", scope: !14, file: !2, line: 30, type: !1168, isLocal: true, isDefinition: true)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 96, elements: !745)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1170, size: 10240, elements: !811)
!1170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "intel_x86_entry_t", file: !1009, line: 79, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1009, line: 66, size: 512, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1172, file: !1009, line: 67, baseType: !583, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !1172, file: !1009, line: 68, baseType: !583, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "equiv", scope: !1172, file: !1009, line: 69, baseType: !583, size: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "cntmsk", scope: !1172, file: !1009, line: 70, baseType: !647, size: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1172, file: !1009, line: 71, baseType: !18, size: 32, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "numasks", scope: !1172, file: !1009, line: 72, baseType: !18, size: 32, offset: 288)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1172, file: !1009, line: 73, baseType: !18, size: 32, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "modmsk", scope: !1172, file: !1009, line: 74, baseType: !18, size: 32, offset: 352)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "modmsk_req", scope: !1172, file: !1009, line: 75, baseType: !18, size: 32, offset: 384)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ngrp", scope: !1172, file: !1009, line: 76, baseType: !787, size: 16, offset: 416)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !1172, file: !1009, line: 77, baseType: !787, size: 16, offset: 432)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "umasks", scope: !1172, file: !1009, line: 78, baseType: !1186, size: 64, offset: 448)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1187 = !{i32 7, !"Dwarf Version", i32 5}
!1188 = !{i32 2, !"Debug Info Version", i32 3}
!1189 = !{i32 1, !"wchar_size", i32 4}
!1190 = !{i32 8, !"PIC Level", i32 2}
!1191 = !{i32 7, !"PIE Level", i32 2}
!1192 = !{i32 7, !"uwtable", i32 2}
!1193 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!1194 = distinct !DISubprogram(name: "pfm_intel_tmt_init", scope: !2, file: !2, line: 37, type: !618, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !1195)
!1195 = !{!1196}
!1196 = !DILocalVariable(name: "this", arg: 1, scope: !1194, file: !2, line: 37, type: !620)
!1197 = !{!1198, !1198, i64 0}
!1198 = !{!"any pointer", !1199, i64 0}
!1199 = !{!"omnipotent char", !1200, i64 0}
!1200 = !{!"Simple C/C++ TBAA"}
!1201 = !DILocation(line: 37, column: 26, scope: !1194)
!1202 = !DILocation(line: 39, column: 33, scope: !1194)
!1203 = !{!1204, !1205, i64 8}
!1204 = !{!"", !1205, i64 0, !1205, i64 4, !1205, i64 8, !1205, i64 12}
!1205 = !{!"int", !1199, i64 0}
!1206 = !DILocation(line: 40, column: 2, scope: !1194)
