; ModuleID = 'samples/37.bc'
source_filename = "bind.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.quo_internal_hwloc_topology = type { i32, i32, i32, ptr, ptr, i64, [20 x i32], [20 x i32], i32, i32, i32, i32, ptr, i64, ptr, i64, [6 x %struct.quo_internal_hwloc_special_level_s], ptr, ptr, %struct.quo_internal_hwloc_binding_hooks, %struct.quo_internal_hwloc_topology_support, ptr, ptr, i32, ptr, ptr, i32, i32, i32, i32, [5 x float], i32, ptr, ptr, i32, i32, ptr, %struct.quo_internal_hwloc_numanode_attr_s, i32, i32, ptr, i32, ptr, ptr, ptr }
%struct.quo_internal_hwloc_special_level_s = type { i32, ptr, ptr, ptr }
%struct.quo_internal_hwloc_binding_hooks = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.quo_internal_hwloc_topology_support = type { ptr, ptr, ptr }
%struct.quo_internal_hwloc_numanode_attr_s = type { i64, i32, ptr }
%struct.quo_internal_hwloc_obj = type { i32, ptr, i32, ptr, i64, ptr, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, i32, ptr, ptr, ptr, i32, i32, ptr, i32, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, i64 }
%struct.quo_internal_hwloc_topology_cpubind_support = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.quo_internal_hwloc_topology_membind_support = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }


!274 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!275 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!276 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!277 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!278 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!279 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!280 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!281 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!282 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!283 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!284 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!285 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!286 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!287 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!288 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!289 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!290 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!291 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!292 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!293 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!294 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!295 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!296 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!297 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!298 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!299 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!300 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!301 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!302 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!303 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!304 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!305 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!306 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!307 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!308 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!309 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!310 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!311 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!312 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!313 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!314 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!315 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!316 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!317 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!318 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!319 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!320 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!321 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!322 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!323 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!324 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!325 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!326 = !DIEnumerator(name: "_SC_MINSIGSTKSZ", value: 249)
!327 = !DIEnumerator(name: "_SC_SIGSTKSZ", value: 250)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quo_internal_hwloc_get_type_depth_e", file: !27, line: 796, baseType: !75, size: 32, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337}
!330 = !DIEnumerator(name: "QUO_INTERNAL_hwloc_TYPE_DEPTH_UNKNOWN", value: -1)
!331 = !DIEnumerator(name: "QUO_INTERNAL_hwloc_TYPE_DEPTH_MULTIPLE", value: -2)
!332 = !DIEnumerator(name: "QUO_INTERNAL_hwloc_TYPE_DEPTH_NUMANODE", value: -3)
!333 = !DIEnumerator(name: "QUO_INTERNAL_hwloc_TYPE_DEPTH_BRIDGE", value: -4)
!334 = !DIEnumerator(name: "QUO_INTERNAL_hwloc_TYPE_DEPTH_PCI_DEVICE", value: -5)
!335 = !DIEnumerator(name: "QUO_INTERNAL_hwloc_TYPE_DEPTH_OS_DEVICE", value: -6)
!336 = !DIEnumerator(name: "QUO_INTERNAL_hwloc_TYPE_DEPTH_MISC", value: -7)
!337 = !DIEnumerator(name: "QUO_INTERNAL_hwloc_TYPE_DEPTH_MEMCACHE", value: -8)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!340 = !{!0, !7, !12, !18}
!341 = !{i32 7, !"Dwarf Version", i32 5}
!342 = !{i32 2, !"Debug Info Version", i32 3}
!343 = !{i32 1, !"wchar_size", i32 4}
!344 = !{i32 8, !"PIC Level", i32 2}
!345 = !{i32 7, !"uwtable", i32 2}
!346 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!347 = distinct !DISubprogram(name: "quo_internal_hwloc_set_cpubind", scope: !24, file: !24, line: 59, type: !348, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !23, retainedNodes: !786)
!348 = !DISubroutineType(types: !349)
!349 = !{!75, !350, !531, !75}
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_topology_t", file: !27, line: 667, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_topology", file: !353, line: 51, size: 6848, elements: !354)
!353 = !DIFile(filename: "include/private/private.h", directory: "/local-ssd/libquo-a5d64skrddtcir6td6wgkbqasktcbifa-build/aidengro/spack-stage-libquo-1.3.1-a5d64skrddtcir6td6wgkbqasktcbifa/spack-src/src/hwloc", checksumkind: CSK_MD5, checksum: "8963c17497e31d792ec1196475f63180")
!354 = !{!355, !356, !357, !358, !360, !491, !492, !496, !498, !499, !500, !501, !505, !506, !507, !508, !511, !521, !522, !523, !612, !658, !662, !667, !668, !688, !689, !690, !691, !692, !693, !697, !698, !743, !744, !745, !746, !756, !757, !758, !759, !767, !768, !774, !785}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "topology_abi", scope: !352, file: !353, line: 52, baseType: !28, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_levels", scope: !352, file: !353, line: 54, baseType: !28, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_levels_allocated", scope: !352, file: !353, line: 55, baseType: !28, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "level_nbobjects", scope: !352, file: !353, line: 56, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !352, file: !353, line: 57, baseType: !361, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_obj", file: !27, line: 381, size: 1984, elements: !365)
!365 = !{!366, !368, !370, !371, !372, !380, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !478, !479, !481, !482, !488, !489, !490}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !27, line: 383, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_obj_type_t", file: !27, line: 307, baseType: !26)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !364, file: !27, line: 384, baseType: !369, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "os_index", scope: !364, file: !27, line: 386, baseType: !28, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !364, file: !27, line: 393, baseType: !369, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "total_memory", scope: !364, file: !27, line: 398, baseType: !373, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_uint64_t", file: !374, line: 217, baseType: !375)
!374 = !DIFile(filename: "include/hwloc/autogen/config.h", directory: "/local-ssd/libquo-a5d64skrddtcir6td6wgkbqasktcbifa-build/aidengro/spack-stage-libquo-1.3.1-a5d64skrddtcir6td6wgkbqasktcbifa/spack-src/src/hwloc", checksumkind: CSK_MD5, checksum: "7574ee031d7a0fd53225d7770a824f3d")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !376, line: 27, baseType: !377)
!376 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !378, line: 45, baseType: !379)
!378 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!379 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !364, file: !27, line: 400, baseType: !381, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "quo_internal_hwloc_obj_attr_u", file: !27, line: 582, size: 320, elements: !383)
!383 = !{!384, !395, !404, !412, !428, !448}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "numanode", scope: !382, file: !27, line: 596, baseType: !385, size: 192)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_numanode_attr_s", file: !27, line: 584, size: 192, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", scope: !385, file: !27, line: 585, baseType: !373, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "page_types_len", scope: !385, file: !27, line: 586, baseType: !28, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "page_types", scope: !385, file: !27, line: 595, baseType: !390, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_memory_page_type_s", file: !27, line: 592, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !391, file: !27, line: 593, baseType: !373, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !391, file: !27, line: 594, baseType: !373, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !382, file: !27, line: 606, baseType: !396, size: 192)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_cache_attr_s", file: !27, line: 599, size: 192, elements: !397)
!397 = !{!398, !399, !400, !401, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !396, file: !27, line: 600, baseType: !373, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !396, file: !27, line: 601, baseType: !28, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !396, file: !27, line: 602, baseType: !28, size: 32, offset: 96)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "associativity", scope: !396, file: !27, line: 603, baseType: !75, size: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !396, file: !27, line: 605, baseType: !403, size: 32, offset: 160)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_obj_cache_type_t", file: !27, line: 314, baseType: !51)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !382, file: !27, line: 614, baseType: !405, size: 128)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_group_attr_s", file: !27, line: 608, size: 128, elements: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !405, file: !27, line: 609, baseType: !28, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !405, file: !27, line: 611, baseType: !28, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "subkind", scope: !405, file: !27, line: 612, baseType: !28, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dont_merge", scope: !405, file: !27, line: 613, baseType: !411, size: 8, offset: 96)
!411 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pcidev", scope: !382, file: !27, line: 623, baseType: !413, size: 192)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_pcidev_attr_s", file: !27, line: 616, size: 192, elements: !414)
!414 = !{!415, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !413, file: !27, line: 617, baseType: !416, size: 16)
!416 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !413, file: !27, line: 618, baseType: !411, size: 8, offset: 16)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !413, file: !27, line: 618, baseType: !411, size: 8, offset: 24)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !413, file: !27, line: 618, baseType: !411, size: 8, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "class_id", scope: !413, file: !27, line: 619, baseType: !416, size: 16, offset: 48)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_id", scope: !413, file: !27, line: 620, baseType: !416, size: 16, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "device_id", scope: !413, file: !27, line: 620, baseType: !416, size: 16, offset: 80)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "subvendor_id", scope: !413, file: !27, line: 620, baseType: !416, size: 16, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "subdevice_id", scope: !413, file: !27, line: 620, baseType: !416, size: 16, offset: 112)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !413, file: !27, line: 621, baseType: !411, size: 8, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "linkspeed", scope: !413, file: !27, line: 622, baseType: !427, size: 32, offset: 160)
!427 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bridge", scope: !382, file: !27, line: 638, baseType: !429, size: 320)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_bridge_attr_s", file: !27, line: 625, size: 320, elements: !430)
!430 = !{!431, !435, !437, !446, !447}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !429, file: !27, line: 628, baseType: !432, size: 192)
!432 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !429, file: !27, line: 626, size: 192, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !432, file: !27, line: 627, baseType: !413, size: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_type", scope: !429, file: !27, line: 629, baseType: !436, size: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_obj_bridge_type_t", file: !27, line: 320, baseType: !56)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !429, file: !27, line: 635, baseType: !438, size: 32, offset: 224)
!438 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !429, file: !27, line: 630, size: 32, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !438, file: !27, line: 634, baseType: !441, size: 32)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !438, file: !27, line: 631, size: 32, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !441, file: !27, line: 632, baseType: !416, size: 16)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_bus", scope: !441, file: !27, line: 633, baseType: !411, size: 8, offset: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "subordinate_bus", scope: !441, file: !27, line: 633, baseType: !411, size: 8, offset: 24)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_type", scope: !429, file: !27, line: 636, baseType: !436, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !429, file: !27, line: 637, baseType: !28, size: 32, offset: 288)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "osdev", scope: !382, file: !27, line: 642, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_osdev_attr_s", file: !27, line: 640, size: 32, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !449, file: !27, line: 641, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_obj_osdev_type_t", file: !27, line: 340, baseType: !60)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !364, file: !27, line: 404, baseType: !75, size: 32, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "logical_index", scope: !364, file: !27, line: 419, baseType: !28, size: 32, offset: 416)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next_cousin", scope: !364, file: !27, line: 427, baseType: !363, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cousin", scope: !364, file: !27, line: 428, baseType: !363, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !364, file: !27, line: 431, baseType: !363, size: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_rank", scope: !364, file: !27, line: 432, baseType: !28, size: 32, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next_sibling", scope: !364, file: !27, line: 433, baseType: !363, size: 64, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sibling", scope: !364, file: !27, line: 434, baseType: !363, size: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !364, file: !27, line: 437, baseType: !28, size: 32, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !364, file: !27, line: 441, baseType: !362, size: 64, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "first_child", scope: !364, file: !27, line: 442, baseType: !363, size: 64, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "last_child", scope: !364, file: !27, line: 443, baseType: !363, size: 64, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_subtree", scope: !364, file: !27, line: 446, baseType: !75, size: 32, offset: 1088)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "memory_arity", scope: !364, file: !27, line: 457, baseType: !28, size: 32, offset: 1120)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "memory_first_child", scope: !364, file: !27, line: 460, baseType: !363, size: 64, offset: 1152)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "io_arity", scope: !364, file: !27, line: 475, baseType: !28, size: 32, offset: 1216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "io_first_child", scope: !364, file: !27, line: 478, baseType: !363, size: 64, offset: 1280)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "misc_arity", scope: !364, file: !27, line: 487, baseType: !28, size: 32, offset: 1344)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "misc_first_child", scope: !364, file: !27, line: 490, baseType: !363, size: 64, offset: 1408)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !364, file: !27, line: 497, baseType: !473, size: 64, offset: 1472)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_cpuset_t", file: !27, line: 140, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_bitmap_t", file: !475, line: 68, baseType: !476)
!475 = !DIFile(filename: "include/hwloc/bitmap.h", directory: "/local-ssd/libquo-a5d64skrddtcir6td6wgkbqasktcbifa-build/aidengro/spack-stage-libquo-1.3.1-a5d64skrddtcir6td6wgkbqasktcbifa/spack-src/src/hwloc", checksumkind: CSK_MD5, checksum: "3b45c6ee7685b8110a8db2955a1e9fc0")
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_bitmap_s", file: !475, line: 68, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cpuset", scope: !364, file: !27, line: 512, baseType: !473, size: 64, offset: 1536)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nodeset", scope: !364, file: !27, line: 525, baseType: !480, size: 64, offset: 1600)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_nodeset_t", file: !27, line: 157, baseType: !474)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "complete_nodeset", scope: !364, file: !27, line: 545, baseType: !480, size: 64, offset: 1664)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "infos", scope: !364, file: !27, line: 561, baseType: !483, size: 64, offset: 1728)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_info_s", file: !27, line: 649, size: 128, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !484, file: !27, line: 650, baseType: !369, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !484, file: !27, line: 651, baseType: !369, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "infos_count", scope: !364, file: !27, line: 562, baseType: !28, size: 32, offset: 1792)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !364, file: !27, line: 565, baseType: !339, size: 64, offset: 1856)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gp_index", scope: !364, file: !27, line: 570, baseType: !373, size: 64, offset: 1920)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !352, file: !353, line: 58, baseType: !379, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type_depth", scope: !352, file: !353, line: 59, baseType: !493, size: 640, offset: 320)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 640, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 20)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "type_filter", scope: !352, file: !353, line: 60, baseType: !497, size: 640, offset: 960)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 640, elements: !494)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "is_thissystem", scope: !352, file: !353, line: 61, baseType: !75, size: 32, offset: 1600)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "is_loaded", scope: !352, file: !353, line: 62, baseType: !75, size: 32, offset: 1632)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !352, file: !353, line: 63, baseType: !75, size: 32, offset: 1664)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !352, file: !353, line: 64, baseType: !502, size: 32, offset: 1696)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !503, line: 38, baseType: !504)
!503 = !DIFile(filename: "/usr/include/sched.h", directory: "", checksumkind: CSK_MD5, checksum: "52ea601aba54a9937a50019367077a72")
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !378, line: 154, baseType: !75)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !352, file: !353, line: 65, baseType: !339, size: 64, offset: 1728)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next_gp_index", scope: !352, file: !353, line: 66, baseType: !375, size: 64, offset: 1792)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "adopted_shmem_addr", scope: !352, file: !353, line: 68, baseType: !339, size: 64, offset: 1856)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "adopted_shmem_length", scope: !352, file: !353, line: 69, baseType: !509, size: 64, offset: 1920)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !510, line: 70, baseType: !379)
!510 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!511 = !DIDerivedType(tag: DW_TAG_member, name: "slevels", scope: !352, file: !353, line: 85, baseType: !512, size: 1536, offset: 1984)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 1536, elements: !519)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_special_level_s", file: !353, line: 81, size: 256, elements: !514)
!514 = !{!515, !516, !517, !518}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nbobjs", scope: !513, file: !353, line: 82, baseType: !28, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !513, file: !353, line: 83, baseType: !362, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !513, file: !353, line: 84, baseType: !363, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !513, file: !353, line: 84, baseType: !363, size: 64, offset: 192)
!519 = !{!520}
!520 = !DISubrange(count: 6)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_cpuset", scope: !352, file: !353, line: 87, baseType: !474, size: 64, offset: 3520)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_nodeset", scope: !352, file: !353, line: 88, baseType: !474, size: 64, offset: 3584)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "binding_hooks", scope: !352, file: !353, line: 124, baseType: !524, size: 1536, offset: 3648)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_binding_hooks", file: !353, line: 90, size: 1536, elements: !525)
!525 = !{!526, !534, !538, !539, !540, !544, !548, !554, !558, !559, !560, !561, !567, !572, !573, !574, !578, !582, !588, !592, !596, !600, !604, !608}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_cpubind", scope: !524, file: !353, line: 92, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!75, !350, !530, !75}
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_const_cpuset_t", file: !27, line: 142, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_const_bitmap_t", file: !475, line: 70, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_cpubind", scope: !524, file: !353, line: 93, baseType: !535, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!75, !350, !473, !75}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_cpubind", scope: !524, file: !353, line: 94, baseType: !527, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_cpubind", scope: !524, file: !353, line: 95, baseType: !535, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_cpubind", scope: !524, file: !353, line: 96, baseType: !541, size: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!75, !350, !502, !530, !75}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_cpubind", scope: !524, file: !353, line: 97, baseType: !545, size: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!75, !350, !502, !473, !75}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "set_thread_cpubind", scope: !524, file: !353, line: 99, baseType: !549, size: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!75, !350, !552, !530, !75}
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !553, line: 27, baseType: !379)
!553 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!554 = !DIDerivedType(tag: DW_TAG_member, name: "get_thread_cpubind", scope: !524, file: !353, line: 100, baseType: !555, size: 64, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!75, !350, !552, !473, !75}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_last_cpu_location", scope: !524, file: !353, line: 103, baseType: !535, size: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_last_cpu_location", scope: !524, file: !353, line: 104, baseType: !535, size: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_last_cpu_location", scope: !524, file: !353, line: 105, baseType: !545, size: 64, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_membind", scope: !524, file: !353, line: 107, baseType: !562, size: 64, offset: 704)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!75, !350, !565, !566, !75}
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_const_nodeset_t", file: !27, line: 160, baseType: !531)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_membind_policy_t", file: !27, line: 1403, baseType: !74)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_membind", scope: !524, file: !353, line: 108, baseType: !568, size: 64, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!75, !350, !480, !571, !75}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_membind", scope: !524, file: !353, line: 109, baseType: !562, size: 64, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_membind", scope: !524, file: !353, line: 110, baseType: !568, size: 64, offset: 896)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_membind", scope: !524, file: !353, line: 111, baseType: !575, size: 64, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!75, !350, !502, !565, !566, !75}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_membind", scope: !524, file: !353, line: 112, baseType: !579, size: 64, offset: 1024)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!75, !350, !502, !480, !571, !75}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "set_area_membind", scope: !524, file: !353, line: 113, baseType: !583, size: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!75, !350, !586, !509, !565, !566, !75}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_membind", scope: !524, file: !353, line: 114, baseType: !589, size: 64, offset: 1152)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!75, !350, !586, !509, !480, !571, !75}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_memlocation", scope: !524, file: !353, line: 115, baseType: !593, size: 64, offset: 1216)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!75, !350, !586, !509, !480, !75}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !524, file: !353, line: 117, baseType: !597, size: 64, offset: 1280)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!339, !350, !509}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_membind", scope: !524, file: !353, line: 120, baseType: !601, size: 64, offset: 1344)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!339, !350, !509, !565, !566, !75}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "free_membind", scope: !524, file: !353, line: 121, baseType: !605, size: 64, offset: 1408)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!75, !350, !339, !509}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "get_allowed_resources", scope: !524, file: !353, line: 123, baseType: !609, size: 64, offset: 1472)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!75, !350}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "support", scope: !352, file: !353, line: 126, baseType: !613, size: 192, offset: 5184)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_topology_support", file: !27, line: 2039, size: 192, elements: !614)
!614 = !{!615, !624, !639}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "discovery", scope: !613, file: !27, line: 2040, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_topology_discovery_support", file: !27, line: 1952, size: 40, elements: !618)
!618 = !{!619, !620, !621, !622, !623}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pu", scope: !617, file: !27, line: 1954, baseType: !411, size: 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "numa", scope: !617, file: !27, line: 1956, baseType: !411, size: 8, offset: 8)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "numa_memory", scope: !617, file: !27, line: 1958, baseType: !411, size: 8, offset: 16)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "disallowed_pu", scope: !617, file: !27, line: 1960, baseType: !411, size: 8, offset: 24)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "disallowed_numa", scope: !617, file: !27, line: 1962, baseType: !411, size: 8, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cpubind", scope: !613, file: !27, line: 2041, baseType: !625, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_topology_cpubind_support", file: !27, line: 1970, size: 88, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_cpubind", scope: !626, file: !27, line: 1972, baseType: !411, size: 8)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_cpubind", scope: !626, file: !27, line: 1974, baseType: !411, size: 8, offset: 8)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_cpubind", scope: !626, file: !27, line: 1976, baseType: !411, size: 8, offset: 16)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_cpubind", scope: !626, file: !27, line: 1978, baseType: !411, size: 8, offset: 24)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_cpubind", scope: !626, file: !27, line: 1980, baseType: !411, size: 8, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_cpubind", scope: !626, file: !27, line: 1982, baseType: !411, size: 8, offset: 40)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "set_thread_cpubind", scope: !626, file: !27, line: 1984, baseType: !411, size: 8, offset: 48)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "get_thread_cpubind", scope: !626, file: !27, line: 1986, baseType: !411, size: 8, offset: 56)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_last_cpu_location", scope: !626, file: !27, line: 1988, baseType: !411, size: 8, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_last_cpu_location", scope: !626, file: !27, line: 1990, baseType: !411, size: 8, offset: 72)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_last_cpu_location", scope: !626, file: !27, line: 1992, baseType: !411, size: 8, offset: 80)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "membind", scope: !613, file: !27, line: 2042, baseType: !640, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_topology_membind_support", file: !27, line: 2000, size: 120, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_membind", scope: !641, file: !27, line: 2002, baseType: !411, size: 8)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_membind", scope: !641, file: !27, line: 2004, baseType: !411, size: 8, offset: 8)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_membind", scope: !641, file: !27, line: 2006, baseType: !411, size: 8, offset: 16)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_membind", scope: !641, file: !27, line: 2008, baseType: !411, size: 8, offset: 24)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_membind", scope: !641, file: !27, line: 2010, baseType: !411, size: 8, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_membind", scope: !641, file: !27, line: 2012, baseType: !411, size: 8, offset: 40)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "set_area_membind", scope: !641, file: !27, line: 2014, baseType: !411, size: 8, offset: 48)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_membind", scope: !641, file: !27, line: 2016, baseType: !411, size: 8, offset: 56)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_membind", scope: !641, file: !27, line: 2018, baseType: !411, size: 8, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "firsttouch_membind", scope: !641, file: !27, line: 2020, baseType: !411, size: 8, offset: 72)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bind_membind", scope: !641, file: !27, line: 2022, baseType: !411, size: 8, offset: 80)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_membind", scope: !641, file: !27, line: 2024, baseType: !411, size: 8, offset: 88)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nexttouch_membind", scope: !641, file: !27, line: 2026, baseType: !411, size: 8, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "migrate_membind", scope: !641, file: !27, line: 2028, baseType: !411, size: 8, offset: 104)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_memlocation", scope: !641, file: !27, line: 2030, baseType: !411, size: 8, offset: 112)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "userdata_export_cb", scope: !352, file: !353, line: 128, baseType: !659, size: 64, offset: 5376)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !339, !351, !363}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "userdata_import_cb", scope: !352, file: !353, line: 129, baseType: !663, size: 64, offset: 5440)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !351, !363, !666, !586, !509}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "userdata_not_decoded", scope: !352, file: !353, line: 130, baseType: !75, size: 32, offset: 5504)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "first_dist", scope: !352, file: !353, line: 163, baseType: !669, size: 64, offset: 5568)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_internal_distances_s", file: !353, line: 132, size: 704, elements: !671)
!671 = !{!672, !673, !674, !675, !677, !678, !680, !681, !682, !683, !686, !687}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !670, file: !353, line: 133, baseType: !369, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !670, file: !353, line: 135, baseType: !28, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "unique_type", scope: !670, file: !353, line: 142, baseType: !367, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "different_types", scope: !670, file: !353, line: 143, baseType: !676, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nbobjs", scope: !670, file: !353, line: 146, baseType: !28, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !670, file: !353, line: 147, baseType: !679, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !670, file: !353, line: 151, baseType: !679, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !670, file: !353, line: 154, baseType: !379, size: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", scope: !670, file: !353, line: 157, baseType: !28, size: 32, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !670, file: !353, line: 160, baseType: !684, size: 64, offset: 512)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_obj_t", file: !27, line: 579, baseType: !363)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !670, file: !353, line: 162, baseType: !669, size: 64, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !670, file: !353, line: 162, baseType: !669, size: 64, offset: 640)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "last_dist", scope: !352, file: !353, line: 163, baseType: !669, size: 64, offset: 5632)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "next_dist_id", scope: !352, file: !353, line: 164, baseType: !28, size: 32, offset: 5696)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !352, file: !353, line: 166, baseType: !75, size: 32, offset: 5728)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_verbose", scope: !352, file: !353, line: 167, baseType: !75, size: 32, offset: 5760)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_nbaccuracies", scope: !352, file: !353, line: 168, baseType: !28, size: 32, offset: 5792)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_accuracies", scope: !352, file: !353, line: 169, baseType: !694, size: 160, offset: 5824)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 160, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 5)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_next_subkind", scope: !352, file: !353, line: 170, baseType: !28, size: 32, offset: 5984)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "backends", scope: !352, file: !353, line: 173, baseType: !699, size: 64, offset: 6016)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_backend", file: !84, line: 179, size: 704, elements: !701)
!701 = !{!702, !716, !717, !718, !719, !720, !721, !722, !723, !727, !738}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "component", scope: !700, file: !84, line: 181, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_disc_component", file: !84, line: 34, size: 320, elements: !705)
!705 = !{!706, !707, !708, !709, !713, !714, !715}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !704, file: !84, line: 38, baseType: !666, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "phases", scope: !704, file: !84, line: 43, baseType: !28, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_phases", scope: !704, file: !84, line: 53, baseType: !28, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "instantiate", scope: !704, file: !84, line: 58, baseType: !710, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!699, !351, !703, !28, !586, !586, !586}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !704, file: !84, line: 72, baseType: !28, size: 32, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "enabled_by_default", scope: !704, file: !84, line: 77, baseType: !28, size: 32, offset: 224)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !704, file: !84, line: 83, baseType: !703, size: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "topology", scope: !700, file: !84, line: 183, baseType: !351, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "envvar_forced", scope: !700, file: !84, line: 185, baseType: !75, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !700, file: !84, line: 187, baseType: !699, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "phases", scope: !700, file: !84, line: 192, baseType: !28, size: 32, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !700, file: !84, line: 195, baseType: !379, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "is_thissystem", scope: !700, file: !84, line: 203, baseType: !75, size: 32, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !700, file: !84, line: 206, baseType: !339, size: 64, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !700, file: !84, line: 210, baseType: !724, size: 64, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !699}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "discover", scope: !700, file: !84, line: 217, baseType: !728, size: 64, offset: 576)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!75, !699, !731}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_disc_status", file: !84, line: 146, size: 128, elements: !733)
!733 = !{!734, !736, !737}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !732, file: !84, line: 150, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "quo_internal_hwloc_disc_phase_t", file: !84, line: 133, baseType: !83)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_phases", scope: !732, file: !84, line: 155, baseType: !28, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !732, file: !84, line: 158, baseType: !379, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "get_pci_busid_cpuset", scope: !700, file: !84, line: 223, baseType: !739, size: 64, offset: 640)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!75, !699, !742, !474}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "get_pci_busid_cpuset_backend", scope: !352, file: !353, line: 174, baseType: !699, size: 64, offset: 6080)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "backend_phases", scope: !352, file: !353, line: 175, baseType: !28, size: 32, offset: 6144)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "backend_excluded_phases", scope: !352, file: !353, line: 176, baseType: !28, size: 32, offset: 6176)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tma", scope: !352, file: !353, line: 179, baseType: !747, size: 64, offset: 6208)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_tma", file: !353, line: 414, size: 192, elements: !749)
!749 = !{!750, !754, !755}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !748, file: !353, line: 415, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!339, !747, !509}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !748, file: !353, line: 416, baseType: !339, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "dontfree", scope: !748, file: !353, line: 417, baseType: !75, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "machine_memory", scope: !352, file: !353, line: 195, baseType: !385, size: 192, offset: 6272)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pci_has_forced_locality", scope: !352, file: !353, line: 198, baseType: !75, size: 32, offset: 6464)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "pci_forced_locality_nr", scope: !352, file: !353, line: 199, baseType: !28, size: 32, offset: 6496)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pci_forced_locality", scope: !352, file: !353, line: 204, baseType: !760, size: 64, offset: 6528)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_pci_forced_locality_s", file: !353, line: 200, size: 192, elements: !762)
!762 = !{!763, !764, !765, !766}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !761, file: !353, line: 201, baseType: !28, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bus_first", scope: !761, file: !353, line: 202, baseType: !28, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bus_last", scope: !761, file: !353, line: 202, baseType: !28, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !761, file: !353, line: 203, baseType: !474, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "nr_blacklisted_components", scope: !352, file: !353, line: 207, baseType: !28, size: 32, offset: 6592)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "blacklisted_components", scope: !352, file: !353, line: 211, baseType: !769, size: 64, offset: 6656)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_topology_forced_component", file: !353, line: 208, size: 128, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "component", scope: !770, file: !353, line: 209, baseType: !703, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "phases", scope: !770, file: !353, line: 210, baseType: !28, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "first_pci_locality", scope: !352, file: !353, line: 221, baseType: !775, size: 64, offset: 6720)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quo_internal_hwloc_pci_locality_s", file: !353, line: 214, size: 384, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !776, file: !353, line: 215, baseType: !28, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bus_min", scope: !776, file: !353, line: 216, baseType: !28, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bus_max", scope: !776, file: !353, line: 217, baseType: !28, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !776, file: !353, line: 218, baseType: !474, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !776, file: !353, line: 219, baseType: !685, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !776, file: !353, line: 220, baseType: !775, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !776, file: !353, line: 220, baseType: !775, size: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "last_pci_locality", scope: !352, file: !353, line: 221, baseType: !775, size: 64, offset: 6784)
!786 = !{!787, !788, !789, !790}
!787 = !DILocalVariable(name: "topology", arg: 1, scope: !347, file: !24, line: 59, type: !350)
!788 = !DILocalVariable(name: "set", arg: 2, scope: !347, file: !24, line: 59, type: !531)
!789 = !DILocalVariable(name: "flags", arg: 3, scope: !347, file: !24, line: 59, type: !75)
!790 = !DILocalVariable(name: "err", scope: !791, file: !24, line: 78, type: !75)
!791 = distinct !DILexicalBlock(scope: !792, file: !24, line: 77, column: 55)
!792 = distinct !DILexicalBlock(scope: !793, file: !24, line: 77, column: 9)
!793 = distinct !DILexicalBlock(scope: !794, file: !24, line: 76, column: 10)
!794 = distinct !DILexicalBlock(scope: !795, file: !24, line: 73, column: 14)
!795 = distinct !DILexicalBlock(scope: !347, file: !24, line: 70, column: 7)
!796 = !{!797, !797, i64 0}
!797 = !{!"any pointer", !798, i64 0}
!798 = !{!"omnipotent char", !799, i64 0}
!799 = !{!"Simple C/C++ TBAA"}
!800 = !DILocation(line: 59, column: 36, scope: !347)
!801 = !DILocation(line: 59, column: 67, scope: !347)
!802 = !{!803, !803, i64 0}
!803 = !{!"int", !798, i64 0}
!804 = !DILocation(line: 59, column: 76, scope: !347)
!805 = !DILocation(line: 61, column: 7, scope: !806)
!806 = distinct !DILexicalBlock(scope: !347, file: !24, line: 61, column: 7)
!807 = !DILocation(line: 61, column: 13, scope: !806)
!808 = !DILocation(line: 61, column: 7, scope: !347)
!809 = !DILocation(line: 62, column: 5, scope: !810)
!810 = distinct !DILexicalBlock(scope: !806, file: !24, line: 61, column: 40)
!811 = !DILocation(line: 62, column: 11, scope: !810)
!812 = !DILocation(line: 63, column: 5, scope: !810)
!813 = !DILocation(line: 66, column: 27, scope: !347)
!814 = !DILocation(line: 66, column: 37, scope: !347)
!815 = !DILocation(line: 66, column: 9, scope: !347)
!816 = !DILocation(line: 66, column: 7, scope: !347)
!817 = !DILocation(line: 67, column: 8, scope: !818)
!818 = distinct !DILexicalBlock(scope: !347, file: !24, line: 67, column: 7)
!819 = !DILocation(line: 67, column: 7, scope: !347)
!820 = !DILocation(line: 68, column: 5, scope: !818)
!821 = !DILocation(line: 70, column: 7, scope: !795)
!822 = !DILocation(line: 70, column: 13, scope: !795)
!823 = !DILocation(line: 70, column: 7, scope: !347)
!824 = !DILocation(line: 71, column: 9, scope: !825)
!825 = distinct !DILexicalBlock(scope: !826, file: !24, line: 71, column: 9)
!826 = distinct !DILexicalBlock(scope: !795, file: !24, line: 70, column: 38)
!827 = !DILocation(line: 71, column: 19, scope: !825)
!828 = !DILocation(line: 71, column: 33, scope: !825)
!829 = !{!830, !797, i64 456}
!830 = !{!"quo_internal_hwloc_topology", !803, i64 0, !803, i64 4, !803, i64 8, !797, i64 16, !797, i64 24, !831, i64 32, !798, i64 40, !798, i64 120, !803, i64 200, !803, i64 204, !803, i64 208, !803, i64 212, !797, i64 216, !831, i64 224, !797, i64 232, !831, i64 240, !798, i64 248, !797, i64 440, !797, i64 448, !832, i64 456, !833, i64 648, !797, i64 672, !797, i64 680, !803, i64 688, !797, i64 696, !797, i64 704, !803, i64 712, !803, i64 716, !803, i64 720, !803, i64 724, !798, i64 728, !803, i64 748, !797, i64 752, !797, i64 760, !803, i64 768, !803, i64 772, !797, i64 776, !834, i64 784, !803, i64 808, !803, i64 812, !797, i64 816, !803, i64 824, !797, i64 832, !797, i64 840, !797, i64 848}
!831 = !{!"long", !798, i64 0}
!832 = !{!"quo_internal_hwloc_binding_hooks", !797, i64 0, !797, i64 8, !797, i64 16, !797, i64 24, !797, i64 32, !797, i64 40, !797, i64 48, !797, i64 56, !797, i64 64, !797, i64 72, !797, i64 80, !797, i64 88, !797, i64 96, !797, i64 104, !797, i64 112, !797, i64 120, !797, i64 128, !797, i64 136, !797, i64 144, !797, i64 152, !797, i64 160, !797, i64 168, !797, i64 176, !797, i64 184}
!833 = !{!"quo_internal_hwloc_topology_support", !797, i64 0, !797, i64 8, !797, i64 16}
!834 = !{!"quo_internal_hwloc_numanode_attr_s", !831, i64 0, !803, i64 8, !797, i64 16}
