; ModuleID = 'samples/372.bc'
source_filename = "dbm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.dav_hooks_propdb = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.module_struct = type { i32, i32, i32, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct.dav_propdb_metadata = type { i8, i8, i16 }
%struct.dav_db = type { ptr, ptr, i32, %struct.dav_buffer, i16, i32, ptr, %struct.dav_buffer, %struct.apr_datum_t }
%struct.dav_buffer = type { i64, i64, ptr }
%struct.apr_datum_t = type { ptr, i64 }
%struct.dav_error = type { i32, i32, ptr, i32, ptr, ptr, ptr, ptr }
%struct.dav_xmlns_info = type { ptr, ptr, ptr, i32 }
%struct.apr_array_header_t = type { ptr, i32, i32, i32, ptr }
%struct.dav_namespace_map = type { ptr }
%struct.dav_deadprop_rollback = type { %struct.apr_datum_t, %struct.apr_datum_t }
%struct.dav_prop_name = type { ptr, ptr }

@.str = private unnamed_addr constant [15 x i8] c".state_for_dir\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [6 x i8] c"/.DAV\00", align 1, !dbg !7

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "dbm.c", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/dav/fs", checksumkind: CSK_MD5, checksum: "9f9394f499c6bffe7afd6a00c8d15052")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 15)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 121, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 6)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "dav_hooks_db_dbm", scope: !14, file: !2, line: 784, type: !301, isLocal: false, isDefinition: true)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !15, retainedTypes: !179, globals: !223, splitDebugInlining: false, nameTableKind: None)
!15 = !{!16, !28, !86, !110, !119, !127, !139, !144, !149, !161, !165, !170, !175}
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 296, baseType: !18, size: 32, elements: !19)
!17 = !DIFile(filename: "main/mod_dav.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/dav", checksumkind: CSK_MD5, checksum: "b6a8eab5551a9362e9e8d2c4945ac944")
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27}
!20 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_UNKNOWN", value: 0)
!21 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_REGULAR", value: 1)
!22 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_VERSION", value: 2)
!23 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_HISTORY", value: 3)
!24 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_WORKING", value: 4)
!25 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_WORKSPACE", value: 5)
!26 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_ACTIVITY", value: 6)
!27 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_PRIVATE", value: 7)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !30, file: !29, line: 151, baseType: !18, size: 32, elements: !107)
!29 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_buckets.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "afcd28b2e200d46cb3a438f3ad8fc6de")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_type_t", file: !29, line: 131, size: 448, elements: !31)
!31 = !{!32, !35, !37, !38, !43, !90, !98, !102}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !29, line: 135, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "num_func", scope: !30, file: !29, line: 140, baseType: !36, size: 32, offset: 64)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "is_metadata", scope: !30, file: !29, line: 156, baseType: !28, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !30, file: !29, line: 164, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !30, file: !29, line: 176, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !49, !83, !84, !85}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !48, line: 44, baseType: !36)
!48 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_errno.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "571a7b9d4a9f11f6d27db63c8ba4bc85")
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket", file: !29, line: 121, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket", file: !29, line: 224, size: 512, elements: !52)
!52 = !{!53, !60, !64, !70, !77, !78, !79}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !51, file: !29, line: 226, baseType: !54, size: 128)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !29, line: 226, size: 128, elements: !55)
!55 = !{!56, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !29, line: 226, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !54, file: !29, line: 226, baseType: !57, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !29, line: 228, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_type_t", file: !29, line: 126, baseType: !30)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !51, file: !29, line: 234, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !66, line: 379, baseType: !67)
!66 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "73077acfd8398d55139f48047843856b")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 70, baseType: !69)
!68 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!69 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !51, file: !29, line: 242, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !66, line: 381, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !73, line: 85, baseType: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 152, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!76 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !51, file: !29, line: 244, baseType: !42, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !51, file: !29, line: 252, baseType: !39, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !51, file: !29, line: 254, baseType: !80, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_alloc_t", file: !29, line: 123, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_alloc_t", file: !29, line: 123, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_read_type_e", file: !29, line: 60, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 57, baseType: !18, size: 32, elements: !87)
!87 = !{!88, !89}
!88 = !DIEnumerator(name: "APR_BLOCK_READ", value: 0)
!89 = !DIEnumerator(name: "APR_NONBLOCK_READ", value: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "setaside", scope: !30, file: !29, line: 192, baseType: !91, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!47, !49, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !96, line: 60, baseType: !97)
!96 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_pools.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "ca846d53df1698194c1a577ccf147813")
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !96, line: 60, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !30, file: !29, line: 203, baseType: !99, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!47, !49, !65}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !30, file: !29, line: 211, baseType: !103, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!47, !49, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!107 = !{!108, !109}
!108 = !DIEnumerator(name: "APR_BUCKET_DATA", value: 0)
!109 = !DIEnumerator(name: "APR_BUCKET_METADATA", value: 1)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 41, baseType: !18, size: 32, elements: !112)
!111 = !DIFile(filename: "include/util_filter.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "894e51124b630754ca6243e0c50426ad")
!112 = !{!113, !114, !115, !116, !117, !118}
!113 = !DIEnumerator(name: "AP_MODE_READBYTES", value: 0)
!114 = !DIEnumerator(name: "AP_MODE_GETLINE", value: 1)
!115 = !DIEnumerator(name: "AP_MODE_EATCRLF", value: 2)
!116 = !DIEnumerator(name: "AP_MODE_SPECULATIVE", value: 3)
!117 = !DIEnumerator(name: "AP_MODE_EXHAUSTIVE", value: 4)
!118 = !DIEnumerator(name: "AP_MODE_INIT", value: 5)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 158, baseType: !18, size: 32, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126}
!121 = !DIEnumerator(name: "AP_FTYPE_RESOURCE", value: 10)
!122 = !DIEnumerator(name: "AP_FTYPE_CONTENT_SET", value: 20)
!123 = !DIEnumerator(name: "AP_FTYPE_PROTOCOL", value: 30)
!124 = !DIEnumerator(name: "AP_FTYPE_TRANSCODE", value: 40)
!125 = !DIEnumerator(name: "AP_FTYPE_CONNECTION", value: 50)
!126 = !DIEnumerator(name: "AP_FTYPE_NETWORK", value: 60)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 1251, baseType: !18, size: 32, elements: !129)
!128 = !DIFile(filename: "include/httpd.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "13796706810e88ffd526cf3216ebbaab")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138}
!130 = !DIEnumerator(name: "CONN_STATE_CHECK_REQUEST_LINE_READABLE", value: 0)
!131 = !DIEnumerator(name: "CONN_STATE_READ_REQUEST_LINE", value: 1)
!132 = !DIEnumerator(name: "CONN_STATE_HANDLER", value: 2)
!133 = !DIEnumerator(name: "CONN_STATE_WRITE_COMPLETION", value: 3)
!134 = !DIEnumerator(name: "CONN_STATE_SUSPENDED", value: 4)
!135 = !DIEnumerator(name: "CONN_STATE_LINGER", value: 5)
!136 = !DIEnumerator(name: "CONN_STATE_LINGER_NORMAL", value: 6)
!137 = !DIEnumerator(name: "CONN_STATE_LINGER_SHORT", value: 7)
!138 = !DIEnumerator(name: "CONN_STATE_NUM", value: 8)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 1264, baseType: !18, size: 32, elements: !140)
!140 = !{!141, !142, !143}
!141 = !DIEnumerator(name: "CONN_SENSE_DEFAULT", value: 0)
!142 = !DIEnumerator(name: "CONN_SENSE_WANT_READ", value: 1)
!143 = !DIEnumerator(name: "CONN_SENSE_WANT_WRITE", value: 2)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 1136, baseType: !18, size: 32, elements: !145)
!145 = !{!146, !147, !148}
!146 = !DIEnumerator(name: "AP_CONN_UNKNOWN", value: 0)
!147 = !DIEnumerator(name: "AP_CONN_CLOSE", value: 1)
!148 = !DIEnumerator(name: "AP_CONN_KEEPALIVE", value: 2)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !150, line: 62, baseType: !18, size: 32, elements: !151)
!150 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_info.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "58895203e42ced4eaee1557b60315f00")
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160}
!152 = !DIEnumerator(name: "APR_NOFILE", value: 0)
!153 = !DIEnumerator(name: "APR_REG", value: 1)
!154 = !DIEnumerator(name: "APR_DIR", value: 2)
!155 = !DIEnumerator(name: "APR_CHR", value: 3)
!156 = !DIEnumerator(name: "APR_BLK", value: 4)
!157 = !DIEnumerator(name: "APR_PIPE", value: 5)
!158 = !DIEnumerator(name: "APR_LNK", value: 6)
!159 = !DIEnumerator(name: "APR_SOCK", value: 7)
!160 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 1902, baseType: !18, size: 32, elements: !162)
!162 = !{!163, !164}
!163 = !DIEnumerator(name: "DAV_MODE_WRITE_TRUNC", value: 0)
!164 = !DIEnumerator(name: "DAV_MODE_WRITE_SEEKABLE", value: 1)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 1353, baseType: !18, size: 32, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIEnumerator(name: "DAV_LOCKREC_DIRECT", value: 0)
!168 = !DIEnumerator(name: "DAV_LOCKREC_INDIRECT", value: 1)
!169 = !DIEnumerator(name: "DAV_LOCKREC_INDIRECT_PARTIAL", value: 2)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 1342, baseType: !18, size: 32, elements: !171)
!171 = !{!172, !173, !174}
!172 = !DIEnumerator(name: "DAV_LOCKSCOPE_UNKNOWN", value: 0)
!173 = !DIEnumerator(name: "DAV_LOCKSCOPE_EXCLUSIVE", value: 1)
!174 = !DIEnumerator(name: "DAV_LOCKSCOPE_SHARED", value: 2)
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 1348, baseType: !18, size: 32, elements: !176)
!176 = !{!177, !178}
!177 = !DIEnumerator(name: "DAV_LOCKTYPE_UNKNOWN", value: 0)
!178 = !DIEnumerator(name: "DAV_LOCKTYPE_WRITE", value: 1)
!179 = !{!42, !180, !76, !83, !182, !36, !221}
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !75, line: 40, baseType: !181)
!181 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_xml_elem", file: !184, line: 143, baseType: !185)
!184 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_xml.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "478ff65569ad8360e0ab2190ba58f12e")
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_xml_elem", file: !184, line: 162, size: 896, elements: !186)
!186 = !{!187, !188, !189, !190, !203, !204, !206, !207, !208, !216, !217, !220}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !184, line: 164, baseType: !33, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !185, file: !184, line: 166, baseType: !36, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !185, file: !184, line: 168, baseType: !33, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "first_cdata", scope: !185, file: !184, line: 171, baseType: !191, size: 128, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_text_header", file: !184, line: 61, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_text_header", file: !184, line: 64, size: 128, elements: !193)
!193 = !{!194, !202}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !192, file: !184, line: 66, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_text", file: !184, line: 50, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_text", file: !184, line: 53, size: 128, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !197, file: !184, line: 55, baseType: !33, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !184, line: 57, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !192, file: !184, line: 68, baseType: !195, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "following_cdata", scope: !185, file: !184, line: 173, baseType: !191, size: 128, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !185, file: !184, line: 176, baseType: !205, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !184, line: 178, baseType: !205, size: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "first_child", scope: !185, file: !184, line: 180, baseType: !205, size: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !185, file: !184, line: 182, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_xml_attr", file: !184, line: 148, size: 256, elements: !211)
!211 = !{!212, !213, !214, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !184, line: 150, baseType: !33, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !210, file: !184, line: 152, baseType: !36, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !210, file: !184, line: 155, baseType: !33, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !184, line: 158, baseType: !209, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "last_child", scope: !185, file: !184, line: 186, baseType: !205, size: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scope", scope: !185, file: !184, line: 188, baseType: !218, size: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_xml_ns_scope", file: !184, line: 188, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !185, file: !184, line: 192, baseType: !42, size: 64, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!223 = !{!0, !7, !12, !224, !229, !231, !235, !240, !245, !247, !252, !257, !259, !264, !269, !274, !276, !278, !283, !288, !290, !292, !294, !296}
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 103, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 34)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !9, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "aplog_module_index", scope: !14, file: !2, line: 148, type: !233, isLocal: true, isDefinition: true)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 44)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !2, line: 439, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 9)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !242, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 69)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 7)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !2, line: 534, type: !226, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !2, line: 559, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 5)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !2, line: 353, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 4)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 2)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !266, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !266, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !2, line: 392, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 12)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !2, line: 393, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 3)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !2, line: 393, type: !285, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 393, type: !285, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 398, type: !261, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !2, line: 404, type: !271, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !2, line: 693, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 1)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_hooks_db", file: !17, line: 276, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_hooks_propdb", file: !17, line: 267, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_hooks_propdb", file: !17, line: 1206, size: 832, elements: !305)
!305 = !{!306, !1050, !1054, !1066, !1078, !1090, !1096, !1100, !1104, !1109, !1110, !1121, !1125}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !304, file: !17, line: 1208, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!310, !94, !323, !36, !1016}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_error", file: !17, line: 135, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_error", file: !17, line: 121, size: 448, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319, !320, !322}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !312, file: !17, line: 122, baseType: !36, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "error_id", scope: !312, file: !17, line: 123, baseType: !36, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !312, file: !17, line: 124, baseType: !33, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "aprerr", scope: !312, file: !17, line: 126, baseType: !47, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !312, file: !17, line: 128, baseType: !33, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tagname", scope: !312, file: !17, line: 129, baseType: !33, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !312, file: !17, line: 131, baseType: !321, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "childtags", scope: !312, file: !17, line: 133, baseType: !33, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_resource", file: !17, line: 421, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_resource", file: !17, line: 387, size: 448, elements: !327)
!327 = !{!328, !330, !331, !332, !333, !334, !335, !336, !340, !1015}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !326, file: !17, line: 388, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_resource_type", file: !17, line: 315, baseType: !16)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !326, file: !17, line: 390, baseType: !36, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "collection", scope: !326, file: !17, line: 392, baseType: !36, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "versioned", scope: !326, file: !17, line: 396, baseType: !36, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "baselined", scope: !326, file: !17, line: 400, baseType: !36, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "working", scope: !326, file: !17, line: 404, baseType: !36, size: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !326, file: !17, line: 408, baseType: !33, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !326, file: !17, line: 412, baseType: !337, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_resource_private", file: !17, line: 320, baseType: !339)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "dav_resource_private", file: !17, line: 320, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !326, file: !17, line: 414, baseType: !341, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_hooks_repository", file: !17, line: 270, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_hooks_repository", file: !17, line: 1914, size: 1280, elements: !345)
!345 = !{!346, !347, !790, !794, !798, !799, !808, !812, !818, !822, !826, !830, !834, !854, !858, !862, !1008, !1009, !1010, !1014}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "handle_get", scope: !344, file: !17, line: 1922, baseType: !36, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "get_resource", scope: !344, file: !17, line: 1947, baseType: !348, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!310, !351, !33, !33, !36, !788}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_rec", file: !128, line: 811, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request_rec", file: !128, line: 838, size: 5888, elements: !354)
!354 = !{!355, !356, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !647, !648, !649, !650, !651, !652, !653, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !708, !709, !710, !711, !712, !713, !714, !719, !740, !777, !778, !779, !780, !781, !782, !783}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !353, file: !128, line: 840, baseType: !94, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !353, file: !128, line: 842, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_rec", file: !128, line: 809, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_rec", file: !128, line: 1145, size: 1664, elements: !360)
!360 = !{!361, !362, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !545, !602, !603, !604, !606, !615, !616, !617, !618, !619, !620, !622, !623, !626, !627, !632, !633}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !359, file: !128, line: 1147, baseType: !94, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "base_server", scope: !359, file: !128, line: 1149, baseType: !363, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_rec", file: !128, line: 807, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_rec", file: !128, line: 1315, size: 1536, elements: !366)
!366 = !{!367, !379, !380, !381, !386, !393, !396, !397, !398, !399, !400, !404, !405, !406, !407, !502, !509, !510, !511, !512, !523, !524, !525, !526, !527, !528, !529, !530}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !365, file: !128, line: 1317, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "process_rec", file: !128, line: 805, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "process_rec", file: !128, line: 822, size: 320, elements: !371)
!371 = !{!372, !373, !374, !375, !378}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !370, file: !128, line: 824, baseType: !94, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pconf", scope: !370, file: !128, line: 826, baseType: !94, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !370, file: !128, line: 828, baseType: !33, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !370, file: !128, line: 830, baseType: !376, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !370, file: !128, line: 832, baseType: !36, size: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !128, line: 1319, baseType: !363, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "error_fname", scope: !365, file: !128, line: 1324, baseType: !222, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "error_log", scope: !365, file: !128, line: 1326, baseType: !382, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !384, line: 188, baseType: !385)
!384 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9f1a845f7255d07e28e3a10d24320b5d")
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !150, line: 212, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !365, file: !128, line: 1328, baseType: !387, size: 128, offset: 256)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_logconf", file: !128, line: 1305, size: 128, elements: !388)
!388 = !{!389, !392}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "module_levels", scope: !387, file: !128, line: 1307, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !387, file: !128, line: 1310, baseType: !36, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "module_config", scope: !365, file: !128, line: 1334, baseType: !394, size: 64, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_conf_vector_t", file: !128, line: 791, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_defaults", scope: !365, file: !128, line: 1336, baseType: !394, size: 64, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "defn_name", scope: !365, file: !128, line: 1339, baseType: !33, size: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "defn_line_number", scope: !365, file: !128, line: 1341, baseType: !18, size: 32, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "is_virtual", scope: !365, file: !128, line: 1343, baseType: !4, size: 8, offset: 608)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !365, file: !128, line: 1349, baseType: !401, size: 16, offset: 624)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_port_t", file: !402, line: 230, baseType: !403)
!402 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_network_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "d28b53dbcb33f6acce926c2efb3f7365")
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint16_t", file: !66, line: 331, baseType: !181)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "server_scheme", scope: !365, file: !128, line: 1351, baseType: !33, size: 64, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "server_admin", scope: !365, file: !128, line: 1356, baseType: !222, size: 64, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "server_hostname", scope: !365, file: !128, line: 1358, baseType: !222, size: 64, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !365, file: !128, line: 1363, baseType: !408, size: 64, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_addr_rec", file: !128, line: 1293, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_addr_rec", file: !128, line: 1294, size: 256, elements: !411)
!411 = !{!412, !413, !414, !501}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !128, line: 1296, baseType: !408, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "virthost", scope: !410, file: !128, line: 1298, baseType: !222, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !410, file: !128, line: 1300, baseType: !415, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_sockaddr_t", file: !402, line: 235, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_sockaddr_t", file: !402, line: 239, size: 1536, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !425, !430, !431, !432, !433, !434}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !417, file: !402, line: 241, baseType: !94, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !417, file: !402, line: 243, baseType: !222, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "servname", scope: !417, file: !402, line: 245, baseType: !222, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !417, file: !402, line: 247, baseType: !401, size: 16, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !417, file: !402, line: 249, baseType: !424, size: 32, offset: 224)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !66, line: 333, baseType: !36)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !417, file: !402, line: 251, baseType: !426, size: 32, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_socklen_t", file: !66, line: 382, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !428, line: 33, baseType: !429)
!428 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !75, line: 210, baseType: !18)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_len", scope: !417, file: !402, line: 253, baseType: !36, size: 32, offset: 288)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "addr_str_len", scope: !417, file: !402, line: 256, baseType: !36, size: 32, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_ptr", scope: !417, file: !402, line: 259, baseType: !42, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !402, line: 262, baseType: !415, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !417, file: !402, line: 280, baseType: !435, size: 1024, offset: 512)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !417, file: !402, line: 264, size: 1024, elements: !436)
!436 = !{!437, !460, !483, !492}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !435, file: !402, line: 266, baseType: !438, size: 128)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !439, line: 245, size: 128, elements: !440)
!439 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!440 = !{!441, !444, !448, !455}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !438, file: !439, line: 247, baseType: !442, size: 16)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !443, line: 28, baseType: !181)
!443 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !438, file: !439, line: 248, baseType: !445, size: 16, offset: 16)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !439, line: 123, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !447, line: 25, baseType: !180)
!447 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !438, file: !439, line: 249, baseType: !449, size: 32, offset: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !439, line: 31, size: 32, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !449, file: !439, line: 33, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !439, line: 30, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !447, line: 26, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !75, line: 42, baseType: !18)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !438, file: !439, line: 252, baseType: !456, size: 64, offset: 64)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 64, elements: !458)
!457 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!458 = !{!459}
!459 = !DISubrange(count: 8)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !435, file: !402, line: 269, baseType: !461, size: 224)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !439, line: 260, size: 224, elements: !462)
!462 = !{!463, !464, !465, !466, !482}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !461, file: !439, line: 262, baseType: !442, size: 16)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !461, file: !439, line: 263, baseType: !445, size: 16, offset: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !461, file: !439, line: 264, baseType: !453, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !461, file: !439, line: 265, baseType: !467, size: 128, offset: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !439, line: 219, size: 128, elements: !468)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !467, file: !439, line: 226, baseType: !470, size: 128)
!470 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !467, file: !439, line: 221, size: 128, elements: !471)
!471 = !{!472, !478, !480}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !470, file: !439, line: 223, baseType: !473, size: 128)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 128, elements: !476)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !447, line: 24, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !75, line: 38, baseType: !457)
!476 = !{!477}
!477 = !DISubrange(count: 16)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !470, file: !439, line: 224, baseType: !479, size: 128)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 128, elements: !458)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !470, file: !439, line: 225, baseType: !481, size: 128)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 128, elements: !267)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !461, file: !439, line: 266, baseType: !453, size: 32, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sas", scope: !435, file: !402, line: 274, baseType: !484, size: 1024)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !428, line: 193, size: 1024, elements: !485)
!485 = !{!486, !487, !491}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !484, file: !428, line: 195, baseType: !442, size: 16)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !484, file: !428, line: 196, baseType: !488, size: 944, offset: 16)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 944, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 118)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !484, file: !428, line: 197, baseType: !69, size: 64, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "unx", scope: !435, file: !402, line: 278, baseType: !493, size: 880)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !494, line: 29, size: 880, elements: !495)
!494 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !493, file: !494, line: 31, baseType: !442, size: 16)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !493, file: !494, line: 32, baseType: !498, size: 864, offset: 16)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 864, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 108)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "host_port", scope: !410, file: !128, line: 1302, baseType: !401, size: 16, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !365, file: !128, line: 1365, baseType: !503, size: 64, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !504, line: 55, baseType: !505)
!504 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_time.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "1a8b9732d4ee010f71e3eb03e6e3a16e")
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !66, line: 371, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !507, line: 27, baseType: !508)
!507 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !75, line: 44, baseType: !76)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !365, file: !128, line: 1367, baseType: !503, size: 64, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !365, file: !128, line: 1369, baseType: !36, size: 32, offset: 1024)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !365, file: !128, line: 1371, baseType: !36, size: 32, offset: 1056)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !365, file: !128, line: 1374, baseType: !513, size: 64, offset: 1088)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_array_header_t", file: !515, line: 59, baseType: !516)
!515 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_tables.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "82dd315cfdbab9381cd05a1d2abe34a2")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_array_header_t", file: !515, line: 62, size: 256, elements: !517)
!517 = !{!518, !519, !520, !521, !522}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !516, file: !515, line: 64, baseType: !94, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !516, file: !515, line: 66, baseType: !36, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !516, file: !515, line: 68, baseType: !36, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !516, file: !515, line: 70, baseType: !36, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !516, file: !515, line: 72, baseType: !222, size: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "wild_names", scope: !365, file: !128, line: 1376, baseType: !513, size: 64, offset: 1152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !365, file: !128, line: 1379, baseType: !33, size: 64, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pathlen", scope: !365, file: !128, line: 1381, baseType: !36, size: 32, offset: 1280)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_line", scope: !365, file: !128, line: 1384, baseType: !36, size: 32, offset: 1312)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fieldsize", scope: !365, file: !128, line: 1386, baseType: !36, size: 32, offset: 1344)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fields", scope: !365, file: !128, line: 1388, baseType: !36, size: 32, offset: 1376)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !365, file: !128, line: 1391, baseType: !42, size: 64, offset: 1408)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout_set", scope: !365, file: !128, line: 1396, baseType: !18, size: 1, offset: 1472, flags: DIFlagBitField, extraData: i64 1472)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vhost_lookup_data", scope: !359, file: !128, line: 1151, baseType: !42, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !359, file: !128, line: 1155, baseType: !415, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "client_addr", scope: !359, file: !128, line: 1159, baseType: !415, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "client_ip", scope: !359, file: !128, line: 1164, baseType: !222, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "remote_host", scope: !359, file: !128, line: 1168, baseType: !222, size: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "remote_logname", scope: !359, file: !128, line: 1171, baseType: !222, size: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !359, file: !128, line: 1174, baseType: !222, size: 64, offset: 512)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "local_host", scope: !359, file: !128, line: 1177, baseType: !222, size: 64, offset: 576)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !359, file: !128, line: 1180, baseType: !76, size: 64, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "conn_config", scope: !359, file: !128, line: 1183, baseType: !394, size: 64, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !359, file: !128, line: 1186, baseType: !542, size: 64, offset: 768)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_table_t", file: !515, line: 56, baseType: !544)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_table_t", file: !515, line: 56, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "input_filters", scope: !359, file: !128, line: 1188, baseType: !546, size: 64, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_t", file: !111, line: 259, size: 320, elements: !548)
!548 = !{!549, !598, !599, !600, !601}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "frec", scope: !547, file: !111, line: 263, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_rec_t", file: !111, line: 199, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_rec_t", file: !111, line: 215, size: 448, elements: !553)
!553 = !{!554, !555, !583, !588, !590, !594, !596, !597}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !552, file: !111, line: 217, baseType: !33, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "filter_func", scope: !552, file: !111, line: 220, baseType: !556, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_func", file: !111, line: 146, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ap_filter_func", file: !111, line: 143, size: 64, elements: !558)
!558 = !{!559, !577}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "out_func", scope: !557, file: !111, line: 144, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_out_filter_func", file: !111, line: 134, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!47, !564, !566}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_t", file: !111, line: 94, baseType: !547)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_brigade", file: !29, line: 119, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_brigade", file: !29, line: 258, size: 256, elements: !569)
!569 = !{!570, !571, !576}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !568, file: !29, line: 264, baseType: !94, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !568, file: !29, line: 273, baseType: !572, size: 128, offset: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_list", file: !29, line: 273, size: 128, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !572, file: !29, line: 273, baseType: !57, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !572, file: !29, line: 273, baseType: !57, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_alloc", scope: !568, file: !29, line: 275, baseType: !80, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "in_func", scope: !557, file: !111, line: 145, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_in_filter_func", file: !111, line: 136, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!47, !564, !566, !582, !85, !71}
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_input_mode_t", file: !111, line: 63, baseType: !110)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "filter_init_func", scope: !552, file: !111, line: 230, baseType: !584, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_init_filter_func", file: !111, line: 141, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!36, !564}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !552, file: !111, line: 233, baseType: !589, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "providers", scope: !552, file: !111, line: 236, baseType: !591, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_provider_t", file: !111, line: 200, baseType: !593)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_provider_t", file: !111, line: 200, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !552, file: !111, line: 243, baseType: !595, size: 32, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_type", file: !111, line: 184, baseType: !119)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !552, file: !111, line: 246, baseType: !36, size: 32, offset: 352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "proto_flags", scope: !552, file: !111, line: 249, baseType: !18, size: 32, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !547, file: !111, line: 266, baseType: !42, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !547, file: !111, line: 269, baseType: !564, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !547, file: !111, line: 275, baseType: !351, size: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !547, file: !111, line: 280, baseType: !357, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "output_filters", scope: !359, file: !128, line: 1190, baseType: !546, size: 64, offset: 896)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sbh", scope: !359, file: !128, line: 1192, baseType: !42, size: 64, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_alloc", scope: !359, file: !128, line: 1194, baseType: !605, size: 64, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !359, file: !128, line: 1196, baseType: !607, size: 64, offset: 1088)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_state_t", file: !128, line: 813, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_state_t", file: !128, line: 1273, size: 64, elements: !610)
!610 = !{!611, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !609, file: !128, line: 1275, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_state_e", file: !128, line: 1262, baseType: !127)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sense", scope: !609, file: !128, line: 1277, baseType: !614, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_sense_e", file: !128, line: 1268, baseType: !139)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "data_in_input_filters", scope: !359, file: !128, line: 1198, baseType: !36, size: 32, offset: 1152)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "data_in_output_filters", scope: !359, file: !128, line: 1200, baseType: !36, size: 32, offset: 1184)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "clogging_input_filters", scope: !359, file: !128, line: 1205, baseType: !18, size: 1, offset: 1216, flags: DIFlagBitField, extraData: i64 1216)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "double_reverse", scope: !359, file: !128, line: 1209, baseType: !36, size: 2, offset: 1217, flags: DIFlagBitField, extraData: i64 1216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", scope: !359, file: !128, line: 1212, baseType: !18, size: 32, offset: 1248)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !359, file: !128, line: 1216, baseType: !621, size: 32, offset: 1280)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_conn_keepalive_e", file: !128, line: 1140, baseType: !144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "keepalives", scope: !359, file: !128, line: 1219, baseType: !36, size: 32, offset: 1312)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !359, file: !128, line: 1223, baseType: !624, size: 64, offset: 1344)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !359, file: !128, line: 1228, baseType: !33, size: 64, offset: 1408)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "current_thread", scope: !359, file: !128, line: 1237, baseType: !628, size: 64, offset: 1472)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_thread_t", file: !630, line: 178, baseType: !631)
!630 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_thread_proc.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "86521d0dbb7f1fbad577c4bb2abede6c")
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_t", file: !630, line: 178, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !359, file: !128, line: 1241, baseType: !357, size: 64, offset: 1536)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !359, file: !128, line: 1243, baseType: !36, size: 32, offset: 1600)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !353, file: !128, line: 844, baseType: !363, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !128, line: 847, baseType: !351, size: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !128, line: 849, baseType: !351, size: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !353, file: !128, line: 853, baseType: !351, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "the_request", scope: !353, file: !128, line: 859, baseType: !222, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "assbackwards", scope: !353, file: !128, line: 861, baseType: !36, size: 32, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "proxyreq", scope: !353, file: !128, line: 866, baseType: !36, size: 32, offset: 480)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "header_only", scope: !353, file: !128, line: 868, baseType: !36, size: 32, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "proto_num", scope: !353, file: !128, line: 870, baseType: !36, size: 32, offset: 544)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !353, file: !128, line: 872, baseType: !222, size: 64, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !353, file: !128, line: 876, baseType: !33, size: 64, offset: 640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "request_time", scope: !353, file: !128, line: 879, baseType: !646, size: 64, offset: 704)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !504, line: 45, baseType: !505)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "status_line", scope: !353, file: !128, line: 882, baseType: !33, size: 64, offset: 768)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !353, file: !128, line: 884, baseType: !36, size: 32, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "method_number", scope: !353, file: !128, line: 891, baseType: !36, size: 32, offset: 864)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !353, file: !128, line: 893, baseType: !33, size: 64, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !353, file: !128, line: 915, baseType: !505, size: 64, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_xmethods", scope: !353, file: !128, line: 917, baseType: !513, size: 64, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_methods", scope: !353, file: !128, line: 919, baseType: !654, size: 64, offset: 1088)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_method_list_t", file: !128, line: 634, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_method_list_t", file: !128, line: 643, size: 128, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "method_mask", scope: !656, file: !128, line: 645, baseType: !505, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "method_list", scope: !656, file: !128, line: 647, baseType: !513, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bodyct", scope: !353, file: !128, line: 922, baseType: !71, size: 64, offset: 1152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_sent", scope: !353, file: !128, line: 924, baseType: !71, size: 64, offset: 1216)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !353, file: !128, line: 926, baseType: !646, size: 64, offset: 1280)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !353, file: !128, line: 931, baseType: !33, size: 64, offset: 1344)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "clength", scope: !353, file: !128, line: 933, baseType: !71, size: 64, offset: 1408)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "chunked", scope: !353, file: !128, line: 935, baseType: !36, size: 32, offset: 1472)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "read_body", scope: !353, file: !128, line: 940, baseType: !36, size: 32, offset: 1504)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "read_chunked", scope: !353, file: !128, line: 942, baseType: !36, size: 32, offset: 1536)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "expecting_100", scope: !353, file: !128, line: 944, baseType: !18, size: 32, offset: 1568)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "kept_body", scope: !353, file: !128, line: 946, baseType: !566, size: 64, offset: 1600)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "body_table", scope: !353, file: !128, line: 950, baseType: !542, size: 64, offset: 1664)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !353, file: !128, line: 952, baseType: !71, size: 64, offset: 1728)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !353, file: !128, line: 954, baseType: !71, size: 64, offset: 1792)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "headers_in", scope: !353, file: !128, line: 969, baseType: !542, size: 64, offset: 1856)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "headers_out", scope: !353, file: !128, line: 971, baseType: !542, size: 64, offset: 1920)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "err_headers_out", scope: !353, file: !128, line: 974, baseType: !542, size: 64, offset: 1984)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "subprocess_env", scope: !353, file: !128, line: 976, baseType: !542, size: 64, offset: 2048)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !353, file: !128, line: 978, baseType: !542, size: 64, offset: 2112)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !353, file: !128, line: 985, baseType: !33, size: 64, offset: 2176)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !353, file: !128, line: 987, baseType: !33, size: 64, offset: 2240)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "content_encoding", scope: !353, file: !128, line: 990, baseType: !33, size: 64, offset: 2304)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "content_languages", scope: !353, file: !128, line: 992, baseType: !513, size: 64, offset: 2368)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "vlist_validator", scope: !353, file: !128, line: 995, baseType: !222, size: 64, offset: 2432)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !353, file: !128, line: 998, baseType: !222, size: 64, offset: 2496)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ap_auth_type", scope: !353, file: !128, line: 1000, baseType: !222, size: 64, offset: 2560)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "unparsed_uri", scope: !353, file: !128, line: 1007, baseType: !222, size: 64, offset: 2624)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !353, file: !128, line: 1009, baseType: !222, size: 64, offset: 2688)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !353, file: !128, line: 1011, baseType: !222, size: 64, offset: 2752)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_filename", scope: !353, file: !128, line: 1015, baseType: !222, size: 64, offset: 2816)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "path_info", scope: !353, file: !128, line: 1017, baseType: !222, size: 64, offset: 2880)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !353, file: !128, line: 1019, baseType: !222, size: 64, offset: 2944)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "used_path_info", scope: !353, file: !128, line: 1029, baseType: !36, size: 32, offset: 3008)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "eos_sent", scope: !353, file: !128, line: 1032, baseType: !36, size: 32, offset: 3040)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "per_dir_config", scope: !353, file: !128, line: 1040, baseType: !394, size: 64, offset: 3072)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "request_config", scope: !353, file: !128, line: 1042, baseType: !394, size: 64, offset: 3136)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !353, file: !128, line: 1047, baseType: !624, size: 64, offset: 3200)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !353, file: !128, line: 1052, baseType: !33, size: 64, offset: 3264)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "htaccess", scope: !353, file: !128, line: 1060, baseType: !698, size: 64, offset: 3328)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htaccess_result", file: !128, line: 781, size: 320, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !700, file: !128, line: 783, baseType: !33, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !700, file: !128, line: 785, baseType: !36, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "override_opts", scope: !700, file: !128, line: 787, baseType: !36, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "override_list", scope: !700, file: !128, line: 789, baseType: !542, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "htaccess", scope: !700, file: !128, line: 791, baseType: !394, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !700, file: !128, line: 793, baseType: !698, size: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "output_filters", scope: !353, file: !128, line: 1063, baseType: !546, size: 64, offset: 3392)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "input_filters", scope: !353, file: !128, line: 1065, baseType: !546, size: 64, offset: 3456)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "proto_output_filters", scope: !353, file: !128, line: 1069, baseType: !546, size: 64, offset: 3520)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "proto_input_filters", scope: !353, file: !128, line: 1072, baseType: !546, size: 64, offset: 3584)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "no_cache", scope: !353, file: !128, line: 1075, baseType: !36, size: 32, offset: 3648)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "no_local_copy", scope: !353, file: !128, line: 1077, baseType: !36, size: 32, offset: 3680)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "invoke_mtx", scope: !353, file: !128, line: 1082, baseType: !715, size: 64, offset: 3712)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_thread_mutex_t", file: !717, line: 41, baseType: !718)
!717 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_thread_mutex.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "333d6b386ebd5ebf2a57c53b3ab4b684")
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !717, line: 41, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "parsed_uri", scope: !353, file: !128, line: 1085, baseType: !720, size: 704, offset: 3776)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uri_t", file: !721, line: 80, baseType: !722)
!721 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_uri.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9269047179f727bd075392a12871b578")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_uri_t", file: !721, line: 85, size: 704, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !736, !737, !738, !739}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !722, file: !721, line: 87, baseType: !222, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "hostinfo", scope: !722, file: !721, line: 89, baseType: !222, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !722, file: !721, line: 91, baseType: !222, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !722, file: !721, line: 93, baseType: !222, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !722, file: !721, line: 95, baseType: !222, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "port_str", scope: !722, file: !721, line: 97, baseType: !222, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !722, file: !721, line: 99, baseType: !222, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !722, file: !721, line: 101, baseType: !222, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !722, file: !721, line: 103, baseType: !222, size: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "hostent", scope: !722, file: !721, line: 106, baseType: !734, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", file: !721, line: 106, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !722, file: !721, line: 109, baseType: !401, size: 16, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !722, file: !721, line: 112, baseType: !18, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 656)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dns_looked_up", scope: !722, file: !721, line: 115, baseType: !18, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 656)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dns_resolved", scope: !722, file: !721, line: 117, baseType: !18, size: 1, offset: 658, flags: DIFlagBitField, extraData: i64 656)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "finfo", scope: !353, file: !128, line: 1087, baseType: !741, size: 960, offset: 4480)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_finfo_t", file: !150, line: 143, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !150, line: 174, size: 960, elements: !743)
!743 = !{!744, !745, !746, !748, !750, !755, !759, !763, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !742, file: !150, line: 176, baseType: !94, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !742, file: !150, line: 179, baseType: !424, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !742, file: !150, line: 181, baseType: !747, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !150, line: 125, baseType: !424)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !742, file: !150, line: 186, baseType: !749, size: 32, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !150, line: 72, baseType: !149)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !742, file: !150, line: 188, baseType: !751, size: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !752, line: 45, baseType: !753)
!752 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_user.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "724f26fd838740b0ca4b55f59030741b")
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !73, line: 79, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !75, line: 146, baseType: !18)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !742, file: !150, line: 190, baseType: !756, size: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !752, line: 54, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !73, line: 64, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !75, line: 147, baseType: !18)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !742, file: !150, line: 192, baseType: !760, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !66, line: 383, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !73, line: 47, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !75, line: 148, baseType: !69)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !742, file: !150, line: 194, baseType: !764, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !150, line: 135, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !73, line: 59, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !75, line: 145, baseType: !69)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !742, file: !150, line: 196, baseType: !424, size: 32, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !742, file: !150, line: 198, baseType: !71, size: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !742, file: !150, line: 200, baseType: !71, size: 64, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !742, file: !150, line: 202, baseType: !646, size: 64, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !742, file: !150, line: 204, baseType: !646, size: 64, offset: 640)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !742, file: !150, line: 206, baseType: !646, size: 64, offset: 704)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !742, file: !150, line: 208, baseType: !33, size: 64, offset: 768)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !742, file: !150, line: 210, baseType: !33, size: 64, offset: 832)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !742, file: !150, line: 212, baseType: !776, size: 64, offset: 896)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_addr", scope: !353, file: !128, line: 1093, baseType: !415, size: 64, offset: 5440)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_ip", scope: !353, file: !128, line: 1094, baseType: !222, size: 64, offset: 5504)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "trailers_in", scope: !353, file: !128, line: 1097, baseType: !542, size: 64, offset: 5568)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "trailers_out", scope: !353, file: !128, line: 1099, baseType: !542, size: 64, offset: 5632)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_host", scope: !353, file: !128, line: 1104, baseType: !222, size: 64, offset: 5696)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "double_reverse", scope: !353, file: !128, line: 1108, baseType: !36, size: 32, offset: 5760)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bnotes", scope: !353, file: !128, line: 1113, baseType: !784, size: 64, offset: 5824)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_request_bnotes_t", file: !128, line: 662, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint64_t", file: !66, line: 372, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !447, line: 27, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !75, line: 45, baseType: !69)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent_resource", scope: !344, file: !17, line: 1962, baseType: !791, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!310, !323, !788}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "is_same_resource", scope: !344, file: !17, line: 1971, baseType: !795, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!36, !323, !323}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "is_parent_resource", scope: !344, file: !17, line: 1981, baseType: !795, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "open_stream", scope: !344, file: !17, line: 1990, baseType: !800, size: 64, offset: 320)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!310, !323, !803, !804}
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_stream_mode", file: !17, line: 1905, baseType: !161)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_stream", file: !17, line: 1900, baseType: !807)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "dav_stream", file: !17, line: 1900, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "close_stream", scope: !344, file: !17, line: 2010, baseType: !809, size: 64, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!310, !805, !36}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "write_stream", scope: !344, file: !17, line: 2017, baseType: !813, size: 64, offset: 448)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!310, !805, !816, !65}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "seek_stream", scope: !344, file: !17, line: 2027, baseType: !819, size: 64, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!310, !805, !71}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "set_headers", scope: !344, file: !17, line: 2040, baseType: !823, size: 64, offset: 576)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!310, !351, !323}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "deliver", scope: !344, file: !17, line: 2056, baseType: !827, size: 64, offset: 640)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!310, !323, !564}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "create_collection", scope: !344, file: !17, line: 2065, baseType: !831, size: 64, offset: 704)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!310, !789}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "copy_resource", scope: !344, file: !17, line: 2082, baseType: !835, size: 64, offset: 768)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!310, !323, !789, !36, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_response", file: !17, line: 188, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_response", file: !17, line: 492, size: 384, elements: !842)
!842 = !{!843, !844, !845, !851, !852}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "href", scope: !841, file: !17, line: 494, baseType: !33, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !841, file: !17, line: 495, baseType: !33, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "propresult", scope: !841, file: !17, line: 498, baseType: !846, size: 128, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_get_props_result", file: !17, line: 489, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 485, size: 128, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "propstats", scope: !847, file: !17, line: 487, baseType: !195, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "xmlns", scope: !847, file: !17, line: 488, baseType: !195, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !841, file: !17, line: 500, baseType: !36, size: 32, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !841, file: !17, line: 502, baseType: !853, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "move_resource", scope: !344, file: !17, line: 2097, baseType: !855, size: 64, offset: 832)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!310, !789, !789, !838}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "remove_resource", scope: !344, file: !17, line: 2110, baseType: !859, size: 64, offset: 896)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!310, !789, !838}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "walk", scope: !344, file: !17, line: 2126, baseType: !863, size: 64, offset: 960)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!310, !866, !36, !838}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_walk_params", file: !17, line: 1840, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 1820, size: 384, elements: !870)
!870 = !{!871, !872, !884, !885, !886, !887}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !869, file: !17, line: 1822, baseType: !36, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !869, file: !17, line: 1828, baseType: !873, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!310, !876, !36}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_walk_resource", file: !17, line: 1818, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 1804, size: 256, elements: !879)
!879 = !{!880, !881, !882, !883}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "walk_ctx", scope: !878, file: !17, line: 1807, baseType: !42, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !878, file: !17, line: 1810, baseType: !94, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "resource", scope: !878, file: !17, line: 1813, baseType: !323, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !878, file: !17, line: 1816, baseType: !839, size: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "walk_ctx", scope: !869, file: !17, line: 1829, baseType: !42, size: 64, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !869, file: !17, line: 1832, baseType: !94, size: 64, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !869, file: !17, line: 1835, baseType: !323, size: 64, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lockdb", scope: !869, file: !17, line: 1838, baseType: !888, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_lockdb", file: !17, line: 1340, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 1333, size: 192, elements: !891)
!891 = !{!892, !1003, !1004}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !890, file: !17, line: 1335, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_hooks_locks", file: !17, line: 268, baseType: !896)
