; ModuleID = 'samples/378.bc'
source_filename = "pandas/_libs/src/ujson/python/JSONtoObj.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, ptr }
%struct._longobject = type { %struct.PyVarObject, [1 x i32] }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.__JSONObjectDecoder = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr }
%struct.__NpyArrContext = type { ptr, [2 x ptr], %struct.PyArray_Dims, ptr, i64, i64, i64 }
%struct.PyArray_Dims = type { ptr, i32 }
%struct.__PyObjectDecoder = type { %struct.__JSONObjectDecoder, ptr, ptr, i64, ptr }
%struct.PyTupleObject = type { %struct.PyVarObject, [1 x ptr] }
%struct._PyArray_Descr = type { %struct._object, ptr, i8, i8, i8, i8, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.tagPyArrayObject_fields = type { %struct._object, ptr, i32, ptr, ptr, ptr, ptr, i32, ptr }
%struct.PyArray_ArrFuncs = type { [21 x ptr], ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, [3 x ptr], [3 x ptr], ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

!27 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/py-numpy-1.25.2-kmv6orrhibhm5efmdekmyqgaicrkcsqz/lib/python3.9/site-packages/numpy/core/include/numpy/ndarraytypes.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "94ee16a4bda64e45ef6f9ea15a2ebf5a")
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "NPY_CLIP", value: 0)
!31 = !DIEnumerator(name: "NPY_WRAP", value: 1)
!32 = !DIEnumerator(name: "NPY_RAISE", value: 2)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NPY_TYPES", file: !27, line: 48, baseType: !28, size: 32, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!35 = !DIEnumerator(name: "NPY_BOOL", value: 0)
!36 = !DIEnumerator(name: "NPY_BYTE", value: 1)
!37 = !DIEnumerator(name: "NPY_UBYTE", value: 2)
!38 = !DIEnumerator(name: "NPY_SHORT", value: 3)
!39 = !DIEnumerator(name: "NPY_USHORT", value: 4)
!40 = !DIEnumerator(name: "NPY_INT", value: 5)
!41 = !DIEnumerator(name: "NPY_UINT", value: 6)
!42 = !DIEnumerator(name: "NPY_LONG", value: 7)
!43 = !DIEnumerator(name: "NPY_ULONG", value: 8)
!44 = !DIEnumerator(name: "NPY_LONGLONG", value: 9)
!45 = !DIEnumerator(name: "NPY_ULONGLONG", value: 10)
!46 = !DIEnumerator(name: "NPY_FLOAT", value: 11)
!47 = !DIEnumerator(name: "NPY_DOUBLE", value: 12)
!48 = !DIEnumerator(name: "NPY_LONGDOUBLE", value: 13)
!49 = !DIEnumerator(name: "NPY_CFLOAT", value: 14)
!50 = !DIEnumerator(name: "NPY_CDOUBLE", value: 15)
!51 = !DIEnumerator(name: "NPY_CLONGDOUBLE", value: 16)
!52 = !DIEnumerator(name: "NPY_OBJECT", value: 17)
!53 = !DIEnumerator(name: "NPY_STRING", value: 18)
!54 = !DIEnumerator(name: "NPY_UNICODE", value: 19)
!55 = !DIEnumerator(name: "NPY_VOID", value: 20)
!56 = !DIEnumerator(name: "NPY_DATETIME", value: 21)
!57 = !DIEnumerator(name: "NPY_TIMEDELTA", value: 22)
!58 = !DIEnumerator(name: "NPY_HALF", value: 23)
!59 = !DIEnumerator(name: "NPY_NTYPES", value: 24)
!60 = !DIEnumerator(name: "NPY_NOTYPE", value: 25)
!61 = !DIEnumerator(name: "NPY_CHAR", value: 26)
!62 = !DIEnumerator(name: "NPY_USERDEF", value: 256)
!63 = !DIEnumerator(name: "NPY_NTYPES_ABI_COMPATIBLE", value: 21)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 183, baseType: !65, size: 32, elements: !66)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !{!67, !68, !69, !70}
!67 = !DIEnumerator(name: "NPY_ANYORDER", value: -1)
!68 = !DIEnumerator(name: "NPY_CORDER", value: 0)
!69 = !DIEnumerator(name: "NPY_FORTRANORDER", value: 1)
!70 = !DIEnumerator(name: "NPY_KEEPORDER", value: 2)
!71 = !{!72, !73, !370, !686, !703, !711, !716, !453, !719, !732, !734, !739, !87, !741, !745, !748, !749, !114, !752, !755, !756, !85, !765}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !75, line: 109, baseType: !76)
!75 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/object.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "3f9979776300c70b1e34aa51eda1adeb")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !75, line: 105, size: 128, elements: !77)
!77 = !{!78, !86}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !76, file: !75, line: 107, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !80, line: 105, baseType: !81)
!80 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/pyport.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "130a2fc9ce18e45cf2f23659ef07d5ba")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !82, line: 77, baseType: !83)
!82 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !84, line: 194, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!85 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !76, file: !75, line: 108, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !75, line: 66, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !90, line: 193, size: 3264, elements: !91)
!90 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/object.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "90f773997436a8640d3c606f1a7092f7")
!91 = !{!92, !98, !101, !102, !103, !108, !109, !115, !120, !132, !134, !187, !218, !230, !236, !237, !238, !240, !242, !273, !275, !276, !285, !286, !291, !292, !294, !296, !306, !309, !327, !329, !330, !332, !334, !335, !337, !342, !347, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !89, file: !90, line: 194, baseType: !93, size: 192)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !75, line: 118, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 115, size: 192, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !94, file: !75, line: 116, baseType: !74, size: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !94, file: !75, line: 117, baseType: !79, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !89, file: !90, line: 195, baseType: !99, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !89, file: !90, line: 196, baseType: !79, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !89, file: !90, line: 196, baseType: !79, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !89, file: !90, line: 200, baseType: !104, size: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !75, line: 180, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !73}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !89, file: !90, line: 201, baseType: !79, size: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !89, file: !90, line: 202, baseType: !110, size: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !75, line: 181, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!73, !73, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !89, file: !90, line: 203, baseType: !116, size: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !75, line: 183, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!65, !73, !114, !73}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !89, file: !90, line: 204, baseType: !121, size: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !90, line: 182, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 178, size: 192, elements: !124)
!124 = !{!125, !130, !131}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !123, file: !90, line: 179, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !75, line: 163, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!73, !73}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !123, file: !90, line: 180, baseType: !126, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !123, file: !90, line: 181, baseType: !126, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !89, file: !90, line: 206, baseType: !133, size: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !75, line: 185, baseType: !127)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !89, file: !90, line: 210, baseType: !135, size: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !90, line: 156, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 111, size: 2304, elements: !138)
!138 = !{!139, !144, !145, !146, !147, !148, !153, !154, !155, !156, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !137, file: !90, line: 116, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !75, line: 164, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!73, !73, !73}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !137, file: !90, line: 117, baseType: !140, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !137, file: !90, line: 118, baseType: !140, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !137, file: !90, line: 119, baseType: !140, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !137, file: !90, line: 120, baseType: !140, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !137, file: !90, line: 121, baseType: !149, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !75, line: 165, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!73, !73, !73, !73}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !137, file: !90, line: 122, baseType: !126, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !137, file: !90, line: 123, baseType: !126, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !137, file: !90, line: 124, baseType: !126, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !137, file: !90, line: 125, baseType: !157, size: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !75, line: 166, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!65, !73}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !137, file: !90, line: 126, baseType: !126, size: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !137, file: !90, line: 127, baseType: !140, size: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !137, file: !90, line: 128, baseType: !140, size: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !137, file: !90, line: 129, baseType: !140, size: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !137, file: !90, line: 130, baseType: !140, size: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !137, file: !90, line: 131, baseType: !140, size: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !137, file: !90, line: 132, baseType: !126, size: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !137, file: !90, line: 133, baseType: !72, size: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !137, file: !90, line: 134, baseType: !126, size: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !137, file: !90, line: 136, baseType: !140, size: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !137, file: !90, line: 137, baseType: !140, size: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !137, file: !90, line: 138, baseType: !140, size: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !137, file: !90, line: 139, baseType: !140, size: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !137, file: !90, line: 140, baseType: !149, size: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !137, file: !90, line: 141, baseType: !140, size: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !137, file: !90, line: 142, baseType: !140, size: 64, offset: 1600)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !137, file: !90, line: 143, baseType: !140, size: 64, offset: 1664)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !137, file: !90, line: 144, baseType: !140, size: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !137, file: !90, line: 145, baseType: !140, size: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !137, file: !90, line: 147, baseType: !140, size: 64, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !137, file: !90, line: 148, baseType: !140, size: 64, offset: 1920)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !137, file: !90, line: 149, baseType: !140, size: 64, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !137, file: !90, line: 150, baseType: !140, size: 64, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !137, file: !90, line: 152, baseType: !126, size: 64, offset: 2112)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !137, file: !90, line: 154, baseType: !140, size: 64, offset: 2176)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !137, file: !90, line: 155, baseType: !140, size: 64, offset: 2240)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !89, file: !90, line: 211, baseType: !188, size: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !90, line: 170, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 158, size: 640, elements: !191)
!191 = !{!192, !197, !198, !203, !204, !205, !210, !211, !216, !217}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !190, file: !90, line: 159, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !75, line: 167, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!79, !73}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !190, file: !90, line: 160, baseType: !140, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !190, file: !90, line: 161, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !75, line: 168, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!73, !73, !79}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !190, file: !90, line: 162, baseType: !199, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !190, file: !90, line: 163, baseType: !72, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !190, file: !90, line: 164, baseType: !206, size: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !75, line: 170, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!65, !73, !79, !73}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !190, file: !90, line: 165, baseType: !72, size: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !190, file: !90, line: 166, baseType: !212, size: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !75, line: 174, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!65, !73, !73}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !190, file: !90, line: 168, baseType: !140, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !190, file: !90, line: 169, baseType: !199, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !89, file: !90, line: 212, baseType: !219, size: 64, offset: 896)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !90, line: 176, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 172, size: 192, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !221, file: !90, line: 173, baseType: !193, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !221, file: !90, line: 174, baseType: !140, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !221, file: !90, line: 175, baseType: !226, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !75, line: 172, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!65, !73, !73, !73}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !89, file: !90, line: 216, baseType: !231, size: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !75, line: 186, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !73}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !80, line: 114, baseType: !79)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !89, file: !90, line: 217, baseType: !149, size: 64, offset: 1024)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !89, file: !90, line: 218, baseType: !133, size: 64, offset: 1088)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !89, file: !90, line: 219, baseType: !239, size: 64, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !75, line: 182, baseType: !141)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !89, file: !90, line: 220, baseType: !241, size: 64, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !75, line: 184, baseType: !227)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !89, file: !90, line: 223, baseType: !243, size: 64, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !90, line: 187, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 184, size: 128, elements: !246)
!246 = !{!247, !268}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !245, file: !90, line: 185, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !90, line: 71, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!65, !73, !252, !65}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !90, line: 69, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !90, line: 56, size: 640, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !265, !266, !267}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !254, file: !90, line: 57, baseType: !72, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !254, file: !90, line: 58, baseType: !73, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !254, file: !90, line: 59, baseType: !79, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !254, file: !90, line: 60, baseType: !79, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !254, file: !90, line: 62, baseType: !65, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !254, file: !90, line: 63, baseType: !65, size: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !254, file: !90, line: 64, baseType: !114, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !254, file: !90, line: 65, baseType: !264, size: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !254, file: !90, line: 66, baseType: !264, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !254, file: !90, line: 67, baseType: !264, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !254, file: !90, line: 68, baseType: !72, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !245, file: !90, line: 186, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !90, line: 72, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !73, !252}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !89, file: !90, line: 226, baseType: !274, size: 64, offset: 1344)
!274 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !89, file: !90, line: 228, baseType: !99, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !89, file: !90, line: 232, baseType: !277, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !75, line: 176, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!65, !73, !281, !72}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !75, line: 175, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!65, !73, !72}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !89, file: !90, line: 235, baseType: !157, size: 64, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !89, file: !90, line: 239, baseType: !287, size: 64, offset: 1600)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !75, line: 187, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!73, !73, !73, !65}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !89, file: !90, line: 242, baseType: !79, size: 64, offset: 1664)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !89, file: !90, line: 245, baseType: !293, size: 64, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !75, line: 188, baseType: !127)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !89, file: !90, line: 246, baseType: !295, size: 64, offset: 1792)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !75, line: 189, baseType: !127)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !89, file: !90, line: 249, baseType: !297, size: 64, offset: 1856)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !299, line: 35, size: 256, elements: !300)
!299 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/methodobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "bbf63d5b676c05c658805ba163513296")
!300 = !{!301, !302, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !298, file: !299, line: 36, baseType: !99, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !298, file: !299, line: 37, baseType: !303, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !299, line: 19, baseType: !141)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !298, file: !299, line: 38, baseType: !65, size: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !298, file: !299, line: 40, baseType: !99, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !89, file: !90, line: 250, baseType: !307, size: 64, offset: 1920)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !90, line: 250, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !89, file: !90, line: 251, baseType: !310, size: 64, offset: 1984)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !312, line: 11, size: 320, elements: !313)
!312 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/descrobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "4865dae4e254db6f261f61dcb32e8571")
!313 = !{!314, !315, !320, !325, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !312, line: 12, baseType: !99, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !311, file: !312, line: 13, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !312, line: 8, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!73, !73, !72}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !311, file: !312, line: 14, baseType: !321, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !312, line: 9, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!65, !73, !73, !72}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !311, file: !312, line: 15, baseType: !99, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !311, file: !312, line: 16, baseType: !72, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !89, file: !90, line: 252, baseType: !328, size: 64, offset: 2048)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !89, file: !90, line: 253, baseType: !73, size: 64, offset: 2112)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !89, file: !90, line: 254, baseType: !331, size: 64, offset: 2176)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !75, line: 190, baseType: !150)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !89, file: !90, line: 255, baseType: !333, size: 64, offset: 2240)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !75, line: 191, baseType: !227)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !89, file: !90, line: 256, baseType: !79, size: 64, offset: 2304)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !89, file: !90, line: 257, baseType: !336, size: 64, offset: 2368)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !75, line: 192, baseType: !227)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !89, file: !90, line: 258, baseType: !338, size: 64, offset: 2432)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !75, line: 194, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!73, !87, !79}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !89, file: !90, line: 259, baseType: !343, size: 64, offset: 2496)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !75, line: 193, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!73, !87, !73, !73}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !89, file: !90, line: 260, baseType: !348, size: 64, offset: 2560)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !75, line: 179, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !72}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !89, file: !90, line: 261, baseType: !157, size: 64, offset: 2624)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !89, file: !90, line: 262, baseType: !73, size: 64, offset: 2688)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !89, file: !90, line: 263, baseType: !73, size: 64, offset: 2752)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !89, file: !90, line: 264, baseType: !73, size: 64, offset: 2816)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !89, file: !90, line: 265, baseType: !73, size: 64, offset: 2880)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !89, file: !90, line: 266, baseType: !73, size: 64, offset: 2944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !89, file: !90, line: 267, baseType: !104, size: 64, offset: 3008)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !89, file: !90, line: 270, baseType: !28, size: 32, offset: 3072)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !89, file: !90, line: 272, baseType: !104, size: 64, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !89, file: !90, line: 273, baseType: !362, size: 64, offset: 3200)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !90, line: 74, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!73, !73, !366, !368, !73}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !369, line: 70, baseType: !274)
!369 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObjectDecoder", file: !2, line: 55, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__PyObjectDecoder", file: !2, line: 47, size: 1792, elements: !373)
!373 = !{!374, !460, !461, !462, !469}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dec", scope: !372, file: !2, line: 48, baseType: !375, size: 1536)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSONObjectDecoder", file: !376, line: 310, baseType: !377)
!376 = !DIFile(filename: "pandas/_libs/src/ujson/lib/ultrajson.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build/aidengro/spack-stage-py-pandas-1.5.3-t2ah26ijbt7dck44kjkjgtwnjnacpkvn/spack-src", checksumkind: CSK_MD5, checksum: "aa7a8804f012238d790589e0448b2fd6")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__JSONObjectDecoder", file: !376, line: 285, size: 1536, elements: !378)
!378 = !{!379, !386, !390, !394, !398, !399, !400, !401, !402, !406, !410, !411, !412, !420, !427, !435, !440, !444, !449, !451, !456, !457, !458, !459}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "newString", scope: !377, file: !376, line: 286, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!383, !72, !384, !384}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSOBJ", file: !376, line: 156, baseType: !72)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !369, line: 96, baseType: !65)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "objectAddKey", scope: !377, file: !376, line: 287, baseType: !387, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!65, !72, !383, !383, !383}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "arrayAddItem", scope: !377, file: !376, line: 288, baseType: !391, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!65, !72, !383, !383}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "newTrue", scope: !377, file: !376, line: 289, baseType: !395, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!383, !72}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "newFalse", scope: !377, file: !376, line: 290, baseType: !395, size: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "newNull", scope: !377, file: !376, line: 291, baseType: !395, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "newPosInf", scope: !377, file: !376, line: 292, baseType: !395, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "newNegInf", scope: !377, file: !376, line: 293, baseType: !395, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "newObject", scope: !377, file: !376, line: 294, baseType: !403, size: 64, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!383, !72, !72}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "endObject", scope: !377, file: !376, line: 295, baseType: !407, size: 64, offset: 576)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!383, !72, !383}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "newArray", scope: !377, file: !376, line: 296, baseType: !403, size: 64, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "endArray", scope: !377, file: !376, line: 297, baseType: !407, size: 64, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "newInt", scope: !377, file: !376, line: 298, baseType: !413, size: 64, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!383, !72, !416}
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSINT32", file: !376, line: 106, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !418, line: 26, baseType: !419)
!418 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !84, line: 41, baseType: !65)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "newLong", scope: !377, file: !376, line: 299, baseType: !421, size: 64, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!383, !72, !424}
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSINT64", file: !376, line: 103, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !418, line: 27, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !84, line: 44, baseType: !85)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "newUnsignedLong", scope: !377, file: !376, line: 300, baseType: !428, size: 64, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!383, !72, !431}
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSUINT64", file: !376, line: 104, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !433, line: 27, baseType: !434)
!433 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !84, line: 45, baseType: !274)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "newDouble", scope: !377, file: !376, line: 301, baseType: !436, size: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!383, !72, !439}
!439 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "releaseObject", scope: !377, file: !376, line: 302, baseType: !441, size: 64, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !72, !383, !72}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !377, file: !376, line: 303, baseType: !445, size: 64, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSPFN_MALLOC", file: !376, line: 173, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!72, !368}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !377, file: !376, line: 304, baseType: !450, size: 64, offset: 1152)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSPFN_FREE", file: !376, line: 174, baseType: !349)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !377, file: !376, line: 305, baseType: !452, size: 64, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSPFN_REALLOC", file: !376, line: 175, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!72, !72, !368}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "errorStr", scope: !377, file: !376, line: 306, baseType: !114, size: 64, offset: 1280)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "errorOffset", scope: !377, file: !376, line: 307, baseType: !114, size: 64, offset: 1344)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "preciseFloat", scope: !377, file: !376, line: 308, baseType: !65, size: 32, offset: 1408)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "prv", scope: !377, file: !376, line: 309, baseType: !72, size: 64, offset: 1472)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "npyarr", scope: !372, file: !2, line: 50, baseType: !72, size: 64, offset: 1536)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "npyarr_addr", scope: !372, file: !2, line: 51, baseType: !72, size: 64, offset: 1600)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "curdim", scope: !372, file: !2, line: 52, baseType: !463, size: 64, offset: 1664)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "npy_intp", file: !464, line: 198, baseType: !465)
!464 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/py-numpy-1.25.2-kmv6orrhibhm5efmdekmyqgaicrkcsqz/lib/python3.9/site-packages/numpy/core/include/numpy/npy_common.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "8251568495f8deef784ad9f86b3030e6")
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_intptr_t", file: !80, line: 98, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !467, line: 267, baseType: !468)
!467 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !84, line: 207, baseType: !85)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !372, file: !2, line: 54, baseType: !470, size: 64, offset: 1728)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_Descr", file: !27, line: 636, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PyArray_Descr", file: !27, line: 576, size: 768, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !489, !490, !491, !664, !665, !684}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !472, file: !27, line: 577, baseType: !74, size: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "typeobj", scope: !472, file: !27, line: 584, baseType: !87, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !472, file: !27, line: 586, baseType: !4, size: 8, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !472, file: !27, line: 588, baseType: !4, size: 8, offset: 200)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "byteorder", scope: !472, file: !27, line: 593, baseType: !4, size: 8, offset: 208)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !472, file: !27, line: 595, baseType: !4, size: 8, offset: 216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type_num", scope: !472, file: !27, line: 597, baseType: !65, size: 32, offset: 224)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "elsize", scope: !472, file: !27, line: 599, baseType: !65, size: 32, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !472, file: !27, line: 601, baseType: !65, size: 32, offset: 288)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "subarray", scope: !472, file: !27, line: 607, baseType: !484, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_arr_descr", file: !27, line: 638, size: 128, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !485, file: !27, line: 639, baseType: !470, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !485, file: !27, line: 640, baseType: !73, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !472, file: !27, line: 613, baseType: !73, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !472, file: !27, line: 618, baseType: !73, size: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !472, file: !27, line: 623, baseType: !492, size: 64, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_ArrFuncs", file: !27, line: 538, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 428, size: 3008, elements: !495)
!495 = !{!496, !504, !509, !514, !519, !524, !531, !537, !542, !602, !608, !615, !620, !625, !631, !637, !638, !643, !646, !647, !652, !657, !663}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "cast", scope: !494, file: !27, line: 435, baseType: !497, size: 1344)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 1344, elements: !502)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_VectorUnaryFunc", file: !27, line: 387, baseType: !500)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !72, !72, !463, !72, !72}
!502 = !{!503}
!503 = !DISubrange(count: 21)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "getitem", scope: !494, file: !27, line: 443, baseType: !505, size: 64, offset: 1344)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_GetItemFunc", file: !27, line: 366, baseType: !507)
!507 = !DISubroutineType(types: !508)
!508 = !{!73, !72, !72}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "setitem", scope: !494, file: !27, line: 444, baseType: !510, size: 64, offset: 1408)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_SetItemFunc", file: !27, line: 367, baseType: !512)
!512 = !DISubroutineType(types: !513)
!513 = !{!65, !73, !72, !72}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "copyswapn", scope: !494, file: !27, line: 450, baseType: !515, size: 64, offset: 1472)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_CopySwapNFunc", file: !27, line: 369, baseType: !517)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !72, !463, !72, !463, !463, !65, !72}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "copyswap", scope: !494, file: !27, line: 451, baseType: !520, size: 64, offset: 1536)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_CopySwapFunc", file: !27, line: 372, baseType: !522)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !72, !72, !65, !72}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !494, file: !27, line: 457, baseType: !525, size: 64, offset: 1600)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_CompareFunc", file: !27, line: 381, baseType: !527)
!527 = !DISubroutineType(types: !528)
!528 = !{!65, !529, !529, !72}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "argmax", scope: !494, file: !27, line: 463, baseType: !532, size: 64, offset: 1664)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_ArgFunc", file: !27, line: 382, baseType: !534)
!534 = !DISubroutineType(types: !535)
!535 = !{!65, !72, !463, !536, !72}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dotfunc", scope: !494, file: !27, line: 469, baseType: !538, size: 64, offset: 1728)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_DotFunc", file: !27, line: 384, baseType: !540)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !72, !463, !72, !463, !72, !463, !72}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "scanfunc", scope: !494, file: !27, line: 476, baseType: !543, size: 64, offset: 1792)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_ScanFunc", file: !27, line: 394, baseType: !545)
!545 = !DISubroutineType(types: !546)
!546 = !{!65, !547, !72, !114, !601}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !549, line: 7, baseType: !550)
!549 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !551, line: 49, size: 1728, elements: !552)
!551 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !568, !570, !571, !572, !574, !576, !578, !582, !585, !587, !590, !593, !594, !595, !596, !597}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !550, file: !551, line: 51, baseType: !65, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !550, file: !551, line: 54, baseType: !114, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !550, file: !551, line: 55, baseType: !114, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !550, file: !551, line: 56, baseType: !114, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !550, file: !551, line: 57, baseType: !114, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !550, file: !551, line: 58, baseType: !114, size: 64, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !550, file: !551, line: 59, baseType: !114, size: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !550, file: !551, line: 60, baseType: !114, size: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !550, file: !551, line: 61, baseType: !114, size: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !550, file: !551, line: 64, baseType: !114, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !550, file: !551, line: 65, baseType: !114, size: 64, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !550, file: !551, line: 66, baseType: !114, size: 64, offset: 704)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !550, file: !551, line: 68, baseType: !566, size: 64, offset: 768)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !551, line: 36, flags: DIFlagFwdDecl)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !550, file: !551, line: 70, baseType: !569, size: 64, offset: 832)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !550, file: !551, line: 72, baseType: !65, size: 32, offset: 896)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !550, file: !551, line: 73, baseType: !65, size: 32, offset: 928)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !550, file: !551, line: 74, baseType: !573, size: 64, offset: 960)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !84, line: 152, baseType: !85)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !550, file: !551, line: 77, baseType: !575, size: 16, offset: 1024)
!575 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !550, file: !551, line: 78, baseType: !577, size: 8, offset: 1040)
!577 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !550, file: !551, line: 79, baseType: !579, size: 8, offset: 1048)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 1)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !550, file: !551, line: 81, baseType: !583, size: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !551, line: 43, baseType: null)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !550, file: !551, line: 89, baseType: !586, size: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !84, line: 153, baseType: !85)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !550, file: !551, line: 91, baseType: !588, size: 64, offset: 1216)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !551, line: 37, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !550, file: !551, line: 92, baseType: !591, size: 64, offset: 1280)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !551, line: 38, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !550, file: !551, line: 93, baseType: !569, size: 64, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !550, file: !551, line: 94, baseType: !72, size: 64, offset: 1408)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !550, file: !551, line: 95, baseType: !368, size: 64, offset: 1472)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !550, file: !551, line: 96, baseType: !65, size: 32, offset: 1536)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !550, file: !551, line: 98, baseType: !598, size: 160, offset: 1568)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 20)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fromstr", scope: !494, file: !27, line: 482, baseType: !603, size: 64, offset: 1856)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_FromStrFunc", file: !27, line: 396, baseType: !605)
!605 = !DISubroutineType(types: !606)
!606 = !{!65, !114, !72, !607, !601}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "nonzero", scope: !494, file: !27, line: 489, baseType: !609, size: 64, offset: 1920)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_NonzeroFunc", file: !27, line: 373, baseType: !611)
!611 = !DISubroutineType(types: !612)
!612 = !{!613, !72, !72}
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "npy_bool", file: !464, line: 312, baseType: !614)
!614 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !494, file: !27, line: 496, baseType: !616, size: 64, offset: 1984)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_FillFunc", file: !27, line: 399, baseType: !618)
!618 = !DISubroutineType(types: !619)
!619 = !{!65, !72, !463, !72}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fillwithscalar", scope: !494, file: !27, line: 502, baseType: !621, size: 64, offset: 2048)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_FillWithScalarFunc", file: !27, line: 410, baseType: !623)
!623 = !DISubroutineType(types: !624)
!624 = !{!65, !72, !463, !72, !72}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !494, file: !27, line: 508, baseType: !626, size: 192, offset: 2112)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 192, elements: !629)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_SortFunc", file: !27, line: 401, baseType: !618)
!629 = !{!630}
!630 = !DISubrange(count: 3)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "argsort", scope: !494, file: !27, line: 509, baseType: !632, size: 192, offset: 2304)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 192, elements: !629)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_ArgSortFunc", file: !27, line: 402, baseType: !635)
!635 = !DISubroutineType(types: !636)
!636 = !{!65, !72, !536, !463, !72}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "castdict", scope: !494, file: !27, line: 517, baseType: !73, size: 64, offset: 2496)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "scalarkind", scope: !494, file: !27, line: 524, baseType: !639, size: 64, offset: 2560)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_ScalarKindFunc", file: !27, line: 412, baseType: !641)
!641 = !DISubroutineType(types: !642)
!642 = !{!65, !72}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cancastscalarkindto", scope: !494, file: !27, line: 525, baseType: !644, size: 64, offset: 2624)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "cancastto", scope: !494, file: !27, line: 526, baseType: !645, size: 64, offset: 2688)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fastclip", scope: !494, file: !27, line: 528, baseType: !648, size: 64, offset: 2752)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_FastClipFunc", file: !27, line: 414, baseType: !650)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !72, !463, !72, !72, !72}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fastputmask", scope: !494, file: !27, line: 529, baseType: !653, size: 64, offset: 2816)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_FastPutmaskFunc", file: !27, line: 416, baseType: !655)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !72, !72, !463, !72, !463}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fasttake", scope: !494, file: !27, line: 530, baseType: !658, size: 64, offset: 2880)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_FastTakeFunc", file: !27, line: 418, baseType: !660)
!660 = !DISubroutineType(types: !661)
!661 = !{!65, !72, !72, !536, !463, !463, !463, !463, !662}
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "NPY_CLIPMODE", file: !27, line: 213, baseType: !26)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "argmin", scope: !494, file: !27, line: 536, baseType: !532, size: 64, offset: 2944)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !472, file: !27, line: 625, baseType: !73, size: 64, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "c_metadata", scope: !472, file: !27, line: 631, baseType: !666, size: 64, offset: 640)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "NpyAuxData", file: !27, line: 308, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NpyAuxData_tag", file: !27, line: 314, size: 256, elements: !669)
!669 = !{!670, !675, !680}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !668, file: !27, line: 315, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "NpyAuxData_FreeFunc", file: !27, line: 311, baseType: !673)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !666}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !668, file: !27, line: 316, baseType: !676, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "NpyAuxData_CloneFunc", file: !27, line: 312, baseType: !678)
!678 = !DISubroutineType(types: !679)
!679 = !{!666, !666}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !668, file: !27, line: 318, baseType: !681, size: 128, offset: 128)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 2)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !472, file: !27, line: 635, baseType: !685, size: 64, offset: 704)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "npy_hash_t", file: !464, line: 361, baseType: !235)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "NpyArrContext", file: !2, line: 67, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__NpyArrContext", file: !2, line: 57, size: 576, elements: !689)
!689 = !{!690, !691, !693, !699, !700, !701, !702}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !688, file: !2, line: 58, baseType: !73, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !688, file: !2, line: 59, baseType: !692, size: 128, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 128, elements: !682)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !688, file: !2, line: 60, baseType: !694, size: 128, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArray_Dims", file: !27, line: 426, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 423, size: 128, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !695, file: !27, line: 424, baseType: !536, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !695, file: !27, line: 425, baseType: !65, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dec", scope: !688, file: !2, line: 62, baseType: !370, size: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !688, file: !2, line: 64, baseType: !463, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "elsize", scope: !688, file: !2, line: 65, baseType: !463, size: 64, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "elcount", scope: !688, file: !2, line: 66, baseType: !463, size: 64, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !705, line: 15, baseType: !706)
!705 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/tupleobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "5f7ba6d97ded9aa1272172424c6ae4e3")
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !705, line: 9, size: 256, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !706, file: !705, line: 10, baseType: !93, size: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !706, file: !705, line: 14, baseType: !710, size: 64, offset: 192)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !580)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!73, !65, !714, !470, !65}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!470, !65}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArrayObject_fields", file: !27, line: 724, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tagPyArrayObject_fields", file: !27, line: 677, size: 640, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !721, file: !27, line: 678, baseType: !74, size: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !721, file: !27, line: 680, baseType: !114, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nd", scope: !721, file: !27, line: 682, baseType: !65, size: 32, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !721, file: !27, line: 684, baseType: !536, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !721, file: !27, line: 689, baseType: !536, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !721, file: !27, line: 708, baseType: !73, size: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "descr", scope: !721, file: !27, line: 710, baseType: !470, size: 64, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !721, file: !27, line: 712, baseType: !65, size: 32, offset: 512)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !721, file: !27, line: 714, baseType: !73, size: 64, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArrayObject", file: !27, line: 736, baseType: !720)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!73, !732, !737, !738}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "NPY_ORDER", file: !27, line: 192, baseType: !64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!65, !73, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!470, !470}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!73, !87, !470, !65, !714, !714, !72, !65, !73}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!73, !73, !470, !65, !65, !65, !73}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !758, line: 26, baseType: !759)
!758 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/listobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "43a2cf0f4be0c7900fb5a853db58d688")
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 9, size: 320, elements: !760)
!760 = !{!761, !762, !764}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !759, file: !758, line: 10, baseType: !93, size: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !759, file: !758, line: 12, baseType: !763, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !759, file: !758, line: 25, baseType: !79, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !767, line: 15, baseType: !768)
!767 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/bytesobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "9342e23d3f9d1e30a791d71be47f3d50")
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !767, line: 5, size: 320, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !768, file: !767, line: 6, baseType: !93, size: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !768, file: !767, line: 7, baseType: !235, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !768, file: !767, line: 8, baseType: !579, size: 8, offset: 256)
!773 = !{!0, !7, !12, !17, !774, !779, !782, !787, !792, !797, !802, !22}
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 550, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 26)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 590, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !629)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !2, line: 497, type: !784, isLocal: true, isDefinition: true)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 4)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !2, line: 497, type: !789, isLocal: true, isDefinition: true)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 14)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !2, line: 497, type: !794, isLocal: true, isDefinition: true)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 6)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !2, line: 498, type: !799, isLocal: true, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 9)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !2, line: 498, type: !794, isLocal: true, isDefinition: true)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 384, elements: !795)
!805 = !{i32 7, !"Dwarf Version", i32 5}
!806 = !{i32 2, !"Debug Info Version", i32 3}
!807 = !{i32 1, !"wchar_size", i32 4}
!808 = !{i32 8, !"PIC Level", i32 2}
!809 = !{i32 7, !"uwtable", i32 2}
!810 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!811 = distinct !DISubprogram(name: "Npy_releaseContext", scope: !2, file: !2, line: 93, type: !812, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !686}
!814 = !{!815}
!815 = !DILocalVariable(name: "npyarr", arg: 1, scope: !811, file: !2, line: 93, type: !686)
!816 = !{!817, !817, i64 0}
!817 = !{!"any pointer", !818, i64 0}
!818 = !{!"omnipotent char", !819, i64 0}
!819 = !{!"Simple C/C++ TBAA"}
!820 = !DILocation(line: 93, column: 40, scope: !811)
!821 = !DILocation(line: 95, column: 9, scope: !822)
!822 = distinct !DILexicalBlock(scope: !811, file: !2, line: 95, column: 9)
!823 = !DILocation(line: 95, column: 9, scope: !811)
!824 = !DILocation(line: 96, column: 13, scope: !825)
!825 = distinct !DILexicalBlock(scope: !826, file: !2, line: 96, column: 13)
!826 = distinct !DILexicalBlock(scope: !822, file: !2, line: 95, column: 17)
!827 = !DILocation(line: 96, column: 21, scope: !825)
!828 = !DILocation(line: 96, column: 27, scope: !825)
!829 = !{!830, !817, i64 24}
!830 = !{!"__NpyArrContext", !817, i64 0, !818, i64 8, !831, i64 24, !817, i64 40, !833, i64 48, !833, i64 56, !833, i64 64}
!831 = !{!"", !817, i64 0, !832, i64 8}
!832 = !{!"int", !818, i64 0}
!833 = !{!"long", !818, i64 0}
