; ModuleID = 'samples/379.bc'
source_filename = "pandas/_libs/indexing.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { i64, ptr }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.PyModuleDef_Slot = type { i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.__Pyx_StringTabEntry = type { ptr, ptr, i64, ptr, i8, i8, i8 }
%struct.PyGetSetDef = type { ptr, ptr, ptr, ptr, ptr }
%struct._longobject = type { %struct.PyVarObject, [1 x i32] }
%struct.__Pyx_CodeObjectCache = type { i32, i32, ptr }
%struct._ts = type { ptr, ptr, ptr, ptr, i32, i8, i8, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct._err_stackitem, ptr, ptr, i32, ptr, i64, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr, i64, i64 }
%struct._err_stackitem = type { ptr, ptr, ptr, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__pyx_module_is_main_pandas___libs__indexing", scope: !2, file: !3, line: 1374, type: !54, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !486, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "pandas/_libs/indexing.c", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build/aidengro/spack-stage-py-pandas-1.5.3-t2ah26ijbt7dck44kjkjgtwnjnacpkvn/spack-src", checksumkind: CSK_MD5, checksum: "ea92cdd179b5feea66c7ddc62d440dd3")
!4 = !{!5, !6, !304, !48, !306, !238, !313, !323, !340, !20, !341, !360, !12, !54, !362, !372, !384, !397, !433, !339, !452, !456, !209, !381, !460, !467, !18, !468, !472, !480}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !8, line: 109, baseType: !9)
!8 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/object.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "3f9979776300c70b1e34aa51eda1adeb")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !8, line: 105, size: 128, elements: !10)
!10 = !{!11, !19}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !9, file: !8, line: 107, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !13, line: 105, baseType: !14)
!13 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/pyport.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "130a2fc9ce18e45cf2f23659ef07d5ba")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !15, line: 77, baseType: !16)
!15 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !17, line: 194, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!18 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !9, file: !8, line: 108, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !8, line: 66, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !23, line: 193, size: 3264, elements: !24)
!23 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/object.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "90f773997436a8640d3c606f1a7092f7")
!24 = !{!25, !31, !35, !36, !37, !42, !43, !49, !55, !67, !69, !122, !153, !165, !171, !172, !173, !175, !177, !208, !210, !211, !220, !221, !226, !227, !229, !231, !241, !244, !262, !264, !265, !267, !269, !270, !272, !277, !282, !287, !288, !289, !290, !291, !292, !293, !294, !296, !297}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !22, file: !23, line: 194, baseType: !26, size: 192)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !8, line: 118, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 115, size: 192, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !8, line: 116, baseType: !7, size: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !27, file: !8, line: 117, baseType: !12, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !22, file: !23, line: 195, baseType: !32, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !22, file: !23, line: 196, baseType: !12, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !22, file: !23, line: 196, baseType: !12, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !22, file: !23, line: 200, baseType: !38, size: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !8, line: 180, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !6}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !22, file: !23, line: 201, baseType: !12, size: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !22, file: !23, line: 202, baseType: !44, size: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !8, line: 181, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!6, !6, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !22, file: !23, line: 203, baseType: !50, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !8, line: 183, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !6, !48, !6}
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !22, file: !23, line: 204, baseType: !56, size: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !23, line: 182, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 178, size: 192, elements: !59)
!59 = !{!60, !65, !66}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !58, file: !23, line: 179, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !8, line: 163, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!6, !6}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !58, file: !23, line: 180, baseType: !61, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !58, file: !23, line: 181, baseType: !61, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !22, file: !23, line: 206, baseType: !68, size: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !8, line: 185, baseType: !62)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !22, file: !23, line: 210, baseType: !70, size: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !23, line: 156, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 111, size: 2304, elements: !73)
!73 = !{!74, !79, !80, !81, !82, !83, !88, !89, !90, !91, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !72, file: !23, line: 116, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !8, line: 164, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!6, !6, !6}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !72, file: !23, line: 117, baseType: !75, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !72, file: !23, line: 118, baseType: !75, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !72, file: !23, line: 119, baseType: !75, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !72, file: !23, line: 120, baseType: !75, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !72, file: !23, line: 121, baseType: !84, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !8, line: 165, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!6, !6, !6, !6}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !72, file: !23, line: 122, baseType: !61, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !72, file: !23, line: 123, baseType: !61, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !72, file: !23, line: 124, baseType: !61, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !72, file: !23, line: 125, baseType: !92, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !8, line: 166, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!54, !6}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !72, file: !23, line: 126, baseType: !61, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !72, file: !23, line: 127, baseType: !75, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !72, file: !23, line: 128, baseType: !75, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !72, file: !23, line: 129, baseType: !75, size: 64, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !72, file: !23, line: 130, baseType: !75, size: 64, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !72, file: !23, line: 131, baseType: !75, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !72, file: !23, line: 132, baseType: !61, size: 64, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !72, file: !23, line: 133, baseType: !5, size: 64, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !72, file: !23, line: 134, baseType: !61, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !72, file: !23, line: 136, baseType: !75, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !72, file: !23, line: 137, baseType: !75, size: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !72, file: !23, line: 138, baseType: !75, size: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !72, file: !23, line: 139, baseType: !75, size: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !72, file: !23, line: 140, baseType: !84, size: 64, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !72, file: !23, line: 141, baseType: !75, size: 64, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !72, file: !23, line: 142, baseType: !75, size: 64, offset: 1600)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !72, file: !23, line: 143, baseType: !75, size: 64, offset: 1664)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !72, file: !23, line: 144, baseType: !75, size: 64, offset: 1728)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !72, file: !23, line: 145, baseType: !75, size: 64, offset: 1792)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !72, file: !23, line: 147, baseType: !75, size: 64, offset: 1856)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !72, file: !23, line: 148, baseType: !75, size: 64, offset: 1920)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !72, file: !23, line: 149, baseType: !75, size: 64, offset: 1984)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !72, file: !23, line: 150, baseType: !75, size: 64, offset: 2048)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !72, file: !23, line: 152, baseType: !61, size: 64, offset: 2112)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !72, file: !23, line: 154, baseType: !75, size: 64, offset: 2176)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !72, file: !23, line: 155, baseType: !75, size: 64, offset: 2240)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !22, file: !23, line: 211, baseType: !123, size: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !23, line: 170, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 158, size: 640, elements: !126)
!126 = !{!127, !132, !133, !138, !139, !140, !145, !146, !151, !152}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !125, file: !23, line: 159, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !8, line: 167, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!12, !6}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !125, file: !23, line: 160, baseType: !75, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !125, file: !23, line: 161, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !8, line: 168, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!6, !6, !12}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !125, file: !23, line: 162, baseType: !134, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !125, file: !23, line: 163, baseType: !5, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !125, file: !23, line: 164, baseType: !141, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !8, line: 170, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!54, !6, !12, !6}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !125, file: !23, line: 165, baseType: !5, size: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !125, file: !23, line: 166, baseType: !147, size: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !8, line: 174, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!54, !6, !6}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !125, file: !23, line: 168, baseType: !75, size: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !125, file: !23, line: 169, baseType: !134, size: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !22, file: !23, line: 212, baseType: !154, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !23, line: 176, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 172, size: 192, elements: !157)
!157 = !{!158, !159, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !156, file: !23, line: 173, baseType: !128, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !156, file: !23, line: 174, baseType: !75, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !156, file: !23, line: 175, baseType: !161, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !8, line: 172, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!54, !6, !6, !6}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !22, file: !23, line: 216, baseType: !166, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !8, line: 186, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !6}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !13, line: 114, baseType: !12)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !22, file: !23, line: 217, baseType: !84, size: 64, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !22, file: !23, line: 218, baseType: !68, size: 64, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !22, file: !23, line: 219, baseType: !174, size: 64, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !8, line: 182, baseType: !76)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !22, file: !23, line: 220, baseType: !176, size: 64, offset: 1216)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !8, line: 184, baseType: !162)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !22, file: !23, line: 223, baseType: !178, size: 64, offset: 1280)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !23, line: 187, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 184, size: 128, elements: !181)
!181 = !{!182, !203}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !180, file: !23, line: 185, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !23, line: 71, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!54, !6, !187, !54}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !23, line: 69, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !23, line: 56, size: 640, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !200, !201, !202}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !189, file: !23, line: 57, baseType: !5, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !189, file: !23, line: 58, baseType: !6, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !189, file: !23, line: 59, baseType: !12, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !189, file: !23, line: 60, baseType: !12, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !189, file: !23, line: 62, baseType: !54, size: 32, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !189, file: !23, line: 63, baseType: !54, size: 32, offset: 288)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !189, file: !23, line: 64, baseType: !48, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !189, file: !23, line: 65, baseType: !199, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !189, file: !23, line: 66, baseType: !199, size: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !189, file: !23, line: 67, baseType: !199, size: 64, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !189, file: !23, line: 68, baseType: !5, size: 64, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !180, file: !23, line: 186, baseType: !204, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !23, line: 72, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !6, !187}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !22, file: !23, line: 226, baseType: !209, size: 64, offset: 1344)
!209 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !22, file: !23, line: 228, baseType: !32, size: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !22, file: !23, line: 232, baseType: !212, size: 64, offset: 1472)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !8, line: 176, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!54, !6, !216, !5}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !8, line: 175, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!54, !6, !5}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !22, file: !23, line: 235, baseType: !92, size: 64, offset: 1536)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !22, file: !23, line: 239, baseType: !222, size: 64, offset: 1600)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !8, line: 187, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!6, !6, !6, !54}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !22, file: !23, line: 242, baseType: !12, size: 64, offset: 1664)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !22, file: !23, line: 245, baseType: !228, size: 64, offset: 1728)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !8, line: 188, baseType: !62)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !22, file: !23, line: 246, baseType: !230, size: 64, offset: 1792)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !8, line: 189, baseType: !62)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !22, file: !23, line: 249, baseType: !232, size: 64, offset: 1856)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !234, line: 35, size: 256, elements: !235)
!234 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/methodobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "bbf63d5b676c05c658805ba163513296")
!235 = !{!236, !237, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !233, file: !234, line: 36, baseType: !32, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !233, file: !234, line: 37, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !234, line: 19, baseType: !76)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !233, file: !234, line: 38, baseType: !54, size: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !233, file: !234, line: 40, baseType: !32, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !22, file: !23, line: 250, baseType: !242, size: 64, offset: 1920)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !23, line: 250, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !22, file: !23, line: 251, baseType: !245, size: 64, offset: 1984)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !247, line: 11, size: 320, elements: !248)
!247 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/descrobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "4865dae4e254db6f261f61dcb32e8571")
!248 = !{!249, !250, !255, !260, !261}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !247, line: 12, baseType: !32, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !246, file: !247, line: 13, baseType: !251, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !247, line: 8, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!6, !6, !5}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !246, file: !247, line: 14, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !247, line: 9, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!54, !6, !6, !5}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !246, file: !247, line: 15, baseType: !32, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !246, file: !247, line: 16, baseType: !5, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !22, file: !23, line: 252, baseType: !263, size: 64, offset: 2048)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !22, file: !23, line: 253, baseType: !6, size: 64, offset: 2112)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !22, file: !23, line: 254, baseType: !266, size: 64, offset: 2176)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !8, line: 190, baseType: !85)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !22, file: !23, line: 255, baseType: !268, size: 64, offset: 2240)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !8, line: 191, baseType: !162)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !22, file: !23, line: 256, baseType: !12, size: 64, offset: 2304)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !22, file: !23, line: 257, baseType: !271, size: 64, offset: 2368)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !8, line: 192, baseType: !162)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !22, file: !23, line: 258, baseType: !273, size: 64, offset: 2432)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !8, line: 194, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!6, !20, !12}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !22, file: !23, line: 259, baseType: !278, size: 64, offset: 2496)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !8, line: 193, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!6, !20, !6, !6}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !22, file: !23, line: 260, baseType: !283, size: 64, offset: 2560)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !8, line: 179, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !5}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !22, file: !23, line: 261, baseType: !92, size: 64, offset: 2624)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !22, file: !23, line: 262, baseType: !6, size: 64, offset: 2688)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !22, file: !23, line: 263, baseType: !6, size: 64, offset: 2752)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !22, file: !23, line: 264, baseType: !6, size: 64, offset: 2816)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !22, file: !23, line: 265, baseType: !6, size: 64, offset: 2880)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !22, file: !23, line: 266, baseType: !6, size: 64, offset: 2944)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !22, file: !23, line: 267, baseType: !38, size: 64, offset: 3008)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !22, file: !23, line: 270, baseType: !295, size: 32, offset: 3072)
!295 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !22, file: !23, line: 272, baseType: !38, size: 64, offset: 3136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !22, file: !23, line: 273, baseType: !298, size: 64, offset: 3200)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !23, line: 74, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!6, !6, !302, !304, !6}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !305, line: 70, baseType: !209)
!305 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_obj_6pandas_5_libs_8indexing_NDFrameIndexerBase", file: !3, line: 993, size: 320, elements: !308)
!308 = !{!309, !310, !311, !312}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !307, file: !3, line: 994, baseType: !7, size: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_ndim", scope: !307, file: !3, line: 995, baseType: !12, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !3, line: 996, baseType: !6, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !307, file: !3, line: 997, baseType: !6, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !315, line: 15, baseType: !316)
!315 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/tupleobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "5f7ba6d97ded9aa1272172424c6ae4e3")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 9, size: 256, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !316, file: !315, line: 10, baseType: !26, size: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !316, file: !315, line: 14, baseType: !320, size: 64, offset: 192)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 1)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !325, line: 32, baseType: !326)
!325 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/dictobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "7b11975c6ebf262dd56773c52c3767e4")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 14, size: 384, elements: !327)
!327 = !{!328, !329, !330, !334, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !326, file: !325, line: 15, baseType: !7, size: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !326, file: !325, line: 18, baseType: !12, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ma_version_tag", scope: !326, file: !325, line: 22, baseType: !331, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !332, line: 27, baseType: !333)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !17, line: 45, baseType: !209)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !326, file: !325, line: 24, baseType: !335, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !325, line: 9, baseType: !337)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !23, line: 291, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !326, file: !325, line: 31, baseType: !339, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !343, line: 219, baseType: !344)
!343 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/unicodeobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "4e8ada5abdaead20669503dfb3a48df9")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 85, size: 384, elements: !345)
!345 = !{!346, !347, !348, !349, !357}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !344, file: !343, line: 159, baseType: !7, size: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !344, file: !343, line: 160, baseType: !12, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !344, file: !343, line: 161, baseType: !170, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !344, file: !343, line: 217, baseType: !350, size: 32, offset: 256)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !343, line: 162, size: 32, elements: !351)
!351 = !{!352, !353, !354, !355, !356}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !350, file: !343, line: 171, baseType: !295, size: 2, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !350, file: !343, line: 199, baseType: !295, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !350, file: !343, line: 204, baseType: !295, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !350, file: !343, line: 208, baseType: !295, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !350, file: !343, line: 213, baseType: !295, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !344, file: !343, line: 218, baseType: !358, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !305, line: 96, baseType: !54)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodObject", file: !364, line: 18, baseType: !365)
!364 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/classobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "8eaf9417880dc0f5c842fa4a58d84d47")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 12, size: 384, elements: !366)
!366 = !{!367, !368, !369, !370, !371}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !365, file: !364, line: 13, baseType: !7, size: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "im_func", scope: !365, file: !364, line: 14, baseType: !6, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "im_self", scope: !365, file: !364, line: 15, baseType: !6, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "im_weakreflist", scope: !365, file: !364, line: 16, baseType: !6, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !365, file: !364, line: 17, baseType: !298, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !374, line: 10, baseType: !375)
!374 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/longobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "c5b0e7fbad7df1df28a36b8fa53f9db6")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !376, line: 85, size: 256, elements: !377)
!376 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/longintrepr.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "7f0868f7ad63ec0bc19e24f85b1936af")
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !375, file: !376, line: 86, baseType: !26, size: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !375, file: !376, line: 87, baseType: !380, size: 32, offset: 192)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 32, elements: !321)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !376, line: 45, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !332, line: 26, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !17, line: 42, baseType: !295)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !386, line: 30, baseType: !387)
!386 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/methodobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "bfbc0cc805e2824afcda5a852577ba23")
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 23, size: 448, elements: !388)
!388 = !{!389, !390, !393, !394, !395, !396}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !387, file: !386, line: 24, baseType: !7, size: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !387, file: !386, line: 25, baseType: !391, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !234, line: 42, baseType: !233)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !387, file: !386, line: 26, baseType: !6, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !387, file: !386, line: 27, baseType: !6, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !387, file: !386, line: 28, baseType: !6, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !387, file: !386, line: 29, baseType: !298, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !399, line: 9, baseType: !400)
!399 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/code.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "e081917cfdb5732f878695837e533cb0")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !401, line: 18, size: 1408, elements: !402)
!401 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/code.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "218edcf5df759abd05684d50058089cb")
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !427, !431, !432}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !400, file: !401, line: 19, baseType: !7, size: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !400, file: !401, line: 20, baseType: !54, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !400, file: !401, line: 21, baseType: !54, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !400, file: !401, line: 22, baseType: !54, size: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !400, file: !401, line: 23, baseType: !54, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !400, file: !401, line: 24, baseType: !54, size: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !400, file: !401, line: 25, baseType: !54, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !400, file: !401, line: 26, baseType: !54, size: 32, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !400, file: !401, line: 27, baseType: !6, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !400, file: !401, line: 28, baseType: !6, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !400, file: !401, line: 29, baseType: !6, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !400, file: !401, line: 30, baseType: !6, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !400, file: !401, line: 31, baseType: !6, size: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !400, file: !401, line: 32, baseType: !6, size: 64, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !400, file: !401, line: 38, baseType: !199, size: 64, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !400, file: !401, line: 39, baseType: !6, size: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !400, file: !401, line: 40, baseType: !6, size: 64, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !400, file: !401, line: 41, baseType: !6, size: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !400, file: !401, line: 43, baseType: !5, size: 64, offset: 1024)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !400, file: !401, line: 44, baseType: !6, size: 64, offset: 1088)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !400, file: !401, line: 48, baseType: !5, size: 64, offset: 1152)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "co_opcache_map", scope: !400, file: !401, line: 60, baseType: !425, size: 64, offset: 1216)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "co_opcache", scope: !400, file: !401, line: 61, baseType: !428, size: 64, offset: 1280)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyOpcache", file: !401, line: 15, baseType: !430)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyOpcache", file: !401, line: 15, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "co_opcache_flag", scope: !400, file: !401, line: 62, baseType: !54, size: 32, offset: 1344)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "co_opcache_size", scope: !400, file: !401, line: 63, baseType: !426, size: 8, offset: 1376)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFunctionObject", file: !435, line: 42, baseType: !436)
!435 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/funcobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "0de716df241a7060ded7ab7fcb73c6ae")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 21, size: 960, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !436, file: !435, line: 22, baseType: !7, size: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "func_code", scope: !436, file: !435, line: 23, baseType: !6, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "func_globals", scope: !436, file: !435, line: 24, baseType: !6, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "func_defaults", scope: !436, file: !435, line: 25, baseType: !6, size: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "func_kwdefaults", scope: !436, file: !435, line: 26, baseType: !6, size: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "func_closure", scope: !436, file: !435, line: 27, baseType: !6, size: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "func_doc", scope: !436, file: !435, line: 28, baseType: !6, size: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "func_name", scope: !436, file: !435, line: 29, baseType: !6, size: 64, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "func_dict", scope: !436, file: !435, line: 30, baseType: !6, size: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "func_weakreflist", scope: !436, file: !435, line: 31, baseType: !6, size: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "func_module", scope: !436, file: !435, line: 32, baseType: !6, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "func_annotations", scope: !436, file: !435, line: 33, baseType: !6, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "func_qualname", scope: !436, file: !435, line: 34, baseType: !6, size: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !436, file: !435, line: 35, baseType: !298, size: 64, offset: 896)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCFunctionFastWithKeywords", file: !234, line: 23, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!6, !6, !302, !12, !6}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCFunctionFast", file: !234, line: 20, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!6, !6, !302, !12}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !462, line: 18, baseType: !463)
!462 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/floatobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "0f3a658931202298bccdf481c13bf65e")
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !462, line: 15, size: 192, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !463, file: !462, line: 16, baseType: !7, size: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !463, file: !462, line: 17, baseType: !467, size: 64, offset: 128)
!467 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "sdigit", file: !376, line: 46, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !470, line: 26, baseType: !471)
!470 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !17, line: 41, baseType: !54)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !474, line: 26, baseType: !475)
!474 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/cpython/listobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "43a2cf0f4be0c7900fb5a853db58d688")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 9, size: 320, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !475, file: !474, line: 10, baseType: !26, size: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !475, file: !474, line: 12, baseType: !339, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !475, file: !474, line: 25, baseType: !12, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !3, line: 1320, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 1317, size: 128, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !482, file: !3, line: 1318, baseType: !397, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !482, file: !3, line: 1319, baseType: !54, size: 32, offset: 64)
!486 = !{!0, !487, !492, !521, !524, !530, !535, !540, !545, !547, !549, !551, !556, !561, !563, !572, !577, !579, !584, !587, !589, !594, !599, !604, !606, !611, !616, !621, !623, !628, !630, !632, !634, !636, !638, !640, !642, !658, !660, !665, !667, !672, !674, !679, !681, !684, !686, !689, !691, !693, !695, !698, !700, !703, !705, !707, !709, !711, !714, !716, !718, !720, !722, !727, !729, !734, !737, !739, !742, !744, !749, !751, !754, !756, !758, !760, !762, !764, !766, !771, !773, !775, !777, !779, !781, !786, !788, !790, !792, !797, !799, !801, !803, !805, !807, !809, !811, !813, !815, !817, !819, !821, !823, !825, !827, !832, !834, !836, !838, !840, !842, !847, !850, !852, !855, !858, !861, !890, !892, !894, !896, !901, !903, !905, !910, !915, !918, !920, !925, !927, !932, !937, !939, !942, !945, !950, !952, !957, !962, !964, !969, !971, !997, !999, !1004, !1006, !1008, !1010, !1015, !1018, !1021, !1026, !1031, !1033, !1035, !1040, !1042, !1044, !1046, !1071, !1076, !1081, !1083, !1085, !1090, !1095, !1097, !1099, !1101, !1103, !1105, !1209, !1211, !1218, !1220, !1225}
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !3, line: 2855, type: !489, isLocal: true, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 72, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 9)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !3, line: 2853, type: !494, isLocal: true, isDefinition: true)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !495, line: 75, size: 832, elements: !496)
!495 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.9.18-tfi3mxfib577g7oeypbrcz2fdcvilq6g/include/python3.9/moduleobject.h", directory: "/local-ssd/py-pandas-t2ah26ijbt7dck44kjkjgtwnjnacpkvn-build", checksumkind: CSK_MD5, checksum: "78b4265f6930100d3efb78b20d6243db")
!496 = !{!497, !508, !509, !510, !511, !512, !518, !519, !520}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !494, file: !495, line: 76, baseType: !498, size: 320)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !495, line: 49, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !495, line: 44, size: 320, elements: !500)
!500 = !{!501, !502, !506, !507}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !499, file: !495, line: 45, baseType: !7, size: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !499, file: !495, line: 46, baseType: !503, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!6}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !499, file: !495, line: 47, baseType: !12, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !499, file: !495, line: 48, baseType: !6, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !494, file: !495, line: 77, baseType: !32, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !494, file: !495, line: 78, baseType: !32, size: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !494, file: !495, line: 79, baseType: !12, size: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !494, file: !495, line: 80, baseType: !391, size: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !494, file: !495, line: 81, baseType: !513, size: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !495, line: 61, size: 128, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !514, file: !495, line: 62, baseType: !54, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !514, file: !495, line: 63, baseType: !5, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !494, file: !495, line: 82, baseType: !212, size: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !494, file: !495, line: 83, baseType: !92, size: 64, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !494, file: !495, line: 84, baseType: !283, size: 64, offset: 768)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !3, line: 2838, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 256, elements: !321)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !3, line: 2846, type: !526, isLocal: true, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 384, elements: !528)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !495, line: 64, baseType: !514)
!528 = !{!529}
!529 = !DISubrange(count: 3)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3130, type: !532, isLocal: true, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 40, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 5)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3137, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 56, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 7)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3137, type: !542, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 88, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 11)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3138, type: !537, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3138, type: !489, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3139, type: !537, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3139, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 96, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 12)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3140, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 216, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 27)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3140, type: !489, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !565, file: !3, line: 3088, type: !570, isLocal: true, isDefinition: true)
!565 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !3, file: !3, line: 3086, type: !566, scopeLine: 3086, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{!54}
!568 = !{!569}
!569 = !DILocalVariable(name: "current_id", scope: !565, file: !3, line: 3089, type: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !470, line: 27, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !17, line: 44, baseType: !18)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3104, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 760, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 95)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !3, line: 967, type: !6, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3160, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 648, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 81)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3181, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, elements: !321)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3220, type: !489, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3222, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 120, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 15)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3224, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 104, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 13)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3236, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 176, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 22)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3285, type: !558, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !3, line: 5272, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 48, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 6)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !3, line: 5297, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 608, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 76)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !3, line: 981, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 208, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 26)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !3, line: 982, type: !596, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !3, line: 980, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 2)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "__pyx_pyframe_localsplus_offset", scope: !2, file: !3, line: 1237, type: !304, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "__pyx_empty_tuple", scope: !2, file: !3, line: 971, type: !6, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "__pyx_empty_bytes", scope: !2, file: !3, line: 972, type: !6, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "__pyx_empty_unicode", scope: !2, file: !3, line: 973, type: !6, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "__pyx_d", scope: !2, file: !3, line: 968, type: !6, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "__pyx_b", scope: !2, file: !3, line: 969, type: !6, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "__pyx_cython_runtime", scope: !2, file: !3, line: 970, type: !6, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "__pyx_string_tab", scope: !2, file: !3, line: 2883, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 10240, elements: !656)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_StringTabEntry", file: !3, line: 781, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 780, size: 320, elements: !647)
!647 = !{!648, !649, !650, !652, !653, !654, !655}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !646, file: !3, line: 780, baseType: !339, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !646, file: !3, line: 780, baseType: !32, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !646, file: !3, line: 780, baseType: !651, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !646, file: !3, line: 780, baseType: !32, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "is_unicode", scope: !646, file: !3, line: 781, baseType: !33, size: 8, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "is_str", scope: !646, file: !3, line: 781, baseType: !33, size: 8, offset: 264)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "intern", scope: !646, file: !3, line: 781, baseType: !33, size: 8, offset: 272)
!656 = !{!657}
!657 = !DISubrange(count: 32)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "__pyx_kp_s_Incompatible_checksums_0x_x_vs_0", scope: !2, file: !3, line: 1409, type: !6, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "__pyx_k_Incompatible_checksums_0x_x_vs_0", scope: !2, file: !3, line: 1408, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 704, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 88)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "__pyx_n_s_NDFrameIndexerBase", scope: !2, file: !3, line: 1410, type: !6, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "__pyx_k_NDFrameIndexerBase", scope: !2, file: !3, line: 1403, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 152, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 19)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "__pyx_kp_u_NDFrameIndexer_does_not_support", scope: !2, file: !3, line: 1411, type: !6, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "__pyx_k_NDFrameIndexer_does_not_support", scope: !2, file: !3, line: 1407, type: !676, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 496, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 62)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "__pyx_n_s_PickleError", scope: !2, file: !3, line: 1412, type: !6, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "__pyx_k_PickleError", scope: !2, file: !3, line: 1397, type: !683, isLocal: true, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 96, elements: !554)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "__pyx_n_s_ValueError", scope: !2, file: !3, line: 1413, type: !6, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "__pyx_k_ValueError", scope: !2, file: !3, line: 1395, type: !688, isLocal: true, isDefinition: true)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 88, elements: !543)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "__pyx_n_s_cline_in_traceback", scope: !2, file: !3, line: 1414, type: !6, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "__pyx_k_cline_in_traceback", scope: !2, file: !3, line: 1404, type: !669, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "__pyx_n_s_dict", scope: !2, file: !3, line: 1415, type: !6, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "__pyx_k_dict", scope: !2, file: !3, line: 1380, type: !697, isLocal: true, isDefinition: true)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 72, elements: !490)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "__pyx_n_s_getstate", scope: !2, file: !3, line: 1416, type: !6, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "__pyx_k_getstate", scope: !2, file: !3, line: 1390, type: !702, isLocal: true, isDefinition: true)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 104, elements: !597)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "__pyx_n_s_import", scope: !2, file: !3, line: 1417, type: !6, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "__pyx_k_import", scope: !2, file: !3, line: 1385, type: !688, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "__pyx_k_main", scope: !2, file: !3, line: 1381, type: !697, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__pyx_n_s_name", scope: !2, file: !3, line: 1419, type: !6, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "__pyx_k_name", scope: !2, file: !3, line: 1382, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 40, elements: !533)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "__pyx_k_name_2", scope: !2, file: !3, line: 1386, type: !697, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "__pyx_n_s_ndim", scope: !2, file: !3, line: 1421, type: !6, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "__pyx_k_ndim", scope: !2, file: !3, line: 1383, type: !713, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "__pyx_n_s_new", scope: !2, file: !3, line: 1422, type: !6, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "__pyx_k_new", scope: !2, file: !3, line: 1378, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 8)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "__pyx_n_s_obj", scope: !2, file: !3, line: 1423, type: !6, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "__pyx_k_obj", scope: !2, file: !3, line: 1379, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 4)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "__pyx_k_pandas__libs_indexing", scope: !2, file: !3, line: 1405, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 176, elements: !602)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "__pyx_n_s_pickle", scope: !2, file: !3, line: 1425, type: !6, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "__pyx_k_pickle", scope: !2, file: !3, line: 1387, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 56, elements: !538)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "__pyx_n_s_pyx_PickleError", scope: !2, file: !3, line: 1426, type: !6, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "__pyx_k_pyx_PickleError", scope: !2, file: !3, line: 1401, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 144, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 18)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "__pyx_n_s_pyx_checksum", scope: !2, file: !3, line: 1427, type: !6, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "__pyx_k_pyx_checksum", scope: !2, file: !3, line: 1398, type: !753, isLocal: true, isDefinition: true)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 120, elements: !592)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "__pyx_n_s_pyx_result", scope: !2, file: !3, line: 1428, type: !6, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "__pyx_k_pyx_result", scope: !2, file: !3, line: 1396, type: !702, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "__pyx_n_s_pyx_state", scope: !2, file: !3, line: 1429, type: !6, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "__pyx_k_pyx_state", scope: !2, file: !3, line: 1393, type: !683, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "__pyx_n_s_pyx_type", scope: !2, file: !3, line: 1430, type: !6, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "__pyx_k_pyx_type", scope: !2, file: !3, line: 1391, type: !688, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "__pyx_k_pyx_unpickle_NDFrameIndexerBas", scope: !2, file: !3, line: 1406, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 272, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 34)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "__pyx_n_s_reduce", scope: !2, file: !3, line: 1432, type: !6, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "__pyx_k_reduce", scope: !2, file: !3, line: 1388, type: !688, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "__pyx_n_s_reduce_cython", scope: !2, file: !3, line: 1433, type: !6, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "__pyx_k_reduce_cython", scope: !2, file: !3, line: 1400, type: !746, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "__pyx_n_s_reduce_ex", scope: !2, file: !3, line: 1434, type: !6, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "__pyx_k_reduce_ex", scope: !2, file: !3, line: 1394, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 112, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 14)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "__pyx_n_s_setstate", scope: !2, file: !3, line: 1435, type: !6, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "__pyx_k_setstate", scope: !2, file: !3, line: 1392, type: !702, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "__pyx_n_s_setstate_cython", scope: !2, file: !3, line: 1436, type: !6, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "__pyx_k_setstate_cython", scope: !2, file: !3, line: 1402, type: !794, isLocal: true, isDefinition: true)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 20)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "__pyx_kp_s_stringsource", scope: !2, file: !3, line: 1437, type: !6, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "__pyx_k_stringsource", scope: !2, file: !3, line: 1399, type: !702, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "__pyx_k_test", scope: !2, file: !3, line: 1384, type: !697, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "__pyx_n_s_update", scope: !2, file: !3, line: 1439, type: !6, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "__pyx_k_update", scope: !2, file: !3, line: 1389, type: !741, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "__pyx_filename", scope: !2, file: !3, line: 977, type: !32, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "__pyx_lineno", scope: !2, file: !3, line: 974, type: !54, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "__pyx_clineno", scope: !2, file: !3, line: 975, type: !54, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "__pyx_int_2", scope: !2, file: !3, line: 1452, type: !6, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "__pyx_int_68575658", scope: !2, file: !3, line: 1453, type: !6, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "__pyx_int_87510373", scope: !2, file: !3, line: 1454, type: !6, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "__pyx_int_202888320", scope: !2, file: !3, line: 1455, type: !6, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "__pyx_int_neg_1", scope: !2, file: !3, line: 1456, type: !6, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "__pyx_n_s_name_2", scope: !2, file: !3, line: 1420, type: !6, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "__pyx_n_s_main", scope: !2, file: !3, line: 1418, type: !6, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !3, line: 3340, type: !829, isLocal: true, isDefinition: true)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 200, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 25)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "__pyx_builtin_ValueError", scope: !2, file: !3, line: 1377, type: !6, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "__pyx_tuple_", scope: !2, file: !3, line: 1457, type: !6, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "__pyx_tuple__2", scope: !2, file: !3, line: 1458, type: !6, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "__pyx_tuple__3", scope: !2, file: !3, line: 1459, type: !6, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "__pyx_codeobj__4", scope: !2, file: !3, line: 1460, type: !6, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !3, line: 2768, type: !844, isLocal: true, isDefinition: true)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 328, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 41)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !3, line: 2797, type: !849, isLocal: true, isDefinition: true)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 704, elements: !663)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "__pyx_type_6pandas_5_libs_8indexing_NDFrameIndexerBase", scope: !2, file: !3, line: 2766, type: !21, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !3, line: 2754, type: !854, isLocal: true, isDefinition: true)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 144, elements: !747)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !3, line: 2755, type: !857, isLocal: true, isDefinition: true)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !795)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "__pyx_methods_6pandas_5_libs_8indexing_NDFrameIndexerBase", scope: !2, file: !3, line: 2753, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 768, elements: !528)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "__pyx_dict_version", scope: !863, file: !3, line: 2103, type: !331, isLocal: true, isDefinition: true)
!863 = distinct !DISubprogram(name: "__pyx_pf_6pandas_5_libs_8indexing_18NDFrameIndexerBase_2__reduce_cython__", scope: !3, file: !3, line: 1962, type: !864, scopeLine: 1962, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !866)
!864 = !DISubroutineType(types: !865)
!865 = !{!6, !306}
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !885, !887, !888, !889}
!867 = !DILocalVariable(name: "__pyx_v_self", arg: 1, scope: !863, file: !3, line: 1962, type: !306)
!868 = !DILocalVariable(name: "__pyx_v_state", scope: !863, file: !3, line: 1963, type: !6)
!869 = !DILocalVariable(name: "__pyx_v__dict", scope: !863, file: !3, line: 1964, type: !6)
!870 = !DILocalVariable(name: "__pyx_v_use_setstate", scope: !863, file: !3, line: 1965, type: !54)
!871 = !DILocalVariable(name: "__pyx_r", scope: !863, file: !3, line: 1966, type: !6)
!872 = !DILocalVariable(name: "__pyx_t_1", scope: !863, file: !3, line: 1968, type: !6)
!873 = !DILocalVariable(name: "__pyx_t_2", scope: !863, file: !3, line: 1969, type: !6)
!874 = !DILocalVariable(name: "__pyx_t_3", scope: !863, file: !3, line: 1970, type: !54)
!875 = !DILocalVariable(name: "__pyx_t_4", scope: !863, file: !3, line: 1971, type: !54)
!876 = !DILocalVariable(name: "__pyx_t_5", scope: !863, file: !3, line: 1972, type: !54)
!877 = !DILocalVariable(name: "__pyx_t_6", scope: !863, file: !3, line: 1973, type: !6)
!878 = !DILocalVariable(name: "__pyx_lineno", scope: !863, file: !3, line: 1974, type: !54)
!879 = !DILocalVariable(name: "__pyx_filename", scope: !863, file: !3, line: 1975, type: !32)
!880 = !DILocalVariable(name: "__pyx_clineno", scope: !863, file: !3, line: 1976, type: !54)
!881 = !DILocalVariable(name: "tmp", scope: !882, file: !3, line: 2040, type: !6)
!882 = distinct !DILexicalBlock(scope: !883, file: !3, line: 2040, column: 5)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 2023, column: 18)
!884 = distinct !DILexicalBlock(scope: !863, file: !3, line: 2023, column: 7)
