; ModuleID = 'samples/381.bc'
source_filename = "src/tools/gt_matstat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Optionargmodedesc = type { ptr, ptr, i32 }
%struct.Gfmsubcallinfo = type { %struct.Definedunsignedlong, %struct.Definedunsignedlong, i32, i8, ptr, ptr, ptr, i32, i8, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.Definedunsignedlong = type { i8, i64 }
%struct.Fmindex = type { ptr, ptr, i64, ptr, ptr, ptr, i64, i64, i64, i64, %struct.GtArrayGtPairBwtidx, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i64, i64, ptr }
%struct.GtArrayGtPairBwtidx = type { ptr, i64, i64 }
%struct.Suffixarray = type { ptr, %struct.Definedunsignedlong, %struct.Definedunsignedlong, %struct.Defineddouble, %struct.Definedunsignedlong, i32, i8, i64, ptr, ptr, ptr, ptr, i32, ptr, %struct.GtBufferedfile_uint32_t, %struct.GtBufferedfile_GtUword, %struct.GtBufferedfile_GtUchar, %struct.GtBufferedfile_GtUchar, %struct.GtBufferedfile_Largelcpvalue }
%struct.Defineddouble = type { i8, double }
%struct.GtBufferedfile_uint32_t = type { i32, i32, ptr, ptr }
%struct.GtBufferedfile_GtUword = type { i32, i32, ptr, ptr }
%struct.GtBufferedfile_GtUchar = type { i32, i32, ptr, ptr }
%struct.GtBufferedfile_Largelcpvalue = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [23 x i8] c"src/tools/gt_matstat.c\00", align 1, !dbg !0

!198 = !{i32 7, !"uwtable", i32 2}
!199 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!200 = distinct !DISubprogram(name: "gt_matstat", scope: !2, file: !2, line: 477, type: !201, scopeLine: 478, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !169)
!201 = !DISubroutineType(types: !202)
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtTool", file: !205, line: 26, baseType: !206)
!205 = !DIFile(filename: "src/core/tool_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e867124201284063b8eb5758ec6a469a")
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtTool", file: !205, line: 26, flags: DIFlagFwdDecl)
!207 = !DILocation(line: 479, column: 10, scope: !200)
!208 = !DILocation(line: 479, column: 3, scope: !200)
!209 = !DISubprogram(name: "gt_tool_new", scope: !205, file: !205, line: 66, type: !210, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!210 = !DISubroutineType(types: !211)
!211 = !{!203, !212, !216, !220, !228, !237}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsNew", file: !205, line: 30, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!190}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsDelete", file: !205, line: 33, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !190}
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolOptionParserNew", file: !205, line: 36, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !190}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOptionParser", file: !226, line: 27, baseType: !227)
!226 = !DIFile(filename: "src/core/option_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "4af8e95b11f2236d309c3019659f4935")
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtOptionParser", file: !226, line: 27, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsCheck", file: !205, line: 41, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !232, !190, !233}
!232 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !235, line: 44, baseType: !236)
!235 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !235, line: 44, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolRunner", file: !205, line: 52, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!232, !232, !241, !232, !190, !233}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!243 = distinct !DISubprogram(name: "gt_matstat_arguments_new_matstat", scope: !2, file: !2, line: 76, type: !214, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !169)
!244 = !DILocation(line: 78, column: 10, scope: !243)
!245 = !DILocation(line: 78, column: 3, scope: !243)
!246 = distinct !DISubprogram(name: "gt_matstat_arguments_delete", scope: !2, file: !2, line: 86, type: !218, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !169, retainedNodes: !247)
!247 = !{!248, !249}
!248 = !DILocalVariable(name: "tool_arguments", arg: 1, scope: !246, file: !2, line: 86, type: !190)
!249 = !DILocalVariable(name: "arguments", scope: !246, file: !2, line: 88, type: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gfmsubcallinfo", file: !2, line: 61, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 49, size: 1088, elements: !253)
!253 = !{!254, !262, !263, !264, !265, !270, !275, !276, !278, !279, !283, !284, !285, !286, !287, !288, !289}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "minlength", scope: !252, file: !2, line: 51, baseType: !255, size: 128)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "Definedunsignedlong", file: !256, line: 28, baseType: !257)
!256 = !DIFile(filename: "src/core/defined-types.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e7a1f5519c7b299f300cac0dd118ae65")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !256, line: 24, size: 128, elements: !258)
!258 = !{!259, !261}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "defined", scope: !257, file: !256, line: 26, baseType: !260, size: 8)
!260 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "valueunsignedlong", scope: !257, file: !256, line: 27, baseType: !188, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "maxlength", scope: !252, file: !2, line: 52, baseType: !255, size: 128, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "showmode", scope: !252, file: !2, line: 53, baseType: !172, size: 32, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "verifywitnesspos", scope: !252, file: !2, line: 54, baseType: !260, size: 8, offset: 288)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "indexname", scope: !252, file: !2, line: 55, baseType: !266, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStr", file: !268, line: 27, baseType: !269)
!268 = !DIFile(filename: "src/core/str_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "654ceffd2f9ff17a42a8522fe21401e1")
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStr", file: !268, line: 27, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "queryfilenames", scope: !252, file: !2, line: 56, baseType: !271, size: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStrArray", file: !273, line: 24, baseType: !274)
!273 = !DIFile(filename: "src/core/str_array_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "d2f5724ae7121552c301a489d5e7f125")
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStrArray", file: !273, line: 24, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flagsoutputoption", scope: !252, file: !2, line: 56, baseType: !271, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "indextype", scope: !252, file: !2, line: 57, baseType: !277, size: 32, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "Indextype", file: !2, line: 47, baseType: !171)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "doms", scope: !252, file: !2, line: 58, baseType: !260, size: 8, offset: 544)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "optionmin", scope: !252, file: !2, line: 59, baseType: !280, size: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOption", file: !226, line: 33, baseType: !282)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtOption", file: !226, line: 33, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "optionmax", scope: !252, file: !2, line: 59, baseType: !280, size: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "optionoutput", scope: !252, file: !2, line: 59, baseType: !280, size: 64, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "optionfmindex", scope: !252, file: !2, line: 59, baseType: !280, size: 64, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "optionesaindex", scope: !252, file: !2, line: 60, baseType: !280, size: 64, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "optionpckindex", scope: !252, file: !2, line: 60, baseType: !280, size: 64, offset: 896)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "optionquery", scope: !252, file: !2, line: 60, baseType: !280, size: 64, offset: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "optionverify", scope: !252, file: !2, line: 60, baseType: !280, size: 64, offset: 1024)
!290 = !{!291, !291, i64 0}
!291 = !{!"any pointer", !292, i64 0}
!292 = !{!"omnipotent char", !293, i64 0}
!293 = !{!"Simple C/C++ TBAA"}
!294 = !DILocation(line: 86, column: 47, scope: !246)
!295 = !DILocation(line: 88, column: 3, scope: !246)
!296 = !DILocation(line: 88, column: 19, scope: !246)
!297 = !DILocation(line: 88, column: 31, scope: !246)
!298 = !DILocation(line: 89, column: 8, scope: !299)
!299 = distinct !DILexicalBlock(scope: !246, file: !2, line: 89, column: 7)
!300 = !DILocation(line: 89, column: 7, scope: !246)
!301 = !DILocation(line: 89, column: 19, scope: !299)
!302 = !DILocation(line: 90, column: 23, scope: !246)
!303 = !DILocation(line: 90, column: 34, scope: !246)
!304 = !{!305, !291, i64 48}
!305 = !{!"", !306, i64 0, !306, i64 16, !309, i64 32, !307, i64 36, !291, i64 40, !291, i64 48, !291, i64 56, !292, i64 64, !307, i64 68, !291, i64 72, !291, i64 80, !291, i64 88, !291, i64 96, !291, i64 104, !291, i64 112, !291, i64 120, !291, i64 128}
!306 = !{!"", !307, i64 0, !308, i64 8}
!307 = !{!"_Bool", !292, i64 0}
!308 = !{!"long", !292, i64 0}
!309 = !{!"int", !292, i64 0}
!310 = !DILocation(line: 90, column: 3, scope: !246)
!311 = !DILocation(line: 91, column: 23, scope: !246)
!312 = !DILocation(line: 91, column: 34, scope: !246)
!313 = !{!305, !291, i64 56}
!314 = !DILocation(line: 91, column: 3, scope: !246)
!315 = !DILocation(line: 92, column: 17, scope: !246)
!316 = !DILocation(line: 92, column: 28, scope: !246)
!317 = !{!305, !291, i64 40}
!318 = !DILocation(line: 92, column: 3, scope: !246)
!319 = !DILocation(line: 93, column: 3, scope: !246)
!320 = !DILocation(line: 94, column: 1, scope: !246)
!321 = distinct !DISubprogram(name: "gt_matstat_option_parser_new", scope: !2, file: !2, line: 96, type: !222, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !169, retainedNodes: !322)
!322 = !{!323, !324, !325}
!323 = !DILocalVariable(name: "tool_arguments", arg: 1, scope: !321, file: !2, line: 96, type: !190)
!324 = !DILocalVariable(name: "arguments", scope: !321, file: !2, line: 98, type: !250)
!325 = !DILocalVariable(name: "op", scope: !321, file: !2, line: 99, type: !224)
!326 = !DILocation(line: 96, column: 59, scope: !321)
!327 = !DILocation(line: 98, column: 3, scope: !321)
!328 = !DILocation(line: 98, column: 19, scope: !321)
!329 = !DILocation(line: 98, column: 31, scope: !321)
!330 = !DILocation(line: 99, column: 3, scope: !321)
!331 = !DILocation(line: 99, column: 19, scope: !321)
!332 = !DILocation(line: 100, column: 3, scope: !321)
!333 = !DILocation(line: 100, column: 3, scope: !334)
!334 = distinct !DILexicalBlock(scope: !335, file: !2, line: 100, column: 3)
!335 = distinct !DILexicalBlock(scope: !321, file: !2, line: 100, column: 3)
!336 = !DILocation(line: 100, column: 3, scope: !335)
!337 = !DILocation(line: 100, column: 3, scope: !338)
!338 = distinct !DILexicalBlock(scope: !334, file: !2, line: 100, column: 3)
!339 = !DILocation(line: 103, column: 26, scope: !321)
!340 = !DILocation(line: 103, column: 37, scope: !321)
!341 = !{!305, !307, i64 68}
!342 = !{i8 0, i8 2}
!343 = !{}
!344 = !DILocation(line: 102, column: 8, scope: !321)
!345 = !DILocation(line: 102, column: 6, scope: !321)
!346 = !DILocation(line: 106, column: 37, scope: !321)
!347 = !DILocation(line: 106, column: 3, scope: !321)
!348 = !DILocation(line: 109, column: 51, scope: !321)
!349 = !DILocation(line: 109, column: 62, scope: !321)
!350 = !DILocation(line: 108, column: 30, scope: !321)
!351 = !DILocation(line: 108, column: 3, scope: !321)
!352 = !DILocation(line: 108, column: 14, scope: !321)
!353 = !DILocation(line: 108, column: 28, scope: !321)
!354 = !{!305, !291, i64 96}
!355 = !DILocation(line: 110, column: 31, scope: !321)
!356 = !DILocation(line: 110, column: 35, scope: !321)
!357 = !DILocation(line: 110, column: 46, scope: !321)
!358 = !DILocation(line: 110, column: 3, scope: !321)
!359 = !DILocation(line: 114, column: 52, scope: !321)
!360 = !DILocation(line: 114, column: 63, scope: !321)
!361 = !DILocation(line: 112, column: 31, scope: !321)
!362 = !DILocation(line: 112, column: 3, scope: !321)
!363 = !DILocation(line: 112, column: 14, scope: !321)
!364 = !DILocation(line: 112, column: 29, scope: !321)
!365 = !{!305, !291, i64 104}
!366 = !DILocation(line: 115, column: 31, scope: !321)
!367 = !DILocation(line: 115, column: 35, scope: !321)
!368 = !DILocation(line: 115, column: 46, scope: !321)
!369 = !DILocation(line: 115, column: 3, scope: !321)
!370 = !DILocation(line: 119, column: 52, scope: !321)
!371 = !DILocation(line: 119, column: 63, scope: !321)
!372 = !DILocation(line: 117, column: 31, scope: !321)
!373 = !DILocation(line: 117, column: 3, scope: !321)
!374 = !DILocation(line: 117, column: 14, scope: !321)
!375 = !DILocation(line: 117, column: 29, scope: !321)
!376 = !{!305, !291, i64 112}
!377 = !DILocation(line: 120, column: 31, scope: !321)
!378 = !DILocation(line: 120, column: 35, scope: !321)
!379 = !DILocation(line: 120, column: 46, scope: !321)
!380 = !DILocation(line: 120, column: 3, scope: !321)
!381 = !DILocation(line: 122, column: 21, scope: !321)
!382 = !DILocation(line: 122, column: 32, scope: !321)
!383 = !DILocation(line: 122, column: 46, scope: !321)
!384 = !DILocation(line: 122, column: 57, scope: !321)
!385 = !DILocation(line: 122, column: 3, scope: !321)
!386 = !DILocation(line: 123, column: 21, scope: !321)
!387 = !DILocation(line: 123, column: 32, scope: !321)
!388 = !DILocation(line: 123, column: 47, scope: !321)
!389 = !DILocation(line: 123, column: 58, scope: !321)
!390 = !DILocation(line: 123, column: 3, scope: !321)
!391 = !DILocation(line: 124, column: 21, scope: !321)
!392 = !DILocation(line: 124, column: 32, scope: !321)
!393 = !DILocation(line: 124, column: 47, scope: !321)
!394 = !DILocation(line: 124, column: 58, scope: !321)
!395 = !DILocation(line: 124, column: 3, scope: !321)
!396 = !DILocation(line: 128, column: 54, scope: !321)
!397 = !DILocation(line: 128, column: 65, scope: !321)
!398 = !DILocation(line: 126, column: 28, scope: !321)
!399 = !DILocation(line: 126, column: 3, scope: !321)
!400 = !DILocation(line: 126, column: 14, scope: !321)
!401 = !DILocation(line: 126, column: 26, scope: !321)
!402 = !{!305, !291, i64 120}
!403 = !DILocation(line: 129, column: 26, scope: !321)
!404 = !DILocation(line: 129, column: 37, scope: !321)
!405 = !DILocation(line: 129, column: 3, scope: !321)
!406 = !DILocation(line: 130, column: 31, scope: !321)
!407 = !DILocation(line: 130, column: 35, scope: !321)
!408 = !DILocation(line: 130, column: 46, scope: !321)
!409 = !DILocation(line: 130, column: 3, scope: !321)
!410 = !DILocation(line: 135, column: 37, scope: !321)
!411 = !DILocation(line: 135, column: 48, scope: !321)
!412 = !DILocation(line: 136, column: 43, scope: !321)
!413 = !DILocation(line: 132, column: 26, scope: !321)
!414 = !DILocation(line: 132, column: 3, scope: !321)
!415 = !DILocation(line: 132, column: 14, scope: !321)
!416 = !DILocation(line: 132, column: 24, scope: !321)
!417 = !{!305, !291, i64 72}
!418 = !DILocation(line: 138, column: 31, scope: !321)
!419 = !DILocation(line: 138, column: 35, scope: !321)
!420 = !DILocation(line: 138, column: 46, scope: !321)
!421 = !DILocation(line: 138, column: 3, scope: !321)
!422 = !DILocation(line: 143, column: 37, scope: !321)
!423 = !DILocation(line: 143, column: 48, scope: !321)
!424 = !DILocation(line: 144, column: 43, scope: !321)
!425 = !DILocation(line: 140, column: 26, scope: !321)
!426 = !DILocation(line: 140, column: 3, scope: !321)
!427 = !DILocation(line: 140, column: 14, scope: !321)
!428 = !DILocation(line: 140, column: 24, scope: !321)
!429 = !{!305, !291, i64 80}
!430 = !DILocation(line: 146, column: 31, scope: !321)
!431 = !DILocation(line: 146, column: 35, scope: !321)
!432 = !DILocation(line: 146, column: 46, scope: !321)
!433 = !DILocation(line: 146, column: 3, scope: !321)
!434 = !DILocation(line: 149, column: 20, scope: !321)
!435 = !DILocation(line: 149, column: 31, scope: !321)
!436 = !DILocation(line: 152, column: 20, scope: !321)
!437 = !DILocation(line: 152, column: 31, scope: !321)
!438 = !DILocation(line: 148, column: 29, scope: !321)
!439 = !DILocation(line: 148, column: 3, scope: !321)
!440 = !DILocation(line: 148, column: 14, scope: !321)
!441 = !DILocation(line: 148, column: 27, scope: !321)
!442 = !{!305, !291, i64 88}
!443 = !DILocation(line: 153, column: 31, scope: !321)
!444 = !DILocation(line: 153, column: 35, scope: !321)
!445 = !DILocation(line: 153, column: 46, scope: !321)
!446 = !DILocation(line: 153, column: 3, scope: !321)
!447 = !DILocation(line: 155, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !321, file: !2, line: 155, column: 7)
!449 = !DILocation(line: 155, column: 18, scope: !448)
!450 = !DILocation(line: 155, column: 7, scope: !321)
!451 = !DILocation(line: 158, column: 51, scope: !452)
!452 = distinct !DILexicalBlock(scope: !448, file: !2, line: 155, column: 24)
!453 = !DILocation(line: 158, column: 62, scope: !452)
!454 = !DILocation(line: 156, column: 31, scope: !452)
!455 = !DILocation(line: 156, column: 5, scope: !452)
!456 = !DILocation(line: 156, column: 16, scope: !452)
!457 = !DILocation(line: 156, column: 29, scope: !452)
!458 = !{!305, !291, i64 128}
!459 = !DILocation(line: 160, column: 37, scope: !452)
!460 = !DILocation(line: 160, column: 48, scope: !452)
!461 = !DILocation(line: 160, column: 5, scope: !452)
!462 = !DILocation(line: 161, column: 33, scope: !452)
!463 = !DILocation(line: 161, column: 37, scope: !452)
!464 = !DILocation(line: 161, column: 48, scope: !452)
!465 = !DILocation(line: 161, column: 5, scope: !452)
!466 = !DILocation(line: 162, column: 3, scope: !452)
!467 = !DILocation(line: 164, column: 5, scope: !468)
!468 = distinct !DILexicalBlock(scope: !448, file: !2, line: 163, column: 3)
!469 = !DILocation(line: 164, column: 16, scope: !468)
!470 = !DILocation(line: 164, column: 33, scope: !468)
!471 = !{!305, !307, i64 36}
!472 = !DILocation(line: 167, column: 36, scope: !321)
!473 = !DILocation(line: 167, column: 3, scope: !321)
!474 = !DILocation(line: 169, column: 10, scope: !321)
!475 = !DILocation(line: 170, column: 1, scope: !321)
!476 = !DILocation(line: 169, column: 3, scope: !321)
!477 = distinct !DISubprogram(name: "gt_matstat_arguments_check", scope: !2, file: !2, line: 172, type: !230, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !169, retainedNodes: !478)
!478 = !{!479, !480, !481, !482, !483, !484, !494, !498}
!479 = !DILocalVariable(name: "rest_argc", arg: 1, scope: !477, file: !2, line: 172, type: !232)
!480 = !DILocalVariable(name: "tool_arguments", arg: 2, scope: !477, file: !2, line: 173, type: !190)
!481 = !DILocalVariable(name: "err", arg: 3, scope: !477, file: !2, line: 173, type: !233)
!482 = !DILocalVariable(name: "arguments", scope: !477, file: !2, line: 175, type: !250)
!483 = !DILocalVariable(name: "had_err", scope: !477, file: !2, line: 176, type: !232)
!484 = !DILocalVariable(name: "msgfmsubmodedesctable", scope: !477, file: !2, line: 177, type: !485)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 576, elements: !162)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "Optionargmodedesc", file: !488, line: 28, baseType: !489)
!488 = !DIFile(filename: "src/match/optionargmode.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "475c86d167e6b166f3d597fd3233e773")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 23, size: 192, elements: !490)
!490 = !{!491, !492, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !489, file: !488, line: 25, baseType: !242, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !489, file: !488, line: 26, baseType: !242, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "bitmask", scope: !489, file: !488, line: 27, baseType: !172, size: 32, offset: 128)
!494 = !DILocalVariable(name: "gfmsubmodedesctable", scope: !477, file: !2, line: 183, type: !495)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 384, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 2)
!498 = !DILocalVariable(name: "i", scope: !499, file: !2, line: 243, type: !188)
!499 = distinct !DILexicalBlock(scope: !500, file: !2, line: 242, column: 7)
!500 = distinct !DILexicalBlock(scope: !501, file: !2, line: 237, column: 11)
!501 = distinct !DILexicalBlock(scope: !502, file: !2, line: 236, column: 5)
!502 = distinct !DILexicalBlock(scope: !477, file: !2, line: 235, column: 9)
!503 = !{!309, !309, i64 0}
!504 = !DILocation(line: 172, column: 53, scope: !477)
!505 = !DILocation(line: 173, column: 45, scope: !477)
!506 = !DILocation(line: 173, column: 70, scope: !477)
!507 = !DILocation(line: 175, column: 3, scope: !477)
!508 = !DILocation(line: 175, column: 19, scope: !477)
!509 = !DILocation(line: 175, column: 31, scope: !477)
!510 = !DILocation(line: 176, column: 3, scope: !477)
!511 = !DILocation(line: 176, column: 7, scope: !477)
!512 = !DILocation(line: 177, column: 3, scope: !477)
!513 = !DILocation(line: 177, column: 27, scope: !477)
!514 = !DILocation(line: 183, column: 3, scope: !477)
!515 = !DILocation(line: 183, column: 27, scope: !477)
!516 = !DILocation(line: 188, column: 3, scope: !477)
!517 = !DILocation(line: 188, column: 3, scope: !518)
!518 = distinct !DILexicalBlock(scope: !519, file: !2, line: 188, column: 3)
!519 = distinct !DILexicalBlock(scope: !477, file: !2, line: 188, column: 3)
!520 = !DILocation(line: 188, column: 3, scope: !519)
!521 = !DILocation(line: 188, column: 3, scope: !522)
!522 = distinct !DILexicalBlock(scope: !518, file: !2, line: 188, column: 3)
!523 = !DILocation(line: 189, column: 3, scope: !477)
!524 = !DILocation(line: 189, column: 3, scope: !525)
!525 = distinct !DILexicalBlock(scope: !526, file: !2, line: 189, column: 3)
!526 = distinct !DILexicalBlock(scope: !477, file: !2, line: 189, column: 3)
!527 = !DILocation(line: 189, column: 3, scope: !526)
!528 = !DILocation(line: 189, column: 3, scope: !529)
!529 = distinct !DILexicalBlock(scope: !525, file: !2, line: 189, column: 3)
!530 = !DILocation(line: 191, column: 24, scope: !531)
!531 = distinct !DILexicalBlock(scope: !477, file: !2, line: 191, column: 7)
!532 = !DILocation(line: 191, column: 35, scope: !531)
!533 = !DILocation(line: 191, column: 7, scope: !531)
!534 = !DILocation(line: 191, column: 7, scope: !477)
!535 = !DILocation(line: 193, column: 7, scope: !536)
!536 = distinct !DILexicalBlock(scope: !531, file: !2, line: 192, column: 5)
!537 = !DILocation(line: 193, column: 18, scope: !536)
!538 = !DILocation(line: 193, column: 28, scope: !536)
!539 = !{!305, !292, i64 64}
!540 = !DILocation(line: 194, column: 5, scope: !536)
!541 = !DILocation(line: 196, column: 28, scope: !542)
!542 = distinct !DILexicalBlock(scope: !543, file: !2, line: 196, column: 11)
!543 = distinct !DILexicalBlock(scope: !531, file: !2, line: 195, column: 5)
!544 = !DILocation(line: 196, column: 39, scope: !542)
!545 = !DILocation(line: 196, column: 11, scope: !542)
!546 = !DILocation(line: 196, column: 11, scope: !543)
!547 = !DILocation(line: 198, column: 9, scope: !548)
!548 = distinct !DILexicalBlock(scope: !542, file: !2, line: 197, column: 7)
!549 = !DILocation(line: 198, column: 20, scope: !548)
!550 = !DILocation(line: 198, column: 30, scope: !548)
!551 = !DILocation(line: 199, column: 7, scope: !548)
!552 = !DILocation(line: 201, column: 30, scope: !553)
!553 = distinct !DILexicalBlock(scope: !554, file: !2, line: 201, column: 13)
!554 = distinct !DILexicalBlock(scope: !542, file: !2, line: 200, column: 7)
!555 = !DILocation(line: 201, column: 41, scope: !553)
!556 = !DILocation(line: 201, column: 13, scope: !553)
!557 = !DILocation(line: 201, column: 13, scope: !554)
!558 = !DILocation(line: 203, column: 11, scope: !559)
!559 = distinct !DILexicalBlock(scope: !553, file: !2, line: 202, column: 9)
!560 = !DILocation(line: 203, column: 22, scope: !559)
!561 = !DILocation(line: 203, column: 32, scope: !559)
!562 = !DILocation(line: 204, column: 9, scope: !559)
!563 = !DILocation(line: 206, column: 24, scope: !564)
!564 = distinct !DILexicalBlock(scope: !553, file: !2, line: 205, column: 9)
!565 = !DILocation(line: 206, column: 11, scope: !564)
!566 = !DILocation(line: 207, column: 11, scope: !564)
!567 = !DILocation(line: 211, column: 26, scope: !568)
!568 = distinct !DILexicalBlock(scope: !477, file: !2, line: 211, column: 9)
!569 = !DILocation(line: 211, column: 37, scope: !568)
!570 = !DILocation(line: 211, column: 9, scope: !568)
!571 = !DILocation(line: 211, column: 9, scope: !477)
!572 = !DILocation(line: 213, column: 8, scope: !573)
!573 = distinct !DILexicalBlock(scope: !568, file: !2, line: 212, column: 5)
!574 = !DILocation(line: 213, column: 19, scope: !573)
!575 = !DILocation(line: 213, column: 29, scope: !573)
!576 = !DILocation(line: 213, column: 37, scope: !573)
!577 = !{!305, !307, i64 0}
!578 = !DILocation(line: 214, column: 5, scope: !573)
!579 = !DILocation(line: 215, column: 26, scope: !580)
!580 = distinct !DILexicalBlock(scope: !477, file: !2, line: 215, column: 9)
!581 = !DILocation(line: 215, column: 37, scope: !580)
!582 = !DILocation(line: 215, column: 9, scope: !580)
!583 = !DILocation(line: 215, column: 9, scope: !477)
!584 = !DILocation(line: 217, column: 8, scope: !585)
!585 = distinct !DILexicalBlock(scope: !580, file: !2, line: 216, column: 5)
!586 = !DILocation(line: 217, column: 19, scope: !585)
!587 = !DILocation(line: 217, column: 29, scope: !585)
!588 = !DILocation(line: 217, column: 37, scope: !585)
!589 = !{!305, !307, i64 16}
!590 = !DILocation(line: 218, column: 5, scope: !585)
!591 = !DILocation(line: 219, column: 27, scope: !592)
!592 = distinct !DILexicalBlock(scope: !477, file: !2, line: 219, column: 9)
!593 = !DILocation(line: 219, column: 38, scope: !592)
!594 = !DILocation(line: 219, column: 10, scope: !592)
!595 = !DILocation(line: 219, column: 49, scope: !592)
!596 = !DILocation(line: 220, column: 29, scope: !592)
!597 = !DILocation(line: 220, column: 40, scope: !592)
!598 = !DILocation(line: 220, column: 12, scope: !592)
!599 = !DILocation(line: 219, column: 9, scope: !477)
!600 = !DILocation(line: 222, column: 20, scope: !601)
!601 = distinct !DILexicalBlock(scope: !592, file: !2, line: 221, column: 5)
!602 = !DILocation(line: 222, column: 7, scope: !601)
!603 = !DILocation(line: 223, column: 7, scope: !601)
!604 = !DILocation(line: 225, column: 9, scope: !605)
!605 = distinct !DILexicalBlock(scope: !477, file: !2, line: 225, column: 9)
!606 = !DILocation(line: 225, column: 20, scope: !605)
!607 = !DILocation(line: 225, column: 30, scope: !605)
!608 = !DILocation(line: 225, column: 38, scope: !605)
!609 = !DILocation(line: 226, column: 9, scope: !605)
!610 = !DILocation(line: 226, column: 20, scope: !605)
!611 = !DILocation(line: 226, column: 30, scope: !605)
!612 = !DILocation(line: 225, column: 9, scope: !477)
!613 = !DILocation(line: 228, column: 11, scope: !614)
!614 = distinct !DILexicalBlock(scope: !615, file: !2, line: 228, column: 11)
!615 = distinct !DILexicalBlock(scope: !605, file: !2, line: 227, column: 5)
!616 = !DILocation(line: 228, column: 22, scope: !614)
!617 = !DILocation(line: 228, column: 32, scope: !614)
!618 = !{!305, !308, i64 24}
!619 = !DILocation(line: 229, column: 11, scope: !614)
!620 = !DILocation(line: 229, column: 22, scope: !614)
!621 = !DILocation(line: 229, column: 32, scope: !614)
!622 = !{!305, !308, i64 8}
!623 = !DILocation(line: 228, column: 50, scope: !614)
!624 = !DILocation(line: 228, column: 11, scope: !615)
!625 = !DILocation(line: 231, column: 22, scope: !626)
!626 = distinct !DILexicalBlock(scope: !614, file: !2, line: 230, column: 7)
!627 = !DILocation(line: 231, column: 9, scope: !626)
!628 = !DILocation(line: 232, column: 9, scope: !626)
!629 = !DILocation(line: 234, column: 5, scope: !615)
!630 = !DILocation(line: 235, column: 26, scope: !502)
!631 = !DILocation(line: 235, column: 37, scope: !502)
!632 = !DILocation(line: 235, column: 9, scope: !502)
!633 = !DILocation(line: 235, column: 9, scope: !477)
!634 = !DILocation(line: 237, column: 29, scope: !500)
!635 = !DILocation(line: 237, column: 40, scope: !500)
!636 = !DILocation(line: 237, column: 11, scope: !500)
!637 = !DILocation(line: 237, column: 59, scope: !500)
!638 = !DILocation(line: 237, column: 11, scope: !501)
!639 = !DILocation(line: 239, column: 22, scope: !640)
!640 = distinct !DILexicalBlock(scope: !500, file: !2, line: 238, column: 7)
!641 = !DILocation(line: 239, column: 9, scope: !640)
!642 = !DILocation(line: 240, column: 9, scope: !640)
!643 = !DILocation(line: 243, column: 9, scope: !499)
!644 = !DILocation(line: 243, column: 17, scope: !499)
!645 = !DILocation(line: 244, column: 15, scope: !646)
!646 = distinct !DILexicalBlock(scope: !499, file: !2, line: 244, column: 9)
!647 = !{!308, !308, i64 0}
!648 = !DILocation(line: 244, column: 14, scope: !646)
!649 = !DILocation(line: 244, column: 19, scope: !650)
!650 = distinct !DILexicalBlock(scope: !646, file: !2, line: 244, column: 9)
!651 = !DILocation(line: 244, column: 39, scope: !650)
!652 = !DILocation(line: 244, column: 50, scope: !650)
!653 = !DILocation(line: 244, column: 21, scope: !650)
!654 = !DILocation(line: 244, column: 20, scope: !650)
!655 = !DILocation(line: 244, column: 9, scope: !646)
!656 = !DILocation(line: 246, column: 15, scope: !657)
!657 = distinct !DILexicalBlock(scope: !658, file: !2, line: 246, column: 15)
!658 = distinct !DILexicalBlock(scope: !650, file: !2, line: 245, column: 9)
!659 = !DILocation(line: 246, column: 26, scope: !657)
!660 = !DILocation(line: 246, column: 15, scope: !658)
!661 = !DILocation(line: 248, column: 40, scope: !662)
!662 = distinct !DILexicalBlock(scope: !663, file: !2, line: 248, column: 17)
!663 = distinct !DILexicalBlock(scope: !657, file: !2, line: 247, column: 11)
!664 = !DILocation(line: 251, column: 35, scope: !662)
!665 = !DILocation(line: 251, column: 46, scope: !662)
!666 = !DILocation(line: 253, column: 51, scope: !662)
!667 = !DILocation(line: 253, column: 62, scope: !662)
!668 = !DILocation(line: 254, column: 51, scope: !662)
!669 = !DILocation(line: 253, column: 34, scope: !662)
!670 = !DILocation(line: 255, column: 34, scope: !662)
!671 = !DILocation(line: 248, column: 17, scope: !662)
!672 = !DILocation(line: 255, column: 39, scope: !662)
!673 = !DILocation(line: 248, column: 17, scope: !663)
!674 = !DILocation(line: 257, column: 15, scope: !675)
!675 = distinct !DILexicalBlock(scope: !662, file: !2, line: 256, column: 13)
!676 = !DILocation(line: 259, column: 11, scope: !663)
!677 = !DILocation(line: 261, column: 40, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !2, line: 261, column: 17)
!679 = distinct !DILexicalBlock(scope: !657, file: !2, line: 260, column: 11)
!680 = !DILocation(line: 264, column: 36, scope: !678)
!681 = !DILocation(line: 264, column: 47, scope: !678)
!682 = !DILocation(line: 266, column: 52, scope: !678)
!683 = !DILocation(line: 266, column: 63, scope: !678)
!684 = !DILocation(line: 267, column: 52, scope: !678)
!685 = !DILocation(line: 266, column: 35, scope: !678)
!686 = !DILocation(line: 268, column: 35, scope: !678)
!687 = !DILocation(line: 261, column: 17, scope: !678)
!688 = !DILocation(line: 268, column: 40, scope: !678)
!689 = !DILocation(line: 261, column: 17, scope: !679)
!690 = !DILocation(line: 270, column: 15, scope: !691)
!691 = distinct !DILexicalBlock(scope: !678, file: !2, line: 269, column: 13)
!692 = !DILocation(line: 273, column: 9, scope: !658)
!693 = !DILocation(line: 244, column: 71, scope: !650)
!694 = !DILocation(line: 244, column: 9, scope: !650)
!695 = distinct !{!695, !655, !696, !697}
!696 = !DILocation(line: 273, column: 9, scope: !646)
!697 = !{!"llvm.loop.mustprogress"}
!698 = !DILocation(line: 274, column: 7, scope: !500)
!699 = !DILocation(line: 275, column: 5, scope: !501)
!700 = !DILocation(line: 277, column: 10, scope: !477)
!701 = !DILocation(line: 277, column: 3, scope: !477)
!702 = !DILocation(line: 278, column: 1, scope: !477)
!703 = distinct !DISubprogram(name: "gt_matstat_runner", scope: !2, file: !2, line: 291, type: !239, scopeLine: 294, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !169, retainedNodes: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !777, !916, !917, !922, !923, !924, !925, !926, !929, !932}
!705 = !DILocalVariable(name: "argc", arg: 1, scope: !703, file: !2, line: 291, type: !232)
!706 = !DILocalVariable(name: "argv", arg: 2, scope: !703, file: !2, line: 291, type: !241)
!707 = !DILocalVariable(name: "parsed_args", arg: 3, scope: !703, file: !2, line: 292, type: !232)
!708 = !DILocalVariable(name: "tool_arguments", arg: 4, scope: !703, file: !2, line: 293, type: !190)
!709 = !DILocalVariable(name: "err", arg: 5, scope: !703, file: !2, line: 293, type: !233)
!710 = !DILocalVariable(name: "arguments", scope: !703, file: !2, line: 295, type: !250)
!711 = !DILocalVariable(name: "fmindex", scope: !703, file: !2, line: 296, type: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "Fmindex", file: !713, line: 114, baseType: !714)
!713 = !DIFile(filename: "src/match/fmindex.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7e6c46aa1d3ea5efe542c2555a14e059")
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !713, line: 82, size: 1664, elements: !715)
!715 = !{!716, !721, !725, !726, !728, !729, !730, !731, !732, !733, !734, !748, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bwtformatching", scope: !714, file: !713, line: 85, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseq", file: !719, line: 48, baseType: !720)
!719 = !DIFile(filename: "src/core/encseq_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "bab4512cadee996edd2995020539d931")
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncseq", file: !719, line: 48, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bfreq", scope: !714, file: !713, line: 86, baseType: !722, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUchar", file: !189, line: 102, baseType: !724)
!724 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "bwtlength", scope: !714, file: !713, line: 87, baseType: !188, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tfreq", scope: !714, file: !713, line: 88, baseType: !727, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "superbfreq", scope: !714, file: !713, line: 89, baseType: !727, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "markpostable", scope: !714, file: !713, line: 91, baseType: !727, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "longestsuffixpos", scope: !714, file: !713, line: 92, baseType: !188, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "negatebsizeones", scope: !714, file: !713, line: 93, baseType: !188, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "negatesuperbsizeones", scope: !714, file: !713, line: 94, baseType: !188, size: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "markdistminus1", scope: !714, file: !713, line: 95, baseType: !188, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "specpos", scope: !714, file: !713, line: 96, baseType: !735, size: 192, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtArrayGtPairBwtidx", file: !713, line: 78, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !713, line: 78, size: 192, elements: !737)
!737 = !{!738, !746, !747}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "spaceGtPairBwtidx", scope: !736, file: !713, line: 78, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtPairBwtidx", file: !741, line: 21, baseType: !742)
!741 = !DIFile(filename: "src/core/pairbwtidx.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "a077674a651f35c88d69efde7317d61b")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtPairBwtidx", file: !741, line: 23, size: 128, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bwtpos", scope: !742, file: !741, line: 25, baseType: !188, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "suftabvalue", scope: !742, file: !741, line: 26, baseType: !188, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "allocatedGtPairBwtidx", scope: !736, file: !713, line: 78, baseType: !188, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "nextfreeGtPairBwtidx", scope: !736, file: !713, line: 78, baseType: !188, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "alphabet", scope: !714, file: !713, line: 97, baseType: !749, size: 64, offset: 832)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtAlphabet", file: !752, line: 32, baseType: !753)
!752 = !DIFile(filename: "src/core/alphabet_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0b48240ce57ca6598f5548b5c9cf52e4")
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtAlphabet", file: !752, line: 32, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mappedptr", scope: !714, file: !713, line: 98, baseType: !190, size: 64, offset: 896)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mapsize", scope: !714, file: !713, line: 99, baseType: !172, size: 32, offset: 960)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !714, file: !713, line: 100, baseType: !172, size: 32, offset: 992)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bsizehalve", scope: !714, file: !713, line: 101, baseType: !172, size: 32, offset: 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "superbsize", scope: !714, file: !713, line: 102, baseType: !172, size: 32, offset: 1056)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "log2bsize", scope: !714, file: !713, line: 103, baseType: !172, size: 32, offset: 1088)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "log2superbsize", scope: !714, file: !713, line: 104, baseType: !172, size: 32, offset: 1120)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "log2superbsizeminuslog2bsize", scope: !714, file: !713, line: 105, baseType: !172, size: 32, offset: 1152)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "log2markdist", scope: !714, file: !713, line: 106, baseType: !172, size: 32, offset: 1184)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "suffixlength", scope: !714, file: !713, line: 107, baseType: !172, size: 32, offset: 1216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sizeofindex", scope: !714, file: !713, line: 108, baseType: !188, size: 64, offset: 1280)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "nofblocks", scope: !714, file: !713, line: 109, baseType: !188, size: 64, offset: 1344)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "nofsuperblocks", scope: !714, file: !713, line: 110, baseType: !188, size: 64, offset: 1408)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "markdist", scope: !714, file: !713, line: 111, baseType: !188, size: 64, offset: 1472)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "numofcodes", scope: !714, file: !713, line: 112, baseType: !188, size: 64, offset: 1536)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "boundarray", scope: !714, file: !713, line: 113, baseType: !770, size: 64, offset: 1600)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUwordBound", file: !772, line: 21, baseType: !773)
!772 = !DIFile(filename: "src/core/ulongbound.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "5815ec5aad6c13ed0fc0be044c91840c")
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtUwordBound", file: !772, line: 23, size: 128, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lbound", scope: !773, file: !772, line: 25, baseType: !188, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ubound", scope: !773, file: !772, line: 26, baseType: !188, size: 64, offset: 64)
!777 = !DILocalVariable(name: "suffixarray", scope: !703, file: !2, line: 297, type: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "Suffixarray", file: !779, line: 88, baseType: !780)
!779 = !DIFile(filename: "src/match/sarr-def.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "680305296307322e88a803109233df34")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 63, size: 2048, elements: !781)
!781 = !{!782, !783, !784, !785, !792, !793, !795, !796, !797, !801, !804, !813, !814, !815, !820, !889, !898, !906, !907}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "encseq", scope: !780, file: !779, line: 65, baseType: !717, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "numoflargelcpvalues", scope: !780, file: !779, line: 66, baseType: !255, size: 128, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "maxbranchdepth", scope: !780, file: !779, line: 67, baseType: !255, size: 128, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "averagelcp", scope: !780, file: !779, line: 68, baseType: !786, size: 128, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "Defineddouble", file: !256, line: 40, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !256, line: 36, size: 128, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "defined", scope: !787, file: !256, line: 38, baseType: !260, size: 8)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "valuedouble", scope: !787, file: !256, line: 39, baseType: !791, size: 64, offset: 64)
!791 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "longest", scope: !780, file: !779, line: 69, baseType: !255, size: 128, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "readmode", scope: !780, file: !779, line: 70, baseType: !794, size: 32, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtReadmode", file: !178, line: 32, baseType: !177)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mirroredencseq", scope: !780, file: !779, line: 71, baseType: !260, size: 8, offset: 608)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "numberofallsortedsuffixes", scope: !780, file: !779, line: 72, baseType: !188, size: 64, offset: 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "suftab", scope: !780, file: !779, line: 74, baseType: !798, size: 64, offset: 704)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESASuffixptr", file: !779, line: 59, baseType: !188)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lcptab", scope: !780, file: !779, line: 75, baseType: !802, size: 64, offset: 768)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "llvtab", scope: !780, file: !779, line: 76, baseType: !805, size: 64, offset: 832)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "Largelcpvalue", file: !808, line: 30, baseType: !809)
!808 = !DIFile(filename: "src/match/lcpoverflow.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "fbf9328cf0deca32f53d590fbcd3426d")
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !808, line: 26, size: 128, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !809, file: !808, line: 28, baseType: !188, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !809, file: !808, line: 29, baseType: !188, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bwttab", scope: !780, file: !779, line: 77, baseType: !802, size: 64, offset: 896)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlength", scope: !780, file: !779, line: 78, baseType: !172, size: 32, offset: 960)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "bcktab", scope: !780, file: !779, line: 79, baseType: !816, size: 64, offset: 1024)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBcktab", file: !818, line: 49, baseType: !819)
!818 = !DIFile(filename: "src/match/bcktab.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1e275b447e1ba6b734897fa227cc90a3")
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtBcktab", file: !818, line: 49, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "suftabstream_uint32_t", scope: !780, file: !779, line: 82, baseType: !821, size: 192, offset: 1088)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_uint32_t", file: !779, line: 49, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 49, size: 192, elements: !823)
!823 = !{!824, !825, !826, !832}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !822, file: !779, line: 49, baseType: !172, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !822, file: !779, line: 49, baseType: !172, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !822, file: !779, line: 49, baseType: !827, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !829, line: 26, baseType: !830)
!829 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !831, line: 42, baseType: !172)
!831 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!832 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !822, file: !779, line: 49, baseType: !833, size: 64, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !835, line: 7, baseType: !836)
!835 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !837, line: 49, size: 1728, elements: !838)
!837 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!838 = !{!839, !840, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !855, !857, !858, !859, !862, !864, !866, !870, !873, !875, !878, !881, !882, !883, !884, !885}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !836, file: !837, line: 51, baseType: !232, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !836, file: !837, line: 54, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !836, file: !837, line: 55, baseType: !841, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !836, file: !837, line: 56, baseType: !841, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !836, file: !837, line: 57, baseType: !841, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !836, file: !837, line: 58, baseType: !841, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !836, file: !837, line: 59, baseType: !841, size: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !836, file: !837, line: 60, baseType: !841, size: 64, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !836, file: !837, line: 61, baseType: !841, size: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !836, file: !837, line: 64, baseType: !841, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !836, file: !837, line: 65, baseType: !841, size: 64, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !836, file: !837, line: 66, baseType: !841, size: 64, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !836, file: !837, line: 68, baseType: !853, size: 64, offset: 768)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !837, line: 36, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !836, file: !837, line: 70, baseType: !856, size: 64, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !836, file: !837, line: 72, baseType: !232, size: 32, offset: 896)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !836, file: !837, line: 73, baseType: !232, size: 32, offset: 928)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !836, file: !837, line: 74, baseType: !860, size: 64, offset: 960)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !831, line: 152, baseType: !861)
!861 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !836, file: !837, line: 77, baseType: !863, size: 16, offset: 1024)
!863 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !836, file: !837, line: 78, baseType: !865, size: 8, offset: 1040)
!865 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !836, file: !837, line: 79, baseType: !867, size: 8, offset: 1048)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 1)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !836, file: !837, line: 81, baseType: !871, size: 64, offset: 1088)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !837, line: 43, baseType: null)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !836, file: !837, line: 89, baseType: !874, size: 64, offset: 1152)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !831, line: 153, baseType: !861)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !836, file: !837, line: 91, baseType: !876, size: 64, offset: 1216)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !837, line: 37, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !836, file: !837, line: 92, baseType: !879, size: 64, offset: 1280)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !837, line: 38, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !836, file: !837, line: 93, baseType: !856, size: 64, offset: 1344)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !836, file: !837, line: 94, baseType: !190, size: 64, offset: 1408)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !836, file: !837, line: 95, baseType: !185, size: 64, offset: 1472)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !836, file: !837, line: 96, baseType: !232, size: 32, offset: 1536)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !836, file: !837, line: 98, baseType: !886, size: 160, offset: 1568)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 20)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "suftabstream_GtUword", scope: !780, file: !779, line: 84, baseType: !890, size: 192, offset: 1280)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_GtUword", file: !891, line: 61, baseType: !892)
!891 = !DIFile(filename: "src/match/declare-readfunc.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "efed3a700136885dfbda6df2e18c991e")
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !891, line: 61, size: 192, elements: !893)
!893 = !{!894, !895, !896, !897}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !892, file: !891, line: 61, baseType: !172, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !892, file: !891, line: 61, baseType: !172, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !892, file: !891, line: 61, baseType: !727, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !892, file: !891, line: 61, baseType: !833, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bwttabstream", scope: !780, file: !779, line: 85, baseType: !899, size: 192, offset: 1472)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_GtUchar", file: !779, line: 53, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 53, size: 192, elements: !901)
!901 = !{!902, !903, !904, !905}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !900, file: !779, line: 53, baseType: !172, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !900, file: !779, line: 53, baseType: !172, size: 32, offset: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !900, file: !779, line: 53, baseType: !722, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !900, file: !779, line: 53, baseType: !833, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lcptabstream", scope: !780, file: !779, line: 86, baseType: !899, size: 192, offset: 1664)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "llvtabstream", scope: !780, file: !779, line: 87, baseType: !908, size: 192, offset: 1856)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_Largelcpvalue", file: !779, line: 56, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 56, size: 192, elements: !910)
!910 = !{!911, !912, !913, !915}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !909, file: !779, line: 56, baseType: !172, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !909, file: !779, line: 56, baseType: !172, size: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !909, file: !779, line: 56, baseType: !914, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !909, file: !779, line: 56, baseType: !833, size: 64, offset: 128)
!916 = !DILocalVariable(name: "packedindex", scope: !703, file: !2, line: 298, type: !190)
!917 = !DILocalVariable(name: "logger", scope: !703, file: !2, line: 299, type: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtLogger", file: !920, line: 26, baseType: !921)
!920 = !DIFile(filename: "src/core/logger_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "076ebb09feb7de7a97ee09fc11eb7134")
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtLogger", file: !920, line: 26, flags: DIFlagFwdDecl)
!922 = !DILocalVariable(name: "haserr", scope: !703, file: !2, line: 300, type: !260)
!923 = !DILocalVariable(name: "alphabet", scope: !703, file: !2, line: 301, type: !749)
!924 = !DILocalVariable(name: "totallength", scope: !703, file: !2, line: 305, type: !188)
!925 = !DILocalVariable(name: "gt_mapfmindexfail", scope: !703, file: !2, line: 306, type: !260)
!926 = !DILocalVariable(name: "mappedbits", scope: !927, file: !2, line: 325, type: !172)
!927 = distinct !DILexicalBlock(scope: !928, file: !2, line: 324, column: 3)
!928 = distinct !DILexicalBlock(scope: !703, file: !2, line: 311, column: 7)
!929 = !DILocalVariable(name: "theindex", scope: !930, file: !2, line: 378, type: !191)
!930 = distinct !DILexicalBlock(scope: !931, file: !2, line: 377, column: 3)
!931 = distinct !DILexicalBlock(scope: !703, file: !2, line: 376, column: 7)
!932 = !DILocalVariable(name: "gmatchforwardfunction", scope: !930, file: !2, line: 379, type: !933)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "Greedygmatchforwardfunction", file: !934, line: 30, baseType: !935)
!934 = !DIFile(filename: "src/match/greedyfwdmat.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "88c6842e19a7bbc59f6872569e40be08")
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!188, !191, !188, !188, !188, !727, !802, !802}
!938 = !DILocation(line: 291, column: 44, scope: !703)
!939 = !DILocation(line: 291, column: 73, scope: !703)
!940 = !DILocation(line: 292, column: 44, scope: !703)
!941 = !DILocation(line: 293, column: 36, scope: !703)
!942 = !DILocation(line: 293, column: 61, scope: !703)
!943 = !DILocation(line: 295, column: 3, scope: !703)
!944 = !DILocation(line: 295, column: 19, scope: !703)
!945 = !DILocation(line: 295, column: 31, scope: !703)
!946 = !DILocation(line: 296, column: 3, scope: !703)
!947 = !DILocation(line: 296, column: 11, scope: !703)
!948 = !DILocation(line: 297, column: 3, scope: !703)
!949 = !DILocation(line: 297, column: 15, scope: !703)
!950 = !DILocation(line: 298, column: 3, scope: !703)
!951 = !DILocation(line: 298, column: 9, scope: !703)
!952 = !DILocation(line: 299, column: 3, scope: !703)
!953 = !DILocation(line: 299, column: 13, scope: !703)
!954 = !DILocation(line: 300, column: 3, scope: !703)
!955 = !DILocation(line: 300, column: 8, scope: !703)
!956 = !{!307, !307, i64 0}
!957 = !DILocation(line: 301, column: 3, scope: !703)
!958 = !DILocation(line: 301, column: 21, scope: !703)
!959 = !DILocation(line: 305, column: 3, scope: !703)
!960 = !DILocation(line: 305, column: 11, scope: !703)
!961 = !DILocation(line: 306, column: 3, scope: !703)
!962 = !DILocation(line: 306, column: 8, scope: !703)
!963 = !DILocation(line: 307, column: 3, scope: !703)
!964 = !DILocation(line: 307, column: 3, scope: !965)
!965 = distinct !DILexicalBlock(scope: !966, file: !2, line: 307, column: 3)
!966 = distinct !DILexicalBlock(scope: !703, file: !2, line: 307, column: 3)
