; ModuleID = 'samples/384.bc'
source_filename = "src/http/modules/ngx_http_mirror_module.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_http_module_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_command_s = type { %struct.ngx_str_t, i64, ptr, i64, i64, ptr }
%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_conf_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr }
%struct.ngx_http_conf_ctx_t = type { ptr, ptr, ptr }
%struct.ngx_http_core_main_conf_t = type { %struct.ngx_array_t, %struct.ngx_http_phase_engine_t, %struct.ngx_hash_t, %struct.ngx_hash_t, %struct.ngx_array_t, %struct.ngx_array_t, i64, i64, i64, i64, i64, ptr, ptr, [11 x %struct.ngx_http_phase_t] }
%struct.ngx_http_phase_engine_t = type { ptr, i64, i64 }
%struct.ngx_hash_t = type { ptr, i64 }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }
%struct.ngx_http_phase_t = type { %struct.ngx_array_t }
%struct.ngx_http_mirror_loc_conf_t = type { ptr, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/http/modules/ngx_http_mirror_module.c", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "e436a9f07e10f99d53dc82b26d42e3e7")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 41)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "ngx_http_mirror_module_ctx", scope: !9, file: !2, line: 54, type: !647, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !26, globals: !50, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11}
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 108, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "01bbc621c19214151ccc7d6928049534")
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!15 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!16 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!17 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!18 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!19 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!20 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!21 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!22 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!23 = !DIEnumerator(name: "NGX_HTTP_PRECONTENT_PHASE", value: 8)
!24 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!25 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!26 = !{!27, !32, !33, !42, !48}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !28, line: 79, baseType: !29)
!28 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !30, line: 90, baseType: !31)
!30 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!31 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !35, line: 21, baseType: !36)
!35 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f0f323751ab5b63196467d991a0424cd")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 17, size: 192, elements: !37)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !36, file: !35, line: 18, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !36, file: !35, line: 19, baseType: !39, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !36, file: !35, line: 20, baseType: !39, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !44, line: 33, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !46, line: 31, baseType: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!50 = !{!0, !51, !7, !624, !629, !634, !637, !642}
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "ngx_http_mirror_module", scope: !9, file: !2, line: 69, type: !53, isLocal: false, isDefinition: true)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !54, line: 15, baseType: !55)
!54 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1c4d8383f329aa1de050d17038ecb169")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !56, line: 222, size: 1600, elements: !57)
!56 = !DIFile(filename: "src/core/ngx_module.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1b2032f87974a892f93f4098e8fc0619")
!57 = !{!58, !59, !60, !62, !63, !64, !65, !66, !67, !599, !600, !604, !608, !609, !610, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !55, file: !56, line: 223, baseType: !27, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !55, file: !56, line: 224, baseType: !27, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !56, line: 226, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !55, file: !56, line: 228, baseType: !27, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !55, file: !56, line: 229, baseType: !27, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !55, file: !56, line: 231, baseType: !27, size: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !55, file: !56, line: 232, baseType: !48, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !55, file: !56, line: 234, baseType: !32, size: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !55, file: !56, line: 235, baseType: !68, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !54, line: 22, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !71, line: 77, size: 448, elements: !72)
!71 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6ae6b72e2fd6bbb6ecc9de2e6386072c")
!72 = !{!73, !82, !83, !596, !597, !598}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !71, line: 78, baseType: !74, size: 128)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !75, line: 19, baseType: !76)
!75 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "aecf67ab89c624000ba2e2684dbcfdc8")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 16, size: 128, elements: !77)
!77 = !{!78, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !76, file: !75, line: 17, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !80, line: 29, baseType: !31)
!80 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !75, line: 18, baseType: !42, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !71, line: 79, baseType: !27, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !70, file: !71, line: 80, baseType: !84, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!61, !87, !68, !32}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !54, line: 16, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !71, line: 116, size: 768, elements: !90)
!90 = !{!91, !92, !267, !578, !579, !580, !589, !590, !591, !592, !593, !595}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !71, line: 117, baseType: !61, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !89, file: !71, line: 118, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !95, line: 22, baseType: !96)
!95 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 16, size: 320, elements: !97)
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !96, file: !95, line: 17, baseType: !32, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !96, file: !95, line: 18, baseType: !27, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !96, file: !95, line: 19, baseType: !79, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !96, file: !95, line: 20, baseType: !27, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !96, file: !95, line: 21, baseType: !103, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !54, line: 18, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !106, line: 57, size: 640, elements: !107)
!106 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!107 = !{!108, !116, !117, !118, !247, !254, !266}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !105, file: !106, line: 58, baseType: !109, size: 256)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !106, line: 54, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 49, size: 256, elements: !111)
!111 = !{!112, !113, !114, !115}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !110, file: !106, line: 50, baseType: !42, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !110, file: !106, line: 51, baseType: !42, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !106, line: 52, baseType: !103, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !110, file: !106, line: 53, baseType: !27, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !105, file: !106, line: 59, baseType: !79, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !105, file: !106, line: 60, baseType: !103, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !105, file: !106, line: 61, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !54, line: 19, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !122, line: 59, size: 128, elements: !123)
!122 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6fc45f3cccbbf41b239dcfa9e2c5b7b1")
!123 = !{!124, !246}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !121, file: !122, line: 60, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !122, line: 18, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !122, line: 20, size: 640, elements: !128)
!128 = !{!129, !130, !131, !135, !136, !137, !138, !140, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !127, file: !122, line: 21, baseType: !42, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !127, file: !122, line: 22, baseType: !42, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !127, file: !122, line: 23, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !44, line: 87, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !46, line: 153, baseType: !134)
!134 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !127, file: !122, line: 24, baseType: !132, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !127, file: !122, line: 26, baseType: !42, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !127, file: !122, line: 27, baseType: !42, size: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !127, file: !122, line: 28, baseType: !139, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !122, line: 16, baseType: !32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !127, file: !122, line: 29, baseType: !141, size: 64, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !54, line: 23, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !144, line: 16, size: 1600, elements: !145)
!144 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!145 = !{!146, !150, !151, !190, !191, !192, !231, !232}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !143, file: !144, line: 17, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !148, line: 16, baseType: !149)
!148 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "7b9a751e8c1ad1afef5467d60ed94e69")
!149 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 18, baseType: !74, size: 128, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !143, file: !144, line: 19, baseType: !152, size: 1152, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !148, line: 17, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !154, line: 26, size: 1152, elements: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!155 = !{!156, !158, !160, !162, !164, !166, !168, !169, !170, !172, !174, !176, !184, !185, !186}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !153, file: !154, line: 31, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !46, line: 145, baseType: !31)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !153, file: !154, line: 36, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !46, line: 148, baseType: !31)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !153, file: !154, line: 44, baseType: !161, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !46, line: 151, baseType: !31)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !153, file: !154, line: 45, baseType: !163, size: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !46, line: 150, baseType: !13)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !153, file: !154, line: 47, baseType: !165, size: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !46, line: 146, baseType: !13)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !153, file: !154, line: 48, baseType: !167, size: 32, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !46, line: 147, baseType: !13)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !153, file: !154, line: 50, baseType: !149, size: 32, offset: 288)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !153, file: !154, line: 52, baseType: !157, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !153, file: !154, line: 57, baseType: !171, size: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !46, line: 152, baseType: !134)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !153, file: !154, line: 61, baseType: !173, size: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !46, line: 175, baseType: !134)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !153, file: !154, line: 63, baseType: !175, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !46, line: 180, baseType: !134)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !153, file: !154, line: 74, baseType: !177, size: 128, offset: 576)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !178, line: 11, size: 128, elements: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !177, file: !178, line: 16, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !46, line: 160, baseType: !134)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !177, file: !178, line: 21, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !46, line: 197, baseType: !134)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !153, file: !154, line: 75, baseType: !177, size: 128, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !153, file: !154, line: 76, baseType: !177, size: 128, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !153, file: !154, line: 89, baseType: !187, size: 192, offset: 960)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 192, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 3)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !143, file: !144, line: 21, baseType: !132, size: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !143, file: !144, line: 22, baseType: !132, size: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !143, file: !144, line: 24, baseType: !193, size: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !54, line: 20, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !196, line: 50, size: 640, elements: !197)
!196 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f35895306f847777914ce99ffeccfabd")
!197 = !{!198, !199, !211, !214, !217, !222, !223, !228, !229, !230}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !195, file: !196, line: 51, baseType: !27, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !195, file: !196, line: 52, baseType: !200, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !54, line: 21, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !71, line: 89, size: 320, elements: !203)
!203 = !{!204, !205, !206, !210}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !202, file: !71, line: 90, baseType: !147, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !71, line: 91, baseType: !74, size: 128, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !202, file: !71, line: 93, baseType: !207, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !200, !193}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !202, file: !71, line: 94, baseType: !32, size: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !195, file: !196, line: 54, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !213, line: 98, baseType: !31)
!213 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "eac8f0294f941da9268c3a72c9fca0e1")
!214 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !195, file: !196, line: 56, baseType: !215, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !216, line: 10, baseType: !181)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!217 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !195, file: !196, line: 58, baseType: !218, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !196, line: 45, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!42, !193, !42, !79}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !196, line: 59, baseType: !32, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !195, file: !196, line: 61, baseType: !224, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !196, line: 46, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !193, !27, !42, !79}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !195, file: !196, line: 62, baseType: !32, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !195, file: !196, line: 70, baseType: !61, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !196, line: 72, baseType: !193, size: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !143, file: !144, line: 37, baseType: !13, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !143, file: !144, line: 38, baseType: !13, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !127, file: !122, line: 30, baseType: !125, size: 64, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !127, file: !122, line: 34, baseType: !13, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !127, file: !122, line: 40, baseType: !13, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !127, file: !122, line: 43, baseType: !13, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !127, file: !122, line: 45, baseType: !13, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !127, file: !122, line: 46, baseType: !13, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !127, file: !122, line: 47, baseType: !13, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !127, file: !122, line: 48, baseType: !13, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !127, file: !122, line: 49, baseType: !13, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !127, file: !122, line: 50, baseType: !13, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !127, file: !122, line: 52, baseType: !13, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !127, file: !122, line: 53, baseType: !13, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !127, file: !122, line: 55, baseType: !149, size: 32, offset: 608)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !122, line: 61, baseType: !119, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !105, file: !106, line: 62, baseType: !248, size: 64, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !106, line: 41, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !106, line: 43, size: 128, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !106, line: 44, baseType: !248, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !250, file: !106, line: 45, baseType: !32, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !105, file: !106, line: 63, baseType: !255, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !106, line: 32, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !106, line: 34, size: 192, elements: !258)
!258 = !{!259, !264, !265}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !257, file: !106, line: 35, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !106, line: 30, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !32}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !257, file: !106, line: 36, baseType: !32, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !106, line: 37, baseType: !255, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !105, file: !106, line: 64, baseType: !193, size: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !89, file: !71, line: 120, baseType: !268, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !54, line: 17, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !271, line: 47, size: 5184, elements: !272)
!271 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "084646d0d3ecf791b89c14281fd46376")
!272 = !{!273, !276, !277, !278, !279, !280, !527, !528, !529, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !576, !577}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !270, file: !271, line: 48, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !270, file: !271, line: 49, baseType: !103, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !270, file: !271, line: 51, baseType: !193, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !270, file: !271, line: 52, baseType: !194, size: 640, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !270, file: !271, line: 54, baseType: !27, size: 64, offset: 832)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !270, file: !271, line: 56, baseType: !281, size: 64, offset: 896)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !54, line: 26, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !285, line: 124, size: 1920, elements: !286)
!285 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf513a87e959064e14502903e9282b0e")
!286 = !{!287, !288, !345, !346, !349, !357, !359, !364, !369, !448, !449, !450, !451, !452, !453, !454, !455, !456, !462, !503, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !284, file: !285, line: 125, baseType: !32, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !284, file: !285, line: 126, baseType: !289, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !54, line: 24, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !292, line: 30, size: 768, elements: !293)
!292 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c79f651cc4aca504d9d912404beb8bf3")
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !322, !323, !324, !337}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !291, file: !292, line: 31, baseType: !32, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !291, file: !292, line: 33, baseType: !13, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !291, file: !292, line: 35, baseType: !13, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !291, file: !292, line: 38, baseType: !13, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !291, file: !292, line: 44, baseType: !13, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !291, file: !292, line: 46, baseType: !13, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !291, file: !292, line: 49, baseType: !13, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !291, file: !292, line: 51, baseType: !13, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !291, file: !292, line: 54, baseType: !13, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !291, file: !292, line: 56, baseType: !13, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !291, file: !292, line: 57, baseType: !13, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !291, file: !292, line: 59, baseType: !13, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !291, file: !292, line: 60, baseType: !13, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !291, file: !292, line: 62, baseType: !13, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !291, file: !292, line: 64, baseType: !13, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !291, file: !292, line: 67, baseType: !13, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !291, file: !292, line: 69, baseType: !13, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !291, file: !292, line: 71, baseType: !13, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !291, file: !292, line: 74, baseType: !13, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !291, file: !292, line: 75, baseType: !13, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "skip_socket_leak_check", scope: !291, file: !292, line: 77, baseType: !13, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !291, file: !292, line: 80, baseType: !13, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !291, file: !292, line: 110, baseType: !13, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !291, file: !292, line: 113, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !54, line: 32, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !289}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !291, file: !292, line: 120, baseType: !27, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !291, file: !292, line: 122, baseType: !193, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !291, file: !292, line: 124, baseType: !325, size: 320, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !326, line: 20, baseType: !327)
!326 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ee5b3151c1c48b156833d321f8e1946a")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !326, line: 22, size: 320, elements: !328)
!328 = !{!329, !331, !333, !334, !335, !336}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !327, file: !326, line: 23, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !326, line: 16, baseType: !27)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !327, file: !326, line: 24, baseType: !332, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !327, file: !326, line: 25, baseType: !332, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !327, file: !326, line: 26, baseType: !332, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !327, file: !326, line: 27, baseType: !43, size: 8, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !327, file: !326, line: 28, baseType: !43, size: 8, offset: 264)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !291, file: !292, line: 127, baseType: !338, size: 128, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !339, line: 16, baseType: !340)
!339 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !339, line: 18, size: 128, elements: !341)
!341 = !{!342, !344}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !340, file: !339, line: 19, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !339, line: 20, baseType: !343, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !284, file: !285, line: 127, baseType: !289, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !284, file: !285, line: 129, baseType: !347, size: 32, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !348, line: 17, baseType: !149)
!348 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ad64fd7b9f2b4876e8c9dcdeeb2305ce")
!349 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !284, file: !285, line: 131, baseType: !350, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !351, line: 19, baseType: !352)
!351 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!355, !282, !42, !79}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !44, line: 108, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !46, line: 194, baseType: !134)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !284, file: !285, line: 132, baseType: !358, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !351, line: 22, baseType: !352)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !284, file: !285, line: 133, baseType: !360, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !351, line: 20, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!355, !282, !119, !132}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !284, file: !285, line: 134, baseType: !365, size: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !351, line: 23, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!119, !282, !119, !132}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !284, file: !285, line: 136, baseType: !370, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !285, line: 16, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !285, line: 18, size: 2432, elements: !373)
!373 = !{!374, !375, !388, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !406, !407, !408, !409, !410, !411, !414, !415, !416, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !372, file: !285, line: 19, baseType: !347, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !372, file: !285, line: 21, baseType: !376, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !378, line: 180, size: 128, elements: !379)
!378 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!379 = !{!380, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !377, file: !378, line: 182, baseType: !381, size: 16)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !382, line: 28, baseType: !383)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!383 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !377, file: !378, line: 183, baseType: !385, size: 112, offset: 16)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 14)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !372, file: !285, line: 22, baseType: !389, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !390, line: 274, baseType: !391)
!390 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !46, line: 210, baseType: !13)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !372, file: !285, line: 23, baseType: !79, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !372, file: !285, line: 24, baseType: !74, size: 128, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !372, file: !285, line: 26, baseType: !149, size: 32, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !372, file: !285, line: 28, baseType: !149, size: 32, offset: 416)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !372, file: !285, line: 29, baseType: !149, size: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !372, file: !285, line: 30, baseType: !149, size: 32, offset: 480)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !372, file: !285, line: 32, baseType: !149, size: 32, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !372, file: !285, line: 33, baseType: !149, size: 32, offset: 544)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !372, file: !285, line: 34, baseType: !149, size: 32, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !372, file: !285, line: 38, baseType: !402, size: 64, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !54, line: 33, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !282}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !372, file: !285, line: 40, baseType: !32, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !372, file: !285, line: 42, baseType: !194, size: 640, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !372, file: !285, line: 43, baseType: !193, size: 64, offset: 1408)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !372, file: !285, line: 45, baseType: !79, size: 64, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !372, file: !285, line: 47, baseType: !79, size: 64, offset: 1536)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !372, file: !285, line: 49, baseType: !412, size: 64, offset: 1600)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !413, line: 16, baseType: !330)
!413 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!414 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !372, file: !285, line: 51, baseType: !370, size: 64, offset: 1664)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !372, file: !285, line: 52, baseType: !282, size: 64, offset: 1728)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !372, file: !285, line: 54, baseType: !417, size: 192, offset: 1792)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !326, line: 32, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !326, line: 37, size: 192, elements: !419)
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !418, file: !326, line: 38, baseType: !332, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !418, file: !326, line: 39, baseType: !332, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !418, file: !326, line: 40, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !326, line: 34, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !332, !332, !332}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !372, file: !285, line: 55, baseType: !325, size: 320, offset: 1984)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !372, file: !285, line: 57, baseType: !27, size: 64, offset: 2304)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !372, file: !285, line: 59, baseType: !13, size: 1, offset: 2368, flags: DIFlagBitField, extraData: i64 2368)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !372, file: !285, line: 60, baseType: !13, size: 1, offset: 2369, flags: DIFlagBitField, extraData: i64 2368)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !372, file: !285, line: 61, baseType: !13, size: 1, offset: 2370, flags: DIFlagBitField, extraData: i64 2368)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !372, file: !285, line: 63, baseType: !13, size: 1, offset: 2371, flags: DIFlagBitField, extraData: i64 2368)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !372, file: !285, line: 64, baseType: !13, size: 1, offset: 2372, flags: DIFlagBitField, extraData: i64 2368)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !372, file: !285, line: 65, baseType: !13, size: 1, offset: 2373, flags: DIFlagBitField, extraData: i64 2368)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !372, file: !285, line: 66, baseType: !13, size: 1, offset: 2374, flags: DIFlagBitField, extraData: i64 2368)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !372, file: !285, line: 67, baseType: !13, size: 1, offset: 2375, flags: DIFlagBitField, extraData: i64 2368)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !372, file: !285, line: 68, baseType: !13, size: 1, offset: 2376, flags: DIFlagBitField, extraData: i64 2368)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !372, file: !285, line: 69, baseType: !13, size: 1, offset: 2377, flags: DIFlagBitField, extraData: i64 2368)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !372, file: !285, line: 70, baseType: !13, size: 1, offset: 2378, flags: DIFlagBitField, extraData: i64 2368)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !372, file: !285, line: 73, baseType: !13, size: 1, offset: 2379, flags: DIFlagBitField, extraData: i64 2368)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !372, file: !285, line: 75, baseType: !13, size: 1, offset: 2380, flags: DIFlagBitField, extraData: i64 2368)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !372, file: !285, line: 76, baseType: !13, size: 1, offset: 2381, flags: DIFlagBitField, extraData: i64 2368)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !372, file: !285, line: 77, baseType: !13, size: 2, offset: 2382, flags: DIFlagBitField, extraData: i64 2368)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !372, file: !285, line: 79, baseType: !13, size: 1, offset: 2384, flags: DIFlagBitField, extraData: i64 2368)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !372, file: !285, line: 80, baseType: !13, size: 1, offset: 2385, flags: DIFlagBitField, extraData: i64 2368)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !372, file: !285, line: 81, baseType: !13, size: 1, offset: 2386, flags: DIFlagBitField, extraData: i64 2368)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !372, file: !285, line: 90, baseType: !149, size: 32, offset: 2400)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !284, file: !285, line: 138, baseType: !132, size: 64, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !284, file: !285, line: 140, baseType: !193, size: 64, offset: 640)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !284, file: !285, line: 142, baseType: !103, size: 64, offset: 704)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !284, file: !285, line: 144, baseType: !149, size: 32, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !284, file: !285, line: 146, baseType: !376, size: 64, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !284, file: !285, line: 147, baseType: !389, size: 32, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !284, file: !285, line: 148, baseType: !74, size: 128, offset: 960)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !284, file: !285, line: 150, baseType: !74, size: 128, offset: 1088)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !284, file: !285, line: 151, baseType: !457, size: 16, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !458, line: 123, baseType: !459)
!458 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !460, line: 25, baseType: !461)
!460 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !46, line: 40, baseType: !383)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !284, file: !285, line: 154, baseType: !463, size: 64, offset: 1280)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !54, line: 29, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !466, line: 74, size: 704, elements: !467)
!466 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "51639b814b1b55c5b35047c033281672")
!467 = !{!468, !473, !477, !481, !482, !483, !484, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !465, file: !466, line: 75, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !471, line: 184, baseType: !472)
!471 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !471, line: 184, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !465, file: !466, line: 76, baseType: !474, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !471, line: 185, baseType: !476)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !471, line: 185, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !465, file: !466, line: 78, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !28, line: 78, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !390, line: 267, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !46, line: 207, baseType: !134)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !465, file: !466, line: 79, baseType: !125, size: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !465, file: !466, line: 80, baseType: !79, size: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !465, file: !466, line: 82, baseType: !402, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !465, file: !466, line: 84, baseType: !485, size: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !487, line: 231, baseType: !488)
!487 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "848d42aedd0da44ffda19088217823c7")
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !487, line: 231, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !465, file: !466, line: 85, baseType: !402, size: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !465, file: !466, line: 87, baseType: !318, size: 64, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !465, file: !466, line: 88, baseType: !318, size: 64, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !465, file: !466, line: 90, baseType: !43, size: 8, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !465, file: !466, line: 92, baseType: !13, size: 1, offset: 648, flags: DIFlagBitField, extraData: i64 648)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !465, file: !466, line: 93, baseType: !13, size: 1, offset: 649, flags: DIFlagBitField, extraData: i64 648)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !465, file: !466, line: 94, baseType: !13, size: 1, offset: 650, flags: DIFlagBitField, extraData: i64 648)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !465, file: !466, line: 95, baseType: !13, size: 1, offset: 651, flags: DIFlagBitField, extraData: i64 648)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !465, file: !466, line: 96, baseType: !13, size: 1, offset: 652, flags: DIFlagBitField, extraData: i64 648)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !465, file: !466, line: 97, baseType: !13, size: 1, offset: 653, flags: DIFlagBitField, extraData: i64 648)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !465, file: !466, line: 98, baseType: !13, size: 1, offset: 654, flags: DIFlagBitField, extraData: i64 648)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !465, file: !466, line: 99, baseType: !13, size: 1, offset: 655, flags: DIFlagBitField, extraData: i64 648)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !465, file: !466, line: 100, baseType: !13, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 648)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !465, file: !466, line: 101, baseType: !13, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 648)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !284, file: !285, line: 157, baseType: !504, size: 64, offset: 1344)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !54, line: 30, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !54, line: 30, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !284, file: !285, line: 159, baseType: !376, size: 64, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !284, file: !285, line: 160, baseType: !389, size: 32, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !284, file: !285, line: 162, baseType: !125, size: 64, offset: 1536)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !284, file: !285, line: 164, baseType: !338, size: 128, offset: 1600)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !284, file: !285, line: 166, baseType: !212, size: 64, offset: 1728)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !284, file: !285, line: 168, baseType: !27, size: 64, offset: 1792)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !284, file: !285, line: 170, baseType: !13, size: 8, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !284, file: !285, line: 172, baseType: !13, size: 3, offset: 1864, flags: DIFlagBitField, extraData: i64 1856)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !284, file: !285, line: 174, baseType: !13, size: 1, offset: 1867, flags: DIFlagBitField, extraData: i64 1856)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !284, file: !285, line: 175, baseType: !13, size: 1, offset: 1868, flags: DIFlagBitField, extraData: i64 1856)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !284, file: !285, line: 176, baseType: !13, size: 1, offset: 1869, flags: DIFlagBitField, extraData: i64 1856)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !284, file: !285, line: 178, baseType: !13, size: 1, offset: 1870, flags: DIFlagBitField, extraData: i64 1856)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !284, file: !285, line: 179, baseType: !13, size: 1, offset: 1871, flags: DIFlagBitField, extraData: i64 1856)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !284, file: !285, line: 180, baseType: !13, size: 1, offset: 1872, flags: DIFlagBitField, extraData: i64 1856)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !284, file: !285, line: 181, baseType: !13, size: 1, offset: 1873, flags: DIFlagBitField, extraData: i64 1856)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !284, file: !285, line: 183, baseType: !13, size: 1, offset: 1874, flags: DIFlagBitField, extraData: i64 1856)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !284, file: !285, line: 184, baseType: !13, size: 1, offset: 1875, flags: DIFlagBitField, extraData: i64 1856)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !284, file: !285, line: 185, baseType: !13, size: 2, offset: 1876, flags: DIFlagBitField, extraData: i64 1856)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !284, file: !285, line: 186, baseType: !13, size: 2, offset: 1878, flags: DIFlagBitField, extraData: i64 1856)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !284, file: !285, line: 188, baseType: !13, size: 1, offset: 1880, flags: DIFlagBitField, extraData: i64 1856)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !270, file: !271, line: 57, baseType: !282, size: 64, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !270, file: !271, line: 58, baseType: !27, size: 64, offset: 1024)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !270, file: !271, line: 60, baseType: !530, size: 64, offset: 1088)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !270, file: !271, line: 61, baseType: !27, size: 64, offset: 1152)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !270, file: !271, line: 62, baseType: !27, size: 64, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !270, file: !271, line: 64, baseType: !338, size: 128, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !270, file: !271, line: 65, baseType: !27, size: 64, offset: 1408)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !270, file: !271, line: 67, baseType: !94, size: 320, offset: 1472)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !270, file: !271, line: 68, baseType: !94, size: 320, offset: 1792)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !270, file: !271, line: 70, baseType: !94, size: 320, offset: 2112)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !270, file: !271, line: 71, baseType: !417, size: 192, offset: 2432)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !270, file: !271, line: 72, baseType: !325, size: 320, offset: 2624)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !270, file: !271, line: 74, baseType: !542, size: 448, offset: 2944)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !543, line: 31, baseType: !544)
!543 = !DIFile(filename: "src/core/ngx_list.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "580525d954b127a1c35170a83ca4d8b1")
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !543, line: 25, size: 448, elements: !545)
!545 = !{!546, !554, !555, !556, !557}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !544, file: !543, line: 26, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !543, line: 16, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !543, line: 18, size: 192, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !549, file: !543, line: 19, baseType: !32, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !549, file: !543, line: 20, baseType: !27, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !549, file: !543, line: 21, baseType: !547, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !544, file: !543, line: 27, baseType: !548, size: 192, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !543, line: 28, baseType: !79, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !544, file: !543, line: 29, baseType: !27, size: 64, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !544, file: !543, line: 30, baseType: !103, size: 64, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !270, file: !271, line: 75, baseType: !542, size: 448, offset: 3392)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !270, file: !271, line: 77, baseType: !27, size: 64, offset: 3840)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !270, file: !271, line: 78, baseType: !27, size: 64, offset: 3904)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !270, file: !271, line: 80, baseType: !282, size: 64, offset: 3968)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !270, file: !271, line: 81, baseType: !289, size: 64, offset: 4032)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !270, file: !271, line: 82, baseType: !289, size: 64, offset: 4096)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !270, file: !271, line: 84, baseType: !268, size: 64, offset: 4160)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !270, file: !271, line: 86, baseType: !74, size: 128, offset: 4224)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !270, file: !271, line: 87, baseType: !74, size: 128, offset: 4352)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !270, file: !271, line: 88, baseType: !74, size: 128, offset: 4480)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !270, file: !271, line: 89, baseType: !74, size: 128, offset: 4608)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !270, file: !271, line: 90, baseType: !74, size: 128, offset: 4736)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !270, file: !271, line: 91, baseType: !74, size: 128, offset: 4864)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_handler", scope: !270, file: !271, line: 93, baseType: !572, size: 64, offset: 4992)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_intercept_pt", file: !271, line: 34, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!478, !193, !27, !42, !79}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_data", scope: !270, file: !271, line: 94, baseType: !32, size: 64, offset: 5056)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "entered_logger", scope: !270, file: !271, line: 95, baseType: !13, size: 32, offset: 5120)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !89, file: !71, line: 121, baseType: !103, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !89, file: !71, line: 122, baseType: !103, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !89, file: !71, line: 123, baseType: !581, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !71, line: 103, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 98, size: 1792, elements: !584)
!584 = !{!585, !586, !587, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !583, file: !71, line: 99, baseType: !142, size: 1600)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !583, file: !71, line: 100, baseType: !125, size: 64, offset: 1600)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !583, file: !71, line: 101, baseType: !125, size: 64, offset: 1664)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !583, file: !71, line: 102, baseType: !27, size: 64, offset: 1728)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !89, file: !71, line: 124, baseType: !193, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !89, file: !71, line: 126, baseType: !32, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !89, file: !71, line: 127, baseType: !27, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !89, file: !71, line: 128, baseType: !27, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !89, file: !71, line: 130, baseType: !594, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !71, line: 112, baseType: !84)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !89, file: !71, line: 131, baseType: !32, size: 64, offset: 704)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !70, file: !71, line: 81, baseType: !27, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !70, file: !71, line: 82, baseType: !27, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !70, file: !71, line: 83, baseType: !32, size: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !56, line: 236, baseType: !27, size: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !55, file: !56, line: 238, baseType: !601, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!478, !193}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !55, file: !56, line: 240, baseType: !605, size: 64, offset: 704)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!478, !268}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !55, file: !56, line: 242, baseType: !605, size: 64, offset: 768)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !55, file: !56, line: 243, baseType: !605, size: 64, offset: 832)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !55, file: !56, line: 244, baseType: !611, size: 64, offset: 896)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !268}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !55, file: !56, line: 245, baseType: !611, size: 64, offset: 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !55, file: !56, line: 247, baseType: !611, size: 64, offset: 1024)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !55, file: !56, line: 249, baseType: !29, size: 64, offset: 1088)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !55, file: !56, line: 250, baseType: !29, size: 64, offset: 1152)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !55, file: !56, line: 251, baseType: !29, size: 64, offset: 1216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !55, file: !56, line: 252, baseType: !29, size: 64, offset: 1280)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !55, file: !56, line: 253, baseType: !29, size: 64, offset: 1344)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !55, file: !56, line: 254, baseType: !29, size: 64, offset: 1408)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !55, file: !56, line: 255, baseType: !29, size: 64, offset: 1472)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !55, file: !56, line: 256, baseType: !29, size: 64, offset: 1536)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 36, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 7)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !631, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 20)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "ngx_http_mirror_commands", scope: !9, file: !2, line: 34, type: !636, isLocal: true, isDefinition: true)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 1344, elements: !188)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 217, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 4)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !2, line: 219, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 13)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !35, line: 36, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 24, size: 512, elements: !649)
!649 = !{!650, !654, !655, !659, !663, !664, !668, !669}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !648, file: !35, line: 25, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!478, !87}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !648, file: !35, line: 26, baseType: !651, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !648, file: !35, line: 28, baseType: !656, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!32, !87}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !648, file: !35, line: 29, baseType: !660, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!61, !87, !32}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !648, file: !35, line: 31, baseType: !656, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !648, file: !35, line: 32, baseType: !665, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!61, !87, !32, !32}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !648, file: !35, line: 34, baseType: !656, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !648, file: !35, line: 35, baseType: !665, size: 64, offset: 448)
!670 = !{i32 7, !"Dwarf Version", i32 5}
!671 = !{i32 2, !"Debug Info Version", i32 3}
!672 = !{i32 1, !"wchar_size", i32 4}
!673 = !{i32 8, !"PIC Level", i32 2}
!674 = !{i32 7, !"PIE Level", i32 2}
!675 = !{i32 7, !"uwtable", i32 2}
!676 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!677 = distinct !DISubprogram(name: "ngx_http_mirror_init", scope: !2, file: !2, line: 249, type: !652, scopeLine: 250, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !678)
!678 = !{!679, !680, !1960}
!679 = !DILocalVariable(name: "cf", arg: 1, scope: !677, file: !2, line: 249, type: !87)
!680 = !DILocalVariable(name: "h", scope: !677, file: !2, line: 251, type: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_handler_pt", file: !683, line: 367, baseType: !684)
!683 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1757f93ddb5cd3c545713a957f23192d")
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!478, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !689, line: 16, baseType: !690)
!689 = !DIFile(filename: "src/http/ngx_http.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "936639e5730ac898b9486f4f53b5f2f5")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !683, line: 371, size: 11456, elements: !691)
!691 = !{!692, !695, !696, !697, !698, !699, !700, !705, !706, !922, !1514, !1515, !1516, !1517, !1559, !1591, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1637, !1648, !1655, !1656, !1657, !1658, !1671, !1672, !1673, !1674, !1675, !1676, !1853, !1857, !1862, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !690, file: !683, line: 372, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !460, line: 26, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !46, line: 42, baseType: !13)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !690, file: !683, line: 374, baseType: !282, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !690, file: !683, line: 376, baseType: !39, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !690, file: !683, line: 377, baseType: !39, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !690, file: !683, line: 378, baseType: !39, size: 64, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !690, file: !683, line: 379, baseType: !39, size: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !690, file: !683, line: 381, baseType: !701, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !683, line: 368, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !687}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !690, file: !683, line: 382, baseType: !701, size: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !690, file: !683, line: 385, baseType: !707, size: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !689, line: 18, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !710, line: 65, size: 4800, elements: !711)
!710 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "04ea2ebc84c597718a4782ab3cabf19d")
!711 = !{!712, !713, !714, !715, !719, !720, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !880, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !709, file: !710, line: 66, baseType: !142, size: 1600)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !709, file: !710, line: 67, baseType: !94, size: 320, offset: 1600)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !709, file: !710, line: 68, baseType: !693, size: 32, offset: 1920)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !709, file: !710, line: 69, baseType: !716, size: 128, offset: 1952)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 128, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 16)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !709, file: !710, line: 70, baseType: !716, size: 128, offset: 2080)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !709, file: !710, line: 72, baseType: !721, size: 64, offset: 2240)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !148, line: 18, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !44, line: 49, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !46, line: 149, baseType: !31)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !709, file: !710, line: 73, baseType: !215, size: 64, offset: 2304)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !709, file: !710, line: 74, baseType: !215, size: 64, offset: 2368)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !709, file: !710, line: 75, baseType: !215, size: 64, offset: 2432)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !709, file: !710, line: 76, baseType: !215, size: 64, offset: 2496)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !709, file: !710, line: 77, baseType: !215, size: 64, offset: 2560)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !709, file: !710, line: 79, baseType: !74, size: 128, offset: 2624)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !709, file: !710, line: 80, baseType: !74, size: 128, offset: 2752)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !709, file: !710, line: 81, baseType: !716, size: 128, offset: 2880)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !709, file: !710, line: 83, baseType: !79, size: 64, offset: 3008)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !709, file: !710, line: 84, baseType: !79, size: 64, offset: 3072)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !709, file: !710, line: 85, baseType: !132, size: 64, offset: 3136)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !709, file: !710, line: 86, baseType: !132, size: 64, offset: 3200)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !709, file: !710, line: 88, baseType: !27, size: 64, offset: 3264)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !709, file: !710, line: 89, baseType: !27, size: 64, offset: 3328)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !709, file: !710, line: 90, baseType: !27, size: 64, offset: 3392)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !709, file: !710, line: 91, baseType: !27, size: 64, offset: 3456)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !709, file: !710, line: 93, baseType: !125, size: 64, offset: 3520)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !709, file: !710, line: 95, baseType: !742, size: 64, offset: 3584)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !689, line: 19, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !710, line: 157, size: 1088, elements: !745)
!745 = !{!746, !761, !822, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !879}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !744, file: !710, line: 158, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !710, line: 154, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !710, line: 145, size: 960, elements: !750)
!750 = !{!751, !752, !753, !754, !757, !758, !759, !760}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !749, file: !710, line: 146, baseType: !417, size: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !749, file: !710, line: 147, baseType: !325, size: 320, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !749, file: !710, line: 148, baseType: !338, size: 128, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !749, file: !710, line: 149, baseType: !755, size: 64, offset: 640)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !213, line: 106, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !212)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !749, file: !710, line: 150, baseType: !755, size: 64, offset: 704)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !749, file: !710, line: 151, baseType: !132, size: 64, offset: 768)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !749, file: !710, line: 152, baseType: !27, size: 64, offset: 832)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !749, file: !710, line: 153, baseType: !27, size: 64, offset: 896)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !744, file: !710, line: 159, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !764, line: 59, baseType: !765)
!764 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6137611cd598fa2ecc498e6967a03177")
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !764, line: 34, size: 1600, elements: !766)
!766 = !{!767, !774, !775, !776, !784, !785, !786, !795, !796, !797, !798, !817, !818, !819, !820, !821}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !765, file: !764, line: 35, baseType: !768, size: 128)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !769, line: 21, baseType: !770)
!769 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "56a332e5761f46e2bb83cbdaf8b18a9f")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 16, size: 128, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !770, file: !769, line: 17, baseType: !755, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !770, file: !769, line: 19, baseType: !755, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !765, file: !764, line: 37, baseType: !79, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !765, file: !764, line: 38, baseType: !79, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !765, file: !764, line: 40, baseType: !777, size: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !764, line: 16, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !764, line: 18, size: 192, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !779, file: !764, line: 19, baseType: !29, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !779, file: !764, line: 20, baseType: !777, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !779, file: !764, line: 21, baseType: !29, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !765, file: !764, line: 41, baseType: !777, size: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !765, file: !764, line: 42, baseType: !778, size: 192, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !765, file: !764, line: 44, baseType: !787, size: 64, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !764, line: 31, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !764, line: 25, size: 256, elements: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !789, file: !764, line: 26, baseType: !27, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !789, file: !764, line: 27, baseType: !27, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !789, file: !764, line: 29, baseType: !27, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !789, file: !764, line: 30, baseType: !27, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !765, file: !764, line: 45, baseType: !27, size: 64, offset: 640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !765, file: !764, line: 47, baseType: !42, size: 64, offset: 704)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !765, file: !764, line: 48, baseType: !42, size: 64, offset: 768)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !765, file: !764, line: 50, baseType: !799, size: 512, offset: 832)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !769, line: 37, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 24, size: 512, elements: !801)
!801 = !{!802, !804, !805, !806, !816}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !800, file: !769, line: 26, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !800, file: !769, line: 28, baseType: !803, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !800, file: !769, line: 29, baseType: !27, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !800, file: !769, line: 30, baseType: !807, size: 256, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !808, line: 39, baseType: !809)
!808 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!809 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !808, line: 35, size: 256, elements: !810)
!810 = !{!811, !815}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !809, file: !808, line: 37, baseType: !812, size: 256)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !809, file: !808, line: 38, baseType: !134, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !800, file: !769, line: 36, baseType: !27, size: 64, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !765, file: !764, line: 52, baseType: !42, size: 64, offset: 1344)
