; ModuleID = 'samples/389.bc'
source_filename = "src/extended/shredder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtShredder = type { ptr, i64, i64, i64, i64, i64, double }

@.str = private unnamed_addr constant [24 x i8] c"src/extended/shredder.c\00", align 1, !dbg !0
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [46 x i8] c"bioseq && minlength && minlength <= maxlength\00", align 1, !dbg !12
@__func__.gt_shredder_new = private unnamed_addr constant [16 x i8] c"gt_shredder_new\00", align 1, !dbg !17
@.str.3 = private unnamed_addr constant [9 x i8] c"shredder\00", align 1, !dbg !23
@__func__.gt_shredder_set_overlap = private unnamed_addr constant [24 x i8] c"gt_shredder_set_overlap\00", align 1, !dbg !28
@__func__.gt_shredder_set_sample_probability = private unnamed_addr constant [35 x i8] c"gt_shredder_set_sample_probability\00", align 1, !dbg !31

!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 24)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 36, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2376, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 297)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 36, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 46)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 36, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !21)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!21 = !{!22}
!22 = !DISubrange(count: 16)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 9)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 192, elements: !5)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 280, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 35)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 41)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !43, isLocal: true, isDefinition: true)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 28)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !48, isLocal: true, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 144, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 18)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !48, isLocal: true, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 31)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 34)
!63 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !64, splitDebugInlining: false, nameTableKind: None)
!64 = !{!0, !7, !12, !17, !23, !28, !31, !36, !41, !46, !51, !53, !58}
!65 = !{i32 7, !"Dwarf Version", i32 5}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{i32 1, !"wchar_size", i32 4}
!68 = !{i32 8, !"PIC Level", i32 2}
!69 = !{i32 7, !"uwtable", i32 2}
!70 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!71 = distinct !DISubprogram(name: "gt_shredder_new", scope: !2, file: !2, line: 32, type: !72, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !63, retainedNodes: !94)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !80, !85, !85}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtShredder", file: !76, line: 23, baseType: !77)
!76 = !DIFile(filename: "src/extended/shredder.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "f33feb9741a0141cbe83ebc0130d50e9")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtShredder", file: !2, line: 22, size: 448, elements: !78)
!78 = !{!79, !84, !88, !89, !90, !91, !92}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "bioseq", scope: !77, file: !2, line: 23, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBioseq", file: !82, line: 29, baseType: !83)
!82 = !DIFile(filename: "src/core/bioseq_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "9b30cca4d5e7006f9055b785cc9b7afe")
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtBioseq", file: !82, line: 29, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "minlength", scope: !77, file: !2, line: 24, baseType: !85, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !86, line: 83, baseType: !87)
!86 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!87 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "maxlength", scope: !77, file: !2, line: 25, baseType: !85, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !77, file: !2, line: 26, baseType: !85, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !77, file: !2, line: 27, baseType: !85, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !77, file: !2, line: 28, baseType: !85, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sample_probability", scope: !77, file: !2, line: 29, baseType: !93, size: 64, offset: 384)
!93 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!94 = !{!95, !96, !97, !98}
!95 = !DILocalVariable(name: "bioseq", arg: 1, scope: !71, file: !2, line: 32, type: !80)
!96 = !DILocalVariable(name: "minlength", arg: 2, scope: !71, file: !2, line: 32, type: !85)
!97 = !DILocalVariable(name: "maxlength", arg: 3, scope: !71, file: !2, line: 33, type: !85)
!98 = !DILocalVariable(name: "shredder", scope: !71, file: !2, line: 35, type: !74)
!99 = !{!100, !100, i64 0}
!100 = !{!"any pointer", !101, i64 0}
!101 = !{!"omnipotent char", !102, i64 0}
!102 = !{!"Simple C/C++ TBAA"}
!103 = !DILocation(line: 32, column: 39, scope: !71)
!104 = !{!105, !105, i64 0}
!105 = !{!"long", !101, i64 0}
!106 = !DILocation(line: 32, column: 55, scope: !71)
!107 = !DILocation(line: 33, column: 48, scope: !71)
!108 = !DILocation(line: 35, column: 3, scope: !71)
!109 = !DILocation(line: 35, column: 15, scope: !71)
!110 = !DILocation(line: 35, column: 26, scope: !71)
!111 = !DILocation(line: 36, column: 3, scope: !71)
!112 = !DILocation(line: 36, column: 3, scope: !113)
!113 = distinct !DILexicalBlock(scope: !114, file: !2, line: 36, column: 3)
!114 = distinct !DILexicalBlock(scope: !71, file: !2, line: 36, column: 3)
!115 = !DILocation(line: 36, column: 3, scope: !114)
!116 = !DILocation(line: 36, column: 3, scope: !117)
!117 = distinct !DILexicalBlock(scope: !113, file: !2, line: 36, column: 3)
!118 = !DILocation(line: 37, column: 22, scope: !71)
!119 = !DILocation(line: 37, column: 3, scope: !71)
!120 = !DILocation(line: 37, column: 13, scope: !71)
!121 = !DILocation(line: 37, column: 20, scope: !71)
!122 = !{!123, !100, i64 0}
!123 = !{!"GtShredder", !100, i64 0, !105, i64 8, !105, i64 16, !105, i64 24, !105, i64 32, !105, i64 40, !124, i64 48}
!124 = !{!"double", !101, i64 0}
!125 = !DILocation(line: 38, column: 25, scope: !71)
!126 = !DILocation(line: 38, column: 3, scope: !71)
!127 = !DILocation(line: 38, column: 13, scope: !71)
!128 = !DILocation(line: 38, column: 23, scope: !71)
!129 = !{!123, !105, i64 8}
!130 = !DILocation(line: 39, column: 25, scope: !71)
!131 = !DILocation(line: 39, column: 3, scope: !71)
!132 = !DILocation(line: 39, column: 13, scope: !71)
!133 = !DILocation(line: 39, column: 23, scope: !71)
!134 = !{!123, !105, i64 16}
!135 = !DILocation(line: 40, column: 3, scope: !71)
!136 = !DILocation(line: 40, column: 13, scope: !71)
!137 = !DILocation(line: 40, column: 32, scope: !71)
!138 = !{!123, !124, i64 48}
!139 = !DILocation(line: 41, column: 10, scope: !71)
!140 = !DILocation(line: 42, column: 1, scope: !71)
!141 = !DILocation(line: 41, column: 3, scope: !71)
!142 = !DISubprogram(name: "gt_calloc_mem", scope: !143, file: !143, line: 62, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!143 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !147, !147, !149, !150}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !148, line: 70, baseType: !87)
!148 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!150 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!151 = !DISubprogram(name: "fprintf", scope: !152, file: !152, line: 350, type: !153, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!152 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!153 = !DISubroutineType(types: !154)
!154 = !{!150, !155, !213, null}
!155 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !158, line: 7, baseType: !159)
!158 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !160, line: 49, size: 1728, elements: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!161 = !{!162, !163, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !178, !180, !181, !182, !186, !188, !190, !194, !197, !199, !202, !205, !206, !207, !208, !209}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !159, file: !160, line: 51, baseType: !150, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !159, file: !160, line: 54, baseType: !164, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !159, file: !160, line: 55, baseType: !164, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !159, file: !160, line: 56, baseType: !164, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !159, file: !160, line: 57, baseType: !164, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !159, file: !160, line: 58, baseType: !164, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !159, file: !160, line: 59, baseType: !164, size: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !159, file: !160, line: 60, baseType: !164, size: 64, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !159, file: !160, line: 61, baseType: !164, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !159, file: !160, line: 64, baseType: !164, size: 64, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !159, file: !160, line: 65, baseType: !164, size: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !159, file: !160, line: 66, baseType: !164, size: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !159, file: !160, line: 68, baseType: !176, size: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !160, line: 36, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !159, file: !160, line: 70, baseType: !179, size: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !159, file: !160, line: 72, baseType: !150, size: 32, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !159, file: !160, line: 73, baseType: !150, size: 32, offset: 928)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !159, file: !160, line: 74, baseType: !183, size: 64, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !184, line: 152, baseType: !185)
!184 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!185 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !159, file: !160, line: 77, baseType: !187, size: 16, offset: 1024)
!187 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !159, file: !160, line: 78, baseType: !189, size: 8, offset: 1040)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !159, file: !160, line: 79, baseType: !191, size: 8, offset: 1048)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 1)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !159, file: !160, line: 81, baseType: !195, size: 64, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !160, line: 43, baseType: null)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !159, file: !160, line: 89, baseType: !198, size: 64, offset: 1152)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !184, line: 153, baseType: !185)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !159, file: !160, line: 91, baseType: !200, size: 64, offset: 1216)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !160, line: 37, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !159, file: !160, line: 92, baseType: !203, size: 64, offset: 1280)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !160, line: 38, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !159, file: !160, line: 93, baseType: !179, size: 64, offset: 1344)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !159, file: !160, line: 94, baseType: !146, size: 64, offset: 1408)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !159, file: !160, line: 95, baseType: !147, size: 64, offset: 1472)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !159, file: !160, line: 96, baseType: !150, size: 32, offset: 1536)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !159, file: !160, line: 98, baseType: !210, size: 160, offset: 1568)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 20)
!213 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !149)
!214 = !DISubprogram(name: "abort", scope: !215, file: !215, line: 598, type: !216, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!215 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!216 = !DISubroutineType(types: !217)
!217 = !{null}
!218 = distinct !DISubprogram(name: "gt_shredder_delete", scope: !2, file: !2, line: 44, type: !219, scopeLine: 45, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !63, retainedNodes: !221)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !74}
!221 = !{!222}
!222 = !DILocalVariable(name: "shredder", arg: 1, scope: !218, file: !2, line: 44, type: !74)
!223 = !DILocation(line: 44, column: 37, scope: !218)
!224 = !DILocation(line: 46, column: 8, scope: !225)
!225 = distinct !DILexicalBlock(scope: !218, file: !2, line: 46, column: 7)
!226 = !DILocation(line: 46, column: 7, scope: !218)
!227 = !DILocation(line: 46, column: 18, scope: !225)
!228 = !DILocation(line: 47, column: 3, scope: !218)
!229 = !DILocation(line: 48, column: 1, scope: !218)
!230 = !DISubprogram(name: "gt_free_mem", scope: !143, file: !143, line: 75, type: !231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !146, !149, !150}
!233 = distinct !DISubprogram(name: "gt_shredder_set_overlap", scope: !2, file: !2, line: 50, type: !234, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !63, retainedNodes: !236)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !74, !85}
!236 = !{!237, !238}
!237 = !DILocalVariable(name: "shredder", arg: 1, scope: !233, file: !2, line: 50, type: !74)
!238 = !DILocalVariable(name: "overlap", arg: 2, scope: !233, file: !2, line: 50, type: !85)
!239 = !DILocation(line: 50, column: 42, scope: !233)
!240 = !DILocation(line: 50, column: 60, scope: !233)
!241 = !DILocation(line: 52, column: 3, scope: !233)
!242 = !DILocation(line: 52, column: 3, scope: !243)
!243 = distinct !DILexicalBlock(scope: !244, file: !2, line: 52, column: 3)
!244 = distinct !DILexicalBlock(scope: !233, file: !2, line: 52, column: 3)
!245 = !DILocation(line: 52, column: 3, scope: !244)
!246 = !DILocation(line: 52, column: 3, scope: !247)
!247 = distinct !DILexicalBlock(scope: !243, file: !2, line: 52, column: 3)
!248 = !DILocation(line: 53, column: 23, scope: !233)
!249 = !DILocation(line: 53, column: 3, scope: !233)
!250 = !DILocation(line: 53, column: 13, scope: !233)
!251 = !DILocation(line: 53, column: 21, scope: !233)
!252 = !{!123, !105, i64 24}
!253 = !DILocation(line: 54, column: 1, scope: !233)
!254 = distinct !DISubprogram(name: "gt_shredder_set_sample_probability", scope: !2, file: !2, line: 56, type: !255, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !63, retainedNodes: !257)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !74, !93}
!257 = !{!258, !259}
!258 = !DILocalVariable(name: "shredder", arg: 1, scope: !254, file: !2, line: 56, type: !74)
!259 = !DILocalVariable(name: "probability", arg: 2, scope: !254, file: !2, line: 57, type: !93)
!260 = !DILocation(line: 56, column: 53, scope: !254)
!261 = !{!124, !124, i64 0}
!262 = !DILocation(line: 57, column: 48, scope: !254)
!263 = !DILocation(line: 59, column: 3, scope: !254)
!264 = !DILocation(line: 59, column: 3, scope: !265)
!265 = distinct !DILexicalBlock(scope: !266, file: !2, line: 59, column: 3)
!266 = distinct !DILexicalBlock(scope: !254, file: !2, line: 59, column: 3)
