; ModuleID = 'samples/391.bc'
source_filename = "./src/generator_gemm_noarch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.libxsmm_gemm_descriptor = type <{ i32, i32, i32, i32, i32, i32, i32, i8, i8, i64, i64, i8, i32, i32, i32, i8, i8, i8 }>

@.str = private unnamed_addr constant [25 x i8] c"  unsigned int l_m = 0;\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [25 x i8] c"  unsigned int l_n = 0;\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [26 x i8] c"  unsigned int l_k = 0;\0A\0A\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [38 x i8] c"  for ( l_n = 0; l_n < %u; l_n++ ) {\0A\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [66 x i8] c"    for ( l_m = 0; l_m < %u; l_m++ ) { C[(l_n*%u)+l_m] = 0.0; }\0A\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [67 x i8] c"    for ( l_m = 0; l_m < %u; l_m++ ) { C[(l_n*%u)+l_m] = 0.0f; }\0A\0A\00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [40 x i8] c"    for ( l_k = 0; l_k < %u; l_k++ ) {\0A\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [20 x i8] c"      #pragma simd\0A\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [42 x i8] c"      for ( l_m = 0; l_m < %u; l_m++ ) {\0A\00", align 1, !dbg !39

!78 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_BATCH_REDUCE_ADDRESS", value: 256)
!79 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_BATCH_REDUCE_OFFSET", value: 512)
!80 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_BATCH_REDUCE_STRIDE", value: 1024)
!81 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT", value: 2176)
!82 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_A_UNSIGNED", value: 4096)
!83 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_B_UNSIGNED", value: 8192)
!84 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_C_UNSIGNED", value: 16384)
!85 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_AB_UNSIGNED", value: 12288)
!86 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_VNNI_A", value: 32768)
!87 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_VNNI_B", value: 65536)
!88 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0", value: 2192)
!89 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_ADDRESS", value: 2432)
!90 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_ADDRESS", value: 2448)
!91 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_OFFSET", value: 2688)
!92 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_OFFSET", value: 2704)
!93 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_STRIDE", value: 3200)
!94 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_STRIDE", value: 3216)
!95 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_A_UNSIGNED", value: 6288)
!96 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_ADDRESS_A_UNSIGNED", value: 6528)
!97 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_ADDRESS_A_UNSIGNED", value: 6544)
!98 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_OFFSET_A_UNSIGNED", value: 6784)
!99 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_OFFSET_A_UNSIGNED", value: 6800)
!100 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_STRIDE_A_UNSIGNED", value: 7296)
!101 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_STRIDE_A_UNSIGNED", value: 7312)
!102 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_B_UNSIGNED", value: 10384)
!103 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_ADDRESS_B_UNSIGNED", value: 10624)
!104 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_ADDRESS_B_UNSIGNED", value: 10640)
!105 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_OFFSET_B_UNSIGNED", value: 10880)
!106 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_OFFSET_B_UNSIGNED", value: 10896)
!107 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_STRIDE_B_UNSIGNED", value: 11392)
!108 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_STRIDE_B_UNSIGNED", value: 11408)
!109 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_AB_UNSIGNED", value: 14480)
!110 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_ADDRESS_AB_UNSIGNED", value: 14720)
!111 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_ADDRESS_AB_UNSIGNED", value: 14736)
!112 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_OFFSET_AB_UNSIGNED", value: 14976)
!113 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_OFFSET_AB_UNSIGNED", value: 14992)
!114 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BATCH_REDUCE_STRIDE_AB_UNSIGNED", value: 15488)
!115 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_ALIGN_C_NTS_HINT_BETA_0_BATCH_REDUCE_STRIDE_AB_UNSIGNED", value: 15504)
!116 = !DIEnumerator(name: "LIBXSMM_GEMM_FLAG_INVALID", value: 131072)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "libxsmm_gemm_precision", file: !68, line: 152, baseType: !69, size: 32, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124}
!119 = !DIEnumerator(name: "LIBXSMM_GEMM_PRECISION_F64", value: 0)
!120 = !DIEnumerator(name: "LIBXSMM_GEMM_PRECISION_F32", value: 1)
!121 = !DIEnumerator(name: "LIBXSMM_GEMM_PRECISION_BF16", value: 2)
!122 = !DIEnumerator(name: "LIBXSMM_GEMM_PRECISION_I32", value: 4)
!123 = !DIEnumerator(name: "LIBXSMM_GEMM_PRECISION_I16", value: 5)
!124 = !DIEnumerator(name: "LIBXSMM_GEMM_PRECISION_I8", value: 6)
!125 = !{!69}
!126 = !{!0, !7, !9, !14, !19, !24, !29, !34, !39, !44, !49, !54, !59}
!127 = !{i32 7, !"Dwarf Version", i32 5}
!128 = !{i32 2, !"Debug Info Version", i32 3}
!129 = !{i32 1, !"wchar_size", i32 4}
!130 = !{i32 8, !"PIC Level", i32 2}
!131 = !{i32 7, !"uwtable", i32 2}
!132 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!133 = distinct !DISubprogram(name: "libxsmm_generator_gemm_noarch_kernel", scope: !2, file: !2, line: 15, type: !134, scopeLine: 16, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !175)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !136, !149}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_generated_code", file: !138, line: 138, baseType: !139)
!138 = !DIFile(filename: "include/libxsmm_generator.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "546d2dd75eaf8cc5937953149b404b74")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_generated_code", file: !138, line: 118, size: 256, elements: !140)
!140 = !{!141, !143, !144, !145, !146, !147, !148}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "generated_code", scope: !139, file: !138, line: 119, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !139, file: !138, line: 120, baseType: !69, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "code_size", scope: !139, file: !138, line: 121, baseType: !69, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "code_type", scope: !139, file: !138, line: 122, baseType: !69, size: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !139, file: !138, line: 130, baseType: !69, size: 32, offset: 160)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !139, file: !138, line: 134, baseType: !69, size: 32, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sf_size", scope: !139, file: !138, line: 135, baseType: !69, size: 32, offset: 224)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_gemm_descriptor", file: !68, line: 123, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_gemm_descriptor", file: !153, line: 202, size: 496, elements: !154)
!153 = !DIFile(filename: "./src/libxsmm_main.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "327f1483fde3a8c227e86e12c0467dc8")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !164, !165, !167, !168, !169, !170, !171, !172, !173, !174}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !152, file: !153, line: 204, baseType: !69, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !152, file: !153, line: 204, baseType: !69, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !152, file: !153, line: 204, baseType: !69, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lda", scope: !152, file: !153, line: 206, baseType: !69, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ldb", scope: !152, file: !153, line: 206, baseType: !69, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ldc", scope: !152, file: !153, line: 206, baseType: !69, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !152, file: !153, line: 208, baseType: !69, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "prefetch", scope: !152, file: !153, line: 210, baseType: !163, size: 8, offset: 224)
!163 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !152, file: !153, line: 212, baseType: !163, size: 8, offset: 232)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !152, file: !153, line: 216, baseType: !166, size: 64, offset: 240)
!166 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !152, file: !153, line: 218, baseType: !166, size: 64, offset: 304)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "c3", scope: !152, file: !153, line: 220, baseType: !163, size: 8, offset: 368)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "meltw_ldx", scope: !152, file: !153, line: 222, baseType: !69, size: 32, offset: 376)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "meltw_ldy", scope: !152, file: !153, line: 222, baseType: !69, size: 32, offset: 408)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "meltw_ldz", scope: !152, file: !153, line: 222, baseType: !69, size: 32, offset: 440)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "meltw_datatype_aux", scope: !152, file: !153, line: 224, baseType: !163, size: 8, offset: 472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "meltw_flags", scope: !152, file: !153, line: 226, baseType: !163, size: 8, offset: 480)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "meltw_operation", scope: !152, file: !153, line: 228, baseType: !163, size: 8, offset: 488)
!175 = !{!176, !177, !178, !182, !184}
!176 = !DILocalVariable(name: "io_generated_code", arg: 1, scope: !133, file: !2, line: 15, type: !136)
!177 = !DILocalVariable(name: "i_xgemm_desc", arg: 2, scope: !133, file: !2, line: 16, type: !149)
!178 = !DILocalVariable(name: "l_new_code", scope: !133, file: !2, line: 17, type: !179)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4096, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 512)
!182 = !DILocalVariable(name: "l_max_code_length", scope: !133, file: !2, line: 18, type: !183)
!183 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!184 = !DILocalVariable(name: "l_code_length", scope: !133, file: !2, line: 19, type: !183)
!185 = !{!186, !186, i64 0}
!186 = !{!"any pointer", !187, i64 0}
!187 = !{!"omnipotent char", !188, i64 0}
!188 = !{!"Simple C/C++ TBAA"}
!189 = !DILocation(line: 15, column: 75, scope: !133)
!190 = !DILocation(line: 16, column: 75, scope: !133)
!191 = !DILocation(line: 17, column: 3, scope: !133)
!192 = !DILocation(line: 17, column: 8, scope: !133)
!193 = !DILocation(line: 18, column: 3, scope: !133)
!194 = !DILocation(line: 18, column: 7, scope: !133)
!195 = !{!196, !196, i64 0}
!196 = !{!"int", !187, i64 0}
!197 = !DILocation(line: 19, column: 3, scope: !133)
!198 = !DILocation(line: 19, column: 7, scope: !133)
!199 = !DILocation(line: 21, column: 19, scope: !133)
!200 = !DILocation(line: 21, column: 17, scope: !133)
!201 = !DILocation(line: 22, column: 34, scope: !133)
!202 = !DILocation(line: 22, column: 53, scope: !133)
!203 = !DILocation(line: 22, column: 65, scope: !133)
!204 = !DILocation(line: 22, column: 3, scope: !133)
!205 = !DILocation(line: 23, column: 19, scope: !133)
!206 = !DILocation(line: 23, column: 17, scope: !133)
!207 = !DILocation(line: 24, column: 34, scope: !133)
!208 = !DILocation(line: 24, column: 53, scope: !133)
!209 = !DILocation(line: 24, column: 65, scope: !133)
!210 = !DILocation(line: 24, column: 3, scope: !133)
!211 = !DILocation(line: 25, column: 19, scope: !133)
!212 = !DILocation(line: 25, column: 17, scope: !133)
!213 = !DILocation(line: 26, column: 34, scope: !133)
!214 = !DILocation(line: 26, column: 53, scope: !133)
!215 = !DILocation(line: 26, column: 65, scope: !133)
!216 = !DILocation(line: 26, column: 3, scope: !133)
!217 = !DILocation(line: 28, column: 19, scope: !133)
!218 = !{!219, !196, i64 4}
!219 = !{!"libxsmm_gemm_descriptor", !196, i64 0, !196, i64 4, !196, i64 8, !196, i64 12, !196, i64 16, !196, i64 20, !196, i64 24, !187, i64 28, !187, i64 29, !220, i64 30, !220, i64 38, !187, i64 46, !196, i64 47, !196, i64 51, !196, i64 55, !187, i64 59, !187, i64 60, !187, i64 61}
!220 = !{!"long long", !187, i64 0}
!221 = !DILocation(line: 28, column: 17, scope: !133)
!222 = !DILocation(line: 29, column: 34, scope: !133)
!223 = !DILocation(line: 29, column: 53, scope: !133)
!224 = !DILocation(line: 29, column: 65, scope: !133)
!225 = !DILocation(line: 29, column: 3, scope: !133)
!226 = !DILocation(line: 30, column: 40, scope: !227)
!227 = distinct !DILexicalBlock(scope: !133, file: !2, line: 30, column: 7)
!228 = !DILocation(line: 30, column: 54, scope: !227)
!229 = !{!219, !196, i64 24}
!230 = !DILocation(line: 30, column: 38, scope: !227)
!231 = !DILocation(line: 30, column: 9, scope: !227)
!232 = !DILocation(line: 30, column: 7, scope: !133)
!233 = !DILocation(line: 31, column: 40, scope: !234)
!234 = distinct !DILexicalBlock(scope: !235, file: !2, line: 31, column: 10)
!235 = distinct !DILexicalBlock(scope: !227, file: !2, line: 30, column: 62)
!236 = !{!219, !187, i64 29}
!237 = !DILocation(line: 31, column: 37, scope: !234)
!238 = !DILocation(line: 31, column: 10, scope: !235)
!239 = !DILocation(line: 32, column: 23, scope: !240)
!240 = distinct !DILexicalBlock(scope: !234, file: !2, line: 31, column: 89)
!241 = !{!219, !196, i64 0}
