; ModuleID = 'samples/394.bc'
source_filename = "distances.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.hwloc_topology = type { i32, i32, i32, ptr, ptr, i64, [20 x i32], [20 x i32], i32, i32, i32, i32, ptr, i64, ptr, i64, [6 x %struct.hwloc_special_level_s], ptr, ptr, %struct.hwloc_binding_hooks, %struct.hwloc_topology_support, ptr, ptr, i32, ptr, ptr, i32, i32, ptr, i32, i32, ptr, i32, i32, i32, [5 x float], i32, ptr, ptr, i32, i32, ptr, %struct.hwloc_numanode_attr_s, i32, i32, ptr, i64, i32, ptr, ptr, ptr }
%struct.hwloc_special_level_s = type { i32, ptr, ptr, ptr }
%struct.hwloc_binding_hooks = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.hwloc_topology_support = type { ptr, ptr, ptr, ptr }
%struct.hwloc_numanode_attr_s = type { i64, i32, ptr }
%struct.hwloc_internal_distances_s = type { ptr, i32, i32, ptr, i32, ptr, ptr, i64, i32, ptr, ptr, ptr }
%struct.hwloc_tma = type { ptr, ptr, i32 }
%struct.hwloc_distances_container_s = type { i32, %struct.hwloc_distances_s }
%struct.hwloc_distances_s = type { i32, ptr, i64, ptr }
%struct.hwloc_obj = type { i32, ptr, i32, ptr, i64, ptr, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, i32, ptr, ptr, ptr, i32, i32, ptr, i32, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, i64 }
%struct.hwloc_group_attr_s = type { i32, i32, i32, i8 }


!178 = !DIEnumerator(name: "HWLOC_TYPE_FILTER_KEEP_STRUCTURE", value: 2)
!179 = !DIEnumerator(name: "HWLOC_TYPE_FILTER_KEEP_IMPORTANT", value: 3)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !133, line: 1398, baseType: !181, size: 32, elements: !182)
!181 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!182 = !{!183, !184, !185, !186, !187, !188}
!183 = !DIEnumerator(name: "HWLOC_MEMBIND_DEFAULT", value: 0)
!184 = !DIEnumerator(name: "HWLOC_MEMBIND_FIRSTTOUCH", value: 1)
!185 = !DIEnumerator(name: "HWLOC_MEMBIND_BIND", value: 2)
!186 = !DIEnumerator(name: "HWLOC_MEMBIND_INTERLEAVE", value: 3)
!187 = !DIEnumerator(name: "HWLOC_MEMBIND_NEXTTOUCH", value: 4)
!188 = !DIEnumerator(name: "HWLOC_MEMBIND_MIXED", value: -1)
!189 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_location_type_e", file: !190, line: 189, baseType: !134, size: 32, elements: !191)
!190 = !DIFile(filename: "include/hwloc/memattrs.h", directory: "/local-ssd/hwloc-zu2rei3kjykcqla7tvon4gcf6srurf7q-build/aidengro/spack-stage-hwloc-2.9.1-zu2rei3kjykcqla7tvon4gcf6srurf7q/spack-src", checksumkind: CSK_MD5, checksum: "8d02fef3c931f8d5edf088c2e471611c")
!191 = !{!192, !193}
!192 = !DIEnumerator(name: "HWLOC_LOCATION_TYPE_CPUSET", value: 1)
!193 = !DIEnumerator(name: "HWLOC_LOCATION_TYPE_OBJECT", value: 0)
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_disc_phase_e", file: !195, line: 106, baseType: !134, size: 32, elements: !196)
!195 = !DIFile(filename: "include/hwloc/plugins.h", directory: "/local-ssd/hwloc-zu2rei3kjykcqla7tvon4gcf6srurf7q-build/aidengro/spack-stage-hwloc-2.9.1-zu2rei3kjykcqla7tvon4gcf6srurf7q/spack-src", checksumkind: CSK_MD5, checksum: "1091dfebc1c65f2228869166bc74d551")
!196 = !{!197, !198, !199, !200, !201, !202, !203, !204}
!197 = !DIEnumerator(name: "HWLOC_DISC_PHASE_GLOBAL", value: 1)
!198 = !DIEnumerator(name: "HWLOC_DISC_PHASE_CPU", value: 2)
!199 = !DIEnumerator(name: "HWLOC_DISC_PHASE_MEMORY", value: 4)
!200 = !DIEnumerator(name: "HWLOC_DISC_PHASE_PCI", value: 8)
!201 = !DIEnumerator(name: "HWLOC_DISC_PHASE_IO", value: 16)
!202 = !DIEnumerator(name: "HWLOC_DISC_PHASE_MISC", value: 32)
!203 = !DIEnumerator(name: "HWLOC_DISC_PHASE_ANNOTATE", value: 64)
!204 = !DIEnumerator(name: "HWLOC_DISC_PHASE_TWEAK", value: 128)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_distances_kind_e", file: !206, line: 79, baseType: !134, size: 32, elements: !207)
!206 = !DIFile(filename: "include/hwloc/distances.h", directory: "/local-ssd/hwloc-zu2rei3kjykcqla7tvon4gcf6srurf7q-build/aidengro/spack-stage-hwloc-2.9.1-zu2rei3kjykcqla7tvon4gcf6srurf7q/spack-src", checksumkind: CSK_MD5, checksum: "863dd20681acdca3d698acf4037fd048")
!207 = !{!208, !209, !210, !211, !212}
!208 = !DIEnumerator(name: "HWLOC_DISTANCES_KIND_FROM_OS", value: 1)
!209 = !DIEnumerator(name: "HWLOC_DISTANCES_KIND_FROM_USER", value: 2)
!210 = !DIEnumerator(name: "HWLOC_DISTANCES_KIND_MEANS_LATENCY", value: 4)
!211 = !DIEnumerator(name: "HWLOC_DISTANCES_KIND_MEANS_BANDWIDTH", value: 8)
!212 = !DIEnumerator(name: "HWLOC_DISTANCES_KIND_HETEROGENEOUS_TYPES", value: 16)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_distances_add_flag_e", file: !206, line: 387, baseType: !134, size: 32, elements: !214)
!214 = !{!215, !216}
!215 = !DIEnumerator(name: "HWLOC_DISTANCES_ADD_FLAG_GROUP", value: 1)
!216 = !DIEnumerator(name: "HWLOC_DISTANCES_ADD_FLAG_GROUP_INACCURATE", value: 2)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_distances_transform_e", file: !206, line: 187, baseType: !134, size: 32, elements: !218)
!218 = !{!219, !220, !221, !222}
!219 = !DIEnumerator(name: "HWLOC_DISTANCES_TRANSFORM_REMOVE_NULL", value: 0)
!220 = !DIEnumerator(name: "HWLOC_DISTANCES_TRANSFORM_LINKS", value: 1)
!221 = !DIEnumerator(name: "HWLOC_DISTANCES_TRANSFORM_MERGE_SWITCH_PORTS", value: 2)
!222 = !DIEnumerator(name: "HWLOC_DISTANCES_TRANSFORM_TRANSITIVE_CLOSURE", value: 3)
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_get_type_depth_e", file: !133, line: 821, baseType: !181, size: 32, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232}
!225 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_UNKNOWN", value: -1)
!226 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_MULTIPLE", value: -2)
!227 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_NUMANODE", value: -3)
!228 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_BRIDGE", value: -4)
!229 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_PCI_DEVICE", value: -5)
!230 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_OS_DEVICE", value: -6)
!231 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_MISC", value: -7)
!232 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_MEMCACHE", value: -8)
!233 = !{!234, !258, !259, !260, !261, !277, !401, !181, !403, !404, !134, !405}
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !235, line: 24, baseType: !236)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !237, line: 41, baseType: !238)
!237 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !237, line: 27, size: 1856, elements: !240)
!240 = !{!241, !247, !251, !254, !255}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !239, file: !237, line: 30, baseType: !242, size: 832)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 832, elements: !245)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !237, line: 30, flags: DIFlagFwdDecl)
!245 = !{!246}
!246 = !DISubrange(count: 13)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !239, file: !237, line: 33, baseType: !248, size: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!250 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !239, file: !237, line: 34, baseType: !252, size: 64, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !239, file: !237, line: 35, baseType: !252, size: 64, offset: 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !239, file: !237, line: 38, baseType: !256, size: 832, offset: 1024)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 832, elements: !245)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!258 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_obj_type_t", file: !133, line: 323, baseType: !132)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_distances_container_s", file: !2, line: 858, size: 320, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !262, file: !2, line: 859, baseType: !134, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "distances", scope: !262, file: !2, line: 860, baseType: !266, size: 256, offset: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_distances_s", file: !206, line: 53, size: 256, elements: !267)
!267 = !{!268, !269, !398, !399}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nbobjs", scope: !266, file: !206, line: 54, baseType: !134, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !266, file: !206, line: 55, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_obj_t", file: !133, line: 596, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_obj", file: !133, line: 396, size: 1984, elements: !274)
!274 = !{!275, !276, !278, !279, !280, !288, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !385, !386, !388, !389, !395, !396, !397}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !273, file: !133, line: 398, baseType: !260, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !273, file: !133, line: 399, baseType: !277, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "os_index", scope: !273, file: !133, line: 401, baseType: !134, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !273, file: !133, line: 408, baseType: !277, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "total_memory", scope: !273, file: !133, line: 413, baseType: !281, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_uint64_t", file: !282, line: 226, baseType: !283)
!282 = !DIFile(filename: "include/hwloc/autogen/config.h", directory: "/local-ssd/hwloc-zu2rei3kjykcqla7tvon4gcf6srurf7q-build/aidengro/spack-stage-hwloc-2.9.1-zu2rei3kjykcqla7tvon4gcf6srurf7q/spack-src", checksumkind: CSK_MD5, checksum: "2df0ab57186d6652185a93ca57e74def")
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !284, line: 27, baseType: !285)
!284 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !286, line: 45, baseType: !287)
!286 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!287 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !273, file: !133, line: 415, baseType: !289, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "hwloc_obj_attr_u", file: !133, line: 599, size: 320, elements: !291)
!291 = !{!292, !303, !312, !320, !334, !354}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "numanode", scope: !290, file: !133, line: 613, baseType: !293, size: 192)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_numanode_attr_s", file: !133, line: 601, size: 192, elements: !294)
!294 = !{!295, !296, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", scope: !293, file: !133, line: 602, baseType: !281, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "page_types_len", scope: !293, file: !133, line: 603, baseType: !134, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "page_types", scope: !293, file: !133, line: 612, baseType: !298, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_memory_page_type_s", file: !133, line: 609, size: 128, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !133, line: 610, baseType: !281, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !299, file: !133, line: 611, baseType: !281, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !290, file: !133, line: 623, baseType: !304, size: 192)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_cache_attr_s", file: !133, line: 616, size: 192, elements: !305)
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !304, file: !133, line: 617, baseType: !281, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !304, file: !133, line: 618, baseType: !134, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !304, file: !133, line: 619, baseType: !134, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "associativity", scope: !304, file: !133, line: 620, baseType: !181, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !133, line: 622, baseType: !311, size: 32, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_obj_cache_type_t", file: !133, line: 330, baseType: !157)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !290, file: !133, line: 631, baseType: !313, size: 128)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_group_attr_s", file: !133, line: 625, size: 128, elements: !314)
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !313, file: !133, line: 626, baseType: !134, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !313, file: !133, line: 628, baseType: !134, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "subkind", scope: !313, file: !133, line: 629, baseType: !134, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "dont_merge", scope: !313, file: !133, line: 630, baseType: !319, size: 8, offset: 96)
!319 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pcidev", scope: !290, file: !133, line: 644, baseType: !321, size: 192)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_pcidev_attr_s", file: !133, line: 633, size: 192, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !321, file: !133, line: 635, baseType: !250, size: 16)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !321, file: !133, line: 639, baseType: !319, size: 8, offset: 16)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !321, file: !133, line: 639, baseType: !319, size: 8, offset: 24)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !321, file: !133, line: 639, baseType: !319, size: 8, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "class_id", scope: !321, file: !133, line: 640, baseType: !250, size: 16, offset: 48)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_id", scope: !321, file: !133, line: 641, baseType: !250, size: 16, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "device_id", scope: !321, file: !133, line: 641, baseType: !250, size: 16, offset: 80)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "subvendor_id", scope: !321, file: !133, line: 641, baseType: !250, size: 16, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "subdevice_id", scope: !321, file: !133, line: 641, baseType: !250, size: 16, offset: 112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !321, file: !133, line: 642, baseType: !319, size: 8, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "linkspeed", scope: !321, file: !133, line: 643, baseType: !258, size: 32, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bridge", scope: !290, file: !133, line: 663, baseType: !335, size: 320)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_bridge_attr_s", file: !133, line: 646, size: 320, elements: !336)
!336 = !{!337, !341, !343, !352, !353}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !335, file: !133, line: 649, baseType: !338, size: 192)
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !335, file: !133, line: 647, size: 192, elements: !339)
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !338, file: !133, line: 648, baseType: !321, size: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_type", scope: !335, file: !133, line: 650, baseType: !342, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_obj_bridge_type_t", file: !133, line: 336, baseType: !162)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !335, file: !133, line: 660, baseType: !344, size: 32, offset: 224)
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !335, file: !133, line: 651, size: 32, elements: !345)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !344, file: !133, line: 659, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !133, line: 652, size: 32, elements: !348)
!348 = !{!349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !347, file: !133, line: 654, baseType: !250, size: 16)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_bus", scope: !347, file: !133, line: 658, baseType: !319, size: 8, offset: 16)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "subordinate_bus", scope: !347, file: !133, line: 658, baseType: !319, size: 8, offset: 24)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_type", scope: !335, file: !133, line: 661, baseType: !342, size: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !335, file: !133, line: 662, baseType: !134, size: 32, offset: 288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "osdev", scope: !290, file: !133, line: 667, baseType: !355, size: 32)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_osdev_attr_s", file: !133, line: 665, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !133, line: 666, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_obj_osdev_type_t", file: !133, line: 356, baseType: !166)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !273, file: !133, line: 419, baseType: !181, size: 32, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "logical_index", scope: !273, file: !133, line: 434, baseType: !134, size: 32, offset: 416)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next_cousin", scope: !273, file: !133, line: 442, baseType: !272, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cousin", scope: !273, file: !133, line: 443, baseType: !272, size: 64, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !273, file: !133, line: 446, baseType: !272, size: 64, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_rank", scope: !273, file: !133, line: 447, baseType: !134, size: 32, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "next_sibling", scope: !273, file: !133, line: 448, baseType: !272, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sibling", scope: !273, file: !133, line: 449, baseType: !272, size: 64, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !273, file: !133, line: 452, baseType: !134, size: 32, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !273, file: !133, line: 456, baseType: !369, size: 64, offset: 896)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "first_child", scope: !273, file: !133, line: 457, baseType: !272, size: 64, offset: 960)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "last_child", scope: !273, file: !133, line: 458, baseType: !272, size: 64, offset: 1024)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_subtree", scope: !273, file: !133, line: 461, baseType: !181, size: 32, offset: 1088)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "memory_arity", scope: !273, file: !133, line: 472, baseType: !134, size: 32, offset: 1120)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "memory_first_child", scope: !273, file: !133, line: 475, baseType: !272, size: 64, offset: 1152)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "io_arity", scope: !273, file: !133, line: 490, baseType: !134, size: 32, offset: 1216)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "io_first_child", scope: !273, file: !133, line: 493, baseType: !272, size: 64, offset: 1280)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "misc_arity", scope: !273, file: !133, line: 502, baseType: !134, size: 32, offset: 1344)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "misc_first_child", scope: !273, file: !133, line: 505, baseType: !272, size: 64, offset: 1408)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !273, file: !133, line: 512, baseType: !380, size: 64, offset: 1472)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_cpuset_t", file: !133, line: 140, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_bitmap_t", file: !382, line: 68, baseType: !383)
!382 = !DIFile(filename: "include/hwloc/bitmap.h", directory: "/local-ssd/hwloc-zu2rei3kjykcqla7tvon4gcf6srurf7q-build/aidengro/spack-stage-hwloc-2.9.1-zu2rei3kjykcqla7tvon4gcf6srurf7q/spack-src", checksumkind: CSK_MD5, checksum: "d0456df9b7335ef555b3fd609c469e99")
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_bitmap_s", file: !382, line: 68, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cpuset", scope: !273, file: !133, line: 527, baseType: !380, size: 64, offset: 1536)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nodeset", scope: !273, file: !133, line: 540, baseType: !387, size: 64, offset: 1600)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_nodeset_t", file: !133, line: 157, baseType: !381)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "complete_nodeset", scope: !273, file: !133, line: 562, baseType: !387, size: 64, offset: 1664)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "infos", scope: !273, file: !133, line: 578, baseType: !390, size: 64, offset: 1728)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_info_s", file: !133, line: 674, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !391, file: !133, line: 675, baseType: !277, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !391, file: !133, line: 676, baseType: !277, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "infos_count", scope: !273, file: !133, line: 579, baseType: !134, size: 32, offset: 1792)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !273, file: !133, line: 582, baseType: !259, size: 64, offset: 1856)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "gp_index", scope: !273, file: !133, line: 587, baseType: !281, size: 64, offset: 1920)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !266, file: !206, line: 60, baseType: !287, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !266, file: !206, line: 61, baseType: !400, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !402, line: 90, baseType: !287)
!402 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!404 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!405 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!406 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !48, !50, !55, !60, !65, !67, !72, !74, !79, !84, !89, !94, !99, !104, !109, !114, !119, !124, !126, !128}
!407 = !{i32 7, !"Dwarf Version", i32 5}
!408 = !{i32 2, !"Debug Info Version", i32 3}
!409 = !{i32 1, !"wchar_size", i32 4}
!410 = !{i32 8, !"PIC Level", i32 2}
!411 = !{i32 7, !"uwtable", i32 2}
!412 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!413 = distinct !DISubprogram(name: "hwloc_internal_distances_init", scope: !2, file: !2, line: 56, type: !414, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !775)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology", file: !418, line: 63, size: 7232, elements: !419)
!418 = !DIFile(filename: "include/private/private.h", directory: "/local-ssd/hwloc-zu2rei3kjykcqla7tvon4gcf6srurf7q-build/aidengro/spack-stage-hwloc-2.9.1-zu2rei3kjykcqla7tvon4gcf6srurf7q/spack-src", checksumkind: CSK_MD5, checksum: "d5b6519b0f9aae3453b4c83bca837d9a")
!419 = !{!420, !421, !422, !423, !425, !427, !428, !432, !434, !435, !436, !437, !441, !442, !443, !444, !447, !455, !456, !457, !547, !599, !603, !607, !608, !626, !627, !628, !629, !666, !667, !668, !678, !679, !680, !681, !685, !686, !731, !732, !733, !734, !744, !745, !746, !747, !755, !756, !757, !763, !774}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "topology_abi", scope: !417, file: !418, line: 64, baseType: !134, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "nb_levels", scope: !417, file: !418, line: 66, baseType: !134, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "nb_levels_allocated", scope: !417, file: !418, line: 67, baseType: !134, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "level_nbobjects", scope: !417, file: !418, line: 68, baseType: !424, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !417, file: !418, line: 69, baseType: !426, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !417, file: !418, line: 70, baseType: !287, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type_depth", scope: !417, file: !418, line: 71, baseType: !429, size: 640, offset: 320)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 640, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 20)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type_filter", scope: !417, file: !418, line: 72, baseType: !433, size: 640, offset: 960)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 640, elements: !430)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "is_thissystem", scope: !417, file: !418, line: 73, baseType: !181, size: 32, offset: 1600)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "is_loaded", scope: !417, file: !418, line: 74, baseType: !181, size: 32, offset: 1632)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !417, file: !418, line: 75, baseType: !181, size: 32, offset: 1664)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !417, file: !418, line: 76, baseType: !438, size: 32, offset: 1696)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !439, line: 38, baseType: !440)
!439 = !DIFile(filename: "/usr/include/sched.h", directory: "", checksumkind: CSK_MD5, checksum: "52ea601aba54a9937a50019367077a72")
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !286, line: 154, baseType: !181)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !417, file: !418, line: 77, baseType: !259, size: 64, offset: 1728)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next_gp_index", scope: !417, file: !418, line: 78, baseType: !283, size: 64, offset: 1792)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "adopted_shmem_addr", scope: !417, file: !418, line: 80, baseType: !259, size: 64, offset: 1856)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "adopted_shmem_length", scope: !417, file: !418, line: 81, baseType: !445, size: 64, offset: 1920)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !446, line: 70, baseType: !287)
!446 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!447 = !DIDerivedType(tag: DW_TAG_member, name: "slevels", scope: !417, file: !418, line: 97, baseType: !448, size: 1536, offset: 1984)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 1536, elements: !70)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_special_level_s", file: !418, line: 93, size: 256, elements: !450)
!450 = !{!451, !452, !453, !454}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nbobjs", scope: !449, file: !418, line: 94, baseType: !134, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !449, file: !418, line: 95, baseType: !369, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !449, file: !418, line: 96, baseType: !272, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !449, file: !418, line: 96, baseType: !272, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_cpuset", scope: !417, file: !418, line: 99, baseType: !381, size: 64, offset: 3520)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_nodeset", scope: !417, file: !418, line: 100, baseType: !381, size: 64, offset: 3584)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "binding_hooks", scope: !417, file: !418, line: 136, baseType: !458, size: 1536, offset: 3648)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_binding_hooks", file: !418, line: 102, size: 1536, elements: !459)
!459 = !{!460, !469, !473, !474, !475, !479, !483, !489, !493, !494, !495, !496, !502, !507, !508, !509, !513, !517, !523, !527, !531, !535, !539, !543}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_cpubind", scope: !458, file: !418, line: 104, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!181, !464, !465, !181}
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_topology_t", file: !133, line: 692, baseType: !416)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_const_cpuset_t", file: !133, line: 142, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_const_bitmap_t", file: !382, line: 70, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_cpubind", scope: !458, file: !418, line: 105, baseType: !470, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!181, !464, !380, !181}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_cpubind", scope: !458, file: !418, line: 106, baseType: !461, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_cpubind", scope: !458, file: !418, line: 107, baseType: !470, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_cpubind", scope: !458, file: !418, line: 108, baseType: !476, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!181, !464, !438, !465, !181}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_cpubind", scope: !458, file: !418, line: 109, baseType: !480, size: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!181, !464, !438, !380, !181}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "set_thread_cpubind", scope: !458, file: !418, line: 111, baseType: !484, size: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!181, !464, !487, !465, !181}
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !488, line: 27, baseType: !287)
!488 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!489 = !DIDerivedType(tag: DW_TAG_member, name: "get_thread_cpubind", scope: !458, file: !418, line: 112, baseType: !490, size: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!181, !464, !487, !380, !181}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_last_cpu_location", scope: !458, file: !418, line: 115, baseType: !470, size: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_last_cpu_location", scope: !458, file: !418, line: 116, baseType: !470, size: 64, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_last_cpu_location", scope: !458, file: !418, line: 117, baseType: !480, size: 64, offset: 640)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_membind", scope: !458, file: !418, line: 119, baseType: !497, size: 64, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!181, !464, !500, !501, !181}
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_const_nodeset_t", file: !133, line: 160, baseType: !466)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_membind_policy_t", file: !133, line: 1446, baseType: !180)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_membind", scope: !458, file: !418, line: 120, baseType: !503, size: 64, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!181, !464, !387, !506, !181}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_membind", scope: !458, file: !418, line: 121, baseType: !497, size: 64, offset: 832)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_membind", scope: !458, file: !418, line: 122, baseType: !503, size: 64, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_membind", scope: !458, file: !418, line: 123, baseType: !510, size: 64, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!181, !464, !438, !500, !501, !181}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_membind", scope: !458, file: !418, line: 124, baseType: !514, size: 64, offset: 1024)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!181, !464, !438, !387, !506, !181}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "set_area_membind", scope: !458, file: !418, line: 125, baseType: !518, size: 64, offset: 1088)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!181, !464, !521, !445, !500, !501, !181}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_membind", scope: !458, file: !418, line: 126, baseType: !524, size: 64, offset: 1152)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!181, !464, !521, !445, !387, !506, !181}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_memlocation", scope: !458, file: !418, line: 127, baseType: !528, size: 64, offset: 1216)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!181, !464, !521, !445, !387, !181}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !458, file: !418, line: 129, baseType: !532, size: 64, offset: 1280)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!259, !464, !445}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_membind", scope: !458, file: !418, line: 132, baseType: !536, size: 64, offset: 1344)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!259, !464, !445, !500, !501, !181}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "free_membind", scope: !458, file: !418, line: 133, baseType: !540, size: 64, offset: 1408)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!181, !464, !259, !445}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "get_allowed_resources", scope: !458, file: !418, line: 135, baseType: !544, size: 64, offset: 1472)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!181, !464}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "support", scope: !417, file: !418, line: 138, baseType: !548, size: 256, offset: 5184)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_support", file: !133, line: 2215, size: 256, elements: !549)
!549 = !{!550, !560, !575, !594}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "discovery", scope: !548, file: !133, line: 2216, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_discovery_support", file: !133, line: 2119, size: 48, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pu", scope: !552, file: !133, line: 2121, baseType: !319, size: 8)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "numa", scope: !552, file: !133, line: 2123, baseType: !319, size: 8, offset: 8)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "numa_memory", scope: !552, file: !133, line: 2125, baseType: !319, size: 8, offset: 16)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "disallowed_pu", scope: !552, file: !133, line: 2127, baseType: !319, size: 8, offset: 24)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "disallowed_numa", scope: !552, file: !133, line: 2129, baseType: !319, size: 8, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cpukind_efficiency", scope: !552, file: !133, line: 2131, baseType: !319, size: 8, offset: 40)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cpubind", scope: !548, file: !133, line: 2217, baseType: !561, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_cpubind_support", file: !133, line: 2139, size: 88, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_cpubind", scope: !562, file: !133, line: 2141, baseType: !319, size: 8)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_cpubind", scope: !562, file: !133, line: 2143, baseType: !319, size: 8, offset: 8)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_cpubind", scope: !562, file: !133, line: 2145, baseType: !319, size: 8, offset: 16)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_cpubind", scope: !562, file: !133, line: 2147, baseType: !319, size: 8, offset: 24)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_cpubind", scope: !562, file: !133, line: 2149, baseType: !319, size: 8, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_cpubind", scope: !562, file: !133, line: 2151, baseType: !319, size: 8, offset: 40)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "set_thread_cpubind", scope: !562, file: !133, line: 2153, baseType: !319, size: 8, offset: 48)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "get_thread_cpubind", scope: !562, file: !133, line: 2155, baseType: !319, size: 8, offset: 56)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_last_cpu_location", scope: !562, file: !133, line: 2157, baseType: !319, size: 8, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_last_cpu_location", scope: !562, file: !133, line: 2159, baseType: !319, size: 8, offset: 72)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_last_cpu_location", scope: !562, file: !133, line: 2161, baseType: !319, size: 8, offset: 80)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "membind", scope: !548, file: !133, line: 2218, baseType: !576, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_membind_support", file: !133, line: 2169, size: 120, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_membind", scope: !577, file: !133, line: 2171, baseType: !319, size: 8)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_membind", scope: !577, file: !133, line: 2173, baseType: !319, size: 8, offset: 8)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_membind", scope: !577, file: !133, line: 2175, baseType: !319, size: 8, offset: 16)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_membind", scope: !577, file: !133, line: 2177, baseType: !319, size: 8, offset: 24)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_membind", scope: !577, file: !133, line: 2179, baseType: !319, size: 8, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_membind", scope: !577, file: !133, line: 2181, baseType: !319, size: 8, offset: 40)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "set_area_membind", scope: !577, file: !133, line: 2183, baseType: !319, size: 8, offset: 48)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_membind", scope: !577, file: !133, line: 2185, baseType: !319, size: 8, offset: 56)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_membind", scope: !577, file: !133, line: 2187, baseType: !319, size: 8, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "firsttouch_membind", scope: !577, file: !133, line: 2189, baseType: !319, size: 8, offset: 72)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bind_membind", scope: !577, file: !133, line: 2191, baseType: !319, size: 8, offset: 80)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_membind", scope: !577, file: !133, line: 2193, baseType: !319, size: 8, offset: 88)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nexttouch_membind", scope: !577, file: !133, line: 2195, baseType: !319, size: 8, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "migrate_membind", scope: !577, file: !133, line: 2197, baseType: !319, size: 8, offset: 104)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_memlocation", scope: !577, file: !133, line: 2199, baseType: !319, size: 8, offset: 112)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !548, file: !133, line: 2219, baseType: !595, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_misc_support", file: !133, line: 2204, size: 8, elements: !597)
!597 = !{!598}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "imported_support", scope: !596, file: !133, line: 2206, baseType: !319, size: 8)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "userdata_export_cb", scope: !417, file: !418, line: 140, baseType: !600, size: 64, offset: 5440)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !259, !416, !272}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "userdata_import_cb", scope: !417, file: !418, line: 141, baseType: !604, size: 64, offset: 5504)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !416, !272, !257, !521, !445}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "userdata_not_decoded", scope: !417, file: !418, line: 142, baseType: !181, size: 32, offset: 5568)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "first_dist", scope: !417, file: !418, line: 176, baseType: !609, size: 64, offset: 5632)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_distances_s", file: !418, line: 144, size: 704, elements: !611)
!611 = !{!612, !613, !614, !615, !617, !618, !620, !621, !622, !623, !624, !625}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !610, file: !418, line: 145, baseType: !277, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !610, file: !418, line: 147, baseType: !134, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "unique_type", scope: !610, file: !418, line: 154, baseType: !260, size: 32, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "different_types", scope: !610, file: !418, line: 155, baseType: !616, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nbobjs", scope: !610, file: !418, line: 158, baseType: !134, size: 32, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !610, file: !418, line: 159, baseType: !619, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !610, file: !418, line: 163, baseType: !619, size: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !610, file: !418, line: 166, baseType: !287, size: 64, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", scope: !610, file: !418, line: 170, baseType: !134, size: 32, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !610, file: !418, line: 173, baseType: !270, size: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !610, file: !418, line: 175, baseType: !609, size: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !610, file: !418, line: 175, baseType: !609, size: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "last_dist", scope: !417, file: !418, line: 176, baseType: !609, size: 64, offset: 5696)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next_dist_id", scope: !417, file: !418, line: 177, baseType: !134, size: 32, offset: 5760)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nr_memattrs", scope: !417, file: !418, line: 180, baseType: !134, size: 32, offset: 5792)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "memattrs", scope: !417, file: !418, line: 208, baseType: !630, size: 64, offset: 5824)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_memattr_s", file: !418, line: 181, size: 256, elements: !632)
!632 = !{!633, !634, !635, !636, !637}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !631, file: !418, line: 183, baseType: !277, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !631, file: !418, line: 184, baseType: !287, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", scope: !631, file: !418, line: 188, baseType: !134, size: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nr_targets", scope: !631, file: !418, line: 191, baseType: !134, size: 32, offset: 160)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !631, file: !418, line: 207, baseType: !638, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_memattr_target_s", file: !418, line: 192, size: 384, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !639, file: !418, line: 194, baseType: !271, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !639, file: !418, line: 195, baseType: !260, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "os_index", scope: !639, file: !418, line: 196, baseType: !134, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "gp_index", scope: !639, file: !418, line: 197, baseType: !281, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "noinitiator_value", scope: !639, file: !418, line: 200, baseType: !281, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nr_initiators", scope: !639, file: !418, line: 202, baseType: !134, size: 32, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "initiators", scope: !639, file: !418, line: 206, baseType: !648, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_memattr_initiator_s", file: !418, line: 203, size: 320, elements: !650)
!650 = !{!651, !665}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "initiator", scope: !649, file: !418, line: 204, baseType: !652, size: 256)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_location_s", file: !418, line: 45, size: 256, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !652, file: !418, line: 46, baseType: !189, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !652, file: !418, line: 54, baseType: !656, size: 192, offset: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !652, file: !418, line: 47, size: 192, elements: !657)
!657 = !{!658, !664}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !656, file: !418, line: 52, baseType: !659, size: 192)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !656, file: !418, line: 48, size: 192, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !659, file: !418, line: 49, baseType: !271, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "gp_index", scope: !659, file: !418, line: 50, baseType: !283, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !659, file: !418, line: 51, baseType: !260, size: 32, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !656, file: !418, line: 53, baseType: !380, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !649, file: !418, line: 205, baseType: !281, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpukinds", scope: !417, file: !418, line: 211, baseType: !134, size: 32, offset: 5888)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpukinds_allocated", scope: !417, file: !418, line: 212, baseType: !134, size: 32, offset: 5920)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cpukinds", scope: !417, file: !418, line: 221, baseType: !669, size: 64, offset: 5952)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_cpukind_s", file: !418, line: 213, size: 320, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !670, file: !418, line: 214, baseType: !380, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "efficiency", scope: !670, file: !418, line: 216, baseType: !181, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "forced_efficiency", scope: !670, file: !418, line: 217, baseType: !181, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ranking_value", scope: !670, file: !418, line: 218, baseType: !281, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nr_infos", scope: !670, file: !418, line: 219, baseType: !134, size: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "infos", scope: !670, file: !418, line: 220, baseType: !390, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !417, file: !418, line: 223, baseType: !181, size: 32, offset: 6016)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_verbose", scope: !417, file: !418, line: 224, baseType: !181, size: 32, offset: 6048)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_nbaccuracies", scope: !417, file: !418, line: 225, baseType: !134, size: 32, offset: 6080)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_accuracies", scope: !417, file: !418, line: 226, baseType: !682, size: 160, offset: 6112)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 160, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 5)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_next_subkind", scope: !417, file: !418, line: 227, baseType: !134, size: 32, offset: 6272)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "backends", scope: !417, file: !418, line: 230, baseType: !687, size: 64, offset: 6336)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_backend", file: !195, line: 189, size: 704, elements: !689)
!689 = !{!690, !704, !705, !706, !707, !708, !709, !710, !711, !715, !726}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "component", scope: !688, file: !195, line: 191, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_disc_component", file: !195, line: 41, size: 320, elements: !693)
!693 = !{!694, !695, !696, !697, !701, !702, !703}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !692, file: !195, line: 45, baseType: !257, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "phases", scope: !692, file: !195, line: 50, baseType: !134, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_phases", scope: !692, file: !195, line: 60, baseType: !134, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "instantiate", scope: !692, file: !195, line: 65, baseType: !698, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!687, !416, !691, !134, !521, !521, !521}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !692, file: !195, line: 79, baseType: !134, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "enabled_by_default", scope: !692, file: !195, line: 84, baseType: !134, size: 32, offset: 224)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !692, file: !195, line: 90, baseType: !691, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "topology", scope: !688, file: !195, line: 193, baseType: !416, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "envvar_forced", scope: !688, file: !195, line: 195, baseType: !181, size: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !688, file: !195, line: 197, baseType: !687, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "phases", scope: !688, file: !195, line: 202, baseType: !134, size: 32, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !688, file: !195, line: 205, baseType: !287, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "is_thissystem", scope: !688, file: !195, line: 213, baseType: !181, size: 32, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !688, file: !195, line: 216, baseType: !259, size: 64, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !688, file: !195, line: 220, baseType: !712, size: 64, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !687}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "discover", scope: !688, file: !195, line: 227, baseType: !716, size: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!181, !687, !719}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_disc_status", file: !195, line: 156, size: 128, elements: !721)
!721 = !{!722, !724, !725}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !720, file: !195, line: 160, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_disc_phase_t", file: !195, line: 143, baseType: !194)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_phases", scope: !720, file: !195, line: 165, baseType: !134, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !720, file: !195, line: 168, baseType: !287, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "get_pci_busid_cpuset", scope: !688, file: !195, line: 233, baseType: !727, size: 64, offset: 640)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!181, !687, !730, !381}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "get_pci_busid_cpuset_backend", scope: !417, file: !418, line: 231, baseType: !687, size: 64, offset: 6400)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "backend_phases", scope: !417, file: !418, line: 232, baseType: !134, size: 32, offset: 6464)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "backend_excluded_phases", scope: !417, file: !418, line: 233, baseType: !134, size: 32, offset: 6496)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tma", scope: !417, file: !418, line: 236, baseType: !735, size: 64, offset: 6528)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_tma", file: !418, line: 493, size: 192, elements: !737)
!737 = !{!738, !742, !743}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !736, file: !418, line: 494, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!259, !735, !445}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !736, file: !418, line: 495, baseType: !259, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dontfree", scope: !736, file: !418, line: 496, baseType: !181, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "machine_memory", scope: !417, file: !418, line: 252, baseType: !293, size: 192, offset: 6592)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pci_has_forced_locality", scope: !417, file: !418, line: 255, baseType: !181, size: 32, offset: 6784)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pci_forced_locality_nr", scope: !417, file: !418, line: 256, baseType: !134, size: 32, offset: 6816)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pci_forced_locality", scope: !417, file: !418, line: 261, baseType: !748, size: 64, offset: 6848)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_pci_forced_locality_s", file: !418, line: 257, size: 192, elements: !750)
!750 = !{!751, !752, !753, !754}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !749, file: !418, line: 258, baseType: !134, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bus_first", scope: !749, file: !418, line: 259, baseType: !134, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bus_last", scope: !749, file: !418, line: 259, baseType: !134, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !749, file: !418, line: 260, baseType: !381, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pci_locality_quirks", scope: !417, file: !418, line: 262, baseType: !281, size: 64, offset: 6912)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "nr_blacklisted_components", scope: !417, file: !418, line: 265, baseType: !134, size: 32, offset: 6976)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "blacklisted_components", scope: !417, file: !418, line: 269, baseType: !758, size: 64, offset: 7040)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_forced_component_s", file: !418, line: 266, size: 128, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "component", scope: !759, file: !418, line: 267, baseType: !691, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "phases", scope: !759, file: !418, line: 268, baseType: !134, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "first_pci_locality", scope: !417, file: !418, line: 279, baseType: !764, size: 64, offset: 7104)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_pci_locality_s", file: !418, line: 272, size: 384, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !765, file: !418, line: 273, baseType: !134, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "bus_min", scope: !765, file: !418, line: 274, baseType: !134, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bus_max", scope: !765, file: !418, line: 275, baseType: !134, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !765, file: !418, line: 276, baseType: !381, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !765, file: !418, line: 277, baseType: !271, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !765, file: !418, line: 278, baseType: !764, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !765, file: !418, line: 278, baseType: !764, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "last_pci_locality", scope: !417, file: !418, line: 279, baseType: !764, size: 64, offset: 7168)
!775 = !{!776}
!776 = !DILocalVariable(name: "topology", arg: 1, scope: !413, file: !2, line: 56, type: !416)
!777 = !{!778, !778, i64 0}
!778 = !{!"any pointer", !779, i64 0}
!779 = !{!"omnipotent char", !780, i64 0}
!780 = !{!"Simple C/C++ TBAA"}
!781 = !DILocation(line: 56, column: 59, scope: !413)
!782 = !DILocation(line: 58, column: 26, scope: !413)
!783 = !DILocation(line: 58, column: 36, scope: !413)
!784 = !DILocation(line: 58, column: 46, scope: !413)
!785 = !{!786, !778, i64 712}
!786 = !{!"hwloc_topology", !787, i64 0, !787, i64 4, !787, i64 8, !778, i64 16, !778, i64 24, !788, i64 32, !779, i64 40, !779, i64 120, !787, i64 200, !787, i64 204, !787, i64 208, !787, i64 212, !778, i64 216, !788, i64 224, !778, i64 232, !788, i64 240, !779, i64 248, !778, i64 440, !778, i64 448, !789, i64 456, !790, i64 648, !778, i64 680, !778, i64 688, !787, i64 696, !778, i64 704, !778, i64 712, !787, i64 720, !787, i64 724, !778, i64 728, !787, i64 736, !787, i64 740, !778, i64 744, !787, i64 752, !787, i64 756, !787, i64 760, !779, i64 764, !787, i64 784, !778, i64 792, !778, i64 800, !787, i64 808, !787, i64 812, !778, i64 816, !791, i64 824, !787, i64 848, !787, i64 852, !778, i64 856, !788, i64 864, !787, i64 872, !778, i64 880, !778, i64 888, !778, i64 896}
!787 = !{!"int", !779, i64 0}
!788 = !{!"long", !779, i64 0}
!789 = !{!"hwloc_binding_hooks", !778, i64 0, !778, i64 8, !778, i64 16, !778, i64 24, !778, i64 32, !778, i64 40, !778, i64 48, !778, i64 56, !778, i64 64, !778, i64 72, !778, i64 80, !778, i64 88, !778, i64 96, !778, i64 104, !778, i64 112, !778, i64 120, !778, i64 128, !778, i64 136, !778, i64 144, !778, i64 152, !778, i64 160, !778, i64 168, !778, i64 176, !778, i64 184}
!790 = !{!"hwloc_topology_support", !778, i64 0, !778, i64 8, !778, i64 16, !778, i64 24}
!791 = !{!"hwloc_numanode_attr_s", !788, i64 0, !787, i64 8, !778, i64 16}
!792 = !DILocation(line: 58, column: 3, scope: !413)
!793 = !DILocation(line: 58, column: 13, scope: !413)
!794 = !DILocation(line: 58, column: 24, scope: !413)
!795 = !{!786, !778, i64 704}
!796 = !DILocation(line: 59, column: 3, scope: !413)
!797 = !DILocation(line: 59, column: 13, scope: !413)
!798 = !DILocation(line: 59, column: 26, scope: !413)
!799 = !{!786, !787, i64 720}
!800 = !DILocation(line: 60, column: 1, scope: !413)
!801 = distinct !DISubprogram(name: "hwloc_internal_distances_prepare", scope: !2, file: !2, line: 63, type: !414, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !802)
!802 = !{!803, !804, !805, !806}
!803 = !DILocalVariable(name: "topology", arg: 1, scope: !801, file: !2, line: 63, type: !416)
!804 = !DILocalVariable(name: "env", scope: !801, file: !2, line: 65, type: !277)
!805 = !DILocalVariable(name: "__old_locale", scope: !801, file: !2, line: 66, type: !234)
!806 = !DILocalVariable(name: "__new_locale", scope: !801, file: !2, line: 66, type: !234)
!807 = !DILocation(line: 63, column: 62, scope: !801)
!808 = !DILocation(line: 65, column: 3, scope: !801)
!809 = !DILocation(line: 65, column: 9, scope: !801)
!810 = !DILocation(line: 66, column: 3, scope: !801)
!811 = !DILocation(line: 68, column: 3, scope: !801)
!812 = !DILocation(line: 68, column: 13, scope: !801)
!813 = !DILocation(line: 68, column: 22, scope: !801)
!814 = !{!786, !787, i64 752}
!815 = !DILocation(line: 69, column: 7, scope: !816)
!816 = distinct !DILexicalBlock(scope: !801, file: !2, line: 69, column: 7)
!817 = !DILocation(line: 69, column: 17, scope: !816)
!818 = !{!779, !779, i64 0}
!819 = !DILocation(line: 69, column: 46, scope: !816)
!820 = !DILocation(line: 69, column: 7, scope: !801)
!821 = !DILocation(line: 70, column: 5, scope: !816)
!822 = !DILocation(line: 70, column: 15, scope: !816)
!823 = !DILocation(line: 70, column: 24, scope: !816)
!824 = !DILocation(line: 71, column: 9, scope: !801)
!825 = !DILocation(line: 71, column: 7, scope: !801)
!826 = !DILocation(line: 72, column: 7, scope: !827)
!827 = distinct !DILexicalBlock(scope: !801, file: !2, line: 72, column: 7)
!828 = !DILocation(line: 72, column: 11, scope: !827)
!829 = !DILocation(line: 72, column: 20, scope: !827)
!830 = !DILocation(line: 72, column: 15, scope: !827)
!831 = !DILocation(line: 72, column: 7, scope: !801)
!832 = !DILocation(line: 73, column: 5, scope: !827)
!833 = !DILocation(line: 73, column: 15, scope: !827)
!834 = !DILocation(line: 73, column: 24, scope: !827)
!835 = !DILocation(line: 75, column: 7, scope: !836)
!836 = distinct !DILexicalBlock(scope: !801, file: !2, line: 75, column: 7)
!837 = !DILocation(line: 75, column: 17, scope: !836)
!838 = !DILocation(line: 75, column: 7, scope: !801)
!839 = !DILocation(line: 76, column: 5, scope: !840)
!840 = distinct !DILexicalBlock(scope: !836, file: !2, line: 75, column: 27)
!841 = !DILocation(line: 76, column: 15, scope: !840)
!842 = !DILocation(line: 76, column: 37, scope: !840)
!843 = !{!786, !787, i64 784}
!844 = !DILocation(line: 79, column: 5, scope: !840)
!845 = !DILocation(line: 79, column: 15, scope: !840)
!846 = !DILocation(line: 79, column: 38, scope: !840)
!847 = !{!848, !848, i64 0}
!848 = !{!"float", !779, i64 0}
!849 = !DILocation(line: 80, column: 5, scope: !840)
!850 = !DILocation(line: 80, column: 15, scope: !840)
!851 = !DILocation(line: 80, column: 38, scope: !840)
!852 = !DILocation(line: 81, column: 5, scope: !840)
!853 = !DILocation(line: 81, column: 15, scope: !840)
!854 = !DILocation(line: 81, column: 38, scope: !840)
!855 = !DILocation(line: 82, column: 5, scope: !840)
!856 = !DILocation(line: 82, column: 15, scope: !840)
!857 = !DILocation(line: 82, column: 38, scope: !840)
!858 = !DILocation(line: 83, column: 5, scope: !840)
!859 = !DILocation(line: 83, column: 15, scope: !840)
!860 = !DILocation(line: 83, column: 38, scope: !840)
!861 = !DILocation(line: 84, column: 5, scope: !840)
!862 = !DILocation(line: 84, column: 15, scope: !840)
!863 = !DILocation(line: 84, column: 37, scope: !840)
!864 = !{!786, !787, i64 760}
!865 = !DILocation(line: 86, column: 5, scope: !840)
!866 = !DILocation(line: 86, column: 5, scope: !867)
!867 = distinct !DILexicalBlock(scope: !840, file: !2, line: 86, column: 5)
!868 = !DILocation(line: 86, column: 5, scope: !869)
!869 = distinct !DILexicalBlock(scope: !867, file: !2, line: 86, column: 5)
!870 = !DILocation(line: 87, column: 11, scope: !840)
!871 = !DILocation(line: 87, column: 9, scope: !840)
!872 = !DILocation(line: 88, column: 10, scope: !873)
!873 = distinct !DILexicalBlock(scope: !840, file: !2, line: 88, column: 9)
!874 = !DILocation(line: 88, column: 9, scope: !840)
!875 = !DILocation(line: 90, column: 7, scope: !876)
!876 = distinct !DILexicalBlock(scope: !873, file: !2, line: 88, column: 15)
!877 = !DILocation(line: 90, column: 17, scope: !876)
!878 = !DILocation(line: 90, column: 39, scope: !876)
!879 = !DILocation(line: 91, column: 5, scope: !876)
!880 = !DILocation(line: 91, column: 23, scope: !881)
!881 = distinct !DILexicalBlock(scope: !873, file: !2, line: 91, column: 16)
!882 = !DILocation(line: 91, column: 16, scope: !881)
!883 = !DILocation(line: 91, column: 16, scope: !873)
!884 = !DILocation(line: 93, column: 7, scope: !885)
!885 = distinct !DILexicalBlock(scope: !881, file: !2, line: 91, column: 36)
!886 = !DILocation(line: 93, column: 17, scope: !885)
!887 = !DILocation(line: 93, column: 39, scope: !885)
!888 = !DILocation(line: 94, column: 55, scope: !885)
!889 = !DILocation(line: 94, column: 50, scope: !885)
!890 = !DILocation(line: 94, column: 42, scope: !885)
!891 = !DILocation(line: 94, column: 7, scope: !885)
!892 = !DILocation(line: 94, column: 17, scope: !885)
!893 = !DILocation(line: 94, column: 40, scope: !885)
!894 = !DILocation(line: 95, column: 5, scope: !885)
!895 = !DILocation(line: 96, column: 5, scope: !840)
!896 = !DILocation(line: 96, column: 5, scope: !897)
!897 = distinct !DILexicalBlock(scope: !898, file: !2, line: 96, column: 5)
!898 = distinct !DILexicalBlock(scope: !840, file: !2, line: 96, column: 5)
!899 = !DILocation(line: 96, column: 5, scope: !898)
!900 = !DILocation(line: 96, column: 5, scope: !901)
!901 = distinct !DILexicalBlock(scope: !897, file: !2, line: 96, column: 5)
!902 = !DILocation(line: 98, column: 5, scope: !840)
!903 = !DILocation(line: 98, column: 15, scope: !840)
!904 = !DILocation(line: 98, column: 32, scope: !840)
!905 = !{!786, !787, i64 756}
!906 = !DILocation(line: 99, column: 11, scope: !840)
!907 = !DILocation(line: 99, column: 9, scope: !840)
!908 = !DILocation(line: 100, column: 9, scope: !909)
!909 = distinct !DILexicalBlock(scope: !840, file: !2, line: 100, column: 9)
!910 = !DILocation(line: 100, column: 9, scope: !840)
!911 = !DILocation(line: 101, column: 41, scope: !909)
!912 = !DILocation(line: 101, column: 36, scope: !909)
!913 = !DILocation(line: 101, column: 7, scope: !909)
!914 = !DILocation(line: 101, column: 17, scope: !909)
!915 = !DILocation(line: 101, column: 34, scope: !909)
!916 = !DILocation(line: 102, column: 3, scope: !840)
!917 = !DILocation(line: 103, column: 1, scope: !801)
!918 = !DISubprogram(name: "getenv", scope: !919, file: !919, line: 641, type: !920, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!919 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!920 = !DISubroutineType(types: !921)
!921 = !{!277, !257}
!922 = distinct !DISubprogram(name: "atoi", scope: !919, file: !919, line: 362, type: !923, scopeLine: 363, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !925)
!923 = !DISubroutineType(types: !924)
!924 = !{!181, !257}
!925 = !{!926}
!926 = !DILocalVariable(name: "__nptr", arg: 1, scope: !922, file: !919, line: 362, type: !257)
!927 = !DILocation(line: 362, column: 1, scope: !922)
!928 = !DILocation(line: 364, column: 24, scope: !922)
!929 = !DILocation(line: 364, column: 16, scope: !922)
!930 = !DILocation(line: 364, column: 10, scope: !922)
!931 = !DILocation(line: 364, column: 3, scope: !922)
!932 = !DISubprogram(name: "newlocale", scope: !933, file: !933, line: 141, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!933 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!934 = !DISubroutineType(types: !935)
!935 = !{!234, !181, !257, !234}
!936 = !DISubprogram(name: "uselocale", scope: !933, file: !933, line: 187, type: !937, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!937 = !DISubroutineType(types: !938)
!938 = !{!234, !234}
!939 = !DISubprogram(name: "strcmp", scope: !940, file: !940, line: 156, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!940 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!941 = !DISubroutineType(types: !942)
!942 = !{!181, !257, !257}
!943 = distinct !DISubprogram(name: "atof", scope: !944, file: !944, line: 25, type: !945, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !948)
!944 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "", checksumkind: CSK_MD5, checksum: "adfe1626ff4efc68ac58c367ff5f206b")
!945 = !DISubroutineType(types: !946)
!946 = !{!947, !257}
!947 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!948 = !{!949}
!949 = !DILocalVariable(name: "__nptr", arg: 1, scope: !943, file: !944, line: 25, type: !257)
!950 = !DILocation(line: 25, column: 1, scope: !943)
!951 = !DILocation(line: 27, column: 18, scope: !943)
!952 = !DILocation(line: 27, column: 10, scope: !943)
!953 = !DILocation(line: 27, column: 3, scope: !943)
!954 = !DISubprogram(name: "freelocale", scope: !933, file: !933, line: 180, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !234}
!957 = distinct !DISubprogram(name: "hwloc_internal_distances_destroy", scope: !2, file: !2, line: 116, type: !414, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !958)
!958 = !{!959, !960, !961}
!959 = !DILocalVariable(name: "topology", arg: 1, scope: !957, file: !2, line: 116, type: !416)
!960 = !DILocalVariable(name: "dist", scope: !957, file: !2, line: 118, type: !609)
!961 = !DILocalVariable(name: "next", scope: !957, file: !2, line: 118, type: !609)
!962 = !DILocation(line: 116, column: 63, scope: !957)
!963 = !DILocation(line: 118, column: 3, scope: !957)
!964 = !DILocation(line: 118, column: 38, scope: !957)
!965 = !DILocation(line: 118, column: 45, scope: !957)
!966 = !DILocation(line: 118, column: 52, scope: !957)
!967 = !DILocation(line: 118, column: 62, scope: !957)
!968 = !DILocation(line: 119, column: 3, scope: !957)
!969 = !DILocation(line: 119, column: 18, scope: !957)
!970 = !DILocation(line: 119, column: 16, scope: !957)
!971 = !DILocation(line: 119, column: 24, scope: !957)
!972 = !DILocation(line: 120, column: 12, scope: !973)
!973 = distinct !DILexicalBlock(scope: !957, file: !2, line: 119, column: 33)
!974 = !DILocation(line: 120, column: 18, scope: !973)
!975 = !{!976, !778, i64 80}
!976 = !{!"hwloc_internal_distances_s", !778, i64 0, !787, i64 8, !779, i64 12, !778, i64 16, !787, i64 24, !778, i64 32, !778, i64 40, !788, i64 48, !787, i64 56, !778, i64 64, !778, i64 72, !778, i64 80}
!977 = !DILocation(line: 120, column: 10, scope: !973)
!978 = !DILocation(line: 121, column: 35, scope: !973)
!979 = !DILocation(line: 121, column: 5, scope: !973)
!980 = distinct !{!980, !968, !981, !982}
!981 = !DILocation(line: 122, column: 3, scope: !957)
!982 = !{!"llvm.loop.mustprogress"}
!983 = !DILocation(line: 123, column: 26, scope: !957)
!984 = !DILocation(line: 123, column: 36, scope: !957)
!985 = !DILocation(line: 123, column: 46, scope: !957)
!986 = !DILocation(line: 123, column: 3, scope: !957)
!987 = !DILocation(line: 123, column: 13, scope: !957)
!988 = !DILocation(line: 123, column: 24, scope: !957)
!989 = !DILocation(line: 124, column: 1, scope: !957)
!990 = distinct !DISubprogram(name: "hwloc_internal_distances_free", scope: !2, file: !2, line: 105, type: !991, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !993)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !609}
!993 = !{!994}
!994 = !DILocalVariable(name: "dist", arg: 1, scope: !990, file: !2, line: 105, type: !609)
!995 = !DILocation(line: 105, column: 78, scope: !990)
!996 = !DILocation(line: 107, column: 8, scope: !990)
!997 = !DILocation(line: 107, column: 14, scope: !990)
!998 = !{!976, !778, i64 0}
!999 = !DILocation(line: 107, column: 3, scope: !990)
!1000 = !DILocation(line: 108, column: 8, scope: !990)
!1001 = !DILocation(line: 108, column: 14, scope: !990)
!1002 = !{!976, !778, i64 16}
!1003 = !DILocation(line: 108, column: 3, scope: !990)
!1004 = !DILocation(line: 109, column: 8, scope: !990)
!1005 = !DILocation(line: 109, column: 14, scope: !990)
!1006 = !{!976, !778, i64 32}
!1007 = !DILocation(line: 109, column: 3, scope: !990)
!1008 = !DILocation(line: 110, column: 8, scope: !990)
!1009 = !DILocation(line: 110, column: 14, scope: !990)
!1010 = !{!976, !778, i64 64}
!1011 = !DILocation(line: 110, column: 3, scope: !990)
!1012 = !DILocation(line: 111, column: 8, scope: !990)
!1013 = !DILocation(line: 111, column: 14, scope: !990)
!1014 = !{!976, !778, i64 40}
!1015 = !DILocation(line: 111, column: 3, scope: !990)
!1016 = !DILocation(line: 112, column: 8, scope: !990)
!1017 = !DILocation(line: 112, column: 3, scope: !990)
!1018 = !DILocation(line: 113, column: 1, scope: !990)
!1019 = distinct !DISubprogram(name: "hwloc_internal_distances_dup", scope: !2, file: !2, line: 186, type: !1020, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !1022)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!181, !416, !416}
!1022 = !{!1023, !1024, !1025, !1026}
!1023 = !DILocalVariable(name: "new", arg: 1, scope: !1019, file: !2, line: 186, type: !416)
!1024 = !DILocalVariable(name: "old", arg: 2, scope: !1019, file: !2, line: 186, type: !416)
!1025 = !DILocalVariable(name: "olddist", scope: !1019, file: !2, line: 188, type: !609)
!1026 = !DILocalVariable(name: "err", scope: !1019, file: !2, line: 189, type: !181)
!1027 = !DILocation(line: 186, column: 57, scope: !1019)
!1028 = !DILocation(line: 186, column: 85, scope: !1019)
!1029 = !DILocation(line: 188, column: 3, scope: !1019)
!1030 = !DILocation(line: 188, column: 38, scope: !1019)
!1031 = !DILocation(line: 189, column: 3, scope: !1019)
!1032 = !DILocation(line: 189, column: 7, scope: !1019)
!1033 = !DILocation(line: 190, column: 23, scope: !1019)
!1034 = !DILocation(line: 190, column: 28, scope: !1019)
!1035 = !DILocation(line: 190, column: 3, scope: !1019)
!1036 = !DILocation(line: 190, column: 8, scope: !1019)
!1037 = !DILocation(line: 190, column: 21, scope: !1019)
!1038 = !DILocation(line: 191, column: 17, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1019, file: !2, line: 191, column: 3)
!1040 = !DILocation(line: 191, column: 22, scope: !1039)
!1041 = !DILocation(line: 191, column: 15, scope: !1039)
!1042 = !DILocation(line: 191, column: 7, scope: !1039)
!1043 = !DILocation(line: 191, column: 34, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1039, file: !2, line: 191, column: 3)
!1045 = !DILocation(line: 191, column: 3, scope: !1039)
!1046 = !DILocation(line: 192, column: 44, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1044, file: !2, line: 191, column: 68)
!1048 = !DILocation(line: 192, column: 49, scope: !1047)
!1049 = !DILocation(line: 192, column: 11, scope: !1047)
!1050 = !DILocation(line: 192, column: 9, scope: !1047)
!1051 = !{!787, !787, i64 0}
!1052 = !DILocation(line: 193, column: 9, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 193, column: 9)
!1054 = !DILocation(line: 193, column: 13, scope: !1053)
!1055 = !DILocation(line: 193, column: 9, scope: !1047)
!1056 = !DILocation(line: 194, column: 14, scope: !1053)
!1057 = !DILocation(line: 194, column: 7, scope: !1053)
!1058 = !DILocation(line: 195, column: 3, scope: !1047)
!1059 = !DILocation(line: 191, column: 53, scope: !1044)
!1060 = !DILocation(line: 191, column: 62, scope: !1044)
!1061 = !DILocation(line: 191, column: 51, scope: !1044)
!1062 = !DILocation(line: 191, column: 3, scope: !1044)
!1063 = distinct !{!1063, !1045, !1064, !982}
!1064 = !DILocation(line: 195, column: 3, scope: !1039)
!1065 = !DILocation(line: 196, column: 3, scope: !1019)
!1066 = !DILocation(line: 197, column: 1, scope: !1019)
!1067 = distinct !DISubprogram(name: "hwloc_internal_distances_dup_one", scope: !2, file: !2, line: 126, type: !1068, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !1070)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!181, !416, !609}
!1070 = !{!1071, !1072, !1073, !1074, !1075}
!1071 = !DILocalVariable(name: "new", arg: 1, scope: !1067, file: !2, line: 126, type: !416)
!1072 = !DILocalVariable(name: "olddist", arg: 2, scope: !1067, file: !2, line: 126, type: !609)
!1073 = !DILocalVariable(name: "tma", scope: !1067, file: !2, line: 128, type: !735)
!1074 = !DILocalVariable(name: "newdist", scope: !1067, file: !2, line: 129, type: !609)
!1075 = !DILocalVariable(name: "nbobjs", scope: !1067, file: !2, line: 130, type: !134)
!1076 = !DILocation(line: 126, column: 68, scope: !1067)
!1077 = !DILocation(line: 126, column: 108, scope: !1067)
!1078 = !DILocation(line: 128, column: 3, scope: !1067)
!1079 = !DILocation(line: 128, column: 21, scope: !1067)
!1080 = !DILocation(line: 128, column: 27, scope: !1067)
!1081 = !DILocation(line: 128, column: 32, scope: !1067)
!1082 = !{!786, !778, i64 816}
!1083 = !DILocation(line: 129, column: 3, scope: !1067)
!1084 = !DILocation(line: 129, column: 38, scope: !1067)
!1085 = !DILocation(line: 130, column: 3, scope: !1067)
!1086 = !DILocation(line: 130, column: 12, scope: !1067)
!1087 = !DILocation(line: 130, column: 21, scope: !1067)
!1088 = !DILocation(line: 130, column: 30, scope: !1067)
!1089 = !{!976, !787, i64 24}
!1090 = !DILocation(line: 132, column: 30, scope: !1067)
!1091 = !DILocation(line: 132, column: 13, scope: !1067)
!1092 = !DILocation(line: 132, column: 11, scope: !1067)
!1093 = !DILocation(line: 133, column: 8, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1067, file: !2, line: 133, column: 7)
!1095 = !DILocation(line: 133, column: 7, scope: !1067)
!1096 = !DILocation(line: 134, column: 5, scope: !1094)
!1097 = !DILocation(line: 135, column: 7, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1067, file: !2, line: 135, column: 7)
!1099 = !DILocation(line: 135, column: 16, scope: !1098)
!1100 = !DILocation(line: 135, column: 7, scope: !1067)
!1101 = !DILocation(line: 136, column: 38, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1098, file: !2, line: 135, column: 22)
!1103 = !DILocation(line: 136, column: 43, scope: !1102)
!1104 = !DILocation(line: 136, column: 52, scope: !1102)
!1105 = !DILocation(line: 136, column: 21, scope: !1102)
!1106 = !DILocation(line: 136, column: 5, scope: !1102)
!1107 = !DILocation(line: 136, column: 14, scope: !1102)
!1108 = !DILocation(line: 136, column: 19, scope: !1102)
!1109 = !DILocation(line: 137, column: 10, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1102, file: !2, line: 137, column: 9)
!1111 = !DILocation(line: 137, column: 19, scope: !1110)
!1112 = !DILocation(line: 137, column: 9, scope: !1102)
!1113 = !DILocation(line: 138, column: 7, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !2, line: 138, column: 7)
!1115 = distinct !DILexicalBlock(scope: !1116, file: !2, line: 138, column: 7)
!1116 = distinct !DILexicalBlock(scope: !1110, file: !2, line: 137, column: 25)
!1117 = !{!1118, !787, i64 16}
!1118 = !{!"hwloc_tma", !778, i64 0, !778, i64 8, !787, i64 16}
!1119 = !DILocation(line: 138, column: 7, scope: !1115)
!1120 = !DILocation(line: 139, column: 37, scope: !1116)
!1121 = !DILocation(line: 139, column: 7, scope: !1116)
!1122 = !DILocation(line: 140, column: 7, scope: !1116)
!1123 = !DILocation(line: 142, column: 3, scope: !1102)
!1124 = !DILocation(line: 143, column: 5, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1098, file: !2, line: 142, column: 10)
!1126 = !DILocation(line: 143, column: 14, scope: !1125)
!1127 = !DILocation(line: 143, column: 19, scope: !1125)
!1128 = !DILocation(line: 146, column: 7, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1067, file: !2, line: 146, column: 7)
!1130 = !DILocation(line: 146, column: 16, scope: !1129)
!1131 = !DILocation(line: 146, column: 7, scope: !1067)
!1132 = !DILocation(line: 147, column: 49, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1129, file: !2, line: 146, column: 33)
!1134 = !DILocation(line: 147, column: 54, scope: !1133)
!1135 = !DILocation(line: 147, column: 61, scope: !1133)
!1136 = !DILocation(line: 147, column: 32, scope: !1133)
!1137 = !DILocation(line: 147, column: 5, scope: !1133)
!1138 = !DILocation(line: 147, column: 14, scope: !1133)
!1139 = !DILocation(line: 147, column: 30, scope: !1133)
!1140 = !DILocation(line: 148, column: 10, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1133, file: !2, line: 148, column: 9)
!1142 = !DILocation(line: 148, column: 19, scope: !1141)
!1143 = !DILocation(line: 148, column: 9, scope: !1133)
!1144 = !DILocation(line: 149, column: 7, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1146, file: !2, line: 149, column: 7)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !2, line: 149, column: 7)
!1147 = distinct !DILexicalBlock(scope: !1141, file: !2, line: 148, column: 36)
!1148 = !DILocation(line: 149, column: 7, scope: !1146)
!1149 = !DILocation(line: 150, column: 37, scope: !1147)
!1150 = !DILocation(line: 150, column: 7, scope: !1147)
!1151 = !DILocation(line: 151, column: 7, scope: !1147)
!1152 = !DILocation(line: 153, column: 12, scope: !1133)
!1153 = !DILocation(line: 153, column: 21, scope: !1133)
!1154 = !DILocation(line: 153, column: 38, scope: !1133)
!1155 = !DILocation(line: 153, column: 47, scope: !1133)
!1156 = !DILocation(line: 153, column: 64, scope: !1133)
!1157 = !DILocation(line: 153, column: 71, scope: !1133)
!1158 = !DILocation(line: 153, column: 5, scope: !1133)
!1159 = !DILocation(line: 154, column: 3, scope: !1133)
!1160 = !DILocation(line: 155, column: 5, scope: !1129)
!1161 = !DILocation(line: 155, column: 14, scope: !1129)
!1162 = !DILocation(line: 155, column: 30, scope: !1129)
!1163 = !DILocation(line: 156, column: 26, scope: !1067)
!1164 = !DILocation(line: 156, column: 35, scope: !1067)
!1165 = !{!976, !779, i64 12}
!1166 = !DILocation(line: 156, column: 3, scope: !1067)
!1167 = !DILocation(line: 156, column: 12, scope: !1067)
!1168 = !DILocation(line: 156, column: 24, scope: !1067)
!1169 = !DILocation(line: 157, column: 21, scope: !1067)
!1170 = !DILocation(line: 157, column: 3, scope: !1067)
!1171 = !DILocation(line: 157, column: 12, scope: !1067)
!1172 = !DILocation(line: 157, column: 19, scope: !1067)
!1173 = !DILocation(line: 158, column: 19, scope: !1067)
!1174 = !DILocation(line: 158, column: 28, scope: !1067)
!1175 = !{!976, !788, i64 48}
!1176 = !DILocation(line: 158, column: 3, scope: !1067)
!1177 = !DILocation(line: 158, column: 12, scope: !1067)
!1178 = !DILocation(line: 158, column: 17, scope: !1067)
!1179 = !DILocation(line: 159, column: 17, scope: !1067)
!1180 = !DILocation(line: 159, column: 26, scope: !1067)
!1181 = !{!976, !787, i64 8}
!1182 = !DILocation(line: 159, column: 3, scope: !1067)
!1183 = !DILocation(line: 159, column: 12, scope: !1067)
!1184 = !DILocation(line: 159, column: 15, scope: !1067)
!1185 = !DILocation(line: 161, column: 39, scope: !1067)
!1186 = !DILocation(line: 161, column: 44, scope: !1067)
!1187 = !DILocation(line: 161, column: 51, scope: !1067)
!1188 = !DILocation(line: 161, column: 22, scope: !1067)
!1189 = !DILocation(line: 161, column: 3, scope: !1067)
!1190 = !DILocation(line: 161, column: 12, scope: !1067)
!1191 = !DILocation(line: 161, column: 20, scope: !1067)
!1192 = !DILocation(line: 162, column: 36, scope: !1067)
!1193 = !DILocation(line: 162, column: 41, scope: !1067)
!1194 = !DILocation(line: 162, column: 48, scope: !1067)
!1195 = !DILocation(line: 162, column: 19, scope: !1067)
!1196 = !DILocation(line: 162, column: 3, scope: !1067)
!1197 = !DILocation(line: 162, column: 12, scope: !1067)
!1198 = !DILocation(line: 162, column: 17, scope: !1067)
!1199 = !DILocation(line: 163, column: 21, scope: !1067)
!1200 = !DILocation(line: 163, column: 30, scope: !1067)
!1201 = !{!976, !787, i64 56}
!1202 = !DILocation(line: 163, column: 37, scope: !1067)
!1203 = !DILocation(line: 163, column: 3, scope: !1067)
!1204 = !DILocation(line: 163, column: 12, scope: !1067)
!1205 = !DILocation(line: 163, column: 19, scope: !1067)
!1206 = !DILocation(line: 164, column: 38, scope: !1067)
!1207 = !DILocation(line: 164, column: 43, scope: !1067)
!1208 = !DILocation(line: 164, column: 50, scope: !1067)
!1209 = !DILocation(line: 164, column: 49, scope: !1067)
!1210 = !DILocation(line: 164, column: 57, scope: !1067)
!1211 = !DILocation(line: 164, column: 21, scope: !1067)
!1212 = !DILocation(line: 164, column: 3, scope: !1067)
!1213 = !DILocation(line: 164, column: 12, scope: !1067)
!1214 = !DILocation(line: 164, column: 19, scope: !1067)
!1215 = !DILocation(line: 165, column: 8, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1067, file: !2, line: 165, column: 7)
!1217 = !DILocation(line: 165, column: 17, scope: !1216)
!1218 = !DILocation(line: 165, column: 25, scope: !1216)
!1219 = !DILocation(line: 165, column: 29, scope: !1216)
!1220 = !DILocation(line: 165, column: 38, scope: !1216)
!1221 = !DILocation(line: 165, column: 43, scope: !1216)
!1222 = !DILocation(line: 165, column: 47, scope: !1216)
!1223 = !DILocation(line: 165, column: 56, scope: !1216)
!1224 = !DILocation(line: 165, column: 7, scope: !1067)
!1225 = !DILocation(line: 166, column: 5, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1227, file: !2, line: 166, column: 5)
!1227 = distinct !DILexicalBlock(scope: !1228, file: !2, line: 166, column: 5)
!1228 = distinct !DILexicalBlock(scope: !1216, file: !2, line: 165, column: 64)
!1229 = !DILocation(line: 166, column: 5, scope: !1227)
!1230 = !DILocation(line: 167, column: 35, scope: !1228)
!1231 = !DILocation(line: 167, column: 5, scope: !1228)
!1232 = !DILocation(line: 168, column: 5, scope: !1228)
!1233 = !DILocation(line: 171, column: 10, scope: !1067)
!1234 = !DILocation(line: 171, column: 19, scope: !1067)
!1235 = !DILocation(line: 171, column: 28, scope: !1067)
!1236 = !DILocation(line: 171, column: 37, scope: !1067)
!1237 = !DILocation(line: 171, column: 46, scope: !1067)
!1238 = !DILocation(line: 171, column: 53, scope: !1067)
!1239 = !DILocation(line: 171, column: 3, scope: !1067)
!1240 = !DILocation(line: 172, column: 10, scope: !1067)
!1241 = !DILocation(line: 172, column: 19, scope: !1067)
!1242 = !DILocation(line: 172, column: 27, scope: !1067)
!1243 = !DILocation(line: 172, column: 36, scope: !1067)
!1244 = !DILocation(line: 172, column: 44, scope: !1067)
!1245 = !DILocation(line: 172, column: 51, scope: !1067)
!1246 = !DILocation(line: 172, column: 50, scope: !1067)
!1247 = !DILocation(line: 172, column: 58, scope: !1067)
!1248 = !DILocation(line: 172, column: 3, scope: !1067)
!1249 = !DILocation(line: 174, column: 3, scope: !1067)
!1250 = !DILocation(line: 174, column: 12, scope: !1067)
!1251 = !DILocation(line: 174, column: 17, scope: !1067)
!1252 = !DILocation(line: 175, column: 19, scope: !1067)
!1253 = !DILocation(line: 175, column: 24, scope: !1067)
!1254 = !DILocation(line: 175, column: 3, scope: !1067)
!1255 = !DILocation(line: 175, column: 12, scope: !1067)
!1256 = !DILocation(line: 175, column: 17, scope: !1067)
!1257 = !{!976, !778, i64 72}
!1258 = !DILocation(line: 176, column: 7, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1067, file: !2, line: 176, column: 7)
!1260 = !DILocation(line: 176, column: 12, scope: !1259)
!1261 = !DILocation(line: 176, column: 7, scope: !1067)
!1262 = !DILocation(line: 177, column: 28, scope: !1259)
!1263 = !DILocation(line: 177, column: 5, scope: !1259)
!1264 = !DILocation(line: 177, column: 10, scope: !1259)
!1265 = !DILocation(line: 177, column: 21, scope: !1259)
!1266 = !DILocation(line: 177, column: 26, scope: !1259)
!1267 = !DILocation(line: 179, column: 23, scope: !1259)
!1268 = !DILocation(line: 179, column: 5, scope: !1259)
!1269 = !DILocation(line: 179, column: 10, scope: !1259)
!1270 = !DILocation(line: 179, column: 21, scope: !1259)
!1271 = !DILocation(line: 180, column: 20, scope: !1067)
!1272 = !DILocation(line: 180, column: 3, scope: !1067)
!1273 = !DILocation(line: 180, column: 8, scope: !1067)
!1274 = !DILocation(line: 180, column: 18, scope: !1067)
!1275 = !DILocation(line: 182, column: 3, scope: !1067)
!1276 = !DILocation(line: 183, column: 1, scope: !1067)
!1277 = distinct !DISubprogram(name: "hwloc_distances_remove", scope: !2, file: !2, line: 203, type: !545, scopeLine: 204, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !1278)
!1278 = !{!1279}
!1279 = !DILocalVariable(name: "topology", arg: 1, scope: !1277, file: !2, line: 203, type: !464)
!1280 = !DILocation(line: 203, column: 45, scope: !1277)
!1281 = !DILocation(line: 205, column: 8, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1277, file: !2, line: 205, column: 7)
!1283 = !DILocation(line: 205, column: 18, scope: !1282)
!1284 = !{!786, !787, i64 204}
!1285 = !DILocation(line: 205, column: 7, scope: !1277)
!1286 = !DILocation(line: 206, column: 5, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1282, file: !2, line: 205, column: 29)
!1288 = !DILocation(line: 206, column: 11, scope: !1287)
!1289 = !DILocation(line: 207, column: 5, scope: !1287)
!1290 = !DILocation(line: 209, column: 7, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1277, file: !2, line: 209, column: 7)
!1292 = !DILocation(line: 209, column: 17, scope: !1291)
!1293 = !{!786, !778, i64 232}
!1294 = !DILocation(line: 209, column: 7, scope: !1277)
!1295 = !DILocation(line: 210, column: 5, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1291, file: !2, line: 209, column: 37)
!1297 = !DILocation(line: 210, column: 11, scope: !1296)
!1298 = !DILocation(line: 211, column: 5, scope: !1296)
!1299 = !DILocation(line: 213, column: 36, scope: !1277)
!1300 = !DILocation(line: 213, column: 3, scope: !1277)
!1301 = !DILocation(line: 214, column: 3, scope: !1277)
!1302 = !DILocation(line: 215, column: 1, scope: !1277)
!1303 = !DISubprogram(name: "__errno_location", scope: !1304, file: !1304, line: 37, type: !1305, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1304 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!1307}
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!1308 = distinct !DISubprogram(name: "hwloc_distances_remove_by_depth", scope: !2, file: !2, line: 217, type: !1309, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !1311)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!181, !464, !181}
!1311 = !{!1312, !1313, !1314, !1315, !1316}
!1312 = !DILocalVariable(name: "topology", arg: 1, scope: !1308, file: !2, line: 217, type: !464)
!1313 = !DILocalVariable(name: "depth", arg: 2, scope: !1308, file: !2, line: 217, type: !181)
!1314 = !DILocalVariable(name: "dist", scope: !1308, file: !2, line: 219, type: !609)
!1315 = !DILocalVariable(name: "next", scope: !1308, file: !2, line: 219, type: !609)
!1316 = !DILocalVariable(name: "type", scope: !1308, file: !2, line: 220, type: !260)
!1317 = !DILocation(line: 217, column: 54, scope: !1308)
!1318 = !DILocation(line: 217, column: 68, scope: !1308)
