; ModuleID = 'samples/413.bc'
source_filename = "src/http/modules/ngx_http_charset_filter_module.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_http_module_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_command_s = type { %struct.ngx_str_t, i64, ptr, i64, i64, ptr }
%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_conf_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr }
%struct.ngx_http_conf_ctx_t = type { ptr, ptr, ptr }
%struct.ngx_http_charset_main_conf_t = type { %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }
%struct.ngx_http_charset_recode_t = type { i64, i64 }
%struct.ngx_http_charset_tables_t = type { i64, i64, ptr, ptr }
%struct.ngx_log_s = type { i64, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_http_charset_t = type { ptr, %struct.ngx_str_t, i24 }
%struct.ngx_http_charset_loc_conf_t = type { i64, i64, i64, %struct.ngx_hash_t, ptr }
%struct.ngx_hash_t = type { ptr, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 197, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/http/modules/ngx_http_charset_filter_module.c", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "e83b31b02dbc9949ec75523a6fb987b7")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 41)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "ngx_http_charset_filter_module_ctx", scope: !9, file: !2, line: 181, type: !2002, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !10, globals: !47, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !16, !17, !26, !31, !33, !35, !36, !40, !45, !37}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !12, line: 79, baseType: !13)
!12 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !14, line: 90, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!15 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !19, line: 21, baseType: !20)
!19 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f0f323751ab5b63196467d991a0424cd")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 17, size: 192, elements: !21)
!21 = !{!22, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !20, file: !19, line: 18, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !20, file: !19, line: 19, baseType: !23, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !20, file: !19, line: 20, baseType: !23, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !27, line: 87, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !29, line: 153, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!30 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !32, line: 16, baseType: !16)
!32 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6fc45f3cccbbf41b239dcfa9e2c5b7b1")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 29, baseType: !15)
!34 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !27, line: 33, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !29, line: 31, baseType: !39)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !12, line: 78, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !43, line: 267, baseType: !44)
!43 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !29, line: 207, baseType: !30)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!47 = !{!0, !48, !7, !611, !616, !1900, !1905, !1911, !1916, !1921, !1926, !1931, !1936, !1941, !1946, !1949, !1952, !1957, !1959, !1961, !1966, !1971, !1976, !1979, !1982, !1987, !1992, !1997}
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "ngx_http_charset_filter_module", scope: !9, file: !2, line: 196, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !51, line: 15, baseType: !52)
!51 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1c4d8383f329aa1de050d17038ecb169")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !53, line: 222, size: 1600, elements: !54)
!53 = !DIFile(filename: "src/core/ngx_module.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1b2032f87974a892f93f4098e8fc0619")
!54 = !{!55, !56, !57, !59, !60, !61, !62, !63, !64, !586, !587, !591, !595, !596, !597, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !52, file: !53, line: 223, baseType: !11, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !52, file: !53, line: 224, baseType: !11, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !53, line: 226, baseType: !58, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !52, file: !53, line: 228, baseType: !11, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !52, file: !53, line: 229, baseType: !11, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !52, file: !53, line: 231, baseType: !11, size: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !52, file: !53, line: 232, baseType: !45, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !52, file: !53, line: 234, baseType: !16, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !52, file: !53, line: 235, baseType: !65, size: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !51, line: 22, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !68, line: 77, size: 448, elements: !69)
!68 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6ae6b72e2fd6bbb6ecc9de2e6386072c")
!69 = !{!70, !77, !78, !583, !584, !585}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !68, line: 78, baseType: !71, size: 128)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !72, line: 19, baseType: !73)
!72 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "aecf67ab89c624000ba2e2684dbcfdc8")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 16, size: 128, elements: !74)
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, file: !72, line: 17, baseType: !33, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !72, line: 18, baseType: !36, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !68, line: 79, baseType: !11, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !67, file: !68, line: 80, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!58, !82, !65, !16}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !51, line: 16, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !68, line: 116, size: 768, elements: !85)
!85 = !{!86, !87, !258, !565, !566, !567, !576, !577, !578, !579, !580, !582}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !68, line: 117, baseType: !58, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !84, file: !68, line: 118, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !90, line: 22, baseType: !91)
!90 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 16, size: 320, elements: !92)
!92 = !{!93, !94, !95, !96, !97}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !91, file: !90, line: 17, baseType: !16, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !91, file: !90, line: 18, baseType: !11, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !91, file: !90, line: 19, baseType: !33, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !91, file: !90, line: 20, baseType: !11, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !91, file: !90, line: 21, baseType: !98, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !51, line: 18, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !101, line: 57, size: 640, elements: !102)
!101 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!102 = !{!103, !111, !112, !113, !238, !245, !257}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !100, file: !101, line: 58, baseType: !104, size: 256)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !101, line: 54, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 49, size: 256, elements: !106)
!106 = !{!107, !108, !109, !110}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !105, file: !101, line: 50, baseType: !36, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !105, file: !101, line: 51, baseType: !36, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !101, line: 52, baseType: !98, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !105, file: !101, line: 53, baseType: !11, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !100, file: !101, line: 59, baseType: !33, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !100, file: !101, line: 60, baseType: !98, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !100, file: !101, line: 61, baseType: !114, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !51, line: 19, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !32, line: 59, size: 128, elements: !117)
!117 = !{!118, !237}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !116, file: !32, line: 60, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !32, line: 18, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !32, line: 20, size: 640, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !121, file: !32, line: 21, baseType: !36, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !121, file: !32, line: 22, baseType: !36, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !121, file: !32, line: 23, baseType: !26, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !121, file: !32, line: 24, baseType: !26, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !121, file: !32, line: 26, baseType: !36, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !121, file: !32, line: 27, baseType: !36, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !121, file: !32, line: 28, baseType: !31, size: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !121, file: !32, line: 29, baseType: !131, size: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !51, line: 23, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !134, line: 16, size: 1600, elements: !135)
!134 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!135 = !{!136, !140, !141, !181, !182, !183, !222, !223}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !133, file: !134, line: 17, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !138, line: 16, baseType: !139)
!138 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "7b9a751e8c1ad1afef5467d60ed94e69")
!139 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !133, file: !134, line: 18, baseType: !71, size: 128, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !133, file: !134, line: 19, baseType: !142, size: 1152, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !138, line: 17, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !144, line: 26, size: 1152, elements: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!145 = !{!146, !148, !150, !152, !155, !157, !159, !160, !161, !163, !165, !167, !175, !176, !177}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !143, file: !144, line: 31, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !29, line: 145, baseType: !15)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !143, file: !144, line: 36, baseType: !149, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !29, line: 148, baseType: !15)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !143, file: !144, line: 44, baseType: !151, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !29, line: 151, baseType: !15)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !143, file: !144, line: 45, baseType: !153, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !29, line: 150, baseType: !154)
!154 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !143, file: !144, line: 47, baseType: !156, size: 32, offset: 224)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !29, line: 146, baseType: !154)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !143, file: !144, line: 48, baseType: !158, size: 32, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !29, line: 147, baseType: !154)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !143, file: !144, line: 50, baseType: !139, size: 32, offset: 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !143, file: !144, line: 52, baseType: !147, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !143, file: !144, line: 57, baseType: !162, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !29, line: 152, baseType: !30)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !143, file: !144, line: 61, baseType: !164, size: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !29, line: 175, baseType: !30)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !143, file: !144, line: 63, baseType: !166, size: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !29, line: 180, baseType: !30)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !143, file: !144, line: 74, baseType: !168, size: 128, offset: 576)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !169, line: 11, size: 128, elements: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !168, file: !169, line: 16, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !29, line: 160, baseType: !30)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !168, file: !169, line: 21, baseType: !174, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !29, line: 197, baseType: !30)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !143, file: !144, line: 75, baseType: !168, size: 128, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !143, file: !144, line: 76, baseType: !168, size: 128, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !143, file: !144, line: 89, baseType: !178, size: 192, offset: 960)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 192, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 3)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !133, file: !134, line: 21, baseType: !26, size: 64, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !133, file: !134, line: 22, baseType: !26, size: 64, offset: 1408)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !133, file: !134, line: 24, baseType: !184, size: 64, offset: 1472)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !51, line: 20, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !187, line: 50, size: 640, elements: !188)
!187 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f35895306f847777914ce99ffeccfabd")
!188 = !{!189, !190, !202, !205, !208, !213, !214, !219, !220, !221}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !186, file: !187, line: 51, baseType: !11, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !186, file: !187, line: 52, baseType: !191, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !51, line: 21, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !68, line: 89, size: 320, elements: !194)
!194 = !{!195, !196, !197, !201}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !193, file: !68, line: 90, baseType: !137, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !193, file: !68, line: 91, baseType: !71, size: 128, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !193, file: !68, line: 93, baseType: !198, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !191, !184}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !193, file: !68, line: 94, baseType: !16, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !186, file: !187, line: 54, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !204, line: 98, baseType: !15)
!204 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "eac8f0294f941da9268c3a72c9fca0e1")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !186, file: !187, line: 56, baseType: !206, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !207, line: 10, baseType: !172)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !186, file: !187, line: 58, baseType: !209, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !187, line: 45, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!36, !184, !36, !33}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !187, line: 59, baseType: !16, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !186, file: !187, line: 61, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !187, line: 46, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !184, !11, !36, !33}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !186, file: !187, line: 62, baseType: !16, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !186, file: !187, line: 70, baseType: !58, size: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !187, line: 72, baseType: !184, size: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !133, file: !134, line: 37, baseType: !154, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !133, file: !134, line: 38, baseType: !154, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !121, file: !32, line: 30, baseType: !119, size: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !121, file: !32, line: 34, baseType: !154, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !121, file: !32, line: 40, baseType: !154, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !121, file: !32, line: 43, baseType: !154, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !121, file: !32, line: 45, baseType: !154, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !121, file: !32, line: 46, baseType: !154, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !121, file: !32, line: 47, baseType: !154, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !121, file: !32, line: 48, baseType: !154, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !121, file: !32, line: 49, baseType: !154, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !121, file: !32, line: 50, baseType: !154, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !121, file: !32, line: 52, baseType: !154, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !121, file: !32, line: 53, baseType: !154, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !121, file: !32, line: 55, baseType: !139, size: 32, offset: 608)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !116, file: !32, line: 61, baseType: !114, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !100, file: !101, line: 62, baseType: !239, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !101, line: 41, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !101, line: 43, size: 128, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !101, line: 44, baseType: !239, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !241, file: !101, line: 45, baseType: !16, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !100, file: !101, line: 63, baseType: !246, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !101, line: 32, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !101, line: 34, size: 192, elements: !249)
!249 = !{!250, !255, !256}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !248, file: !101, line: 35, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !101, line: 30, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !16}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !101, line: 36, baseType: !16, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !101, line: 37, baseType: !246, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !100, file: !101, line: 64, baseType: !184, size: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !84, file: !68, line: 120, baseType: !259, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !51, line: 17, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !262, line: 47, size: 5184, elements: !263)
!262 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "084646d0d3ecf791b89c14281fd46376")
!263 = !{!264, !267, !268, !269, !270, !271, !514, !515, !516, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !563, !564}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !261, file: !262, line: 48, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !261, file: !262, line: 49, baseType: !98, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !261, file: !262, line: 51, baseType: !184, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !261, file: !262, line: 52, baseType: !185, size: 640, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !261, file: !262, line: 54, baseType: !11, size: 64, offset: 832)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !261, file: !262, line: 56, baseType: !272, size: 64, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !51, line: 26, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !276, line: 124, size: 1920, elements: !277)
!276 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf513a87e959064e14502903e9282b0e")
!277 = !{!278, !279, !336, !337, !340, !348, !350, !355, !360, !438, !439, !440, !441, !442, !443, !444, !445, !446, !452, !490, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !276, line: 125, baseType: !16, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !275, file: !276, line: 126, baseType: !280, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !51, line: 24, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !283, line: 30, size: 768, elements: !284)
!283 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c79f651cc4aca504d9d912404beb8bf3")
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !313, !314, !315, !328}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !282, file: !283, line: 31, baseType: !16, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !282, file: !283, line: 33, baseType: !154, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !282, file: !283, line: 35, baseType: !154, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !282, file: !283, line: 38, baseType: !154, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !282, file: !283, line: 44, baseType: !154, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !282, file: !283, line: 46, baseType: !154, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !282, file: !283, line: 49, baseType: !154, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !282, file: !283, line: 51, baseType: !154, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !282, file: !283, line: 54, baseType: !154, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !282, file: !283, line: 56, baseType: !154, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !282, file: !283, line: 57, baseType: !154, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !282, file: !283, line: 59, baseType: !154, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !282, file: !283, line: 60, baseType: !154, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !282, file: !283, line: 62, baseType: !154, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !282, file: !283, line: 64, baseType: !154, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !282, file: !283, line: 67, baseType: !154, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !282, file: !283, line: 69, baseType: !154, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !282, file: !283, line: 71, baseType: !154, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !282, file: !283, line: 74, baseType: !154, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !282, file: !283, line: 75, baseType: !154, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "skip_socket_leak_check", scope: !282, file: !283, line: 77, baseType: !154, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !282, file: !283, line: 80, baseType: !154, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !282, file: !283, line: 110, baseType: !154, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !282, file: !283, line: 113, baseType: !309, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !51, line: 32, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !280}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !282, file: !283, line: 120, baseType: !11, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !282, file: !283, line: 122, baseType: !184, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !282, file: !283, line: 124, baseType: !316, size: 320, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !317, line: 20, baseType: !318)
!317 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ee5b3151c1c48b156833d321f8e1946a")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !317, line: 22, size: 320, elements: !319)
!319 = !{!320, !322, !324, !325, !326, !327}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !318, file: !317, line: 23, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !317, line: 16, baseType: !11)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !318, file: !317, line: 24, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !318, file: !317, line: 25, baseType: !323, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !318, file: !317, line: 26, baseType: !323, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !318, file: !317, line: 27, baseType: !37, size: 8, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !317, line: 28, baseType: !37, size: 8, offset: 264)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !282, file: !283, line: 127, baseType: !329, size: 128, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !330, line: 16, baseType: !331)
!330 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !330, line: 18, size: 128, elements: !332)
!332 = !{!333, !335}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !331, file: !330, line: 19, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !331, file: !330, line: 20, baseType: !334, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !275, file: !276, line: 127, baseType: !280, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !275, file: !276, line: 129, baseType: !338, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !339, line: 17, baseType: !139)
!339 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ad64fd7b9f2b4876e8c9dcdeeb2305ce")
!340 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !275, file: !276, line: 131, baseType: !341, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !342, line: 19, baseType: !343)
!342 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!346, !273, !36, !33}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !27, line: 108, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !29, line: 194, baseType: !30)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !275, file: !276, line: 132, baseType: !349, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !342, line: 22, baseType: !343)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !275, file: !276, line: 133, baseType: !351, size: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !342, line: 20, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!346, !273, !114, !26}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !275, file: !276, line: 134, baseType: !356, size: 64, offset: 448)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !342, line: 23, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!114, !273, !114, !26}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !275, file: !276, line: 136, baseType: !361, size: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !276, line: 16, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !276, line: 18, size: 2432, elements: !364)
!364 = !{!365, !366, !379, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !396, !397, !398, !399, !400, !401, !404, !405, !406, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !363, file: !276, line: 19, baseType: !338, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !363, file: !276, line: 21, baseType: !367, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !369, line: 180, size: 128, elements: !370)
!369 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!370 = !{!371, !375}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !368, file: !369, line: 182, baseType: !372, size: 16)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !373, line: 28, baseType: !374)
!373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!374 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !368, file: !369, line: 183, baseType: !376, size: 112, offset: 16)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 14)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !363, file: !276, line: 22, baseType: !380, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !43, line: 274, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !29, line: 210, baseType: !154)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !363, file: !276, line: 23, baseType: !33, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !363, file: !276, line: 24, baseType: !71, size: 128, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !363, file: !276, line: 26, baseType: !139, size: 32, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !363, file: !276, line: 28, baseType: !139, size: 32, offset: 416)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !363, file: !276, line: 29, baseType: !139, size: 32, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !363, file: !276, line: 30, baseType: !139, size: 32, offset: 480)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !363, file: !276, line: 32, baseType: !139, size: 32, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !363, file: !276, line: 33, baseType: !139, size: 32, offset: 544)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !363, file: !276, line: 34, baseType: !139, size: 32, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !363, file: !276, line: 38, baseType: !392, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !51, line: 33, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !273}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !363, file: !276, line: 40, baseType: !16, size: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !363, file: !276, line: 42, baseType: !185, size: 640, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !363, file: !276, line: 43, baseType: !184, size: 64, offset: 1408)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !363, file: !276, line: 45, baseType: !33, size: 64, offset: 1472)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !363, file: !276, line: 47, baseType: !33, size: 64, offset: 1536)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !363, file: !276, line: 49, baseType: !402, size: 64, offset: 1600)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !403, line: 16, baseType: !321)
!403 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!404 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !363, file: !276, line: 51, baseType: !361, size: 64, offset: 1664)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !363, file: !276, line: 52, baseType: !273, size: 64, offset: 1728)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !363, file: !276, line: 54, baseType: !407, size: 192, offset: 1792)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !317, line: 32, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !317, line: 37, size: 192, elements: !409)
!409 = !{!410, !411, !412}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !408, file: !317, line: 38, baseType: !323, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !408, file: !317, line: 39, baseType: !323, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !408, file: !317, line: 40, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !317, line: 34, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !323, !323, !323}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !363, file: !276, line: 55, baseType: !316, size: 320, offset: 1984)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !363, file: !276, line: 57, baseType: !11, size: 64, offset: 2304)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !363, file: !276, line: 59, baseType: !154, size: 1, offset: 2368, flags: DIFlagBitField, extraData: i64 2368)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !363, file: !276, line: 60, baseType: !154, size: 1, offset: 2369, flags: DIFlagBitField, extraData: i64 2368)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !363, file: !276, line: 61, baseType: !154, size: 1, offset: 2370, flags: DIFlagBitField, extraData: i64 2368)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !363, file: !276, line: 63, baseType: !154, size: 1, offset: 2371, flags: DIFlagBitField, extraData: i64 2368)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !363, file: !276, line: 64, baseType: !154, size: 1, offset: 2372, flags: DIFlagBitField, extraData: i64 2368)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !363, file: !276, line: 65, baseType: !154, size: 1, offset: 2373, flags: DIFlagBitField, extraData: i64 2368)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !363, file: !276, line: 66, baseType: !154, size: 1, offset: 2374, flags: DIFlagBitField, extraData: i64 2368)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !363, file: !276, line: 67, baseType: !154, size: 1, offset: 2375, flags: DIFlagBitField, extraData: i64 2368)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !363, file: !276, line: 68, baseType: !154, size: 1, offset: 2376, flags: DIFlagBitField, extraData: i64 2368)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !363, file: !276, line: 69, baseType: !154, size: 1, offset: 2377, flags: DIFlagBitField, extraData: i64 2368)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !363, file: !276, line: 70, baseType: !154, size: 1, offset: 2378, flags: DIFlagBitField, extraData: i64 2368)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !363, file: !276, line: 73, baseType: !154, size: 1, offset: 2379, flags: DIFlagBitField, extraData: i64 2368)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !363, file: !276, line: 75, baseType: !154, size: 1, offset: 2380, flags: DIFlagBitField, extraData: i64 2368)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !363, file: !276, line: 76, baseType: !154, size: 1, offset: 2381, flags: DIFlagBitField, extraData: i64 2368)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !363, file: !276, line: 77, baseType: !154, size: 2, offset: 2382, flags: DIFlagBitField, extraData: i64 2368)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !363, file: !276, line: 79, baseType: !154, size: 1, offset: 2384, flags: DIFlagBitField, extraData: i64 2368)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !363, file: !276, line: 80, baseType: !154, size: 1, offset: 2385, flags: DIFlagBitField, extraData: i64 2368)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !363, file: !276, line: 81, baseType: !154, size: 1, offset: 2386, flags: DIFlagBitField, extraData: i64 2368)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !363, file: !276, line: 90, baseType: !139, size: 32, offset: 2400)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !275, file: !276, line: 138, baseType: !26, size: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !275, file: !276, line: 140, baseType: !184, size: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !275, file: !276, line: 142, baseType: !98, size: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !276, line: 144, baseType: !139, size: 32, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !275, file: !276, line: 146, baseType: !367, size: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !275, file: !276, line: 147, baseType: !380, size: 32, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !275, file: !276, line: 148, baseType: !71, size: 128, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !275, file: !276, line: 150, baseType: !71, size: 128, offset: 1088)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !275, file: !276, line: 151, baseType: !447, size: 16, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !448, line: 123, baseType: !449)
!448 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !450, line: 25, baseType: !451)
!450 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !29, line: 40, baseType: !374)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !275, file: !276, line: 154, baseType: !453, size: 64, offset: 1280)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !51, line: 29, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !456, line: 74, size: 704, elements: !457)
!456 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "51639b814b1b55c5b35047c033281672")
!457 = !{!458, !463, !467, !468, !469, !470, !471, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !455, file: !456, line: 75, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !461, line: 184, baseType: !462)
!461 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !461, line: 184, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !455, file: !456, line: 76, baseType: !464, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !461, line: 185, baseType: !466)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !461, line: 185, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !455, file: !456, line: 78, baseType: !41, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !455, file: !456, line: 79, baseType: !119, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !455, file: !456, line: 80, baseType: !33, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !455, file: !456, line: 82, baseType: !392, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !455, file: !456, line: 84, baseType: !472, size: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !474, line: 231, baseType: !475)
!474 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "848d42aedd0da44ffda19088217823c7")
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !474, line: 231, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !455, file: !456, line: 85, baseType: !392, size: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !455, file: !456, line: 87, baseType: !309, size: 64, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !455, file: !456, line: 88, baseType: !309, size: 64, offset: 576)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !455, file: !456, line: 90, baseType: !37, size: 8, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !455, file: !456, line: 92, baseType: !154, size: 1, offset: 648, flags: DIFlagBitField, extraData: i64 648)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !455, file: !456, line: 93, baseType: !154, size: 1, offset: 649, flags: DIFlagBitField, extraData: i64 648)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !455, file: !456, line: 94, baseType: !154, size: 1, offset: 650, flags: DIFlagBitField, extraData: i64 648)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !455, file: !456, line: 95, baseType: !154, size: 1, offset: 651, flags: DIFlagBitField, extraData: i64 648)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !455, file: !456, line: 96, baseType: !154, size: 1, offset: 652, flags: DIFlagBitField, extraData: i64 648)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !455, file: !456, line: 97, baseType: !154, size: 1, offset: 653, flags: DIFlagBitField, extraData: i64 648)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !455, file: !456, line: 98, baseType: !154, size: 1, offset: 654, flags: DIFlagBitField, extraData: i64 648)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !455, file: !456, line: 99, baseType: !154, size: 1, offset: 655, flags: DIFlagBitField, extraData: i64 648)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !455, file: !456, line: 100, baseType: !154, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 648)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !455, file: !456, line: 101, baseType: !154, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 648)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !275, file: !276, line: 157, baseType: !491, size: 64, offset: 1344)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !51, line: 30, baseType: !493)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !51, line: 30, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !275, file: !276, line: 159, baseType: !367, size: 64, offset: 1408)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !275, file: !276, line: 160, baseType: !380, size: 32, offset: 1472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !275, file: !276, line: 162, baseType: !119, size: 64, offset: 1536)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !275, file: !276, line: 164, baseType: !329, size: 128, offset: 1600)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !275, file: !276, line: 166, baseType: !203, size: 64, offset: 1728)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !275, file: !276, line: 168, baseType: !11, size: 64, offset: 1792)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !275, file: !276, line: 170, baseType: !154, size: 8, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !275, file: !276, line: 172, baseType: !154, size: 3, offset: 1864, flags: DIFlagBitField, extraData: i64 1856)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !275, file: !276, line: 174, baseType: !154, size: 1, offset: 1867, flags: DIFlagBitField, extraData: i64 1856)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !275, file: !276, line: 175, baseType: !154, size: 1, offset: 1868, flags: DIFlagBitField, extraData: i64 1856)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !275, file: !276, line: 176, baseType: !154, size: 1, offset: 1869, flags: DIFlagBitField, extraData: i64 1856)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !275, file: !276, line: 178, baseType: !154, size: 1, offset: 1870, flags: DIFlagBitField, extraData: i64 1856)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !275, file: !276, line: 179, baseType: !154, size: 1, offset: 1871, flags: DIFlagBitField, extraData: i64 1856)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !275, file: !276, line: 180, baseType: !154, size: 1, offset: 1872, flags: DIFlagBitField, extraData: i64 1856)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !275, file: !276, line: 181, baseType: !154, size: 1, offset: 1873, flags: DIFlagBitField, extraData: i64 1856)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !275, file: !276, line: 183, baseType: !154, size: 1, offset: 1874, flags: DIFlagBitField, extraData: i64 1856)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !275, file: !276, line: 184, baseType: !154, size: 1, offset: 1875, flags: DIFlagBitField, extraData: i64 1856)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !275, file: !276, line: 185, baseType: !154, size: 2, offset: 1876, flags: DIFlagBitField, extraData: i64 1856)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !275, file: !276, line: 186, baseType: !154, size: 2, offset: 1878, flags: DIFlagBitField, extraData: i64 1856)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !275, file: !276, line: 188, baseType: !154, size: 1, offset: 1880, flags: DIFlagBitField, extraData: i64 1856)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !261, file: !262, line: 57, baseType: !273, size: 64, offset: 960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !261, file: !262, line: 58, baseType: !11, size: 64, offset: 1024)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !261, file: !262, line: 60, baseType: !517, size: 64, offset: 1088)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !261, file: !262, line: 61, baseType: !11, size: 64, offset: 1152)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !261, file: !262, line: 62, baseType: !11, size: 64, offset: 1216)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !261, file: !262, line: 64, baseType: !329, size: 128, offset: 1280)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !261, file: !262, line: 65, baseType: !11, size: 64, offset: 1408)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !261, file: !262, line: 67, baseType: !89, size: 320, offset: 1472)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !261, file: !262, line: 68, baseType: !89, size: 320, offset: 1792)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !261, file: !262, line: 70, baseType: !89, size: 320, offset: 2112)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !261, file: !262, line: 71, baseType: !407, size: 192, offset: 2432)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !261, file: !262, line: 72, baseType: !316, size: 320, offset: 2624)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !261, file: !262, line: 74, baseType: !529, size: 448, offset: 2944)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !530, line: 31, baseType: !531)
!530 = !DIFile(filename: "src/core/ngx_list.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "580525d954b127a1c35170a83ca4d8b1")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !530, line: 25, size: 448, elements: !532)
!532 = !{!533, !541, !542, !543, !544}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !531, file: !530, line: 26, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !530, line: 16, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !530, line: 18, size: 192, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !536, file: !530, line: 19, baseType: !16, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !536, file: !530, line: 20, baseType: !11, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !536, file: !530, line: 21, baseType: !534, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !531, file: !530, line: 27, baseType: !535, size: 192, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !531, file: !530, line: 28, baseType: !33, size: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !531, file: !530, line: 29, baseType: !11, size: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !531, file: !530, line: 30, baseType: !98, size: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !261, file: !262, line: 75, baseType: !529, size: 448, offset: 3392)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !261, file: !262, line: 77, baseType: !11, size: 64, offset: 3840)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !261, file: !262, line: 78, baseType: !11, size: 64, offset: 3904)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !261, file: !262, line: 80, baseType: !273, size: 64, offset: 3968)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !261, file: !262, line: 81, baseType: !280, size: 64, offset: 4032)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !261, file: !262, line: 82, baseType: !280, size: 64, offset: 4096)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !261, file: !262, line: 84, baseType: !259, size: 64, offset: 4160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !261, file: !262, line: 86, baseType: !71, size: 128, offset: 4224)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !261, file: !262, line: 87, baseType: !71, size: 128, offset: 4352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !261, file: !262, line: 88, baseType: !71, size: 128, offset: 4480)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !261, file: !262, line: 89, baseType: !71, size: 128, offset: 4608)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !261, file: !262, line: 90, baseType: !71, size: 128, offset: 4736)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !261, file: !262, line: 91, baseType: !71, size: 128, offset: 4864)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_handler", scope: !261, file: !262, line: 93, baseType: !559, size: 64, offset: 4992)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_intercept_pt", file: !262, line: 34, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!41, !184, !11, !36, !33}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_data", scope: !261, file: !262, line: 94, baseType: !16, size: 64, offset: 5056)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "entered_logger", scope: !261, file: !262, line: 95, baseType: !154, size: 32, offset: 5120)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !84, file: !68, line: 121, baseType: !98, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !84, file: !68, line: 122, baseType: !98, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !84, file: !68, line: 123, baseType: !568, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !68, line: 103, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 98, size: 1792, elements: !571)
!571 = !{!572, !573, !574, !575}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !570, file: !68, line: 99, baseType: !132, size: 1600)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !570, file: !68, line: 100, baseType: !119, size: 64, offset: 1600)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !570, file: !68, line: 101, baseType: !119, size: 64, offset: 1664)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !570, file: !68, line: 102, baseType: !11, size: 64, offset: 1728)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !84, file: !68, line: 124, baseType: !184, size: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !84, file: !68, line: 126, baseType: !16, size: 64, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !84, file: !68, line: 127, baseType: !11, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !84, file: !68, line: 128, baseType: !11, size: 64, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !84, file: !68, line: 130, baseType: !581, size: 64, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !68, line: 112, baseType: !79)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !84, file: !68, line: 131, baseType: !16, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !67, file: !68, line: 81, baseType: !11, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !67, file: !68, line: 82, baseType: !11, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !67, file: !68, line: 83, baseType: !16, size: 64, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !53, line: 236, baseType: !11, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !52, file: !53, line: 238, baseType: !588, size: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!41, !184}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !52, file: !53, line: 240, baseType: !592, size: 64, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!41, !259}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !52, file: !53, line: 242, baseType: !592, size: 64, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !52, file: !53, line: 243, baseType: !592, size: 64, offset: 832)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !52, file: !53, line: 244, baseType: !598, size: 64, offset: 896)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !259}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !52, file: !53, line: 245, baseType: !598, size: 64, offset: 960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !52, file: !53, line: 247, baseType: !598, size: 64, offset: 1024)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !52, file: !53, line: 249, baseType: !13, size: 64, offset: 1088)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !52, file: !53, line: 250, baseType: !13, size: 64, offset: 1152)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !52, file: !53, line: 251, baseType: !13, size: 64, offset: 1216)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !52, file: !53, line: 252, baseType: !13, size: 64, offset: 1280)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !52, file: !53, line: 253, baseType: !13, size: 64, offset: 1344)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !52, file: !53, line: 254, baseType: !13, size: 64, offset: 1408)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !52, file: !53, line: 255, baseType: !13, size: 64, offset: 1472)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !52, file: !53, line: 256, baseType: !13, size: 64, offset: 1536)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1640, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 52)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "ngx_http_next_header_filter", scope: !9, file: !2, line: 212, type: !618, isLocal: true, isDefinition: true)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_output_header_filter_pt", file: !619, line: 512, baseType: !620)
!619 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "01bbc621c19214151ccc7d6928049534")
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!41, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !625, line: 16, baseType: !626)
!625 = !DIFile(filename: "src/http/ngx_http.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "936639e5730ac898b9486f4f53b5f2f5")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !627, line: 371, size: 11456, elements: !628)
!627 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1757f93ddb5cd3c545713a957f23192d")
!628 = !{!629, !632, !633, !634, !635, !636, !637, !642, !643, !859, !1453, !1454, !1455, !1456, !1498, !1530, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1576, !1587, !1594, !1595, !1597, !1598, !1611, !1612, !1613, !1614, !1615, !1616, !1793, !1797, !1802, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !626, file: !627, line: 372, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !450, line: 26, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !29, line: 42, baseType: !154)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !626, file: !627, line: 374, baseType: !273, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !626, file: !627, line: 376, baseType: !23, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !626, file: !627, line: 377, baseType: !23, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !626, file: !627, line: 378, baseType: !23, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !626, file: !627, line: 379, baseType: !23, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !626, file: !627, line: 381, baseType: !638, size: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !627, line: 368, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !623}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !626, file: !627, line: 382, baseType: !638, size: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !626, file: !627, line: 385, baseType: !644, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !625, line: 18, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !647, line: 65, size: 4800, elements: !648)
!647 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "04ea2ebc84c597718a4782ab3cabf19d")
!648 = !{!649, !650, !651, !652, !656, !657, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !817, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !646, file: !647, line: 66, baseType: !132, size: 1600)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !646, file: !647, line: 67, baseType: !89, size: 320, offset: 1600)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !646, file: !647, line: 68, baseType: !630, size: 32, offset: 1920)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !646, file: !647, line: 69, baseType: !653, size: 128, offset: 1952)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 128, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 16)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !646, file: !647, line: 70, baseType: !653, size: 128, offset: 2080)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !646, file: !647, line: 72, baseType: !658, size: 64, offset: 2240)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !138, line: 18, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !27, line: 49, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !29, line: 149, baseType: !15)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !646, file: !647, line: 73, baseType: !206, size: 64, offset: 2304)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !646, file: !647, line: 74, baseType: !206, size: 64, offset: 2368)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !646, file: !647, line: 75, baseType: !206, size: 64, offset: 2432)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !646, file: !647, line: 76, baseType: !206, size: 64, offset: 2496)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !646, file: !647, line: 77, baseType: !206, size: 64, offset: 2560)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !646, file: !647, line: 79, baseType: !71, size: 128, offset: 2624)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !646, file: !647, line: 80, baseType: !71, size: 128, offset: 2752)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !646, file: !647, line: 81, baseType: !653, size: 128, offset: 2880)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !646, file: !647, line: 83, baseType: !33, size: 64, offset: 3008)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !646, file: !647, line: 84, baseType: !33, size: 64, offset: 3072)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !646, file: !647, line: 85, baseType: !26, size: 64, offset: 3136)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !646, file: !647, line: 86, baseType: !26, size: 64, offset: 3200)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !646, file: !647, line: 88, baseType: !11, size: 64, offset: 3264)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !646, file: !647, line: 89, baseType: !11, size: 64, offset: 3328)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !646, file: !647, line: 90, baseType: !11, size: 64, offset: 3392)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !646, file: !647, line: 91, baseType: !11, size: 64, offset: 3456)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !646, file: !647, line: 93, baseType: !119, size: 64, offset: 3520)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !646, file: !647, line: 95, baseType: !679, size: 64, offset: 3584)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !625, line: 19, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !647, line: 157, size: 1088, elements: !682)
!682 = !{!683, !698, !759, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !816}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !681, file: !647, line: 158, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !647, line: 154, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !647, line: 145, size: 960, elements: !687)
!687 = !{!688, !689, !690, !691, !694, !695, !696, !697}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !686, file: !647, line: 146, baseType: !407, size: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !686, file: !647, line: 147, baseType: !316, size: 320, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !686, file: !647, line: 148, baseType: !329, size: 128, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !686, file: !647, line: 149, baseType: !692, size: 64, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !204, line: 106, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !203)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !686, file: !647, line: 150, baseType: !692, size: 64, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !686, file: !647, line: 151, baseType: !26, size: 64, offset: 768)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !686, file: !647, line: 152, baseType: !11, size: 64, offset: 832)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !686, file: !647, line: 153, baseType: !11, size: 64, offset: 896)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !681, file: !647, line: 159, baseType: !699, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !701, line: 59, baseType: !702)
!701 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6137611cd598fa2ecc498e6967a03177")
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !701, line: 34, size: 1600, elements: !703)
!703 = !{!704, !711, !712, !713, !721, !722, !723, !732, !733, !734, !735, !754, !755, !756, !757, !758}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !702, file: !701, line: 35, baseType: !705, size: 128)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !706, line: 21, baseType: !707)
!706 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "56a332e5761f46e2bb83cbdaf8b18a9f")
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 16, size: 128, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !707, file: !706, line: 17, baseType: !692, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !707, file: !706, line: 19, baseType: !692, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !702, file: !701, line: 37, baseType: !33, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !702, file: !701, line: 38, baseType: !33, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !702, file: !701, line: 40, baseType: !714, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !701, line: 16, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !701, line: 18, size: 192, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !716, file: !701, line: 19, baseType: !13, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !716, file: !701, line: 20, baseType: !714, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !716, file: !701, line: 21, baseType: !13, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !702, file: !701, line: 41, baseType: !714, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !702, file: !701, line: 42, baseType: !715, size: 192, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !702, file: !701, line: 44, baseType: !724, size: 64, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !701, line: 31, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !701, line: 25, size: 256, elements: !727)
!727 = !{!728, !729, !730, !731}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !726, file: !701, line: 26, baseType: !11, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !726, file: !701, line: 27, baseType: !11, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !726, file: !701, line: 29, baseType: !11, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !726, file: !701, line: 30, baseType: !11, size: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !702, file: !701, line: 45, baseType: !11, size: 64, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !702, file: !701, line: 47, baseType: !36, size: 64, offset: 704)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !702, file: !701, line: 48, baseType: !36, size: 64, offset: 768)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !702, file: !701, line: 50, baseType: !736, size: 512, offset: 832)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !706, line: 37, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 24, size: 512, elements: !738)
!738 = !{!739, !741, !742, !743, !753}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !737, file: !706, line: 26, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !737, file: !706, line: 28, baseType: !740, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !737, file: !706, line: 29, baseType: !11, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !737, file: !706, line: 30, baseType: !744, size: 256, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !745, line: 39, baseType: !746)
!745 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!746 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !745, line: 35, size: 256, elements: !747)
!747 = !{!748, !752}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !746, file: !745, line: 37, baseType: !749, size: 256)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !746, file: !745, line: 38, baseType: !30, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !737, file: !706, line: 36, baseType: !11, size: 64, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !702, file: !701, line: 52, baseType: !36, size: 64, offset: 1344)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !702, file: !701, line: 53, baseType: !37, size: 8, offset: 1408)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !702, file: !701, line: 55, baseType: !154, size: 1, offset: 1416, flags: DIFlagBitField, extraData: i64 1416)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !702, file: !701, line: 57, baseType: !16, size: 64, offset: 1472)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !702, file: !701, line: 58, baseType: !16, size: 64, offset: 1536)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !681, file: !647, line: 161, baseType: !760, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !134, line: 62, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 50, size: 768, elements: !763)
!763 = !{!764, !765, !766, !768, !773, !775, !777, !778, !779}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !762, file: !134, line: 51, baseType: !71, size: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !762, file: !134, line: 52, baseType: !33, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !762, file: !134, line: 53, baseType: !767, size: 192, offset: 192)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 192, elements: !179)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !762, file: !134, line: 55, baseType: !769, size: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !134, line: 45, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!402, !16}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !762, file: !134, line: 56, baseType: !774, size: 64, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !134, line: 46, baseType: !770)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !762, file: !134, line: 57, baseType: !776, size: 64, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !134, line: 47, baseType: !252)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !762, file: !134, line: 58, baseType: !16, size: 64, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !762, file: !134, line: 60, baseType: !36, size: 64, offset: 640)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !762, file: !134, line: 61, baseType: !11, size: 64, offset: 704)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !681, file: !647, line: 163, baseType: !26, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !681, file: !647, line: 164, baseType: !33, size: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !681, file: !647, line: 166, baseType: !206, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !681, file: !647, line: 168, baseType: !206, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !681, file: !647, line: 170, baseType: !11, size: 64, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !681, file: !647, line: 171, baseType: !11, size: 64, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !681, file: !647, line: 172, baseType: !402, size: 64, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !681, file: !647, line: 173, baseType: !402, size: 64, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !681, file: !647, line: 174, baseType: !402, size: 64, offset: 704)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !681, file: !647, line: 176, baseType: !11, size: 64, offset: 768)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !681, file: !647, line: 177, baseType: !402, size: 64, offset: 832)
