; ModuleID = 'samples/415.bc'
source_filename = "cmsalpha.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._cmstransform_struct = type { i32, i32, ptr, ptr, ptr, ptr, ptr, %struct._cmsCACHE, ptr, ptr, ptr, ptr, i32, i32, %struct.cmsCIEXYZ, %struct.cmsCIEXYZ, ptr, i32, double, i32, ptr, ptr, ptr, ptr }
%struct._cmsCACHE = type { [16 x i16], [16 x i16] }
%struct.cmsCIEXYZ = type { double, double, double }
%struct.cmsStride = type { i32, i32, i32, i32 }
%union.anon = type { double }

@_cmsGetFormatterAlpha.FormattersAlpha = internal global [6 x [6 x ptr]] [[6 x ptr] [ptr @copy8, ptr @from8to16, ptr @from8to16SE, ptr @from8toHLF, ptr @from8toFLT, ptr @from8toDBL], [6 x ptr] [ptr @from16to8, ptr @copy16, ptr @from16to16, ptr @from16toHLF, ptr @from16toFLT, ptr @from16toDBL], [6 x ptr] [ptr @from16SEto8, ptr @from16to16, ptr @copy16, ptr @from16SEtoHLF, ptr @from16SEtoFLT, ptr @from16SEtoDBL], [6 x ptr] [ptr @fromHLFto8, ptr @fromHLFto16, ptr @fromHLFto16SE, ptr @copy16, ptr @fromHLFtoFLT, ptr @fromHLFtoDBL], [6 x ptr] [ptr @fromFLTto8, ptr @fromFLTto16, ptr @fromFLTto16SE, ptr @fromFLTtoHLF, ptr @copy32, ptr @fromFLTtoDBL], [6 x ptr] [ptr @fromDBLto8, ptr @fromDBLto16, ptr @fromDBLto16SE, ptr @fromDBLtoHLF, ptr @fromDBLtoFLT, ptr @copy64]], align 16, !dbg !0
@.str = private unnamed_addr constant [33 x i8] c"Unrecognized alpha channel width\00", align 1, !dbg !181


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "FormattersAlpha", scope: !2, file: !3, line: 380, type: !194, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_cmsGetFormatterAlpha", scope: !3, file: !3, line: 378, type: !4, scopeLine: 379, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !187)
!3 = !DIFile(filename: "cmsalpha.c", directory: "/local-ssd/lcms-ztpfygwoja345726vi3y4tc34unbjaib-build/aidengro/spack-stage-lcms-2.13.1-ztpfygwoja345726vi3y4tc34unbjaib/spack-src/src", checksumkind: CSK_MD5, checksum: "980ab75696bcb44f5f68be1ed1124e16")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !13, !36, !36}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsFormatterAlphaFn", file: !3, line: 63, baseType: !7)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !11}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsContext", file: !14, line: 1056, baseType: !15)
!14 = !DIFile(filename: "../include/lcms2.h", directory: "/local-ssd/lcms-ztpfygwoja345726vi3y4tc34unbjaib-build/aidengro/spack-stage-lcms-2.13.1-ztpfygwoja345726vi3y4tc34unbjaib/spack-src/src", checksumkind: CSK_MD5, checksum: "b2bebc2d7c5ccc569b0d00311c47ac6c")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cmsContext_struct", file: !17, line: 511, size: 1472, elements: !18)
!17 = !DIFile(filename: "./lcms2_internal.h", directory: "/local-ssd/lcms-ztpfygwoja345726vi3y4tc34unbjaib-build/aidengro/spack-stage-lcms-2.13.1-ztpfygwoja345726vi3y4tc34unbjaib/spack-src/src", checksumkind: CSK_MD5, checksum: "479b61780e49804306b4c5804e975f85")
!18 = !{!19, !20, !41, !45}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !16, file: !17, line: 513, baseType: !15, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "MemPool", scope: !16, file: !17, line: 514, baseType: !21, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsSubAllocator", file: !17, line: 460, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 455, size: 128, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !23, file: !17, line: 457, baseType: !13, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !23, file: !17, line: 458, baseType: !27, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsSubAllocator_chunk", file: !17, line: 452, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cmsSubAllocator_chunk_st", file: !17, line: 444, size: 192, elements: !30)
!30 = !{!31, !35, !38, !39}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !29, file: !17, line: 446, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsUInt8Number", file: !14, line: 90, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", scope: !29, file: !17, line: 447, baseType: !36, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsUInt32Number", file: !14, line: 120, baseType: !37)
!37 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Used", scope: !29, file: !17, line: 448, baseType: !36, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !29, file: !17, line: 450, baseType: !40, size: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "chunks", scope: !16, file: !17, line: 516, baseType: !42, size: 960, offset: 128)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 960, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 15)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultMemoryManager", scope: !16, file: !17, line: 519, baseType: !46, size: 384, offset: 1088)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsMemPluginChunkType", file: !17, line: 505, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 496, size: 384, elements: !48)
!48 = !{!49, !55, !57, !62, !67, !72}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "MallocPtr", scope: !47, file: !17, line: 498, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsMallocFnPtrType", file: !51, line: 229, baseType: !52)
!51 = !DIFile(filename: "../include/lcms2_plugin.h", directory: "/local-ssd/lcms-ztpfygwoja345726vi3y4tc34unbjaib-build/aidengro/spack-stage-lcms-2.13.1-ztpfygwoja345726vi3y4tc34unbjaib/spack-src/src", checksumkind: CSK_MD5, checksum: "3a8f6b8afdf5dfc22373e8103ac5e8ca")
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!10, !13, !36}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "MallocZeroPtr", scope: !47, file: !17, line: 499, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsMalloZerocFnPtrType", file: !51, line: 233, baseType: !52)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "FreePtr", scope: !47, file: !17, line: 500, baseType: !58, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsFreeFnPtrType", file: !51, line: 230, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !13, !10}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ReallocPtr", scope: !47, file: !17, line: 501, baseType: !63, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsReallocFnPtrType", file: !51, line: 231, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!10, !13, !10, !36}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "CallocPtr", scope: !47, file: !17, line: 502, baseType: !68, size: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsCallocFnPtrType", file: !51, line: 234, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!10, !13, !36, !36}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "DupPtr", scope: !47, file: !17, line: 503, baseType: !73, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsDupFnPtrType", file: !51, line: 235, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!10, !13, !11, !36}
!77 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !78, retainedTypes: !170, globals: !180, splitDebugInlining: false, nameTableKind: None)
!78 = !{!79, !97, !142}
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 523, baseType: !37, size: 32, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!81 = !DIEnumerator(name: "cmsSigCurveSetElemType", value: 1668707188)
!82 = !DIEnumerator(name: "cmsSigMatrixElemType", value: 1835103334)
!83 = !DIEnumerator(name: "cmsSigCLutElemType", value: 1668052340)
!84 = !DIEnumerator(name: "cmsSigBAcsElemType", value: 1648444243)
!85 = !DIEnumerator(name: "cmsSigEAcsElemType", value: 1698775891)
!86 = !DIEnumerator(name: "cmsSigXYZ2LabElemType", value: 1815246880)
!87 = !DIEnumerator(name: "cmsSigLab2XYZElemType", value: 2016570400)
!88 = !DIEnumerator(name: "cmsSigNamedColorElemType", value: 1852009504)
!89 = !DIEnumerator(name: "cmsSigLabV2toV4", value: 840971296)
!90 = !DIEnumerator(name: "cmsSigLabV4toV2", value: 874525216)
!91 = !DIEnumerator(name: "cmsSigIdentityElemType", value: 1768189472)
!92 = !DIEnumerator(name: "cmsSigLab2FloatPCS", value: 1681026080)
!93 = !DIEnumerator(name: "cmsSigFloatPCS2Lab", value: 1815241760)
!94 = !DIEnumerator(name: "cmsSigXYZ2FloatPCS", value: 1681029152)
!95 = !DIEnumerator(name: "cmsSigFloatPCS2XYZ", value: 2016568352)
!96 = !DIEnumerator(name: "cmsSigClipNegativesElemType", value: 1668050976)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 442, baseType: !37, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!99 = !DIEnumerator(name: "cmsSigXYZData", value: 1482250784)
!100 = !DIEnumerator(name: "cmsSigLabData", value: 1281450528)
!101 = !DIEnumerator(name: "cmsSigLuvData", value: 1282766368)
!102 = !DIEnumerator(name: "cmsSigYCbCrData", value: 1497588338)
!103 = !DIEnumerator(name: "cmsSigYxyData", value: 1501067552)
!104 = !DIEnumerator(name: "cmsSigRgbData", value: 1380401696)
!105 = !DIEnumerator(name: "cmsSigGrayData", value: 1196573017)
!106 = !DIEnumerator(name: "cmsSigHsvData", value: 1213421088)
!107 = !DIEnumerator(name: "cmsSigHlsData", value: 1212961568)
!108 = !DIEnumerator(name: "cmsSigCmykData", value: 1129142603)
!109 = !DIEnumerator(name: "cmsSigCmyData", value: 1129142560)
!110 = !DIEnumerator(name: "cmsSigMCH1Data", value: 1296255025)
!111 = !DIEnumerator(name: "cmsSigMCH2Data", value: 1296255026)
!112 = !DIEnumerator(name: "cmsSigMCH3Data", value: 1296255027)
!113 = !DIEnumerator(name: "cmsSigMCH4Data", value: 1296255028)
!114 = !DIEnumerator(name: "cmsSigMCH5Data", value: 1296255029)
!115 = !DIEnumerator(name: "cmsSigMCH6Data", value: 1296255030)
!116 = !DIEnumerator(name: "cmsSigMCH7Data", value: 1296255031)
!117 = !DIEnumerator(name: "cmsSigMCH8Data", value: 1296255032)
!118 = !DIEnumerator(name: "cmsSigMCH9Data", value: 1296255033)
!119 = !DIEnumerator(name: "cmsSigMCHAData", value: 1296255041)
!120 = !DIEnumerator(name: "cmsSigMCHBData", value: 1296255042)
!121 = !DIEnumerator(name: "cmsSigMCHCData", value: 1296255043)
!122 = !DIEnumerator(name: "cmsSigMCHDData", value: 1296255044)
!123 = !DIEnumerator(name: "cmsSigMCHEData", value: 1296255045)
!124 = !DIEnumerator(name: "cmsSigMCHFData", value: 1296255046)
!125 = !DIEnumerator(name: "cmsSigNamedData", value: 1852662636)
!126 = !DIEnumerator(name: "cmsSig1colorData", value: 826494034)
!127 = !DIEnumerator(name: "cmsSig2colorData", value: 843271250)
!128 = !DIEnumerator(name: "cmsSig3colorData", value: 860048466)
!129 = !DIEnumerator(name: "cmsSig4colorData", value: 876825682)
!130 = !DIEnumerator(name: "cmsSig5colorData", value: 893602898)
!131 = !DIEnumerator(name: "cmsSig6colorData", value: 910380114)
!132 = !DIEnumerator(name: "cmsSig7colorData", value: 927157330)
!133 = !DIEnumerator(name: "cmsSig8colorData", value: 943934546)
!134 = !DIEnumerator(name: "cmsSig9colorData", value: 960711762)
!135 = !DIEnumerator(name: "cmsSig10colorData", value: 1094929490)
!136 = !DIEnumerator(name: "cmsSig11colorData", value: 1111706706)
!137 = !DIEnumerator(name: "cmsSig12colorData", value: 1128483922)
!138 = !DIEnumerator(name: "cmsSig13colorData", value: 1145261138)
!139 = !DIEnumerator(name: "cmsSig14colorData", value: 1162038354)
!140 = !DIEnumerator(name: "cmsSig15colorData", value: 1178815570)
!141 = !DIEnumerator(name: "cmsSigLuvKData", value: 1282766411)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 410, baseType: !37, size: 32, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!144 = !DIEnumerator(name: "cmsSigDigitalCamera", value: 1684234605)
!145 = !DIEnumerator(name: "cmsSigFilmScanner", value: 1718838126)
!146 = !DIEnumerator(name: "cmsSigReflectiveScanner", value: 1920164718)
!147 = !DIEnumerator(name: "cmsSigInkJetPrinter", value: 1768580468)
!148 = !DIEnumerator(name: "cmsSigThermalWaxPrinter", value: 1953980792)
!149 = !DIEnumerator(name: "cmsSigElectrophotographicPrinter", value: 1701865583)
!150 = !DIEnumerator(name: "cmsSigElectrostaticPrinter", value: 1702065249)
!151 = !DIEnumerator(name: "cmsSigDyeSublimationPrinter", value: 1685288290)
!152 = !DIEnumerator(name: "cmsSigPhotographicPaperPrinter", value: 1919969391)
!153 = !DIEnumerator(name: "cmsSigFilmWriter", value: 1718645358)
!154 = !DIEnumerator(name: "cmsSigVideoMonitor", value: 1986618477)
!155 = !DIEnumerator(name: "cmsSigVideoCamera", value: 1986618467)
!156 = !DIEnumerator(name: "cmsSigProjectionTelevision", value: 1886024822)
!157 = !DIEnumerator(name: "cmsSigCRTDisplay", value: 1129468960)
!158 = !DIEnumerator(name: "cmsSigPMDisplay", value: 1347240992)
!159 = !DIEnumerator(name: "cmsSigAMDisplay", value: 1095582752)
!160 = !DIEnumerator(name: "cmsSigPhotoCD", value: 1263551300)
!161 = !DIEnumerator(name: "cmsSigPhotoImageSetter", value: 1768777587)
!162 = !DIEnumerator(name: "cmsSigGravure", value: 1735549302)
!163 = !DIEnumerator(name: "cmsSigOffsetLithography", value: 1868981875)
!164 = !DIEnumerator(name: "cmsSigSilkscreen", value: 1936288875)
!165 = !DIEnumerator(name: "cmsSigFlexography", value: 1718379896)
!166 = !DIEnumerator(name: "cmsSigMotionPictureFilmScanner", value: 1836082803)
!167 = !DIEnumerator(name: "cmsSigMotionPictureFilmRecorder", value: 1836082802)
!168 = !DIEnumerator(name: "cmsSigDigitalMotionPictureCamera", value: 1684893795)
!169 = !DIEnumerator(name: "cmsSigDigitalCinemaProjector", value: 1684236912)
!170 = !{!10, !32, !171, !173, !174, !176, !177, !179, !33, !36}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsUInt16Number", file: !14, line: 103, baseType: !172)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsFloat32Number", file: !14, line: 98, baseType: !175)
!175 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsFloat64Number", file: !14, line: 99, baseType: !178)
!178 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!180 = !{!0, !181}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !3, line: 394, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 264, elements: !185)
!184 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!185 = !{!186}
!186 = !DISubrange(count: 33)
!187 = !{!188, !189, !190, !191, !193}
!188 = !DILocalVariable(name: "id", arg: 1, scope: !2, file: !3, line: 378, type: !13)
!189 = !DILocalVariable(name: "in", arg: 2, scope: !2, file: !3, line: 378, type: !36)
!190 = !DILocalVariable(name: "out", arg: 3, scope: !2, file: !3, line: 378, type: !36)
!191 = !DILocalVariable(name: "in_n", scope: !2, file: !3, line: 389, type: !192)
!192 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!193 = !DILocalVariable(name: "out_n", scope: !2, file: !3, line: 390, type: !192)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 2304, elements: !195)
!195 = !{!196, !196}
!196 = !DISubrange(count: 6)
!197 = !{i32 7, !"Dwarf Version", i32 5}
!198 = !{i32 2, !"Debug Info Version", i32 3}
!199 = !{i32 1, !"wchar_size", i32 4}
!200 = !{i32 8, !"PIC Level", i32 2}
!201 = !{i32 7, !"uwtable", i32 2}
!202 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!203 = distinct !DISubprogram(name: "_cmsHandleExtraChannels", scope: !3, file: !3, line: 536, type: !204, scopeLine: 541, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !416)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !206, !11, !10, !36, !36, !218}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsTRANSFORM", file: !17, line: 1084, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cmstransform_struct", file: !17, line: 1030, size: 2112, elements: !209)
!209 = !{!210, !211, !212, !227, !232, !233, !238, !239, !248, !311, !312, !337, !338, !340, !341, !348, !349, !405, !406, !407, !408, !409, !410, !411}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "InputFormat", scope: !208, file: !17, line: 1032, baseType: !36, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "OutputFormat", scope: !208, file: !17, line: 1032, baseType: !36, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "xform", scope: !208, file: !17, line: 1035, baseType: !213, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsTransform2Fn", file: !51, line: 602, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !217, !11, !10, !36, !36, !218}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsStride", file: !51, line: 593, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 587, size: 128, elements: !222)
!222 = !{!223, !224, !225, !226}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "BytesPerLineIn", scope: !221, file: !51, line: 588, baseType: !36, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "BytesPerLineOut", scope: !221, file: !51, line: 589, baseType: !36, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "BytesPerPlaneIn", scope: !221, file: !51, line: 590, baseType: !36, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "BytesPerPlaneOut", scope: !221, file: !51, line: 591, baseType: !36, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "FromInput", scope: !208, file: !17, line: 1038, baseType: !228, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsFormatter16", file: !51, line: 349, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!32, !217, !173, !32, !36}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ToOutput", scope: !208, file: !17, line: 1039, baseType: !228, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "FromInputFloat", scope: !208, file: !17, line: 1041, baseType: !234, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsFormatterFloat", file: !51, line: 354, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!32, !217, !176, !32, !36}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ToOutputFloat", scope: !208, file: !17, line: 1042, baseType: !234, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Cache", scope: !208, file: !17, line: 1045, baseType: !240, size: 512, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsCACHE", file: !17, line: 1025, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 1019, size: 512, elements: !242)
!242 = !{!243, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "CacheIn", scope: !241, file: !17, line: 1022, baseType: !244, size: 256)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 256, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 16)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "CacheOut", scope: !241, file: !17, line: 1023, baseType: !244, size: 256, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Lut", scope: !208, file: !17, line: 1048, baseType: !249, size: 64, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsPipeline", file: !14, line: 1221, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cmsPipeline_struct", file: !17, line: 913, size: 576, elements: !252)
!252 = !{!253, !286, !287, !288, !289, !296, !301, !303, !308, !309}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Elements", scope: !251, file: !17, line: 915, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsStage", file: !14, line: 1222, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cmsStage_struct", file: !17, line: 871, size: 512, elements: !257)
!257 = !{!258, !259, !261, !262, !263, !264, !273, !278, !283, !284}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !256, file: !17, line: 873, baseType: !13, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !256, file: !17, line: 875, baseType: !260, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsStageSignature", file: !14, line: 548, baseType: !79)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", scope: !256, file: !17, line: 876, baseType: !260, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "InputChannels", scope: !256, file: !17, line: 878, baseType: !36, size: 32, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "OutputChannels", scope: !256, file: !17, line: 879, baseType: !36, size: 32, offset: 160)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "EvalPtr", scope: !256, file: !17, line: 881, baseType: !265, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsStageEvalFn", file: !51, line: 491, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !269, !176, !271}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "DupElemPtr", scope: !256, file: !17, line: 882, baseType: !274, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsStageDupElemFn", file: !51, line: 492, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!10, !254}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "FreePtr", scope: !256, file: !17, line: 883, baseType: !279, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsStageFreeElemFn", file: !51, line: 493, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !254}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !256, file: !17, line: 886, baseType: !10, size: 64, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !256, file: !17, line: 889, baseType: !285, size: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "InputChannels", scope: !251, file: !17, line: 916, baseType: !36, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "OutputChannels", scope: !251, file: !17, line: 916, baseType: !36, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !251, file: !17, line: 919, baseType: !10, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Eval16Fn", scope: !251, file: !17, line: 921, baseType: !290, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsPipelineEval16Fn", file: !51, line: 557, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !294, !173, !11}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "EvalFloatFn", scope: !251, file: !17, line: 922, baseType: !297, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsPipelineEvalFloatFn", file: !51, line: 562, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !269, !176, !11}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "FreeDataFn", scope: !251, file: !17, line: 923, baseType: !302, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsFreeUserDataFn", file: !51, line: 193, baseType: !59)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "DupDataFn", scope: !251, file: !17, line: 924, baseType: !304, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsDupUserDataFn", file: !51, line: 194, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!10, !13, !11}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !251, file: !17, line: 926, baseType: !13, size: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "SaveAs8Bits", scope: !251, file: !17, line: 928, baseType: !310, size: 32, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsBool", file: !14, line: 174, baseType: !192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "GamutCheck", scope: !208, file: !17, line: 1051, baseType: !249, size: 64, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "InputColorant", scope: !208, file: !17, line: 1054, baseType: !313, size: 64, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsNAMEDCOLORLIST", file: !14, line: 1379, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cms_NAMEDCOLORLIST_struct", file: !17, line: 759, size: 768, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !336}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "nColors", scope: !315, file: !17, line: 761, baseType: !36, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Allocated", scope: !315, file: !17, line: 762, baseType: !36, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ColorantCount", scope: !315, file: !17, line: 763, baseType: !36, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Prefix", scope: !315, file: !17, line: 765, baseType: !183, size: 264, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Suffix", scope: !315, file: !17, line: 766, baseType: !183, size: 264, offset: 360)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !315, file: !17, line: 768, baseType: !323, size: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsNAMEDCOLOR", file: !17, line: 757, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 751, size: 2352, elements: !326)
!326 = !{!327, !331, !335}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !325, file: !17, line: 753, baseType: !328, size: 2048)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 2048, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "PCS", scope: !325, file: !17, line: 754, baseType: !332, size: 48, offset: 2048)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 48, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 3)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceColorant", scope: !325, file: !17, line: 755, baseType: !244, size: 256, offset: 2096)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !315, file: !17, line: 770, baseType: !13, size: 64, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "OutputColorant", scope: !208, file: !17, line: 1055, baseType: !313, size: 64, offset: 1088)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "EntryColorSpace", scope: !208, file: !17, line: 1058, baseType: !339, size: 32, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsColorSpaceSignature", file: !14, line: 487, baseType: !97)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ExitColorSpace", scope: !208, file: !17, line: 1059, baseType: !339, size: 32, offset: 1184)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "EntryWhitePoint", scope: !208, file: !17, line: 1062, baseType: !342, size: 192, offset: 1216)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsCIEXYZ", file: !14, line: 970, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 965, size: 192, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !343, file: !14, line: 966, baseType: !177, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !343, file: !14, line: 967, baseType: !177, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !343, file: !14, line: 968, baseType: !177, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ExitWhitePoint", scope: !208, file: !17, line: 1063, baseType: !342, size: 192, offset: 1408)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Sequence", scope: !208, file: !17, line: 1066, baseType: !350, size: 64, offset: 1600)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsSEQ", file: !14, line: 1428, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 1422, size: 192, elements: !353)
!353 = !{!354, !355, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !352, file: !14, line: 1424, baseType: !36, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !352, file: !14, line: 1425, baseType: !13, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !352, file: !14, line: 1426, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsPSEQDESC", file: !14, line: 1420, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 1409, size: 512, elements: !360)
!360 = !{!361, !363, !364, !367, !369, !383, !403, !404}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "deviceMfg", scope: !359, file: !14, line: 1411, baseType: !362, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsSignature", file: !14, line: 168, baseType: !36)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "deviceModel", scope: !359, file: !14, line: 1412, baseType: !362, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !359, file: !14, line: 1413, baseType: !365, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsUInt64Number", file: !14, line: 138, baseType: !366)
!366 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "technology", scope: !359, file: !14, line: 1414, baseType: !368, size: 32, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsTechnologySignature", file: !14, line: 438, baseType: !142)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ProfileID", scope: !359, file: !14, line: 1415, baseType: !370, size: 128, offset: 160)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsProfileID", file: !14, line: 611, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !14, line: 606, size: 128, elements: !372)
!372 = !{!373, !375, !379}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ID8", scope: !371, file: !14, line: 607, baseType: !374, size: 128)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, elements: !245)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ID16", scope: !371, file: !14, line: 608, baseType: !376, size: 128)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 128, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 8)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ID32", scope: !371, file: !14, line: 609, baseType: !380, size: 128)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 128, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 4)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Manufacturer", scope: !359, file: !14, line: 1416, baseType: !384, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsMLU", file: !14, line: 1303, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cms_MLU_struct", file: !17, line: 735, size: 320, elements: !387)
!387 = !{!388, !389, !390, !391, !400, !401, !402}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !386, file: !17, line: 737, baseType: !13, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatedEntries", scope: !386, file: !17, line: 740, baseType: !36, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "UsedEntries", scope: !386, file: !17, line: 741, baseType: !36, size: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !386, file: !17, line: 742, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsMLUentry", file: !17, line: 733, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 725, size: 96, elements: !395)
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Language", scope: !394, file: !17, line: 727, baseType: !171, size: 16)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Country", scope: !394, file: !17, line: 728, baseType: !171, size: 16, offset: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "StrW", scope: !394, file: !17, line: 730, baseType: !36, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Len", scope: !394, file: !17, line: 731, baseType: !36, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "PoolSize", scope: !386, file: !17, line: 745, baseType: !36, size: 32, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "PoolUsed", scope: !386, file: !17, line: 746, baseType: !36, size: 32, offset: 224)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "MemPool", scope: !386, file: !17, line: 747, baseType: !10, size: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Model", scope: !359, file: !14, line: 1417, baseType: !384, size: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Description", scope: !359, file: !14, line: 1418, baseType: !384, size: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dwOriginalFlags", scope: !208, file: !17, line: 1068, baseType: !36, size: 32, offset: 1664)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "AdaptationState", scope: !208, file: !17, line: 1069, baseType: !177, size: 64, offset: 1728)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "RenderingIntent", scope: !208, file: !17, line: 1072, baseType: !36, size: 32, offset: 1792)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !208, file: !17, line: 1075, baseType: !13, size: 64, offset: 1856)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "UserData", scope: !208, file: !17, line: 1078, baseType: !10, size: 64, offset: 1920)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "FreeUserData", scope: !208, file: !17, line: 1079, baseType: !302, size: 64, offset: 1984)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "OldXform", scope: !208, file: !17, line: 1082, baseType: !412, size: 64, offset: 2048)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsTransformFn", file: !51, line: 595, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !217, !11, !10, !36, !36}
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !429, !430, !431, !432, !433, !436, !437, !438, !439, !442, !443, !444}
!417 = !DILocalVariable(name: "p", arg: 1, scope: !203, file: !3, line: 536, type: !206)
!418 = !DILocalVariable(name: "in", arg: 2, scope: !203, file: !3, line: 536, type: !11)
!419 = !DILocalVariable(name: "out", arg: 3, scope: !203, file: !3, line: 537, type: !10)
!420 = !DILocalVariable(name: "PixelsPerLine", arg: 4, scope: !203, file: !3, line: 538, type: !36)
!421 = !DILocalVariable(name: "LineCount", arg: 5, scope: !203, file: !3, line: 539, type: !36)
!422 = !DILocalVariable(name: "Stride", arg: 6, scope: !203, file: !3, line: 540, type: !218)
!423 = !DILocalVariable(name: "i", scope: !203, file: !3, line: 542, type: !36)
!424 = !DILocalVariable(name: "j", scope: !203, file: !3, line: 542, type: !36)
!425 = !DILocalVariable(name: "k", scope: !203, file: !3, line: 542, type: !36)
!426 = !DILocalVariable(name: "nExtra", scope: !203, file: !3, line: 543, type: !36)
!427 = !DILocalVariable(name: "SourceStartingOrder", scope: !203, file: !3, line: 544, type: !428)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 512, elements: !245)
!429 = !DILocalVariable(name: "SourceIncrements", scope: !203, file: !3, line: 545, type: !428)
!430 = !DILocalVariable(name: "DestStartingOrder", scope: !203, file: !3, line: 546, type: !428)
!431 = !DILocalVariable(name: "DestIncrements", scope: !203, file: !3, line: 547, type: !428)
!432 = !DILocalVariable(name: "copyValueFn", scope: !203, file: !3, line: 549, type: !6)
!433 = !DILocalVariable(name: "SourcePtr", scope: !434, file: !3, line: 579, type: !32)
!434 = distinct !DILexicalBlock(scope: !435, file: !3, line: 577, column: 22)
!435 = distinct !DILexicalBlock(scope: !203, file: !3, line: 577, column: 9)
!436 = !DILocalVariable(name: "DestPtr", scope: !434, file: !3, line: 580, type: !32)
!437 = !DILocalVariable(name: "SourceStrideIncrement", scope: !434, file: !3, line: 582, type: !36)
!438 = !DILocalVariable(name: "DestStrideIncrement", scope: !434, file: !3, line: 583, type: !36)
!439 = !DILocalVariable(name: "SourcePtr", scope: !440, file: !3, line: 607, type: !441)
!440 = distinct !DILexicalBlock(scope: !435, file: !3, line: 605, column: 10)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1024, elements: !245)
!442 = !DILocalVariable(name: "DestPtr", scope: !440, file: !3, line: 608, type: !441)
!443 = !DILocalVariable(name: "SourceStrideIncrements", scope: !440, file: !3, line: 610, type: !428)
!444 = !DILocalVariable(name: "DestStrideIncrements", scope: !440, file: !3, line: 611, type: !428)
!445 = !{!446, !446, i64 0}
!446 = !{!"any pointer", !447, i64 0}
!447 = !{!"omnipotent char", !448, i64 0}
!448 = !{!"Simple C/C++ TBAA"}
!449 = !DILocation(line: 536, column: 45, scope: !203)
!450 = !DILocation(line: 536, column: 60, scope: !203)
!451 = !DILocation(line: 537, column: 54, scope: !203)
!452 = !{!453, !453, i64 0}
!453 = !{!"int", !447, i64 0}
!454 = !DILocation(line: 538, column: 64, scope: !203)
!455 = !DILocation(line: 539, column: 64, scope: !203)
!456 = !DILocation(line: 540, column: 65, scope: !203)
!457 = !DILocation(line: 542, column: 5, scope: !203)
!458 = !DILocation(line: 542, column: 21, scope: !203)
!459 = !DILocation(line: 542, column: 24, scope: !203)
!460 = !DILocation(line: 542, column: 27, scope: !203)
!461 = !DILocation(line: 543, column: 5, scope: !203)
!462 = !DILocation(line: 543, column: 21, scope: !203)
!463 = !DILocation(line: 544, column: 5, scope: !203)
