; ModuleID = 'samples/419.bc'
source_filename = "struct.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.definition_struct = type { %struct.bt_definition, ptr, ptr }
%struct.bt_definition = type { ptr, i32, i32, i32, i32, ptr }
%struct._GPtrArray = type { ptr, i32 }
%struct.bt_declaration = type { i32, i64, i32, ptr, ptr, ptr }
%struct.bt_stream_pos = type { ptr, ptr, ptr, ptr, ptr }
%struct.declaration_struct = type { %struct.bt_declaration, ptr, ptr, ptr }
%struct._GArray = type { ptr, i32 }
%struct.declaration_field = type { i32, ptr }

@.str = private unnamed_addr constant [35 x i8] c"pos->rw_table[dispatch_id] != NULL\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"../include/babeltrace/types.h\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.generic_rw = private unnamed_addr constant [63 x i8] c"int generic_rw(struct bt_stream_pos *, struct bt_definition *)\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [22 x i8] c"!ret || ret == -EPERM\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [9 x i8] c"struct.c\00", align 1, !dbg !24
@__PRETTY_FUNCTION__._struct_definition_new = private unnamed_addr constant [124 x i8] c"struct bt_definition *_struct_definition_new(struct bt_declaration *, struct definition_scope *, GQuark, int, const char *)\00", align 1, !dbg !29

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "../include/babeltrace/types.h", directory: "/local-ssd/babeltrace-ltsh36prkey7v3qgu5igo3lgbpgjtjyj-build/aidengro/spack-stage-babeltrace-1.2.4-ltsh36prkey7v3qgu5igo3lgbpgjtjyj/spack-src/types", checksumkind: CSK_MD5, checksum: "f3c4a6ec3715821c96628bfd5e29fc9b")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 35)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 30)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 504, elements: !16)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!16 = !{!17}
!17 = !DISubrange(count: 63)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(scope: null, file: !20, line: 136, type: !21, isLocal: true, isDefinition: true)
!20 = !DIFile(filename: "struct.c", directory: "/local-ssd/babeltrace-ltsh36prkey7v3qgu5igo3lgbpgjtjyj-build/aidengro/spack-stage-babeltrace-1.2.4-ltsh36prkey7v3qgu5igo3lgbpgjtjyj/spack-src/types", checksumkind: CSK_MD5, checksum: "1d05e23ef8e4bc673889de29f9cb2553")
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 22)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(scope: null, file: !20, line: 136, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 9)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !20, line: 136, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 992, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 124)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !20, line: 173, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 58)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !20, line: 173, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 424, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 53)
!44 = distinct !DICompileUnit(language: DW_LANG_C11, file: !20, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !45, retainedTypes: !61, globals: !160, splitDebugInlining: false, nameTableKind: None)
!45 = !{!46}
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ctf_type_id", file: !47, line: 63, baseType: !48, size: 32, elements: !49)
!47 = !DIFile(filename: "../include/babeltrace/ctf/events.h", directory: "/local-ssd/babeltrace-ltsh36prkey7v3qgu5igo3lgbpgjtjyj-build/aidengro/spack-stage-babeltrace-1.2.4-ltsh36prkey7v3qgu5igo3lgbpgjtjyj/spack-src/types", checksumkind: CSK_MD5, checksum: "94e6bc16713c74e95d4df9cedcb70078")
!48 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!50 = !DIEnumerator(name: "CTF_TYPE_UNKNOWN", value: 0)
!51 = !DIEnumerator(name: "CTF_TYPE_INTEGER", value: 1)
!52 = !DIEnumerator(name: "CTF_TYPE_FLOAT", value: 2)
!53 = !DIEnumerator(name: "CTF_TYPE_ENUM", value: 3)
!54 = !DIEnumerator(name: "CTF_TYPE_STRING", value: 4)
!55 = !DIEnumerator(name: "CTF_TYPE_STRUCT", value: 5)
!56 = !DIEnumerator(name: "CTF_TYPE_UNTAGGED_VARIANT", value: 6)
!57 = !DIEnumerator(name: "CTF_TYPE_VARIANT", value: 7)
!58 = !DIEnumerator(name: "CTF_TYPE_ARRAY", value: 8)
!59 = !DIEnumerator(name: "CTF_TYPE_SEQUENCE", value: 9)
!60 = !DIEnumerator(name: "NR_CTF_TYPES", value: 10)
!61 = !{!62, !149, !124, !150, !151, !147, !146, !76, !156, !78, !159}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "definition_struct", file: !2, line: 256, size: 384, elements: !64)
!64 = !{!65, !123, !139}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !63, file: !2, line: 257, baseType: !66, size: 256)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bt_definition", file: !2, line: 100, size: 256, elements: !67)
!67 = !{!68, !118, !119, !120, !121, !122}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "declaration", scope: !66, file: !2, line: 101, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bt_declaration", file: !2, line: 81, size: 384, elements: !71)
!71 = !{!72, !73, !77, !79, !83, !114}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !70, file: !2, line: 82, baseType: !46, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !70, file: !2, line: 83, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 70, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!76 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !70, file: !2, line: 84, baseType: !78, size: 32, offset: 128)
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "declaration_free", scope: !70, file: !2, line: 88, baseType: !80, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !69}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "definition_new", scope: !70, file: !2, line: 90, baseType: !84, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !69, !88, !109, !78, !113}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "definition_scope", file: !2, line: 66, size: 192, elements: !90)
!90 = !{!91, !96, !97}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "definitions", scope: !89, file: !2, line: 68, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !94, line: 40, baseType: !95)
!94 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__sp/linux-ubuntu22.04-zen2/clang-18.0.0/glib-2.78.0-3gqao4bugh5cvju6k4tvz5724i6ntyf7/include/glib-2.0/glib/ghash.h", directory: "/local-ssd/babeltrace-ltsh36prkey7v3qgu5igo3lgbpgjtjyj-build", checksumkind: CSK_MD5, checksum: "ff178276f16d53966cd41952349b047f")
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !94, line: 40, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "parent_scope", scope: !89, file: !2, line: 69, baseType: !88, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "scope_path", scope: !89, file: !2, line: 78, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !100, line: 39, baseType: !101)
!100 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__sp/linux-ubuntu22.04-zen2/clang-18.0.0/glib-2.78.0-3gqao4bugh5cvju6k4tvz5724i6ntyf7/include/glib-2.0/glib/garray.h", directory: "/local-ssd/babeltrace-ltsh36prkey7v3qgu5igo3lgbpgjtjyj-build", checksumkind: CSK_MD5, checksum: "24464ffabff9776f21c3b3e9eb512110")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !100, line: 43, size: 128, elements: !102)
!102 = !{!103, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !101, file: !100, line: 45, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !106, line: 52, baseType: !4)
!106 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__sp/linux-ubuntu22.04-zen2/clang-18.0.0/glib-2.78.0-3gqao4bugh5cvju6k4tvz5724i6ntyf7/include/glib-2.0/glib/gtypes.h", directory: "/local-ssd/babeltrace-ltsh36prkey7v3qgu5igo3lgbpgjtjyj-build", checksumkind: CSK_MD5, checksum: "bb471ab4f4c8d1bff5846ccdfd1b3ac4")
!107 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !101, file: !100, line: 46, baseType: !108, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !106, line: 61, baseType: !48)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !110, line: 38, baseType: !111)
!110 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__sp/linux-ubuntu22.04-zen2/clang-18.0.0/glib-2.78.0-3gqao4bugh5cvju6k4tvz5724i6ntyf7/include/glib-2.0/glib/gquark.h", directory: "/local-ssd/babeltrace-ltsh36prkey7v3qgu5igo3lgbpgjtjyj-build", checksumkind: CSK_MD5, checksum: "faea4af9793ef6f769fba7d824d6e90e")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !112, line: 56, baseType: !48)
!112 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__sp/linux-ubuntu22.04-zen2/clang-18.0.0/glib-2.78.0-3gqao4bugh5cvju6k4tvz5724i6ntyf7/lib/glib-2.0/include/glibconfig.h", directory: "/local-ssd/babeltrace-ltsh36prkey7v3qgu5igo3lgbpgjtjyj-build", checksumkind: CSK_MD5, checksum: "9ffe497af55cf05235a0b35b38ac2c19")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "definition_free", scope: !70, file: !2, line: 97, baseType: !115, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !87}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !66, file: !2, line: 102, baseType: !78, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !66, file: !2, line: 103, baseType: !109, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !66, file: !2, line: 104, baseType: !78, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !66, file: !2, line: 105, baseType: !109, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !66, file: !2, line: 106, baseType: !88, size: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "declaration", scope: !63, file: !2, line: 258, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "declaration_struct", file: !2, line: 249, size: 576, elements: !126)
!126 = !{!127, !128, !129, !138}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !125, file: !2, line: 250, baseType: !70, size: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fields_by_name", scope: !125, file: !2, line: 251, baseType: !92, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !125, file: !2, line: 252, baseType: !130, size: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "declaration_scope", file: !2, line: 52, size: 320, elements: !132)
!132 = !{!133, !134, !135, !136, !137}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "typedef_declarations", scope: !131, file: !2, line: 55, baseType: !92, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "struct_declarations", scope: !131, file: !2, line: 57, baseType: !92, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "variant_declarations", scope: !131, file: !2, line: 59, baseType: !92, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "enum_declarations", scope: !131, file: !2, line: 61, baseType: !92, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "parent_scope", scope: !131, file: !2, line: 62, baseType: !130, size: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !125, file: !2, line: 253, baseType: !98, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !63, file: !2, line: 259, baseType: !140, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !100, line: 41, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !100, line: 55, size: 128, elements: !143)
!143 = !{!144, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !142, file: !100, line: 57, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !106, line: 109, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !142, file: !100, line: 58, baseType: !108, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !112, line: 82, baseType: !76)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "declaration_field", file: !2, line: 244, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !2, line: 245, baseType: !109, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "declaration", scope: !152, file: !2, line: 246, baseType: !69, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !106, line: 110, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!160 = !{!0, !7, !12, !18, !24, !29, !34, !39}
!161 = !{i32 7, !"Dwarf Version", i32 5}
!162 = !{i32 2, !"Debug Info Version", i32 3}
!163 = !{i32 1, !"wchar_size", i32 4}
!164 = !{i32 8, !"PIC Level", i32 2}
!165 = !{i32 7, !"uwtable", i32 2}
!166 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!167 = distinct !DISubprogram(name: "bt_struct_rw", scope: !20, file: !20, line: 46, type: !168, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !44, retainedNodes: !192)
!168 = !DISubroutineType(types: !169)
!169 = !{!78, !170, !87}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bt_stream_pos", file: !2, line: 113, size: 320, elements: !172)
!172 = !{!173, !177, !183, !190, !191}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "rw_table", scope: !171, file: !2, line: 115, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "rw_dispatch", file: !2, line: 109, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "event_cb", scope: !171, file: !2, line: 116, baseType: !178, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!78, !170, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctf_stream_definition", file: !2, line: 45, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pre_trace_cb", scope: !171, file: !2, line: 118, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!78, !170, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "bt_trace_descriptor", file: !189, line: 47, flags: DIFlagFwdDecl)
!189 = !DIFile(filename: "../include/babeltrace/format.h", directory: "/local-ssd/babeltrace-ltsh36prkey7v3qgu5igo3lgbpgjtjyj-build/aidengro/spack-stage-babeltrace-1.2.4-ltsh36prkey7v3qgu5igo3lgbpgjtjyj/spack-src/types", checksumkind: CSK_MD5, checksum: "8b73d2e240348b75e8476ff9731b0bfe")
!190 = !DIDerivedType(tag: DW_TAG_member, name: "post_trace_cb", scope: !171, file: !2, line: 120, baseType: !184, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "trace", scope: !171, file: !2, line: 122, baseType: !187, size: 64, offset: 256)
!192 = !{!193, !194, !195, !196, !200, !201, !202}
!193 = !DILocalVariable(name: "ppos", arg: 1, scope: !167, file: !20, line: 46, type: !170)
!194 = !DILocalVariable(name: "definition", arg: 2, scope: !167, file: !20, line: 46, type: !87)
!195 = !DILocalVariable(name: "struct_definition", scope: !167, file: !20, line: 48, type: !62)
!196 = !DILocalVariable(name: "__ptr", scope: !197, file: !20, line: 49, type: !198)
!197 = distinct !DILexicalBlock(scope: !167, file: !20, line: 49, column: 3)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!200 = !DILocalVariable(name: "i", scope: !167, file: !20, line: 50, type: !76)
!201 = !DILocalVariable(name: "ret", scope: !167, file: !20, line: 51, type: !78)
!202 = !DILocalVariable(name: "field", scope: !203, file: !20, line: 54, type: !87)
!203 = distinct !DILexicalBlock(scope: !204, file: !20, line: 53, column: 55)
!204 = distinct !DILexicalBlock(scope: !205, file: !20, line: 53, column: 2)
!205 = distinct !DILexicalBlock(scope: !167, file: !20, line: 53, column: 2)
!206 = !{!207, !207, i64 0}
!207 = !{!"any pointer", !208, i64 0}
!208 = !{!"omnipotent char", !209, i64 0}
!209 = !{!"Simple C/C++ TBAA"}
!210 = !DILocation(line: 46, column: 40, scope: !167)
!211 = !DILocation(line: 46, column: 68, scope: !167)
!212 = !DILocation(line: 48, column: 2, scope: !167)
!213 = !DILocation(line: 48, column: 28, scope: !167)
!214 = !DILocation(line: 49, column: 3, scope: !197)
!215 = !DILocation(line: 49, column: 3, scope: !167)
!216 = !DILocation(line: 50, column: 2, scope: !167)
!217 = !DILocation(line: 50, column: 16, scope: !167)
!218 = !DILocation(line: 51, column: 2, scope: !167)
!219 = !DILocation(line: 51, column: 6, scope: !167)
!220 = !DILocation(line: 53, column: 9, scope: !205)
!221 = !{!222, !222, i64 0}
!222 = !{!"long", !208, i64 0}
!223 = !DILocation(line: 53, column: 7, scope: !205)
!224 = !DILocation(line: 53, column: 14, scope: !204)
!225 = !DILocation(line: 53, column: 18, scope: !204)
!226 = !DILocation(line: 53, column: 37, scope: !204)
!227 = !{!228, !207, i64 40}
!228 = !{!"definition_struct", !229, i64 0, !207, i64 32, !207, i64 40}
!229 = !{!"bt_definition", !207, i64 0, !230, i64 8, !230, i64 12, !230, i64 16, !230, i64 20, !207, i64 24}
!230 = !{!"int", !208, i64 0}
!231 = !DILocation(line: 53, column: 45, scope: !204)
!232 = !{!233, !230, i64 8}
!233 = !{!"_GPtrArray", !207, i64 0, !230, i64 8}
!234 = !DILocation(line: 53, column: 16, scope: !204)
!235 = !DILocation(line: 53, column: 2, scope: !205)
!236 = !DILocation(line: 54, column: 3, scope: !203)
!237 = !DILocation(line: 54, column: 25, scope: !203)
!238 = !DILocation(line: 55, column: 4, scope: !203)
!239 = !{!233, !207, i64 0}
!240 = !DILocation(line: 56, column: 20, scope: !203)
!241 = !DILocation(line: 56, column: 26, scope: !203)
!242 = !DILocation(line: 56, column: 9, scope: !203)
!243 = !DILocation(line: 56, column: 7, scope: !203)
!244 = !{!230, !230, i64 0}
!245 = !DILocation(line: 57, column: 7, scope: !246)
!246 = distinct !DILexicalBlock(scope: !203, file: !20, line: 57, column: 7)
!247 = !DILocation(line: 57, column: 7, scope: !203)
!248 = !DILocation(line: 58, column: 11, scope: !246)
!249 = !DILocation(line: 58, column: 4, scope: !246)
!250 = !DILocation(line: 59, column: 2, scope: !204)
!251 = !DILocation(line: 59, column: 2, scope: !203)
!252 = !DILocation(line: 53, column: 51, scope: !204)
!253 = !DILocation(line: 53, column: 2, scope: !204)
!254 = distinct !{!254, !235, !255, !256}
!255 = !DILocation(line: 59, column: 2, scope: !205)
!256 = !{!"llvm.loop.mustprogress"}
!257 = !DILocation(line: 60, column: 2, scope: !167)
!258 = !DILocation(line: 61, column: 1, scope: !167)
