; ModuleID = 'samples/42.bc'
source_filename = "src/extended/rcr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtRcrEncoder = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, [10 x i64], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8 }
%struct.bam1_t = type { %struct.bam1_core_t, i32, i32, i32, ptr }
%struct.bam1_core_t = type { i32, i32, i64, i32, i32, i32, i32 }
%struct.GtRcrDecoder = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, [10 x i64], i64, i64, i64, i64, i64, i8, i8, i8, i8, i8 }
%struct.RcrDecodeInfo = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64 }
%struct.MedianData = type { i64, i64, i64 }
%struct.RcrData = type { ptr }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"!err || !gt_error_is_set(err)\00", align 1, !dbg !7

!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2042, type: !172, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2043, type: !197, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2044, type: !122, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2045, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 4)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2046, type: !72, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2048, type: !300, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2053, type: !300, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2055, type: !72, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2069, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 18)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1765, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 168, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 21)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1884, type: !135, isLocal: true, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !324, retainedTypes: !333, globals: !455, splitDebugInlining: false, nameTableKind: None)
!324 = !{!325}
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GtReadmode", file: !326, line: 23, baseType: !327, size: 32, elements: !328)
!326 = !DIFile(filename: "src/core/readmode_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1b062e226e296972a431b9bfcad13aa9")
!327 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!328 = !{!329, !330, !331, !332}
!329 = !DIEnumerator(name: "GT_READMODE_FORWARD", value: 0)
!330 = !DIEnumerator(name: "GT_READMODE_REVERSE", value: 1)
!331 = !DIEnumerator(name: "GT_READMODE_COMPL", value: 2)
!332 = !DIEnumerator(name: "GT_READMODE_REVCOMPL", value: 3)
!333 = !{!334, !335, !338, !340, !376, !378, !380, !354, !357, !373, !4, !381, !350, !382, !389, !393, !394, !451, !407, !327}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !336, line: 83, baseType: !337)
!336 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!337 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtWord", file: !336, line: 94, baseType: !339)
!339 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "bam1_t", file: !342, line: 200, baseType: !343)
!342 = !DIFile(filename: "src/external/samtools-0.1.18/samtools/bam.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "20fe88986d14117a2a12b31ff8325a7a")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 196, size: 448, elements: !344)
!344 = !{!345, !368, !369, !370, !371}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !343, file: !342, line: 197, baseType: !346, size: 256)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "bam1_core_t", file: !342, line: 180, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 171, size: 256, elements: !348)
!348 = !{!349, !355, !356, !360, !361, !362, !363, !364, !365, !366, !367}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !347, file: !342, line: 172, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !351, line: 26, baseType: !352)
!351 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !353, line: 41, baseType: !354)
!353 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!354 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !347, file: !342, line: 173, baseType: !350, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "bin", scope: !347, file: !342, line: 174, baseType: !357, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !358, line: 26, baseType: !359)
!358 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !353, line: 42, baseType: !327)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !347, file: !342, line: 174, baseType: !357, size: 8, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "l_qname", scope: !347, file: !342, line: 174, baseType: !357, size: 8, offset: 88, flags: DIFlagBitField, extraData: i64 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !342, line: 175, baseType: !357, size: 16, offset: 96, flags: DIFlagBitField, extraData: i64 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "n_cigar", scope: !347, file: !342, line: 175, baseType: !357, size: 16, offset: 112, flags: DIFlagBitField, extraData: i64 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "l_qseq", scope: !347, file: !342, line: 176, baseType: !350, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mtid", scope: !347, file: !342, line: 177, baseType: !350, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mpos", scope: !347, file: !342, line: 178, baseType: !350, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "isize", scope: !347, file: !342, line: 179, baseType: !350, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "l_aux", scope: !343, file: !342, line: 198, baseType: !354, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !343, file: !342, line: 198, baseType: !354, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "m_data", scope: !343, file: !342, line: 198, baseType: !354, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !343, file: !342, line: 199, baseType: !372, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !358, line: 24, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !353, line: 38, baseType: !375)
!375 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !377, line: 70, baseType: !337)
!377 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUint64", file: !336, line: 100, baseType: !379)
!379 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUchar", file: !336, line: 102, baseType: !375)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "MedianData", file: !2, line: 167, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MedianData", file: !2, line: 163, size: 192, elements: !385)
!385 = !{!386, !387, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !384, file: !2, line: 164, baseType: !378, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !384, file: !2, line: 165, baseType: !378, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "median", scope: !384, file: !2, line: 166, baseType: !335, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtDiscDistri", file: !391, line: 28, baseType: !392)
!391 = !DIFile(filename: "src/core/disc_distri_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "ea77d3a31f805c2b29f06f3f4a9121a8")
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtDiscDistri", file: !391, line: 28, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcrData", file: !2, line: 1147, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 1145, size: 64, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !396, file: !2, line: 1146, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !401, line: 7, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !403, line: 49, size: 1728, elements: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!404 = !{!405, !406, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !421, !423, !424, !425, !427, !429, !431, !435, !438, !440, !443, !446, !447, !448, !449, !450}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !402, file: !403, line: 51, baseType: !354, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !402, file: !403, line: 54, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !402, file: !403, line: 55, baseType: !407, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !402, file: !403, line: 56, baseType: !407, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !402, file: !403, line: 57, baseType: !407, size: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !402, file: !403, line: 58, baseType: !407, size: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !402, file: !403, line: 59, baseType: !407, size: 64, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !402, file: !403, line: 60, baseType: !407, size: 64, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !402, file: !403, line: 61, baseType: !407, size: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !402, file: !403, line: 64, baseType: !407, size: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !402, file: !403, line: 65, baseType: !407, size: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !402, file: !403, line: 66, baseType: !407, size: 64, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !402, file: !403, line: 68, baseType: !419, size: 64, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !403, line: 36, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !402, file: !403, line: 70, baseType: !422, size: 64, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !402, file: !403, line: 72, baseType: !354, size: 32, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !402, file: !403, line: 73, baseType: !354, size: 32, offset: 928)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !402, file: !403, line: 74, baseType: !426, size: 64, offset: 960)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !353, line: 152, baseType: !339)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !402, file: !403, line: 77, baseType: !428, size: 16, offset: 1024)
!428 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !402, file: !403, line: 78, baseType: !430, size: 8, offset: 1040)
!430 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !402, file: !403, line: 79, baseType: !432, size: 8, offset: 1048)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 1)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !402, file: !403, line: 81, baseType: !436, size: 64, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !403, line: 43, baseType: null)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !402, file: !403, line: 89, baseType: !439, size: 64, offset: 1152)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !353, line: 153, baseType: !339)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !402, file: !403, line: 91, baseType: !441, size: 64, offset: 1216)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !403, line: 37, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !402, file: !403, line: 92, baseType: !444, size: 64, offset: 1280)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !403, line: 38, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !402, file: !403, line: 93, baseType: !422, size: 64, offset: 1344)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !402, file: !403, line: 94, baseType: !334, size: 64, offset: 1408)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !402, file: !403, line: 95, baseType: !376, size: 64, offset: 1472)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !402, file: !403, line: 96, baseType: !354, size: 32, offset: 1536)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !402, file: !403, line: 98, baseType: !185, size: 160, offset: 1568)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBitsequence", file: !452, line: 37, baseType: !453)
!452 = !DIFile(filename: "src/core/intbits.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e96e7c07f92e8441cb7955436fed7622")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !358, line: 27, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !353, line: 45, baseType: !337)
!455 = !{!0, !7, !12, !18, !21, !26, !31, !36, !41, !46, !48, !53, !58, !60, !65, !70, !75, !77, !79, !84, !89, !91, !96, !101, !103, !105, !110, !115, !120, !125, !130, !133, !138, !140, !143, !145, !147, !152, !154, !157, !159, !161, !163, !168, !170, !173, !178, !183, !188, !193, !195, !200, !205, !207, !209, !214, !219, !221, !224, !227, !229, !231, !236, !241, !244, !247, !252, !255, !260, !265, !268, !270, !272, !277, !279, !281, !286, !288, !290, !292, !294, !296, !298, !303, !305, !307, !309, !311, !316, !321}
!456 = !{i32 7, !"Dwarf Version", i32 5}
!457 = !{i32 2, !"Debug Info Version", i32 3}
!458 = !{i32 1, !"wchar_size", i32 4}
!459 = !{i32 8, !"PIC Level", i32 2}
!460 = !{i32 7, !"uwtable", i32 2}
!461 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!462 = distinct !DISubprogram(name: "gt_rcr_encoder_new", scope: !2, file: !2, line: 1089, type: !463, scopeLine: 1098, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !323, retainedNodes: !597)
!463 = !DISubroutineType(types: !464)
!464 = !{!465, !548, !496, !586, !586, !586, !586, !586, !593, !497}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtRcrEncoder", file: !467, line: 30, baseType: !468)
!467 = !DIFile(filename: "src/extended/rcr.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1a31383c67d9b10e0e56ff93260e71ad")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtRcrEncoder", file: !2, line: 80, size: 3584, elements: !469)
!469 = !{!470, !471, !472, !477, !516, !517, !518, !519, !520, !521, !526, !531, !532, !537, !538, !539, !540, !541, !546, !547, !553, !554, !556, !561, !562, !563, !564, !565, !566, !567, !568, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !587, !588, !589, !590, !591, !592}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !468, file: !2, line: 81, baseType: !399, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "unmapped_reads_ptr", scope: !468, file: !2, line: 82, baseType: !399, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !468, file: !2, line: 83, baseType: !473, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBitOutStream", file: !475, line: 27, baseType: !476)
!475 = !DIFile(filename: "src/extended/bitoutstream.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "356357e7c5e1bd20c9f6799efe0a26f2")
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtBitOutStream", file: !475, line: 27, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "cstr_iterator", scope: !468, file: !2, line: 84, baseType: !478, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCstrIterator", file: !480, line: 26, baseType: !481)
!480 = !DIFile(filename: "src/extended/cstr_iterator.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "4aa8c31dd37c155ff2e26267be9dee92")
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtCstrIterator", file: !482, line: 33, size: 128, elements: !483)
!482 = !DIFile(filename: "src/extended/cstr_iterator_rep.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "d89cff8e3f268c0642a29fc47ea1e18e")
!483 = !{!484, !512}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "c_class", scope: !481, file: !482, line: 34, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCstrIteratorClass", file: !482, line: 24, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtCstrIteratorClass", file: !482, line: 38, size: 256, elements: !489)
!489 = !{!490, !501, !506, !511}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "next_func", scope: !488, file: !482, line: 39, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCstrIteratorNextFunc", file: !482, line: 27, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!354, !478, !495, !497}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !499, line: 44, baseType: !500)
!499 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !499, line: 44, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reset_func", scope: !488, file: !482, line: 40, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCstrIteratorResetFunc", file: !482, line: 30, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!354, !478, !497}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "delete_func", scope: !488, file: !482, line: 41, baseType: !507, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCstrIteratorDeleteFunc", file: !482, line: 31, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !478}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !488, file: !482, line: 42, baseType: !376, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !481, file: !482, line: 35, baseType: !513, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCstrIteratorMembers", file: !482, line: 25, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtCstrIteratorMembers", file: !482, line: 25, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "readlength_distr", scope: !468, file: !2, line: 85, baseType: !389, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "readpos_distr", scope: !468, file: !2, line: 86, baseType: !389, size: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "varpos_distr", scope: !468, file: !2, line: 87, baseType: !389, size: 64, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "qual_distr", scope: !468, file: !2, line: 88, baseType: !389, size: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "qual_mapping_distr", scope: !468, file: !2, line: 89, baseType: !389, size: 64, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "encdesc_enc", scope: !468, file: !2, line: 90, baseType: !522, size: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncdescEncoder", file: !524, line: 34, baseType: !525)
!524 = !DIFile(filename: "src/extended/encdesc.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "f7b208b0f13677b9e64be33726d83019")
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncdescEncoder", file: !524, line: 34, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "readpos_golomb", scope: !468, file: !2, line: 91, baseType: !527, size: 64, offset: 640)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtGolomb", file: !529, line: 27, baseType: !530)
!529 = !DIFile(filename: "src/extended/golomb.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "9a4f79eda12bd4b7444316ab55545a3c")
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtGolomb", file: !529, line: 27, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "varpos_golomb", scope: !468, file: !2, line: 92, baseType: !527, size: 64, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "readlenghts_huff", scope: !468, file: !2, line: 93, baseType: !533, size: 64, offset: 768)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtHuffman", file: !535, line: 28, baseType: !536)
!535 = !DIFile(filename: "src/extended/huffcode.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "127c952750a6598d0846275020bb1eae")
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtHuffman", file: !535, line: 28, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "qual_huff", scope: !468, file: !2, line: 94, baseType: !533, size: 64, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "qual_mapping_huff", scope: !468, file: !2, line: 95, baseType: !533, size: 64, offset: 896)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "cigar_ops_huff", scope: !468, file: !2, line: 96, baseType: !533, size: 64, offset: 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bases_huff", scope: !468, file: !2, line: 97, baseType: !533, size: 64, offset: 1024)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sam_iter", scope: !468, file: !2, line: 98, baseType: !542, size: 64, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtSamfileIterator", file: !544, line: 26, baseType: !545)
!544 = !DIFile(filename: "src/extended/samfile_iterator.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "a05f2eaff092eda4f487b59dc6a8cb78")
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtSamfileIterator", file: !544, line: 26, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sam_align", scope: !468, file: !2, line: 99, baseType: !340, size: 64, offset: 1152)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "encseq", scope: !468, file: !2, line: 100, baseType: !548, size: 64, offset: 1216)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseq", file: !551, line: 48, baseType: !552)
!551 = !DIFile(filename: "src/core/encseq_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "bab4512cadee996edd2995020539d931")
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncseq", file: !551, line: 48, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "samfilename", scope: !468, file: !2, line: 101, baseType: !496, size: 64, offset: 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ins_bases", scope: !468, file: !2, line: 102, baseType: !555, size: 64, offset: 1344)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "not_exact_matches", scope: !468, file: !2, line: 103, baseType: !557, size: 64, offset: 1408)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtQueue", file: !559, line: 27, baseType: !560)
!559 = !DIFile(filename: "src/core/queue_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1b28eb0773dae9882bbfb996eb03a2cd")
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtQueue", file: !559, line: 27, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "all_bits", scope: !468, file: !2, line: 104, baseType: !378, size: 64, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dellen_bits", scope: !468, file: !2, line: 105, baseType: !378, size: 64, offset: 1536)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbases", scope: !468, file: !2, line: 106, baseType: !378, size: 64, offset: 1600)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "exact_match_flag_bits", scope: !468, file: !2, line: 107, baseType: !378, size: 64, offset: 1664)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ins_bases_bits", scope: !468, file: !2, line: 108, baseType: !378, size: 64, offset: 1728)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mapqual_bits", scope: !468, file: !2, line: 109, baseType: !378, size: 64, offset: 1792)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pos_bits", scope: !468, file: !2, line: 110, baseType: !378, size: 64, offset: 1856)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "present_cigar_ops", scope: !468, file: !2, line: 111, baseType: !569, size: 640, offset: 1920)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 640, elements: !166)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "qual_bits", scope: !468, file: !2, line: 112, baseType: !378, size: 64, offset: 2560)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "readlen_bits", scope: !468, file: !2, line: 113, baseType: !378, size: 64, offset: 2624)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sclip_bits", scope: !468, file: !2, line: 114, baseType: !378, size: 64, offset: 2688)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "skiplen_bits", scope: !468, file: !2, line: 115, baseType: !378, size: 64, offset: 2752)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "strand_bits", scope: !468, file: !2, line: 116, baseType: !378, size: 64, offset: 2816)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "subs_bits", scope: !468, file: !2, line: 117, baseType: !378, size: 64, offset: 2880)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "varpos_bits", scope: !468, file: !2, line: 118, baseType: !378, size: 64, offset: 2944)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "vartype_bits", scope: !468, file: !2, line: 119, baseType: !378, size: 64, offset: 3008)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cur_read", scope: !468, file: !2, line: 120, baseType: !335, size: 64, offset: 3072)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "cur_seq_startpos", scope: !468, file: !2, line: 121, baseType: !335, size: 64, offset: 3136)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "max_read_length", scope: !468, file: !2, line: 122, baseType: !335, size: 64, offset: 3200)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "numofreads", scope: !468, file: !2, line: 123, baseType: !335, size: 64, offset: 3264)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "numofunmappedreads", scope: !468, file: !2, line: 124, baseType: !335, size: 64, offset: 3328)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "prev_readpos", scope: !468, file: !2, line: 125, baseType: !335, size: 64, offset: 3392)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "readlength", scope: !468, file: !2, line: 126, baseType: !335, size: 64, offset: 3456)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "cons_readlength", scope: !468, file: !2, line: 127, baseType: !586, size: 8, offset: 3520)
!586 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "is_num_fields_cons", scope: !468, file: !2, line: 128, baseType: !586, size: 8, offset: 3528)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "is_verbose", scope: !468, file: !2, line: 129, baseType: !586, size: 8, offset: 3536)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "store_all_qual", scope: !468, file: !2, line: 130, baseType: !586, size: 8, offset: 3544)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "store_mapping_qual", scope: !468, file: !2, line: 131, baseType: !586, size: 8, offset: 3552)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "store_unmmaped_reads", scope: !468, file: !2, line: 132, baseType: !586, size: 8, offset: 3560)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "store_var_qual", scope: !468, file: !2, line: 133, baseType: !586, size: 8, offset: 3568)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtTimer", file: !595, line: 29, baseType: !596)
!595 = !DIFile(filename: "src/core/timer_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "852c50f033e5ef05505f9a97667e02e4")
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtTimer", file: !595, line: 29, flags: DIFlagFwdDecl)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!598 = !DILocalVariable(name: "ref", arg: 1, scope: !462, file: !2, line: 1089, type: !548)
!599 = !DILocalVariable(name: "filename", arg: 2, scope: !462, file: !2, line: 1090, type: !496)
!600 = !DILocalVariable(name: "vquals", arg: 3, scope: !462, file: !2, line: 1091, type: !586)
!601 = !DILocalVariable(name: "mquals", arg: 4, scope: !462, file: !2, line: 1092, type: !586)
!602 = !DILocalVariable(name: "quals", arg: 5, scope: !462, file: !2, line: 1093, type: !586)
!603 = !DILocalVariable(name: "ureads", arg: 6, scope: !462, file: !2, line: 1094, type: !586)
!604 = !DILocalVariable(name: "descs", arg: 7, scope: !462, file: !2, line: 1095, type: !586)
!605 = !DILocalVariable(name: "timer", arg: 8, scope: !462, file: !2, line: 1096, type: !593)
!606 = !DILocalVariable(name: "err", arg: 9, scope: !462, file: !2, line: 1097, type: !497)
!607 = !DILocalVariable(name: "had_err", scope: !462, file: !2, line: 1099, type: !354)
!608 = !DILocalVariable(name: "rcr_enc", scope: !462, file: !2, line: 1100, type: !465)
!609 = !{!610, !610, i64 0}
!610 = !{!"any pointer", !611, i64 0}
!611 = !{!"omnipotent char", !612, i64 0}
!612 = !{!"Simple C/C++ TBAA"}
!613 = !DILocation(line: 1089, column: 50, scope: !462)
!614 = !DILocation(line: 1090, column: 46, scope: !462)
!615 = !{!616, !616, i64 0}
!616 = !{!"_Bool", !611, i64 0}
!617 = !DILocation(line: 1091, column: 39, scope: !462)
!618 = !DILocation(line: 1092, column: 39, scope: !462)
!619 = !DILocation(line: 1093, column: 39, scope: !462)
!620 = !DILocation(line: 1094, column: 39, scope: !462)
!621 = !DILocation(line: 1095, column: 39, scope: !462)
!622 = !DILocation(line: 1096, column: 43, scope: !462)
!623 = !DILocation(line: 1097, column: 43, scope: !462)
!624 = !DILocation(line: 1099, column: 3, scope: !462)
!625 = !DILocation(line: 1099, column: 7, scope: !462)
!626 = !{!627, !627, i64 0}
!627 = !{!"int", !611, i64 0}
!628 = !DILocation(line: 1100, column: 3, scope: !462)
!629 = !DILocation(line: 1100, column: 17, scope: !462)
!630 = !DILocation(line: 1102, column: 3, scope: !462)
!631 = !DILocation(line: 1102, column: 3, scope: !632)
!632 = distinct !DILexicalBlock(scope: !633, file: !2, line: 1102, column: 3)
!633 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1102, column: 3)
!634 = !DILocation(line: 1102, column: 3, scope: !633)
!635 = !DILocation(line: 1102, column: 3, scope: !636)
!636 = distinct !DILexicalBlock(scope: !632, file: !2, line: 1102, column: 3)
!637 = !DILocation(line: 1103, column: 3, scope: !462)
!638 = !DILocation(line: 1103, column: 3, scope: !639)
!639 = distinct !DILexicalBlock(scope: !640, file: !2, line: 1103, column: 3)
!640 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1103, column: 3)
!641 = !DILocation(line: 1103, column: 3, scope: !640)
!642 = !DILocation(line: 1103, column: 3, scope: !643)
!643 = distinct !DILexicalBlock(scope: !639, file: !2, line: 1103, column: 3)
!644 = !DILocation(line: 1105, column: 7, scope: !645)
!645 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1105, column: 7)
!646 = !DILocation(line: 1105, column: 13, scope: !645)
!647 = !DILocation(line: 1105, column: 7, scope: !462)
!648 = !DILocation(line: 1106, column: 28, scope: !645)
!649 = !DILocation(line: 1106, column: 62, scope: !645)
!650 = !DILocation(line: 1106, column: 5, scope: !645)
!651 = !DILocation(line: 1108, column: 33, scope: !462)
!652 = !DILocation(line: 1108, column: 43, scope: !462)
!653 = !DILocation(line: 1108, column: 13, scope: !462)
!654 = !DILocation(line: 1108, column: 11, scope: !462)
!655 = !DILocation(line: 1110, column: 7, scope: !656)
!656 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1110, column: 7)
!657 = !{i8 0, i8 2}
!658 = !{}
!659 = !DILocation(line: 1110, column: 7, scope: !462)
!660 = !DILocation(line: 1111, column: 5, scope: !661)
!661 = distinct !DILexicalBlock(scope: !656, file: !2, line: 1110, column: 14)
!662 = !DILocation(line: 1111, column: 5, scope: !663)
!663 = distinct !DILexicalBlock(scope: !664, file: !2, line: 1111, column: 5)
!664 = distinct !DILexicalBlock(scope: !661, file: !2, line: 1111, column: 5)
!665 = !DILocation(line: 1111, column: 5, scope: !664)
!666 = !DILocation(line: 1111, column: 5, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !2, line: 1111, column: 5)
!668 = !DILocation(line: 1112, column: 5, scope: !661)
!669 = !DILocation(line: 1112, column: 14, scope: !661)
!670 = !DILocation(line: 1112, column: 29, scope: !661)
!671 = !{!672, !616, i64 443}
!672 = !{!"GtRcrEncoder", !610, i64 0, !610, i64 8, !610, i64 16, !610, i64 24, !610, i64 32, !610, i64 40, !610, i64 48, !610, i64 56, !610, i64 64, !610, i64 72, !610, i64 80, !610, i64 88, !610, i64 96, !610, i64 104, !610, i64 112, !610, i64 120, !610, i64 128, !610, i64 136, !610, i64 144, !610, i64 152, !610, i64 160, !610, i64 168, !610, i64 176, !673, i64 184, !673, i64 192, !673, i64 200, !673, i64 208, !673, i64 216, !673, i64 224, !673, i64 232, !611, i64 240, !673, i64 320, !673, i64 328, !673, i64 336, !673, i64 344, !673, i64 352, !673, i64 360, !673, i64 368, !673, i64 376, !674, i64 384, !674, i64 392, !674, i64 400, !674, i64 408, !674, i64 416, !674, i64 424, !674, i64 432, !616, i64 440, !616, i64 441, !616, i64 442, !616, i64 443, !616, i64 444, !616, i64 445, !616, i64 446}
!673 = !{!"long long", !611, i64 0}
!674 = !{!"long", !611, i64 0}
!675 = !DILocation(line: 1113, column: 3, scope: !661)
!676 = !DILocation(line: 1114, column: 7, scope: !677)
!677 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1114, column: 7)
!678 = !DILocation(line: 1114, column: 7, scope: !462)
!679 = !DILocation(line: 1115, column: 5, scope: !680)
!680 = distinct !DILexicalBlock(scope: !677, file: !2, line: 1114, column: 15)
!681 = !DILocation(line: 1115, column: 5, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !2, line: 1115, column: 5)
!683 = distinct !DILexicalBlock(scope: !680, file: !2, line: 1115, column: 5)
!684 = !DILocation(line: 1115, column: 5, scope: !683)
!685 = !DILocation(line: 1115, column: 5, scope: !686)
!686 = distinct !DILexicalBlock(scope: !682, file: !2, line: 1115, column: 5)
!687 = !DILocation(line: 1116, column: 5, scope: !680)
!688 = !DILocation(line: 1116, column: 14, scope: !680)
!689 = !DILocation(line: 1116, column: 29, scope: !680)
!690 = !{!672, !616, i64 446}
!691 = !DILocation(line: 1117, column: 3, scope: !680)
!692 = !DILocation(line: 1118, column: 7, scope: !693)
!693 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1118, column: 7)
!694 = !DILocation(line: 1118, column: 7, scope: !462)
!695 = !DILocation(line: 1119, column: 5, scope: !693)
!696 = !DILocation(line: 1119, column: 14, scope: !693)
!697 = !DILocation(line: 1119, column: 33, scope: !693)
!698 = !{!672, !616, i64 444}
!699 = !DILocation(line: 1120, column: 7, scope: !700)
!700 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1120, column: 7)
!701 = !DILocation(line: 1120, column: 7, scope: !462)
!702 = !DILocation(line: 1121, column: 5, scope: !700)
!703 = !DILocation(line: 1121, column: 14, scope: !700)
!704 = !DILocation(line: 1121, column: 35, scope: !700)
!705 = !{!672, !616, i64 445}
!706 = !DILocation(line: 1123, column: 47, scope: !707)
!707 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1123, column: 7)
!708 = !DILocation(line: 1123, column: 28, scope: !707)
!709 = !DILocation(line: 1123, column: 9, scope: !707)
!710 = !DILocation(line: 1123, column: 7, scope: !462)
!711 = !DILocation(line: 1124, column: 18, scope: !712)
!712 = distinct !DILexicalBlock(scope: !707, file: !2, line: 1123, column: 55)
!713 = !DILocation(line: 1124, column: 5, scope: !712)
!714 = !DILocation(line: 1125, column: 13, scope: !712)
!715 = !DILocation(line: 1126, column: 3, scope: !712)
!716 = !DILocation(line: 1128, column: 8, scope: !717)
!717 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1128, column: 7)
!718 = !DILocation(line: 1128, column: 7, scope: !462)
!719 = !DILocation(line: 1129, column: 45, scope: !717)
!720 = !DILocation(line: 1129, column: 54, scope: !717)
!721 = !DILocation(line: 1129, column: 61, scope: !717)
!722 = !DILocation(line: 1129, column: 15, scope: !717)
!723 = !DILocation(line: 1129, column: 13, scope: !717)
!724 = !DILocation(line: 1129, column: 5, scope: !717)
!725 = !DILocation(line: 1131, column: 8, scope: !726)
!726 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1131, column: 7)
!727 = !DILocation(line: 1131, column: 7, scope: !462)
!728 = !DILocation(line: 1132, column: 39, scope: !726)
!729 = !DILocation(line: 1132, column: 48, scope: !726)
!730 = !DILocation(line: 1132, column: 55, scope: !726)
!731 = !DILocation(line: 1132, column: 15, scope: !726)
!732 = !DILocation(line: 1132, column: 13, scope: !726)
!733 = !DILocation(line: 1132, column: 5, scope: !726)
!734 = !DILocation(line: 1134, column: 8, scope: !735)
!735 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1134, column: 7)
!736 = !DILocation(line: 1134, column: 16, scope: !735)
!737 = !DILocation(line: 1134, column: 19, scope: !735)
!738 = !DILocation(line: 1134, column: 7, scope: !462)
!739 = !DILocation(line: 1135, column: 41, scope: !735)
!740 = !DILocation(line: 1135, column: 50, scope: !735)
!741 = !DILocation(line: 1135, column: 57, scope: !735)
!742 = !DILocation(line: 1135, column: 15, scope: !735)
!743 = !DILocation(line: 1135, column: 13, scope: !735)
!744 = !DILocation(line: 1135, column: 5, scope: !735)
!745 = !DILocation(line: 1137, column: 8, scope: !746)
!746 = distinct !DILexicalBlock(scope: !462, file: !2, line: 1137, column: 7)
!747 = !DILocation(line: 1137, column: 7, scope: !462)
!748 = !DILocation(line: 1138, column: 12, scope: !746)
!749 = !DILocation(line: 1138, column: 5, scope: !746)
!750 = !DILocation(line: 1140, column: 27, scope: !751)
!751 = distinct !DILexicalBlock(scope: !746, file: !2, line: 1139, column: 8)
!752 = !DILocation(line: 1140, column: 5, scope: !751)
!753 = !DILocation(line: 1141, column: 5, scope: !751)
!754 = !DILocation(line: 1143, column: 1, scope: !462)
!755 = !DISubprogram(name: "gt_error_is_set", scope: !499, file: !499, line: 64, type: !756, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!756 = !DISubroutineType(types: !757)
!757 = !{!586, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!760 = !DISubprogram(name: "fprintf", scope: !761, file: !761, line: 350, type: !762, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!761 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!762 = !DISubroutineType(types: !763)
!763 = !{!354, !764, !765, null}
!764 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !399)
!765 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !496)
!766 = !DISubprogram(name: "abort", scope: !767, file: !767, line: 598, type: !768, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!767 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!768 = !DISubroutineType(types: !769)
!769 = !{null}
!770 = !DISubprogram(name: "gt_timer_show_progress", scope: !595, file: !595, line: 58, type: !771, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !593, !496, !399}
!773 = distinct !DISubprogram(name: "gt_rcr_encoder_init", scope: !2, file: !2, line: 960, type: !774, scopeLine: 962, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !323, retainedNodes: !776)
!774 = !DISubroutineType(types: !775)
!775 = !{!465, !496, !548}
!776 = !{!777, !778, !779, !780, !781}
!777 = !DILocalVariable(name: "filename", arg: 1, scope: !773, file: !2, line: 960, type: !496)
!778 = !DILocalVariable(name: "ref", arg: 2, scope: !773, file: !2, line: 961, type: !548)
!779 = !DILocalVariable(name: "alpha_size", scope: !773, file: !2, line: 963, type: !327)
!780 = !DILocalVariable(name: "i", scope: !773, file: !2, line: 964, type: !335)
!781 = !DILocalVariable(name: "rcr_enc", scope: !773, file: !2, line: 966, type: !465)
!782 = !DILocation(line: 960, column: 61, scope: !773)
!783 = !DILocation(line: 961, column: 65, scope: !773)
!784 = !DILocation(line: 963, column: 3, scope: !773)
!785 = !DILocation(line: 963, column: 12, scope: !773)
!786 = !DILocation(line: 963, column: 60, scope: !773)
!787 = !DILocation(line: 963, column: 41, scope: !773)
!788 = !DILocation(line: 963, column: 24, scope: !773)
!789 = !DILocation(line: 964, column: 3, scope: !773)
!790 = !DILocation(line: 964, column: 11, scope: !773)
!791 = !DILocation(line: 966, column: 3, scope: !773)
!792 = !DILocation(line: 966, column: 17, scope: !773)
!793 = !DILocation(line: 966, column: 27, scope: !773)
!794 = !DILocation(line: 968, column: 21, scope: !773)
!795 = !DILocation(line: 968, column: 3, scope: !773)
!796 = !DILocation(line: 968, column: 12, scope: !773)
!797 = !DILocation(line: 968, column: 19, scope: !773)
!798 = !{!672, !610, i64 152}
!799 = !DILocation(line: 969, column: 26, scope: !773)
!800 = !DILocation(line: 969, column: 3, scope: !773)
!801 = !DILocation(line: 969, column: 12, scope: !773)
!802 = !DILocation(line: 969, column: 24, scope: !773)
!803 = !{!672, !610, i64 160}
!804 = !DILocation(line: 970, column: 32, scope: !773)
!805 = !DILocation(line: 970, column: 3, scope: !773)
!806 = !DILocation(line: 970, column: 12, scope: !773)
!807 = !DILocation(line: 970, column: 30, scope: !773)
!808 = !{!672, !610, i64 176}
!809 = !DILocation(line: 971, column: 25, scope: !773)
!810 = !DILocation(line: 971, column: 3, scope: !773)
!811 = !DILocation(line: 971, column: 12, scope: !773)
!812 = !DILocation(line: 971, column: 23, scope: !773)
!813 = !{!672, !610, i64 56}
!814 = !DILocation(line: 972, column: 33, scope: !773)
!815 = !DILocation(line: 972, column: 3, scope: !773)
!816 = !DILocation(line: 972, column: 12, scope: !773)
!817 = !DILocation(line: 972, column: 31, scope: !773)
!818 = !{!672, !610, i64 64}
!819 = !DILocation(line: 973, column: 31, scope: !773)
!820 = !DILocation(line: 973, column: 3, scope: !773)
!821 = !DILocation(line: 973, column: 12, scope: !773)
!822 = !DILocation(line: 973, column: 29, scope: !773)
!823 = !{!672, !610, i64 32}
!824 = !DILocation(line: 974, column: 28, scope: !773)
!825 = !DILocation(line: 974, column: 3, scope: !773)
!826 = !DILocation(line: 974, column: 12, scope: !773)
!827 = !DILocation(line: 974, column: 26, scope: !773)
!828 = !{!672, !610, i64 40}
!829 = !DILocation(line: 975, column: 27, scope: !773)
!830 = !DILocation(line: 975, column: 3, scope: !773)
!831 = !DILocation(line: 975, column: 12, scope: !773)
!832 = !DILocation(line: 975, column: 25, scope: !773)
!833 = !{!672, !610, i64 48}
!834 = !DILocation(line: 976, column: 24, scope: !773)
!835 = !DILocation(line: 976, column: 3, scope: !773)
!836 = !DILocation(line: 976, column: 12, scope: !773)
!837 = !DILocation(line: 976, column: 22, scope: !773)
!838 = !{!672, !610, i64 144}
!839 = !DILocation(line: 977, column: 3, scope: !773)
!840 = !DILocation(line: 977, column: 12, scope: !773)
!841 = !DILocation(line: 977, column: 23, scope: !773)
!842 = !{!672, !610, i64 128}
!843 = !DILocation(line: 978, column: 3, scope: !773)
!844 = !DILocation(line: 978, column: 12, scope: !773)
!845 = !DILocation(line: 978, column: 27, scope: !773)
!846 = !{!672, !610, i64 120}
!847 = !DILocation(line: 979, column: 3, scope: !773)
!848 = !DILocation(line: 979, column: 12, scope: !773)
!849 = !DILocation(line: 979, column: 24, scope: !773)
!850 = !{!672, !610, i64 72}
!851 = !DILocation(line: 980, column: 3, scope: !773)
!852 = !DILocation(line: 980, column: 12, scope: !773)
!853 = !DILocation(line: 980, column: 22, scope: !773)
!854 = !{!672, !610, i64 104}
!855 = !DILocation(line: 981, column: 3, scope: !773)
!856 = !DILocation(line: 981, column: 12, scope: !773)
!857 = !DILocation(line: 981, column: 30, scope: !773)
!858 = !{!672, !610, i64 112}
!859 = !DILocation(line: 982, column: 3, scope: !773)
!860 = !DILocation(line: 982, column: 12, scope: !773)
!861 = !DILocation(line: 982, column: 29, scope: !773)
!862 = !{!672, !610, i64 96}
!863 = !DILocation(line: 983, column: 3, scope: !773)
!864 = !DILocation(line: 983, column: 12, scope: !773)
!865 = !DILocation(line: 983, column: 27, scope: !773)
!866 = !{!672, !610, i64 80}
!867 = !DILocation(line: 984, column: 3, scope: !773)
!868 = !DILocation(line: 984, column: 12, scope: !773)
!869 = !DILocation(line: 984, column: 21, scope: !773)
!870 = !{!672, !610, i64 136}
!871 = !DILocation(line: 985, column: 3, scope: !773)
!872 = !DILocation(line: 985, column: 12, scope: !773)
!873 = !DILocation(line: 985, column: 26, scope: !773)
!874 = !{!672, !610, i64 24}
!875 = !DILocation(line: 986, column: 3, scope: !773)
!876 = !DILocation(line: 986, column: 12, scope: !773)
!877 = !DILocation(line: 986, column: 26, scope: !773)
!878 = !{!672, !610, i64 88}
!879 = !DILocation(line: 987, column: 3, scope: !773)
!880 = !DILocation(line: 987, column: 12, scope: !773)
!881 = !DILocation(line: 987, column: 28, scope: !773)
!882 = !{!672, !616, i64 440}
!883 = !DILocation(line: 988, column: 3, scope: !773)
!884 = !DILocation(line: 988, column: 12, scope: !773)
!885 = !DILocation(line: 988, column: 23, scope: !773)
!886 = !{!672, !616, i64 442}
!887 = !DILocation(line: 989, column: 3, scope: !773)
!888 = !DILocation(line: 989, column: 12, scope: !773)
!889 = !DILocation(line: 989, column: 31, scope: !773)
!890 = !DILocation(line: 990, column: 3, scope: !773)
!891 = !DILocation(line: 990, column: 12, scope: !773)
!892 = !DILocation(line: 990, column: 27, scope: !773)
!893 = !DILocation(line: 991, column: 3, scope: !773)
!894 = !DILocation(line: 991, column: 12, scope: !773)
!895 = !DILocation(line: 991, column: 27, scope: !773)
!896 = !DILocation(line: 992, column: 3, scope: !773)
!897 = !DILocation(line: 992, column: 12, scope: !773)
!898 = !DILocation(line: 992, column: 33, scope: !773)
!899 = !DILocation(line: 993, column: 3, scope: !773)
!900 = !DILocation(line: 993, column: 12, scope: !773)
!901 = !DILocation(line: 993, column: 21, scope: !773)
!902 = !{!672, !674, i64 384}
!903 = !DILocation(line: 994, column: 3, scope: !773)
!904 = !DILocation(line: 994, column: 12, scope: !773)
!905 = !DILocation(line: 994, column: 29, scope: !773)
!906 = !{!672, !674, i64 392}
!907 = !DILocation(line: 995, column: 3, scope: !773)
!908 = !DILocation(line: 995, column: 12, scope: !773)
!909 = !DILocation(line: 995, column: 28, scope: !773)
!910 = !{!672, !674, i64 400}
!911 = !DILocation(line: 996, column: 3, scope: !773)
!912 = !DILocation(line: 996, column: 12, scope: !773)
!913 = !DILocation(line: 996, column: 23, scope: !773)
!914 = !{!672, !674, i64 408}
!915 = !DILocation(line: 997, column: 3, scope: !773)
!916 = !DILocation(line: 997, column: 12, scope: !773)
!917 = !DILocation(line: 997, column: 31, scope: !773)
!918 = !{!672, !674, i64 416}
!919 = !DILocation(line: 998, column: 3, scope: !773)
!920 = !DILocation(line: 998, column: 12, scope: !773)
!921 = !DILocation(line: 998, column: 25, scope: !773)
!922 = !{!672, !674, i64 424}
!923 = !DILocation(line: 999, column: 3, scope: !773)
!924 = !DILocation(line: 999, column: 12, scope: !773)
!925 = !DILocation(line: 999, column: 23, scope: !773)
!926 = !{!672, !674, i64 432}
!927 = !DILocation(line: 1001, column: 24, scope: !773)
!928 = !DILocation(line: 1001, column: 3, scope: !773)
!929 = !DILocation(line: 1001, column: 12, scope: !773)
!930 = !DILocation(line: 1001, column: 22, scope: !773)
!931 = !{!672, !610, i64 168}
!932 = !DILocation(line: 1003, column: 10, scope: !933)
!933 = distinct !DILexicalBlock(scope: !773, file: !2, line: 1003, column: 3)
!934 = !{!674, !674, i64 0}
!935 = !DILocation(line: 1003, column: 8, scope: !933)
!936 = !DILocation(line: 1003, column: 15, scope: !937)
!937 = distinct !DILexicalBlock(scope: !933, file: !2, line: 1003, column: 3)
!938 = !DILocation(line: 1003, column: 30, scope: !937)
!939 = !DILocation(line: 1003, column: 41, scope: !937)
!940 = !DILocation(line: 1003, column: 19, scope: !937)
!941 = !DILocation(line: 1003, column: 17, scope: !937)
!942 = !DILocation(line: 1003, column: 3, scope: !933)
!943 = !DILocation(line: 1004, column: 5, scope: !937)
!944 = !DILocation(line: 1004, column: 14, scope: !937)
!945 = !DILocation(line: 1004, column: 24, scope: !937)
!946 = !DILocation(line: 1004, column: 27, scope: !937)
!947 = !{!673, !673, i64 0}
!948 = !DILocation(line: 1003, column: 49, scope: !937)
!949 = !DILocation(line: 1003, column: 3, scope: !937)
!950 = distinct !{!950, !942, !951, !952}
!951 = !DILocation(line: 1004, column: 29, scope: !933)
!952 = !{!"llvm.loop.mustprogress"}
!953 = !DILocation(line: 1006, column: 10, scope: !954)
!954 = distinct !DILexicalBlock(scope: !773, file: !2, line: 1006, column: 3)
!955 = !DILocation(line: 1006, column: 8, scope: !954)
!956 = !DILocation(line: 1006, column: 15, scope: !957)
!957 = distinct !DILexicalBlock(scope: !954, file: !2, line: 1006, column: 3)
!958 = !DILocation(line: 1006, column: 17, scope: !957)
!959 = !DILocation(line: 1006, column: 3, scope: !954)
!960 = !DILocation(line: 1007, column: 5, scope: !957)
!961 = !DILocation(line: 1007, column: 14, scope: !957)
!962 = !DILocation(line: 1007, column: 32, scope: !957)
!963 = !DILocation(line: 1007, column: 35, scope: !957)
!964 = !DILocation(line: 1006, column: 44, scope: !957)
!965 = !DILocation(line: 1006, column: 3, scope: !957)
!966 = distinct !{!966, !959, !967, !952}
!967 = !DILocation(line: 1007, column: 37, scope: !954)
!968 = !DILocation(line: 1009, column: 10, scope: !773)
!969 = !DILocation(line: 1010, column: 1, scope: !773)
!970 = !DILocation(line: 1009, column: 3, scope: !773)
!971 = !DISubprogram(name: "gt_alphabet_is_dna", scope: !972, file: !972, line: 113, type: !973, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!972 = !DIFile(filename: "src/core/alphabet_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0b48240ce57ca6598f5548b5c9cf52e4")
!973 = !DISubroutineType(types: !974)
!974 = !{!586, !975}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtAlphabet", file: !972, line: 32, baseType: !978)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtAlphabet", file: !972, line: 32, flags: DIFlagFwdDecl)
!979 = !DISubprogram(name: "gt_encseq_alphabet", scope: !551, file: !551, line: 188, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!980 = !DISubroutineType(types: !981)
!981 = !{!982, !548}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!983 = !DISubprogram(name: "gt_error_set", scope: !499, file: !499, line: 56, type: !984, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!984 = !DISubroutineType(types: !985)
!985 = !{null, !497, !496, null}
!986 = distinct !DISubprogram(name: "gt_rcr_analyse_alignment_data", scope: !2, file: !2, line: 1012, type: !987, scopeLine: 1015, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !323, retainedNodes: !989)
!987 = !DISubroutineType(types: !988)
!988 = !{!354, !465, !593, !497}
!989 = !{!990, !991, !992, !993, !994, !995}
!990 = !DILocalVariable(name: "rcr_enc", arg: 1, scope: !986, file: !2, line: 1012, type: !465)
!991 = !DILocalVariable(name: "timer", arg: 2, scope: !986, file: !2, line: 1013, type: !593)
!992 = !DILocalVariable(name: "err", arg: 3, scope: !986, file: !2, line: 1014, type: !497)
!993 = !DILocalVariable(name: "had_err", scope: !986, file: !2, line: 1016, type: !354)
!994 = !DILocalVariable(name: "seq_id", scope: !986, file: !2, line: 1017, type: !350)
!995 = !DILocalVariable(name: "samfile", scope: !986, file: !2, line: 1018, type: !996)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "samfile_t", file: !998, line: 33, baseType: !999)
!998 = !DIFile(filename: "src/external/samtools-0.1.18/samtools/sam.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e9a195ec7b02fef23b3aa6cb9220f8ce")
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !998, line: 25, size: 192, elements: !1000)
!1000 = !{!1001, !1002, !1037}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !999, file: !998, line: 26, baseType: !354, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !999, file: !998, line: 31, baseType: !1003, size: 64, offset: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !999, file: !998, line: 27, size: 64, elements: !1004)
!1004 = !{!1005, !1009, !1036}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "tamr", scope: !1003, file: !998, line: 28, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "tamFile", file: !342, line: 297, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "__tamFile_t", file: !342, line: 297, flags: DIFlagFwdDecl)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "bam", scope: !1003, file: !998, line: 29, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "bamFile", file: !342, line: 55, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "BGZF", file: !1013, line: 59, baseType: !1014)
!1013 = !DIFile(filename: "src/external/samtools-0.1.18/samtools/bgzf.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "6854ccdfd4f877821cd2fd337f8bc83c")
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1013, line: 37, size: 704, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1031, !1032, !1033, !1034, !1035}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "file_descriptor", scope: !1014, file: !1013, line: 38, baseType: !354, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "open_mode", scope: !1014, file: !1013, line: 39, baseType: !4, size: 8, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "owned_file", scope: !1014, file: !1013, line: 40, baseType: !1019, size: 16, offset: 48)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !351, line: 25, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !353, line: 39, baseType: !1021)
!1021 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "compress_level", scope: !1014, file: !1013, line: 40, baseType: !1019, size: 16, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1014, file: !1013, line: 47, baseType: !399, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_block_size", scope: !1014, file: !1013, line: 49, baseType: !354, size: 32, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_block_size", scope: !1014, file: !1013, line: 50, baseType: !354, size: 32, offset: 224)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_block", scope: !1014, file: !1013, line: 51, baseType: !334, size: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_block", scope: !1014, file: !1013, line: 52, baseType: !334, size: 64, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "block_address", scope: !1014, file: !1013, line: 53, baseType: !1029, size: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !351, line: 27, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !353, line: 44, baseType: !339)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "block_length", scope: !1014, file: !1013, line: 54, baseType: !354, size: 32, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "block_offset", scope: !1014, file: !1013, line: 55, baseType: !354, size: 32, offset: 480)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !1014, file: !1013, line: 56, baseType: !354, size: 32, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1014, file: !1013, line: 57, baseType: !496, size: 64, offset: 576)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1014, file: !1013, line: 58, baseType: !334, size: 64, offset: 640)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "tamw", scope: !1003, file: !998, line: 30, baseType: !399, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !999, file: !998, line: 32, baseType: !1038, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "bam_header_t", file: !342, line: 96, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 89, size: 576, elements: !1041)
!1041 = !{!1042, !1043, !1045, !1046, !1047, !1048, !1049, !1050, !1051}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "n_targets", scope: !1040, file: !342, line: 90, baseType: !350, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "target_name", scope: !1040, file: !342, line: 91, baseType: !1044, size: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "target_len", scope: !1040, file: !342, line: 92, baseType: !380, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !1040, file: !342, line: 93, baseType: !334, size: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1040, file: !342, line: 93, baseType: !334, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rg2lib", scope: !1040, file: !342, line: 93, baseType: !334, size: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "l_text", scope: !1040, file: !342, line: 94, baseType: !376, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "n_text", scope: !1040, file: !342, line: 94, baseType: !376, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1040, file: !342, line: 95, baseType: !407, size: 64, offset: 512)
!1052 = !DILocation(line: 1012, column: 63, scope: !986)
!1053 = !DILocation(line: 1013, column: 58, scope: !986)
!1054 = !DILocation(line: 1014, column: 58, scope: !986)
!1055 = !DILocation(line: 1016, column: 3, scope: !986)
!1056 = !DILocation(line: 1016, column: 7, scope: !986)
!1057 = !DILocation(line: 1017, column: 3, scope: !986)
!1058 = !DILocation(line: 1017, column: 11, scope: !986)
!1059 = !DILocation(line: 1018, column: 3, scope: !986)
!1060 = !DILocation(line: 1018, column: 14, scope: !986)
!1061 = !DILocation(line: 1018, column: 32, scope: !986)
!1062 = !DILocation(line: 1018, column: 41, scope: !986)
!1063 = !DILocation(line: 1018, column: 24, scope: !986)
!1064 = !DILocation(line: 1020, column: 3, scope: !986)
!1065 = !DILocation(line: 1020, column: 3, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !2, line: 1020, column: 3)
!1067 = distinct !DILexicalBlock(scope: !986, file: !2, line: 1020, column: 3)
!1068 = !DILocation(line: 1020, column: 3, scope: !1067)
!1069 = !DILocation(line: 1020, column: 3, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1066, file: !2, line: 1020, column: 3)
!1071 = !DILocation(line: 1022, column: 7, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !986, file: !2, line: 1022, column: 7)
!1073 = !DILocation(line: 1022, column: 13, scope: !1072)
!1074 = !DILocation(line: 1022, column: 7, scope: !986)
!1075 = !DILocation(line: 1023, column: 28, scope: !1072)
!1076 = !DILocation(line: 1024, column: 28, scope: !1072)
!1077 = !DILocation(line: 1023, column: 5, scope: !1072)
!1078 = !DILocation(line: 1026, column: 7, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !986, file: !2, line: 1026, column: 7)
!1080 = !DILocation(line: 1026, column: 15, scope: !1079)
!1081 = !DILocation(line: 1026, column: 7, scope: !986)
!1082 = !DILocation(line: 1027, column: 18, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 1026, column: 24)
!1084 = !DILocation(line: 1027, column: 50, scope: !1083)
!1085 = !DILocation(line: 1027, column: 59, scope: !1083)
!1086 = !DILocation(line: 1027, column: 5, scope: !1083)
!1087 = !DILocation(line: 1028, column: 13, scope: !1083)
!1088 = !DILocation(line: 1029, column: 3, scope: !1083)
!1089 = !DILocation(line: 1031, column: 3, scope: !986)
!1090 = !DILocation(line: 1031, column: 11, scope: !986)
!1091 = !DILocation(line: 1031, column: 19, scope: !986)
!1092 = !DILocation(line: 1032, column: 18, scope: !986)
!1093 = !DILocation(line: 1032, column: 27, scope: !986)
!1094 = !DILocation(line: 1032, column: 36, scope: !986)
!1095 = !DILocation(line: 1032, column: 10, scope: !986)
!1096 = !DILocation(line: 1032, column: 47, scope: !986)
!1097 = !DILocation(line: 0, scope: !986)
!1098 = !DILocation(line: 1033, column: 5, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !986, file: !2, line: 1032, column: 53)
!1100 = !DILocation(line: 1033, column: 5, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !2, line: 1033, column: 5)
!1102 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 1033, column: 5)
!1103 = !DILocation(line: 1033, column: 5, scope: !1102)
!1104 = !DILocation(line: 1033, column: 5, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1101, file: !2, line: 1033, column: 5)
!1106 = !DILocation(line: 1034, column: 9, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 1034, column: 9)
!1108 = !DILocation(line: 1034, column: 19, scope: !1107)
!1109 = !DILocation(line: 1034, column: 28, scope: !1107)
!1110 = !DILocation(line: 1034, column: 39, scope: !1107)
!1111 = !DILocation(line: 1034, column: 44, scope: !1107)
!1112 = !{!1113, !627, i64 0}
!1113 = !{!"", !1114, i64 0, !627, i64 32, !627, i64 36, !627, i64 40, !610, i64 48}
!1114 = !{!"", !627, i64 0, !627, i64 4, !627, i64 8, !627, i64 10, !627, i64 11, !627, i64 12, !627, i64 14, !627, i64 16, !627, i64 20, !627, i64 24, !627, i64 28}
!1115 = !DILocation(line: 1034, column: 16, scope: !1107)
!1116 = !DILocation(line: 1034, column: 9, scope: !1099)
!1117 = !DILocation(line: 1035, column: 7, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1107, file: !2, line: 1034, column: 49)
!1119 = !DILocation(line: 1035, column: 16, scope: !1118)
!1120 = !DILocation(line: 1035, column: 29, scope: !1118)
!1121 = !DILocation(line: 1036, column: 16, scope: !1118)
!1122 = !DILocation(line: 1036, column: 25, scope: !1118)
!1123 = !DILocation(line: 1036, column: 36, scope: !1118)
!1124 = !DILocation(line: 1036, column: 41, scope: !1118)
!1125 = !DILocation(line: 1036, column: 14, scope: !1118)
!1126 = !DILocation(line: 1037, column: 57, scope: !1118)
!1127 = !DILocation(line: 1037, column: 66, scope: !1118)
!1128 = !DILocation(line: 1038, column: 67, scope: !1118)
!1129 = !DILocation(line: 1038, column: 57, scope: !1118)
!1130 = !DILocation(line: 1037, column: 35, scope: !1118)
!1131 = !DILocation(line: 1037, column: 7, scope: !1118)
!1132 = !DILocation(line: 1037, column: 16, scope: !1118)
!1133 = !DILocation(line: 1037, column: 33, scope: !1118)
!1134 = !DILocation(line: 1039, column: 5, scope: !1118)
!1135 = !DILocation(line: 1040, column: 9, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 1040, column: 9)
!1137 = !DILocation(line: 1040, column: 18, scope: !1136)
!1138 = !DILocation(line: 1040, column: 43, scope: !1136)
!1139 = !DILocation(line: 1040, column: 52, scope: !1136)
!1140 = !DILocation(line: 1040, column: 63, scope: !1136)
!1141 = !DILocation(line: 1040, column: 68, scope: !1136)
!1142 = !{!1113, !627, i64 4}
!1143 = !DILocation(line: 1040, column: 33, scope: !1136)
!1144 = !DILocation(line: 1040, column: 31, scope: !1136)
!1145 = !DILocation(line: 1040, column: 9, scope: !1099)
!1146 = !DILocation(line: 1041, column: 20, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 1040, column: 73)
!1148 = !DILocation(line: 1041, column: 50, scope: !1147)
!1149 = !DILocation(line: 1041, column: 59, scope: !1147)
!1150 = !DILocation(line: 1041, column: 7, scope: !1147)
!1151 = !DILocation(line: 1042, column: 15, scope: !1147)
!1152 = !DILocation(line: 1043, column: 5, scope: !1147)
!1153 = !DILocation(line: 1045, column: 16, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 1044, column: 10)
!1155 = !DILocation(line: 1045, column: 25, scope: !1154)
!1156 = !DILocation(line: 1045, column: 36, scope: !1154)
!1157 = !DILocation(line: 1045, column: 41, scope: !1154)
!1158 = !DILocation(line: 1045, column: 14, scope: !1154)
!1159 = !DILocation(line: 1046, column: 13, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 1046, column: 11)
!1161 = !DILocation(line: 1046, column: 22, scope: !1160)
!1162 = !DILocation(line: 1046, column: 33, scope: !1160)
!1163 = !DILocation(line: 1046, column: 38, scope: !1160)
!1164 = !DILocation(line: 1046, column: 43, scope: !1160)
!1165 = !DILocation(line: 1046, column: 11, scope: !1154)
!1166 = !DILocation(line: 1047, column: 9, scope: !1160)
!1167 = !DILocation(line: 1047, column: 18, scope: !1160)
!1168 = !DILocation(line: 1047, column: 28, scope: !1160)
!1169 = !DILocation(line: 1049, column: 9, scope: !1160)
!1170 = !DILocation(line: 1049, column: 18, scope: !1160)
!1171 = !DILocation(line: 1049, column: 36, scope: !1160)
!1172 = !DILocation(line: 1051, column: 36, scope: !1154)
!1173 = !DILocation(line: 1051, column: 45, scope: !1154)
!1174 = !DILocation(line: 1051, column: 56, scope: !1154)
!1175 = !DILocation(line: 1051, column: 17, scope: !1154)
!1176 = !DILocation(line: 1051, column: 15, scope: !1154)
!1177 = distinct !{!1177, !1089, !1178, !952}
!1178 = !DILocation(line: 1053, column: 3, scope: !986)
!1179 = !DILocation(line: 1057, column: 47, scope: !986)
!1180 = !DILocation(line: 1057, column: 56, scope: !986)
!1181 = !DILocation(line: 1056, column: 3, scope: !986)
!1182 = !DILocation(line: 1056, column: 12, scope: !986)
!1183 = !DILocation(line: 1056, column: 43, scope: !986)
!1184 = !DILocation(line: 1058, column: 12, scope: !986)
!1185 = !DILocation(line: 1058, column: 3, scope: !986)
!1186 = !DILocation(line: 1060, column: 10, scope: !986)
!1187 = !DILocation(line: 1061, column: 1, scope: !986)
!1188 = !DILocation(line: 1060, column: 3, scope: !986)
!1189 = distinct !DISubprogram(name: "rcr_initialize_encoders", scope: !2, file: !2, line: 705, type: !987, scopeLine: 708, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !323, retainedNodes: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195}
!1191 = !DILocalVariable(name: "rcr_enc", arg: 1, scope: !1189, file: !2, line: 705, type: !465)
!1192 = !DILocalVariable(name: "timer", arg: 2, scope: !1189, file: !2, line: 706, type: !593)
!1193 = !DILocalVariable(name: "err", arg: 3, scope: !1189, file: !2, line: 707, type: !497)
!1194 = !DILocalVariable(name: "has_var", scope: !1189, file: !2, line: 709, type: !586)
!1195 = !DILocalVariable(name: "median", scope: !1189, file: !2, line: 710, type: !335)
!1196 = !DILocation(line: 705, column: 50, scope: !1189)
!1197 = !DILocation(line: 706, column: 45, scope: !1189)
!1198 = !DILocation(line: 707, column: 45, scope: !1189)
!1199 = !DILocation(line: 709, column: 3, scope: !1189)
!1200 = !DILocation(line: 709, column: 8, scope: !1189)
!1201 = !DILocation(line: 710, column: 3, scope: !1189)
!1202 = !DILocation(line: 710, column: 11, scope: !1189)
!1203 = !DILocation(line: 712, column: 7, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 712, column: 7)
!1205 = !DILocation(line: 712, column: 13, scope: !1204)
!1206 = !DILocation(line: 712, column: 7, scope: !1189)
!1207 = !DILocation(line: 713, column: 28, scope: !1204)
!1208 = !DILocation(line: 713, column: 60, scope: !1204)
!1209 = !DILocation(line: 713, column: 5, scope: !1204)
!1210 = !DILocation(line: 715, column: 27, scope: !1189)
!1211 = !DILocation(line: 715, column: 36, scope: !1189)
!1212 = !DILocation(line: 715, column: 12, scope: !1189)
!1213 = !DILocation(line: 715, column: 10, scope: !1189)
!1214 = !DILocation(line: 716, column: 7, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 716, column: 7)
!1216 = !DILocation(line: 716, column: 14, scope: !1215)
!1217 = !DILocation(line: 716, column: 7, scope: !1189)
!1218 = !DILocation(line: 717, column: 18, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1215, file: !2, line: 716, column: 33)
!1220 = !DILocation(line: 717, column: 55, scope: !1219)
!1221 = !DILocation(line: 717, column: 64, scope: !1219)
!1222 = !DILocation(line: 717, column: 5, scope: !1219)
!1223 = !DILocation(line: 718, column: 5, scope: !1219)
!1224 = !DILocation(line: 721, column: 7, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 721, column: 7)
!1226 = !DILocation(line: 721, column: 14, scope: !1225)
!1227 = !DILocation(line: 721, column: 7, scope: !1189)
!1228 = !DILocation(line: 722, column: 12, scope: !1225)
!1229 = !DILocation(line: 722, column: 5, scope: !1225)
!1230 = !DILocation(line: 724, column: 43, scope: !1189)
!1231 = !DILocation(line: 724, column: 29, scope: !1189)
!1232 = !DILocation(line: 724, column: 3, scope: !1189)
!1233 = !DILocation(line: 724, column: 12, scope: !1189)
!1234 = !DILocation(line: 724, column: 27, scope: !1189)
!1235 = !DILocation(line: 726, column: 27, scope: !1189)
!1236 = !DILocation(line: 726, column: 36, scope: !1189)
!1237 = !DILocation(line: 726, column: 12, scope: !1189)
!1238 = !DILocation(line: 726, column: 10, scope: !1189)
!1239 = !DILocation(line: 729, column: 7, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 729, column: 7)
!1241 = !DILocation(line: 729, column: 14, scope: !1240)
!1242 = !DILocation(line: 729, column: 7, scope: !1189)
!1243 = !DILocation(line: 730, column: 13, scope: !1240)
!1244 = !DILocation(line: 730, column: 5, scope: !1240)
!1245 = !DILocation(line: 732, column: 7, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 732, column: 7)
!1247 = !DILocation(line: 732, column: 14, scope: !1246)
!1248 = !DILocation(line: 732, column: 7, scope: !1189)
!1249 = !DILocation(line: 733, column: 12, scope: !1246)
!1250 = !DILocation(line: 733, column: 5, scope: !1246)
!1251 = !DILocation(line: 735, column: 7, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 735, column: 7)
!1253 = !DILocation(line: 735, column: 7, scope: !1189)
!1254 = !DILocation(line: 736, column: 44, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1252, file: !2, line: 735, column: 16)
!1256 = !DILocation(line: 736, column: 30, scope: !1255)
!1257 = !DILocation(line: 736, column: 5, scope: !1255)
!1258 = !DILocation(line: 736, column: 14, scope: !1255)
!1259 = !DILocation(line: 736, column: 28, scope: !1255)
!1260 = !DILocation(line: 738, column: 3, scope: !1255)
!1261 = !DILocation(line: 740, column: 9, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 740, column: 7)
!1263 = !DILocation(line: 740, column: 18, scope: !1262)
!1264 = !DILocation(line: 740, column: 7, scope: !1189)
!1265 = !DILocation(line: 741, column: 48, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1262, file: !2, line: 740, column: 36)
!1267 = !DILocation(line: 741, column: 57, scope: !1266)
!1268 = !DILocation(line: 743, column: 45, scope: !1266)
!1269 = !DILocation(line: 743, column: 54, scope: !1266)
!1270 = !DILocation(line: 743, column: 70, scope: !1266)
!1271 = !DILocation(line: 741, column: 33, scope: !1266)
!1272 = !DILocation(line: 741, column: 5, scope: !1266)
!1273 = !DILocation(line: 741, column: 14, scope: !1266)
!1274 = !DILocation(line: 741, column: 31, scope: !1266)
!1275 = !DILocation(line: 744, column: 3, scope: !1266)
!1276 = !DILocation(line: 746, column: 7, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 746, column: 7)
!1278 = !DILocation(line: 746, column: 16, scope: !1277)
!1279 = !DILocation(line: 746, column: 31, scope: !1277)
!1280 = !DILocation(line: 746, column: 34, scope: !1277)
!1281 = !DILocation(line: 746, column: 43, scope: !1277)
!1282 = !DILocation(line: 746, column: 7, scope: !1189)
!1283 = !DILocation(line: 747, column: 41, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1277, file: !2, line: 746, column: 59)
!1285 = !DILocation(line: 747, column: 50, scope: !1284)
!1286 = !DILocation(line: 747, column: 26, scope: !1284)
!1287 = !DILocation(line: 747, column: 5, scope: !1284)
!1288 = !DILocation(line: 747, column: 14, scope: !1284)
!1289 = !DILocation(line: 747, column: 24, scope: !1284)
!1290 = !DILocation(line: 749, column: 3, scope: !1284)
!1291 = !DILocation(line: 751, column: 7, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 751, column: 7)
!1293 = !DILocation(line: 751, column: 16, scope: !1292)
!1294 = !DILocation(line: 751, column: 7, scope: !1189)
!1295 = !DILocation(line: 753, column: 49, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1292, file: !2, line: 751, column: 36)
!1297 = !DILocation(line: 753, column: 58, scope: !1296)
!1298 = !DILocation(line: 753, column: 34, scope: !1296)
!1299 = !DILocation(line: 753, column: 5, scope: !1296)
!1300 = !DILocation(line: 753, column: 14, scope: !1296)
!1301 = !DILocation(line: 753, column: 32, scope: !1296)
!1302 = !DILocation(line: 755, column: 3, scope: !1296)
!1303 = !DILocation(line: 757, column: 44, scope: !1189)
!1304 = !DILocation(line: 757, column: 53, scope: !1189)
!1305 = !DILocation(line: 757, column: 29, scope: !1189)
!1306 = !DILocation(line: 757, column: 3, scope: !1189)
!1307 = !DILocation(line: 757, column: 12, scope: !1189)
!1308 = !DILocation(line: 757, column: 27, scope: !1189)
!1309 = !DILocation(line: 759, column: 9, scope: !1310)
!1310 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 759, column: 7)
!1311 = !DILocation(line: 759, column: 18, scope: !1310)
!1312 = !DILocation(line: 759, column: 8, scope: !1310)
!1313 = !DILocation(line: 759, column: 7, scope: !1189)
!1314 = !DILocation(line: 760, column: 18, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1310, file: !2, line: 759, column: 35)
!1316 = !DILocation(line: 760, column: 5, scope: !1315)
!1317 = !DILocation(line: 761, column: 5, scope: !1315)
!1318 = !DILocation(line: 765, column: 20, scope: !1189)
!1319 = !DILocation(line: 765, column: 29, scope: !1189)
!1320 = !DILocation(line: 768, column: 58, scope: !1189)
!1321 = !DILocation(line: 768, column: 67, scope: !1189)
!1322 = !DILocation(line: 768, column: 39, scope: !1189)
!1323 = !DILocation(line: 768, column: 22, scope: !1189)
!1324 = !DILocation(line: 767, column: 20, scope: !1189)
!1325 = !DILocation(line: 768, column: 76, scope: !1189)
!1326 = !DILocation(line: 765, column: 5, scope: !1189)
!1327 = !DILocation(line: 764, column: 3, scope: !1189)
!1328 = !DILocation(line: 764, column: 12, scope: !1189)
!1329 = !DILocation(line: 764, column: 23, scope: !1189)
!1330 = !DILocation(line: 769, column: 9, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 769, column: 7)
!1332 = !DILocation(line: 769, column: 18, scope: !1331)
!1333 = !DILocation(line: 769, column: 8, scope: !1331)
!1334 = !DILocation(line: 769, column: 7, scope: !1189)
!1335 = !DILocation(line: 770, column: 18, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1331, file: !2, line: 769, column: 31)
!1337 = !DILocation(line: 770, column: 5, scope: !1336)
!1338 = !DILocation(line: 771, column: 5, scope: !1336)
!1339 = !DILocation(line: 774, column: 3, scope: !1189)
!1340 = !DILocation(line: 775, column: 1, scope: !1189)
!1341 = distinct !DISubprogram(name: "gt_rcr_init_desc_encoding", scope: !2, file: !2, line: 1063, type: !987, scopeLine: 1066, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !323, retainedNodes: !1342)
!1342 = !{!1343, !1344, !1345, !1346}
!1343 = !DILocalVariable(name: "rcr_enc", arg: 1, scope: !1341, file: !2, line: 1063, type: !465)
!1344 = !DILocalVariable(name: "timer", arg: 2, scope: !1341, file: !2, line: 1064, type: !593)
!1345 = !DILocalVariable(name: "err", arg: 3, scope: !1341, file: !2, line: 1065, type: !497)
!1346 = !DILocalVariable(name: "had_err", scope: !1341, file: !2, line: 1067, type: !354)
!1347 = !DILocation(line: 1063, column: 52, scope: !1341)
!1348 = !DILocation(line: 1064, column: 47, scope: !1341)
!1349 = !DILocation(line: 1065, column: 47, scope: !1341)
!1350 = !DILocation(line: 1067, column: 3, scope: !1341)
!1351 = !DILocation(line: 1067, column: 7, scope: !1341)
!1352 = !DILocation(line: 1068, column: 7, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1341, file: !2, line: 1068, column: 7)
!1354 = !DILocation(line: 1068, column: 13, scope: !1353)
!1355 = !DILocation(line: 1068, column: 7, scope: !1341)
!1356 = !DILocation(line: 1069, column: 28, scope: !1353)
!1357 = !DILocation(line: 1070, column: 28, scope: !1353)
!1358 = !DILocation(line: 1069, column: 5, scope: !1353)
!1359 = !DILocation(line: 1072, column: 26, scope: !1341)
!1360 = !DILocation(line: 1072, column: 3, scope: !1341)
!1361 = !DILocation(line: 1072, column: 12, scope: !1341)
!1362 = !DILocation(line: 1072, column: 24, scope: !1341)
!1363 = !DILocation(line: 1073, column: 40, scope: !1341)
!1364 = !DILocation(line: 1073, column: 49, scope: !1341)
!1365 = !DILocation(line: 1073, column: 3, scope: !1341)
!1366 = !DILocation(line: 1075, column: 33, scope: !1341)
!1367 = !DILocation(line: 1075, column: 42, scope: !1341)
!1368 = !DILocation(line: 1076, column: 52, scope: !1341)
!1369 = !DILocation(line: 1076, column: 61, scope: !1341)
!1370 = !DILocation(line: 1076, column: 33, scope: !1341)
!1371 = !DILocation(line: 1077, column: 33, scope: !1341)
!1372 = !DILocation(line: 1075, column: 5, scope: !1341)
!1373 = !DILocation(line: 1074, column: 3, scope: !1341)
!1374 = !DILocation(line: 1074, column: 12, scope: !1341)
!1375 = !DILocation(line: 1074, column: 21, scope: !1341)
!1376 = !DILocation(line: 1078, column: 7, scope: !1377)
!1377 = distinct !DILexicalBlock(scope: !1341, file: !2, line: 1078, column: 7)
!1378 = !DILocation(line: 1078, column: 16, scope: !1377)
!1379 = !DILocation(line: 1078, column: 25, scope: !1377)
!1380 = !DILocation(line: 1078, column: 7, scope: !1341)
!1381 = !DILocation(line: 1079, column: 13, scope: !1377)
!1382 = !DILocation(line: 1079, column: 5, scope: !1377)
!1383 = !DILocation(line: 1080, column: 8, scope: !1384)
!1384 = distinct !DILexicalBlock(scope: !1341, file: !2, line: 1080, column: 7)
!1385 = !DILocation(line: 1080, column: 7, scope: !1341)
!1386 = !DILocation(line: 1081, column: 61, scope: !1387)
!1387 = distinct !DILexicalBlock(scope: !1384, file: !2, line: 1080, column: 17)
!1388 = !DILocation(line: 1081, column: 70, scope: !1387)
!1389 = !DILocation(line: 1082, column: 61, scope: !1387)
!1390 = !DILocation(line: 1081, column: 30, scope: !1387)
!1391 = !DILocation(line: 1081, column: 5, scope: !1387)
!1392 = !DILocation(line: 1081, column: 14, scope: !1387)
!1393 = !DILocation(line: 1081, column: 28, scope: !1387)
!1394 = !DILocation(line: 1083, column: 9, scope: !1395)
!1395 = distinct !DILexicalBlock(scope: !1387, file: !2, line: 1083, column: 9)
!1396 = !DILocation(line: 1083, column: 18, scope: !1395)
!1397 = !DILocation(line: 1083, column: 32, scope: !1395)
!1398 = !DILocation(line: 1083, column: 9, scope: !1387)
!1399 = !DILocation(line: 1084, column: 15, scope: !1395)
!1400 = !DILocation(line: 1084, column: 7, scope: !1395)
!1401 = !DILocation(line: 1085, column: 3, scope: !1387)
!1402 = !DILocation(line: 1086, column: 10, scope: !1341)
!1403 = !DILocation(line: 1087, column: 1, scope: !1341)
!1404 = !DILocation(line: 1086, column: 3, scope: !1341)
!1405 = distinct !DISubprogram(name: "gt_rcr_encoder_delete", scope: !2, file: !2, line: 2176, type: !1406, scopeLine: 2177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !323, retainedNodes: !1408)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{null, !465}
!1408 = !{!1409}
!1409 = !DILocalVariable(name: "rcr_enc", arg: 1, scope: !1405, file: !2, line: 2176, type: !465)
!1410 = !DILocation(line: 2176, column: 42, scope: !1405)
!1411 = !DILocation(line: 2178, column: 7, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1405, file: !2, line: 2178, column: 7)
!1413 = !DILocation(line: 2178, column: 15, scope: !1412)
!1414 = !DILocation(line: 2178, column: 7, scope: !1405)
!1415 = !DILocation(line: 2179, column: 23, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1412, file: !2, line: 2178, column: 24)
!1417 = !DILocation(line: 2179, column: 32, scope: !1416)
!1418 = !DILocation(line: 2179, column: 5, scope: !1416)
!1419 = !DILocation(line: 2180, column: 23, scope: !1416)
!1420 = !DILocation(line: 2180, column: 32, scope: !1416)
!1421 = !DILocation(line: 2180, column: 5, scope: !1416)
!1422 = !DILocation(line: 2181, column: 23, scope: !1416)
!1423 = !DILocation(line: 2181, column: 32, scope: !1416)
!1424 = !DILocation(line: 2181, column: 5, scope: !1416)
!1425 = !DILocation(line: 2182, column: 23, scope: !1416)
!1426 = !DILocation(line: 2182, column: 32, scope: !1416)
!1427 = !DILocation(line: 2182, column: 5, scope: !1416)
!1428 = !DILocation(line: 2183, column: 23, scope: !1416)
!1429 = !DILocation(line: 2183, column: 32, scope: !1416)
!1430 = !DILocation(line: 2183, column: 5, scope: !1416)
!1431 = !DILocation(line: 2185, column: 22, scope: !1416)
!1432 = !DILocation(line: 2185, column: 31, scope: !1416)
!1433 = !DILocation(line: 2185, column: 5, scope: !1416)
!1434 = !DILocation(line: 2186, column: 22, scope: !1416)
!1435 = !DILocation(line: 2186, column: 31, scope: !1416)
!1436 = !DILocation(line: 2186, column: 5, scope: !1416)
!1437 = !DILocation(line: 2188, column: 21, scope: !1416)
!1438 = !DILocation(line: 2188, column: 30, scope: !1416)
!1439 = !DILocation(line: 2188, column: 5, scope: !1416)
!1440 = !DILocation(line: 2190, column: 5, scope: !1416)
!1441 = !DILocation(line: 2190, column: 5, scope: !1442)
!1442 = distinct !DILexicalBlock(scope: !1443, file: !2, line: 2190, column: 5)
!1443 = distinct !DILexicalBlock(scope: !1416, file: !2, line: 2190, column: 5)
!1444 = !DILocation(line: 2190, column: 5, scope: !1443)
!1445 = !DILocation(line: 2190, column: 5, scope: !1446)
!1446 = distinct !DILexicalBlock(scope: !1442, file: !2, line: 2190, column: 5)
!1447 = !{!1113, !610, i64 48}
!1448 = !DILocation(line: 2192, column: 27, scope: !1416)
!1449 = !DILocation(line: 2192, column: 36, scope: !1416)
!1450 = !DILocation(line: 2192, column: 5, scope: !1416)
!1451 = !DILocation(line: 2193, column: 27, scope: !1416)
!1452 = !DILocation(line: 2193, column: 36, scope: !1416)
!1453 = !DILocation(line: 2193, column: 5, scope: !1416)
!1454 = !DILocation(line: 2194, column: 27, scope: !1416)
!1455 = !DILocation(line: 2194, column: 36, scope: !1416)
!1456 = !DILocation(line: 2194, column: 5, scope: !1416)
!1457 = !DILocation(line: 2195, column: 27, scope: !1416)
!1458 = !DILocation(line: 2195, column: 36, scope: !1416)
!1459 = !DILocation(line: 2195, column: 5, scope: !1416)
!1460 = !DILocation(line: 2196, column: 27, scope: !1416)
!1461 = !DILocation(line: 2196, column: 36, scope: !1416)
!1462 = !DILocation(line: 2196, column: 5, scope: !1416)
!1463 = !DILocation(line: 2198, column: 32, scope: !1416)
!1464 = !DILocation(line: 2198, column: 41, scope: !1416)
!1465 = !DILocation(line: 2198, column: 5, scope: !1416)
!1466 = !DILocation(line: 2199, column: 29, scope: !1416)
!1467 = !DILocation(line: 2199, column: 38, scope: !1416)
!1468 = !DILocation(line: 2199, column: 5, scope: !1416)
!1469 = !DILocation(line: 2200, column: 31, scope: !1416)
!1470 = !DILocation(line: 2200, column: 40, scope: !1416)
!1471 = !DILocation(line: 2200, column: 5, scope: !1416)
!1472 = !DILocation(line: 2202, column: 5, scope: !1416)
!1473 = !DILocation(line: 2203, column: 5, scope: !1416)
!1474 = !DILocation(line: 2204, column: 3, scope: !1416)
!1475 = !DILocation(line: 2205, column: 1, scope: !1405)
!1476 = distinct !DISubprogram(name: "gt_rcr_encoder_encode", scope: !2, file: !2, line: 1370, type: !1477, scopeLine: 1372, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !323, retainedNodes: !1479)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!354, !465, !496, !593, !497}
!1479 = !{!1480, !1481, !1482, !1483, !1484}
!1480 = !DILocalVariable(name: "rcr_enc", arg: 1, scope: !1476, file: !2, line: 1370, type: !465)
!1481 = !DILocalVariable(name: "name", arg: 2, scope: !1476, file: !2, line: 1370, type: !496)
!1482 = !DILocalVariable(name: "timer", arg: 3, scope: !1476, file: !2, line: 1371, type: !593)
!1483 = !DILocalVariable(name: "err", arg: 4, scope: !1476, file: !2, line: 1371, type: !497)
!1484 = !DILocalVariable(name: "had_err", scope: !1476, file: !2, line: 1373, type: !354)
!1485 = !DILocation(line: 1370, column: 41, scope: !1476)
!1486 = !DILocation(line: 1370, column: 62, scope: !1476)
!1487 = !DILocation(line: 1371, column: 36, scope: !1476)
!1488 = !DILocation(line: 1371, column: 52, scope: !1476)
!1489 = !DILocation(line: 1373, column: 3, scope: !1476)
!1490 = !DILocation(line: 1373, column: 7, scope: !1476)
!1491 = !DILocation(line: 1374, column: 3, scope: !1476)
!1492 = !DILocation(line: 1374, column: 3, scope: !1493)
!1493 = distinct !DILexicalBlock(scope: !1494, file: !2, line: 1374, column: 3)
!1494 = distinct !DILexicalBlock(scope: !1476, file: !2, line: 1374, column: 3)
!1495 = !DILocation(line: 1374, column: 3, scope: !1494)
!1496 = !DILocation(line: 1374, column: 3, scope: !1497)
!1497 = distinct !DILexicalBlock(scope: !1493, file: !2, line: 1374, column: 3)
!1498 = !DILocation(line: 1375, column: 3, scope: !1476)
!1499 = !DILocation(line: 1375, column: 3, scope: !1500)
!1500 = distinct !DILexicalBlock(scope: !1501, file: !2, line: 1375, column: 3)
!1501 = distinct !DILexicalBlock(scope: !1476, file: !2, line: 1375, column: 3)
!1502 = !DILocation(line: 1375, column: 3, scope: !1501)
!1503 = !DILocation(line: 1375, column: 3, scope: !1504)
!1504 = distinct !DILexicalBlock(scope: !1500, file: !2, line: 1375, column: 3)
!1505 = !DILocation(line: 1376, column: 7, scope: !1506)
!1506 = distinct !DILexicalBlock(scope: !1476, file: !2, line: 1376, column: 7)
!1507 = !DILocation(line: 1376, column: 13, scope: !1506)
!1508 = !DILocation(line: 1376, column: 7, scope: !1476)
!1509 = !DILocation(line: 1377, column: 28, scope: !1506)
!1510 = !DILocation(line: 1377, column: 53, scope: !1506)
!1511 = !DILocation(line: 1377, column: 5, scope: !1506)
!1512 = !DILocation(line: 1378, column: 3, scope: !1476)
!1513 = !DILocation(line: 1378, column: 12, scope: !1476)
!1514 = !DILocation(line: 1378, column: 25, scope: !1476)
!1515 = !DILocation(line: 1379, column: 3, scope: !1476)
!1516 = !DILocation(line: 1379, column: 12, scope: !1476)
!1517 = !DILocation(line: 1379, column: 21, scope: !1476)
!1518 = !DILocation(line: 1380, column: 28, scope: !1476)
!1519 = !DILocation(line: 1380, column: 34, scope: !1476)
!1520 = !DILocation(line: 1380, column: 43, scope: !1476)
!1521 = !DILocation(line: 1380, column: 13, scope: !1476)
!1522 = !DILocation(line: 1380, column: 11, scope: !1476)
!1523 = !DILocation(line: 1381, column: 8, scope: !1524)
!1524 = distinct !DILexicalBlock(scope: !1476, file: !2, line: 1381, column: 7)
!1525 = !DILocation(line: 1381, column: 16, scope: !1524)
!1526 = !DILocation(line: 1382, column: 7, scope: !1524)
!1527 = !DILocation(line: 1382, column: 16, scope: !1524)
!1528 = !DILocation(line: 1382, column: 28, scope: !1524)
!1529 = !DILocation(line: 1381, column: 7, scope: !1476)
!1530 = !DILocation(line: 1383, column: 41, scope: !1531)
!1531 = distinct !DILexicalBlock(scope: !1524, file: !2, line: 1382, column: 37)
!1532 = !DILocation(line: 1383, column: 50, scope: !1531)
!1533 = !DILocation(line: 1384, column: 41, scope: !1531)
!1534 = !DILocation(line: 1384, column: 50, scope: !1531)
!1535 = !DILocation(line: 1385, column: 41, scope: !1531)
!1536 = !DILocation(line: 1386, column: 41, scope: !1531)
!1537 = !DILocation(line: 1383, column: 15, scope: !1531)
!1538 = !DILocation(line: 1383, column: 13, scope: !1531)
!1539 = !DILocation(line: 1387, column: 3, scope: !1531)
!1540 = !DILocation(line: 1389, column: 10, scope: !1476)
!1541 = !DILocation(line: 1390, column: 1, scope: !1476)
!1542 = !DILocation(line: 1389, column: 3, scope: !1476)
!1543 = distinct !DISubprogram(name: "rcr_write_data", scope: !2, file: !2, line: 1322, type: !1544, scopeLine: 1323, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !323, retainedNodes: !1546)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{!354, !496, !465, !497}
!1546 = !{!1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554}
!1547 = !DILocalVariable(name: "name", arg: 1, scope: !1543, file: !2, line: 1322, type: !496)
!1548 = !DILocalVariable(name: "rcr_enc", arg: 2, scope: !1543, file: !2, line: 1322, type: !465)
!1549 = !DILocalVariable(name: "err", arg: 3, scope: !1543, file: !2, line: 1322, type: !497)
!1550 = !DILocalVariable(name: "is_not_at_pageborder", scope: !1543, file: !2, line: 1324, type: !586)
