; ModuleID = 'samples/427.bc'
source_filename = "src/bitmap/pcfwrite.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._PCFTable = type { i32, i32, i32, i32 }
%struct._Font = type { i32, %struct._FontInfo, i8, i8, i8, i8, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr }
%struct._FontInfo = type { i16, i16, i16, i16, i16, i16, i16, i16, %struct.xCharInfo, %struct.xCharInfo, %struct.xCharInfo, %struct.xCharInfo, i16, i16, i32, ptr, ptr }
%struct.xCharInfo = type { i16, i16, i16, i16, i16, i16 }
%struct._BitmapFont = type { i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr }
%struct._BitmapExtra = type { ptr, ptr, [4 x i32], %struct._FontInfo }
%struct._FontProp = type { i64, i64 }
%struct._CharInfo = type { %struct.xCharInfo, ptr }
%struct._buffile = type { ptr, i32, i32, [8192 x i8], ptr, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [54 x i8] c"pcfWriteFont(): Couldn't allocate offsetProps (%d*%d)\00", align 1, !dbg !0
@current_position = internal global i32 0, align 4, !dbg !7
@.str.1 = private unnamed_addr constant [31 x i8] c"can't go backwards... %d > %d\0A\00", align 1, !dbg !118

; Function Attrs: nounwind uwtable
define hidden i32 @pcfWriteFont(ptr noundef %pFont, ptr noundef %file) #0 !dbg !129 {
entry:
  %retval = alloca i32, align 4
  %pFont.addr = alloca ptr, align 8
  %file.addr = alloca ptr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 241, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/bitmap/pcfwrite.c", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build/aidengro/spack-stage-libxfont2-2.0.6-hvuqeosdye26hqi7nikcloa25oti4t3f/spack-src", checksumkind: CSK_MD5, checksum: "bf3b563397f51a9c50cd71f519c0bcd0")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 54)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "current_position", scope: !9, file: !2, line: 45, type: !74, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !19, globals: !117, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11}
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 162, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/fontsproto-2.1.3-b3ds5xiancrlyhfaooh5rnsbzohsusmb/include/X11/fonts/font.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "a41ff5d042660dc9657472c9cc981807")
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "Linear8Bit", value: 0)
!16 = !DIEnumerator(name: "TwoD8Bit", value: 1)
!17 = !DIEnumerator(name: "Linear16Bit", value: 2)
!18 = !DIEnumerator(name: "TwoD16Bit", value: 3)
!19 = !{!20, !114, !27, !115, !116}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "BitmapFontPtr", file: !21, line: 63, baseType: !22)
!21 = !DIFile(filename: "./include/X11/fonts/bitmap.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build/aidengro/spack-stage-libxfont2-2.0.6-hvuqeosdye26hqi7nikcloa25oti4t3f/spack-src", checksumkind: CSK_MD5, checksum: "599e6bd1ca60ce2738e4529407d8b5fd")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_BitmapFont", file: !21, line: 53, size: 512, elements: !24)
!24 = !{!25, !26, !28, !29, !53, !55, !56, !59, !60}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "version_num", scope: !23, file: !21, line: 54, baseType: !13, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "num_chars", scope: !23, file: !21, line: 55, baseType: !27, size: 32, offset: 32)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "num_tables", scope: !23, file: !21, line: 56, baseType: !27, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !23, file: !21, line: 57, baseType: !30, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "CharInfoPtr", file: !12, line: 43, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CharInfo", file: !33, line: 63, size: 192, elements: !34)
!33 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/fontsproto-2.1.3-b3ds5xiancrlyhfaooh5rnsbzohsusmb/include/X11/fonts/fontstruct.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "83a2b2a763f7c1e423b85aece6a41bc2")
!34 = !{!35, !51}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !32, file: !33, line: 64, baseType: !36, size: 96)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "xCharInfo", file: !37, line: 385, baseType: !38)
!37 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/xproto-7.0.31-jty6j5k6aazxxzyyjqrr6lta4awdkwpn/include/X11/Xproto.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "9480d28dfcb38412fb2746e48b2eb919")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 378, size: 96, elements: !39)
!39 = !{!40, !44, !45, !46, !47, !48}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "leftSideBearing", scope: !38, file: !37, line: 379, baseType: !41, size: 16)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !42, line: 102, baseType: !43)
!42 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/xproto-7.0.31-jty6j5k6aazxxzyyjqrr6lta4awdkwpn/include/X11/Xmd.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "6659907b96ce8071adc5e93d9bbce63a")
!43 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "rightSideBearing", scope: !38, file: !37, line: 380, baseType: !41, size: 16, offset: 16)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "characterWidth", scope: !38, file: !37, line: 381, baseType: !41, size: 16, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !38, file: !37, line: 382, baseType: !41, size: 16, offset: 48)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !38, file: !37, line: 383, baseType: !41, size: 16, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !38, file: !37, line: 384, baseType: !49, size: 16, offset: 80)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "CARD16", file: !42, line: 113, baseType: !50)
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !32, file: !33, line: 65, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ink_metrics", scope: !23, file: !21, line: 58, baseType: !54, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "bitmaps", scope: !23, file: !21, line: 59, baseType: !52, size: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !23, file: !21, line: 60, baseType: !57, size: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pDefault", scope: !23, file: !21, line: 61, baseType: !30, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "bitmapExtra", scope: !23, file: !21, line: 62, baseType: !61, size: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "BitmapExtraPtr", file: !21, line: 51, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_BitmapExtra", file: !21, line: 46, size: 960, elements: !64)
!64 = !{!65, !70, !72, !77}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "glyphNames", scope: !63, file: !21, line: 47, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !68, line: 38, baseType: !69)
!68 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/xproto-7.0.31-jty6j5k6aazxxzyyjqrr6lta4awdkwpn/include/X11/Xdefs.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "3cf4f3a89c166d4994924d34661b81e6")
!69 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "sWidths", scope: !63, file: !21, line: 48, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "bitmapsSizes", scope: !63, file: !21, line: 49, baseType: !73, size: 128, offset: 128)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 128, elements: !75)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "CARD32", file: !42, line: 108, baseType: !13)
!75 = !{!76}
!76 = !DISubrange(count: 4)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !63, file: !21, line: 50, baseType: !78, size: 704, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontInfoRec", file: !33, line: 100, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FontInfo", file: !33, line: 73, size: 704, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !113}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "firstCol", scope: !79, file: !33, line: 74, baseType: !50, size: 16)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "lastCol", scope: !79, file: !33, line: 75, baseType: !50, size: 16, offset: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "firstRow", scope: !79, file: !33, line: 76, baseType: !50, size: 16, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lastRow", scope: !79, file: !33, line: 77, baseType: !50, size: 16, offset: 48)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "defaultCh", scope: !79, file: !33, line: 78, baseType: !50, size: 16, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "noOverlap", scope: !79, file: !33, line: 79, baseType: !13, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "terminalFont", scope: !79, file: !33, line: 80, baseType: !13, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 80)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "constantMetrics", scope: !79, file: !33, line: 81, baseType: !13, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 80)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "constantWidth", scope: !79, file: !33, line: 82, baseType: !13, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 80)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "inkInside", scope: !79, file: !33, line: 83, baseType: !13, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 80)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "inkMetrics", scope: !79, file: !33, line: 84, baseType: !13, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 80)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "allExist", scope: !79, file: !33, line: 85, baseType: !13, size: 1, offset: 86, flags: DIFlagBitField, extraData: i64 80)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "drawDirection", scope: !79, file: !33, line: 86, baseType: !13, size: 2, offset: 87, flags: DIFlagBitField, extraData: i64 80)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cachable", scope: !79, file: !33, line: 87, baseType: !13, size: 1, offset: 89, flags: DIFlagBitField, extraData: i64 80)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "anamorphic", scope: !79, file: !33, line: 88, baseType: !13, size: 1, offset: 90, flags: DIFlagBitField, extraData: i64 80)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "maxOverlap", scope: !79, file: !33, line: 89, baseType: !43, size: 16, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !79, file: !33, line: 90, baseType: !43, size: 16, offset: 112)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "maxbounds", scope: !79, file: !33, line: 91, baseType: !36, size: 96, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "minbounds", scope: !79, file: !33, line: 92, baseType: !36, size: 96, offset: 224)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ink_maxbounds", scope: !79, file: !33, line: 93, baseType: !36, size: 96, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ink_minbounds", scope: !79, file: !33, line: 94, baseType: !36, size: 96, offset: 416)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "fontAscent", scope: !79, file: !33, line: 95, baseType: !43, size: 16, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "fontDescent", scope: !79, file: !33, line: 96, baseType: !43, size: 16, offset: 528)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nprops", scope: !79, file: !33, line: 97, baseType: !27, size: 32, offset: 544)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !79, file: !33, line: 98, baseType: !106, size: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontPropPtr", file: !12, line: 38, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FontProp", file: !33, line: 41, size: 128, elements: !109)
!109 = !{!110, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !33, line: 42, baseType: !111, size: 64)
!111 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !108, file: !33, line: 43, baseType: !111, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "isStringProp", scope: !79, file: !33, line: 99, baseType: !52, size: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!115 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!117 = !{!0, !118, !7}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !2, line: 360, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 31)
!123 = !{i32 7, !"Dwarf Version", i32 5}
!124 = !{i32 2, !"Debug Info Version", i32 3}
!125 = !{i32 1, !"wchar_size", i32 4}
!126 = !{i32 8, !"PIC Level", i32 2}
!127 = !{i32 7, !"uwtable", i32 2}
!128 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!129 = distinct !DISubprogram(name: "pcfWriteFont", scope: !2, file: !2, line: 201, type: !130, scopeLine: 202, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !207)
!130 = !DISubroutineType(types: !131)
!131 = !{!27, !132, !177}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontPtr", file: !68, line: 81, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Font", file: !33, line: 102, size: 1472, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !145, !151, !156, !160, !161, !171, !172, !173, !174, !175}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !134, file: !33, line: 103, baseType: !27, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !134, file: !33, line: 104, baseType: !78, size: 704, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !134, file: !33, line: 105, baseType: !4, size: 8, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "byte", scope: !134, file: !33, line: 106, baseType: !4, size: 8, offset: 776)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "glyph", scope: !134, file: !33, line: 107, baseType: !4, size: 8, offset: 784)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "scan", scope: !134, file: !33, line: 108, baseType: !4, size: 8, offset: 792)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !134, file: !33, line: 109, baseType: !143, size: 32, offset: 800)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsBitmapFormat", file: !144, line: 94, baseType: !74)
!144 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/fontsproto-2.1.3-b3ds5xiancrlyhfaooh5rnsbzohsusmb/include/X11/fonts/fsmasks.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "4bfc20aced0cbacb54e9d5fba7414335")
!145 = !DIDerivedType(tag: DW_TAG_member, name: "get_glyphs", scope: !134, file: !33, line: 110, baseType: !146, size: 64, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!27, !132, !69, !116, !149, !150, !58}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontEncoding", file: !12, line: 164, baseType: !11)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "get_metrics", scope: !134, file: !33, line: 116, baseType: !152, size: 64, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!27, !132, !69, !116, !149, !150, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "unload_font", scope: !134, file: !33, line: 122, baseType: !157, size: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !132}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "unload_glyphs", scope: !134, file: !33, line: 123, baseType: !157, size: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "fpe", scope: !134, file: !33, line: 124, baseType: !162, size: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontPathElementPtr", file: !12, line: 40, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FontPathElement", file: !33, line: 148, size: 256, elements: !165)
!165 = !{!166, !167, !168, !169, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name_length", scope: !164, file: !33, line: 149, baseType: !27, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !33, line: 153, baseType: !52, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !33, line: 154, baseType: !27, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !164, file: !33, line: 155, baseType: !27, size: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !164, file: !33, line: 156, baseType: !114, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "svrPrivate", scope: !134, file: !33, line: 125, baseType: !114, size: 64, offset: 1152)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fontPrivate", scope: !134, file: !33, line: 126, baseType: !114, size: 64, offset: 1216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "fpePrivate", scope: !134, file: !33, line: 127, baseType: !114, size: 64, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "maxPrivate", scope: !134, file: !33, line: 128, baseType: !27, size: 32, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "devPrivates", scope: !134, file: !33, line: 129, baseType: !176, size: 64, offset: 1408)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontFilePtr", file: !178, line: 36, baseType: !179)
!178 = !DIFile(filename: "./include/X11/fonts/fntfilio.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build/aidengro/spack-stage-libxfont2-2.0.6-hvuqeosdye26hqi7nikcloa25oti4t3f/spack-src", checksumkind: CSK_MD5, checksum: "ed4d0ca2df22c6eac9550225d5c488a2")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "BufFilePtr", file: !180, line: 38, baseType: !181)
!180 = !DIFile(filename: "./include/X11/fonts/bufio.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build/aidengro/spack-stage-libxfont2-2.0.6-hvuqeosdye26hqi7nikcloa25oti4t3f/spack-src", checksumkind: CSK_MD5, checksum: "ba374ef79e87eca9b48bd9401ca2a64e")
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_buffile", file: !180, line: 40, size: 65984, elements: !183)
!183 = !{!184, !187, !188, !189, !193, !197, !201, !205, !206}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bufp", scope: !182, file: !180, line: 41, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "BufChar", file: !180, line: 37, baseType: !115)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !182, file: !180, line: 42, baseType: !27, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !182, file: !180, line: 43, baseType: !27, size: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !182, file: !180, line: 44, baseType: !190, size: 65536, offset: 128)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 65536, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 8192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !182, file: !180, line: 45, baseType: !194, size: 64, offset: 65664)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!27, !179}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !182, file: !180, line: 46, baseType: !198, size: 64, offset: 65728)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!27, !27, !179}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !182, file: !180, line: 47, baseType: !202, size: 64, offset: 65792)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!27, !179, !27}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !182, file: !180, line: 48, baseType: !202, size: 64, offset: 65856)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !182, file: !180, line: 49, baseType: !52, size: 64, offset: 65920)
!207 = !{!208, !209, !210, !222, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !245, !246}
!208 = !DILocalVariable(name: "pFont", arg: 1, scope: !129, file: !2, line: 201, type: !132)
!209 = !DILocalVariable(name: "file", arg: 2, scope: !129, file: !2, line: 201, type: !177)
!210 = !DILocalVariable(name: "tables", scope: !129, file: !2, line: 203, type: !211)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 4096, elements: !220)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFTableRec", file: !213, line: 47, baseType: !214)
!213 = !DIFile(filename: "./include/X11/fonts/pcf.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build/aidengro/spack-stage-libxfont2-2.0.6-hvuqeosdye26hqi7nikcloa25oti4t3f/spack-src", checksumkind: CSK_MD5, checksum: "aebd33b466df7850f741ebf71b68d792")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCFTable", file: !213, line: 42, size: 128, elements: !215)
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !213, line: 43, baseType: !74, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !214, file: !213, line: 44, baseType: !74, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !214, file: !213, line: 45, baseType: !74, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !214, file: !213, line: 46, baseType: !74, size: 32, offset: 96)
!220 = !{!221}
!221 = !DISubrange(count: 32)
!222 = !DILocalVariable(name: "table", scope: !129, file: !2, line: 204, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!224 = !DILocalVariable(name: "mask", scope: !129, file: !2, line: 205, type: !74)
!225 = !DILocalVariable(name: "bit", scope: !129, file: !2, line: 206, type: !74)
!226 = !DILocalVariable(name: "ntables", scope: !129, file: !2, line: 207, type: !27)
!227 = !DILocalVariable(name: "size", scope: !129, file: !2, line: 208, type: !27)
!228 = !DILocalVariable(name: "format", scope: !129, file: !2, line: 209, type: !74)
!229 = !DILocalVariable(name: "i", scope: !129, file: !2, line: 210, type: !27)
!230 = !DILocalVariable(name: "cur_table", scope: !129, file: !2, line: 211, type: !27)
!231 = !DILocalVariable(name: "prop_string_size", scope: !129, file: !2, line: 212, type: !27)
!232 = !DILocalVariable(name: "glyph_string_size", scope: !129, file: !2, line: 213, type: !27)
!233 = !DILocalVariable(name: "minbounds", scope: !129, file: !2, line: 214, type: !54)
!234 = !DILocalVariable(name: "maxbounds", scope: !129, file: !2, line: 215, type: !54)
!235 = !DILocalVariable(name: "ink_minbounds", scope: !129, file: !2, line: 216, type: !54)
!236 = !DILocalVariable(name: "ink_maxbounds", scope: !129, file: !2, line: 217, type: !54)
!237 = !DILocalVariable(name: "bitmapFont", scope: !129, file: !2, line: 218, type: !20)
!238 = !DILocalVariable(name: "nencodings", scope: !129, file: !2, line: 219, type: !27)
!239 = !DILocalVariable(name: "header_size", scope: !129, file: !2, line: 220, type: !27)
!240 = !DILocalVariable(name: "offsetProps", scope: !129, file: !2, line: 221, type: !106)
!241 = !DILocalVariable(name: "prop_pad", scope: !129, file: !2, line: 222, type: !27)
!242 = !DILocalVariable(name: "atom_name", scope: !129, file: !2, line: 223, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!245 = !DILocalVariable(name: "glyph", scope: !129, file: !2, line: 224, type: !27)
!246 = !DILocalVariable(name: "offset", scope: !129, file: !2, line: 225, type: !74)
!247 = !DILocation(line: 201, column: 22, scope: !129)
!248 = !DILocation(line: 201, column: 41, scope: !129)
!249 = !DILocation(line: 203, column: 5, scope: !129)
!250 = !DILocation(line: 203, column: 17, scope: !129)
!251 = !DILocation(line: 204, column: 17, scope: !129)
!252 = !DILocation(line: 205, column: 5, scope: !129)
!253 = !DILocation(line: 205, column: 17, scope: !129)
!254 = !DILocation(line: 206, column: 17, scope: !129)
!255 = !DILocation(line: 207, column: 5, scope: !129)
!256 = !DILocation(line: 207, column: 17, scope: !129)
!257 = !DILocation(line: 208, column: 5, scope: !129)
!258 = !DILocation(line: 208, column: 17, scope: !129)
!259 = !DILocation(line: 209, column: 5, scope: !129)
!260 = !DILocation(line: 209, column: 17, scope: !129)
!261 = !DILocation(line: 210, column: 5, scope: !129)
!262 = !DILocation(line: 210, column: 17, scope: !129)
!263 = !DILocation(line: 211, column: 5, scope: !129)
!264 = !DILocation(line: 211, column: 17, scope: !129)
!265 = !DILocation(line: 212, column: 5, scope: !129)
!266 = !DILocation(line: 212, column: 17, scope: !129)
!267 = !DILocation(line: 213, column: 5, scope: !129)
!268 = !DILocation(line: 213, column: 17, scope: !129)
!269 = !DILocation(line: 214, column: 5, scope: !129)
!270 = !DILocation(line: 214, column: 17, scope: !129)
!271 = !DILocation(line: 215, column: 17, scope: !129)
!272 = !DILocation(line: 216, column: 5, scope: !129)
!273 = !DILocation(line: 216, column: 17, scope: !129)
!274 = !DILocation(line: 217, column: 17, scope: !129)
!275 = !DILocation(line: 218, column: 5, scope: !129)
!276 = !DILocation(line: 218, column: 20, scope: !129)
!277 = !DILocation(line: 219, column: 5, scope: !129)
