; ModuleID = 'samples/433.bc'
source_filename = "src/core/option.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtOption = type { i32, ptr, ptr, ptr, %union.anon, ptr, %union.anon.0, %union.anon.1, i8, i8, i8, i8, i8, i8, i8, i8, ptr, ptr, ptr, i32 }
%union.anon = type { %struct.GtRange }
%struct.GtRange = type { i64, i64 }
%union.anon.0 = type { double }
%union.anon.1 = type { double }
%struct.GtOptionParser = type { ptr, ptr, ptr, ptr, ptr, i8, i8, ptr, ptr, ptr, ptr, i32, i32, ptr }
%struct.HookInfo = type { ptr, ptr }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [2 x i8] c"o\00", align 1, !dbg !7
@__func__.gt_option_ref = private unnamed_addr constant [14 x i8] c"gt_option_ref\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [18 x i8] c"src/core/option.c\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [22 x i8] c"synopsis && one_liner\00", align 1, !dbg !23

!582 = distinct !DIGlobalVariable(scope: null, file: !2, line: 907, type: !309, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 923, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 616, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 77)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !324, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !14, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !2, line: 127, type: !594, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 72)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !2, line: 127, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 808, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 101)
!602 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !603, retainedTypes: !648, globals: !731, splitDebugInlining: false, nameTableKind: None)
!603 = !{!604, !622, !637, !642}
!604 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 39, baseType: !605, size: 32, elements: !606)
!605 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!607 = !DIEnumerator(name: "OPTION_BOOL", value: 0)
!608 = !DIEnumerator(name: "OPTION_CHOICE", value: 1)
!609 = !DIEnumerator(name: "OPTION_DOUBLE", value: 2)
!610 = !DIEnumerator(name: "OPTION_FILENAME", value: 3)
!611 = !DIEnumerator(name: "OPTION_HELP", value: 4)
!612 = !DIEnumerator(name: "OPTION_HELPPLUS", value: 5)
!613 = !DIEnumerator(name: "OPTION_HELPDEV", value: 6)
!614 = !DIEnumerator(name: "OPTION_INT", value: 7)
!615 = !DIEnumerator(name: "OPTION_UINT", value: 8)
!616 = !DIEnumerator(name: "OPTION_LONG", value: 9)
!617 = !DIEnumerator(name: "OPTION_ULONG", value: 10)
!618 = !DIEnumerator(name: "OPTION_RANGE", value: 11)
!619 = !DIEnumerator(name: "OPTION_STRING", value: 12)
!620 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 13)
!621 = !DIEnumerator(name: "OPTION_VERSION", value: 14)
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !623, line: 46, baseType: !605, size: 32, elements: !624)
!623 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!625 = !DIEnumerator(name: "_ISupper", value: 256)
!626 = !DIEnumerator(name: "_ISlower", value: 512)
!627 = !DIEnumerator(name: "_ISalpha", value: 1024)
!628 = !DIEnumerator(name: "_ISdigit", value: 2048)
!629 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!630 = !DIEnumerator(name: "_ISspace", value: 8192)
!631 = !DIEnumerator(name: "_ISprint", value: 16384)
!632 = !DIEnumerator(name: "_ISgraph", value: 32768)
!633 = !DIEnumerator(name: "_ISblank", value: 1)
!634 = !DIEnumerator(name: "_IScntrl", value: 2)
!635 = !DIEnumerator(name: "_ISpunct", value: 4)
!636 = !DIEnumerator(name: "_ISalnum", value: 8)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !638, line: 28, baseType: !605, size: 32, elements: !639)
!638 = !DIFile(filename: "src/core/hashmap_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "fbce1bd34708e945658f0c72ee2baa3b")
!639 = !{!640, !641}
!640 = !DIEnumerator(name: "GT_HASH_DIRECT", value: 0)
!641 = !DIEnumerator(name: "GT_HASH_STRING", value: 1)
!642 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GtOPrval", file: !643, line: 35, baseType: !605, size: 32, elements: !644)
!643 = !DIFile(filename: "src/core/option_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "4af8e95b11f2236d309c3019659f4935")
!644 = !{!645, !646, !647}
!645 = !DIEnumerator(name: "GT_OPTION_PARSER_OK", value: 0)
!646 = !DIEnumerator(name: "GT_OPTION_PARSER_ERROR", value: 1)
!647 = !DIEnumerator(name: "GT_OPTION_PARSER_REQUESTS_EXIT", value: 2)
!648 = !{!649, !650, !651, !652, !723, !724, !725, !726, !727, !728, !729, !730, !680, !653, !660}
!649 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!650 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOption", file: !643, line: 33, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtOption", file: !2, line: 79, size: 896, elements: !656)
!656 = !{!657, !659, !664, !665, !666, !691, !693, !700, !707, !708, !709, !710, !711, !712, !713, !714, !715, !720, !721, !722}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "option_type", scope: !655, file: !2, line: 80, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOptionType", file: !2, line: 55, baseType: !604)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "option_str", scope: !655, file: !2, line: 81, baseType: !660, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStr", file: !662, line: 27, baseType: !663)
!662 = !DIFile(filename: "src/core/str_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "654ceffd2f9ff17a42a8522fe21401e1")
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStr", file: !662, line: 27, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !655, file: !2, line: 82, baseType: !660, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !655, file: !2, line: 83, baseType: !651, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !655, file: !2, line: 93, baseType: !667, size: 128, offset: 256)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !655, file: !2, line: 84, size: 128, elements: !668)
!668 = !{!669, !671, !673, !674, !675, !679, !682, !689}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !667, file: !2, line: 85, baseType: !670, size: 8)
!670 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !667, file: !2, line: 86, baseType: !672, size: 64)
!672 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !667, file: !2, line: 87, baseType: !649, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !667, file: !2, line: 88, baseType: !605, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !667, file: !2, line: 89, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtWord", file: !677, line: 94, baseType: !678)
!677 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!678 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ul", scope: !667, file: !2, line: 90, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !677, line: 83, baseType: !681)
!681 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !667, file: !2, line: 91, baseType: !683, size: 128)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtRange", file: !684, line: 29, baseType: !685)
!684 = !DIFile(filename: "src/core/range_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "05971597f0a8f239b91be35d4168fb4b")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtRange", file: !684, line: 31, size: 128, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !685, file: !684, line: 32, baseType: !680, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !685, file: !684, line: 33, baseType: !680, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !667, file: !2, line: 92, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !655, file: !2, line: 94, baseType: !692, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "min_value", scope: !655, file: !2, line: 100, baseType: !694, size: 64, offset: 448)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !655, file: !2, line: 95, size: 64, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !694, file: !2, line: 96, baseType: !672, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !694, file: !2, line: 97, baseType: !649, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !694, file: !2, line: 98, baseType: !605, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ul", scope: !694, file: !2, line: 99, baseType: !680, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !655, file: !2, line: 106, baseType: !701, size: 64, offset: 512)
!701 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !655, file: !2, line: 101, size: 64, elements: !702)
!702 = !{!703, !704, !705, !706}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !701, file: !2, line: 102, baseType: !672, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !701, file: !2, line: 103, baseType: !649, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !701, file: !2, line: 104, baseType: !605, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ul", scope: !701, file: !2, line: 105, baseType: !680, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "is_set", scope: !655, file: !2, line: 107, baseType: !670, size: 8, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "is_mandatory", scope: !655, file: !2, line: 108, baseType: !670, size: 8, offset: 584)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "hide_default", scope: !655, file: !2, line: 109, baseType: !670, size: 8, offset: 592)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "min_value_set", scope: !655, file: !2, line: 110, baseType: !670, size: 8, offset: 600)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_set", scope: !655, file: !2, line: 111, baseType: !670, size: 8, offset: 608)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "is_extended_option", scope: !655, file: !2, line: 112, baseType: !670, size: 8, offset: 616)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "is_development_option", scope: !655, file: !2, line: 113, baseType: !670, size: 8, offset: 624)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "argument_is_optional", scope: !655, file: !2, line: 114, baseType: !670, size: 8, offset: 632)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "implications", scope: !655, file: !2, line: 115, baseType: !716, size: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtArray", file: !718, line: 27, baseType: !719)
!718 = !DIFile(filename: "src/core/array_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "4614c0e64ebb94278b4837ce435832ba")
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtArray", file: !718, line: 27, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "exclusions", scope: !655, file: !2, line: 117, baseType: !716, size: 64, offset: 704)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mandatory_either_options", scope: !655, file: !2, line: 118, baseType: !716, size: 64, offset: 768)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !655, file: !2, line: 119, baseType: !605, size: 32, offset: 832)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!731 = !{!0, !7, !12, !18, !23, !28, !33, !38, !43, !48, !53, !58, !63, !65, !70, !75, !80, !85, !87, !92, !97, !102, !107, !110, !112, !117, !122, !125, !130, !133, !138, !140, !145, !147, !152, !154, !159, !161, !163, !168, !170, !172, !174, !176, !178, !183, !185, !190, !192, !194, !196, !198, !200, !202, !204, !206, !208, !210, !212, !215, !220, !222, !227, !229, !234, !236, !239, !241, !243, !245, !247, !252, !254, !256, !258, !260, !265, !270, !272, !274, !276, !278, !280, !282, !284, !286, !288, !293, !298, !300, !302, !307, !312, !317, !322, !325, !327, !329, !331, !333, !338, !340, !342, !344, !346, !348, !353, !355, !357, !360, !362, !364, !366, !371, !376, !381, !383, !386, !388, !390, !393, !395, !397, !399, !401, !404, !406, !408, !411, !413, !418, !420, !422, !424, !426, !431, !436, !438, !443, !445, !447, !449, !452, !454, !459, !461, !463, !465, !467, !472, !474, !479, !484, !487, !490, !492, !495, !500, !502, !504, !506, !508, !513, !515, !517, !519, !521, !523, !525, !527, !529, !534, !536, !541, !543, !545, !548, !551, !553, !558, !560, !562, !564, !566, !568, !570, !572, !577, !579, !581, !583, !588, !590, !592, !597}
!732 = !{i32 7, !"Dwarf Version", i32 5}
!733 = !{i32 2, !"Debug Info Version", i32 3}
!734 = !{i32 1, !"wchar_size", i32 4}
!735 = !{i32 8, !"PIC Level", i32 2}
!736 = !{i32 7, !"uwtable", i32 2}
!737 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!738 = distinct !DISubprogram(name: "gt_option_ref", scope: !2, file: !2, line: 174, type: !739, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{!653, !653}
!741 = !{!742}
!742 = !DILocalVariable(name: "o", arg: 1, scope: !738, file: !2, line: 174, type: !653)
!743 = !{!744, !744, i64 0}
!744 = !{!"any pointer", !745, i64 0}
!745 = !{!"omnipotent char", !746, i64 0}
!746 = !{!"Simple C/C++ TBAA"}
!747 = !DILocation(line: 174, column: 35, scope: !738)
!748 = !DILocation(line: 176, column: 3, scope: !738)
!749 = !DILocation(line: 176, column: 3, scope: !750)
!750 = distinct !DILexicalBlock(scope: !751, file: !2, line: 176, column: 3)
!751 = distinct !DILexicalBlock(scope: !738, file: !2, line: 176, column: 3)
!752 = !DILocation(line: 176, column: 3, scope: !751)
!753 = !DILocation(line: 176, column: 3, scope: !754)
!754 = distinct !DILexicalBlock(scope: !750, file: !2, line: 176, column: 3)
!755 = !DILocation(line: 177, column: 3, scope: !738)
!756 = !DILocation(line: 177, column: 6, scope: !738)
!757 = !DILocation(line: 177, column: 21, scope: !738)
!758 = !{!759, !761, i64 104}
!759 = !{!"GtOption", !745, i64 0, !744, i64 8, !744, i64 16, !744, i64 24, !745, i64 32, !744, i64 48, !745, i64 56, !745, i64 64, !760, i64 72, !760, i64 73, !760, i64 74, !760, i64 75, !760, i64 76, !760, i64 77, !760, i64 78, !760, i64 79, !744, i64 80, !744, i64 88, !744, i64 96, !761, i64 104}
!760 = !{!"_Bool", !745, i64 0}
!761 = !{!"int", !745, i64 0}
!762 = !DILocation(line: 178, column: 10, scope: !738)
!763 = !DILocation(line: 178, column: 3, scope: !738)
!764 = !DISubprogram(name: "fprintf", scope: !765, file: !765, line: 350, type: !766, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!765 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!766 = !DISubroutineType(types: !767)
!767 = !{!649, !768, !820, null}
!768 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !771, line: 7, baseType: !772)
!771 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !773, line: 49, size: 1728, elements: !774)
!773 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!774 = !{!775, !776, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !791, !793, !794, !795, !798, !799, !801, !802, !805, !807, !810, !813, !814, !815, !818, !819}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !772, file: !773, line: 51, baseType: !649, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !772, file: !773, line: 54, baseType: !777, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !772, file: !773, line: 55, baseType: !777, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !772, file: !773, line: 56, baseType: !777, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !772, file: !773, line: 57, baseType: !777, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !772, file: !773, line: 58, baseType: !777, size: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !772, file: !773, line: 59, baseType: !777, size: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !772, file: !773, line: 60, baseType: !777, size: 64, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !772, file: !773, line: 61, baseType: !777, size: 64, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !772, file: !773, line: 64, baseType: !777, size: 64, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !772, file: !773, line: 65, baseType: !777, size: 64, offset: 640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !772, file: !773, line: 66, baseType: !777, size: 64, offset: 704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !772, file: !773, line: 68, baseType: !789, size: 64, offset: 768)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !773, line: 36, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !772, file: !773, line: 70, baseType: !792, size: 64, offset: 832)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !772, file: !773, line: 72, baseType: !649, size: 32, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !772, file: !773, line: 73, baseType: !649, size: 32, offset: 928)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !772, file: !773, line: 74, baseType: !796, size: 64, offset: 960)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !797, line: 152, baseType: !678)
!797 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !772, file: !773, line: 77, baseType: !650, size: 16, offset: 1024)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !772, file: !773, line: 78, baseType: !800, size: 8, offset: 1040)
!800 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !772, file: !773, line: 79, baseType: !510, size: 8, offset: 1048)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !772, file: !773, line: 81, baseType: !803, size: 64, offset: 1088)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !773, line: 43, baseType: null)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !772, file: !773, line: 89, baseType: !806, size: 64, offset: 1152)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !797, line: 153, baseType: !678)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !772, file: !773, line: 91, baseType: !808, size: 64, offset: 1216)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !773, line: 37, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !772, file: !773, line: 92, baseType: !811, size: 64, offset: 1280)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !773, line: 38, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !772, file: !773, line: 93, baseType: !792, size: 64, offset: 1344)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !772, file: !773, line: 94, baseType: !651, size: 64, offset: 1408)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !772, file: !773, line: 95, baseType: !816, size: 64, offset: 1472)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !817, line: 70, baseType: !681)
!817 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !772, file: !773, line: 96, baseType: !649, size: 32, offset: 1536)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !772, file: !773, line: 98, baseType: !373, size: 160, offset: 1568)
!820 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !690)
!821 = !DISubprogram(name: "abort", scope: !822, file: !822, line: 598, type: !823, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!822 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!823 = !DISubroutineType(types: !824)
!824 = !{null}
!825 = distinct !DISubprogram(name: "gt_option_parser_new", scope: !2, file: !2, line: 211, type: !826, scopeLine: 213, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !861)
!826 = !DISubroutineType(types: !827)
!827 = !{!828, !690, !690}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOptionParser", file: !643, line: 27, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtOptionParser", file: !2, line: 62, size: 768, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !848, !849, !854, !855, !856, !857}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "progname", scope: !830, file: !2, line: 63, baseType: !777, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "synopsis", scope: !830, file: !2, line: 64, baseType: !777, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "one_liner", scope: !830, file: !2, line: 65, baseType: !777, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !830, file: !2, line: 66, baseType: !716, size: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !830, file: !2, line: 67, baseType: !716, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "common_options_added", scope: !830, file: !2, line: 68, baseType: !670, size: 8, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "refer_to_manual", scope: !830, file: !2, line: 69, baseType: !670, size: 8, offset: 328)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "comment_func", scope: !830, file: !2, line: 70, baseType: !840, size: 64, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtShowCommentFunc", file: !643, line: 51, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!649, !690, !651, !844}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !846, line: 44, baseType: !847)
!846 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !846, line: 44, flags: DIFlagFwdDecl)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "comment_func_data", scope: !830, file: !2, line: 71, baseType: !651, size: 64, offset: 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "version_func", scope: !830, file: !2, line: 72, baseType: !850, size: 64, offset: 512)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtShowVersionFunc", file: !643, line: 50, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !690}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mail_address", scope: !830, file: !2, line: 73, baseType: !690, size: 64, offset: 576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "min_additional_arguments", scope: !830, file: !2, line: 74, baseType: !605, size: 32, offset: 640)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "max_additional_arguments", scope: !830, file: !2, line: 75, baseType: !605, size: 32, offset: 672)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "optionindex", scope: !830, file: !2, line: 76, baseType: !858, size: 64, offset: 704)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtHashmap", file: !638, line: 26, baseType: !860)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtHashmap", file: !638, line: 26, flags: DIFlagFwdDecl)
!861 = !{!862, !863, !864}
!862 = !DILocalVariable(name: "synopsis", arg: 1, scope: !825, file: !2, line: 211, type: !690)
!863 = !DILocalVariable(name: "one_liner", arg: 2, scope: !825, file: !2, line: 212, type: !690)
!864 = !DILocalVariable(name: "op", scope: !825, file: !2, line: 214, type: !828)
!865 = !DILocation(line: 211, column: 50, scope: !825)
!866 = !DILocation(line: 212, column: 50, scope: !825)
!867 = !DILocation(line: 214, column: 3, scope: !825)
!868 = !DILocation(line: 214, column: 19, scope: !825)
!869 = !DILocation(line: 215, column: 3, scope: !825)
!870 = !DILocation(line: 215, column: 3, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !2, line: 215, column: 3)
!872 = distinct !DILexicalBlock(scope: !825, file: !2, line: 215, column: 3)
!873 = !DILocation(line: 215, column: 3, scope: !872)
!874 = !DILocation(line: 215, column: 3, scope: !875)
!875 = distinct !DILexicalBlock(scope: !871, file: !2, line: 215, column: 3)
!876 = !DILocation(line: 216, column: 3, scope: !825)
!877 = !DILocation(line: 216, column: 3, scope: !878)
!878 = distinct !DILexicalBlock(scope: !879, file: !2, line: 216, column: 3)
!879 = distinct !DILexicalBlock(scope: !825, file: !2, line: 216, column: 3)
!880 = !{!745, !745, i64 0}
!881 = !{!882, !882, i64 0}
!882 = !{!"short", !745, i64 0}
!883 = !DILocation(line: 216, column: 3, scope: !879)
!884 = !DILocation(line: 216, column: 3, scope: !885)
!885 = distinct !DILexicalBlock(scope: !878, file: !2, line: 216, column: 3)
!886 = !DILocation(line: 218, column: 3, scope: !825)
!887 = !DILocation(line: 218, column: 3, scope: !888)
!888 = distinct !DILexicalBlock(scope: !889, file: !2, line: 218, column: 3)
!889 = distinct !DILexicalBlock(scope: !825, file: !2, line: 218, column: 3)
!890 = !DILocation(line: 218, column: 3, scope: !889)
!891 = !DILocation(line: 218, column: 3, scope: !892)
!892 = distinct !DILexicalBlock(scope: !888, file: !2, line: 218, column: 3)
!893 = !DILocation(line: 219, column: 8, scope: !825)
!894 = !DILocation(line: 219, column: 6, scope: !825)
!895 = !DILocation(line: 220, column: 30, scope: !825)
!896 = !DILocation(line: 220, column: 18, scope: !825)
!897 = !DILocation(line: 220, column: 3, scope: !825)
!898 = !DILocation(line: 220, column: 7, scope: !825)
!899 = !DILocation(line: 220, column: 16, scope: !825)
!900 = !{!901, !744, i64 8}
!901 = !{!"GtOptionParser", !744, i64 0, !744, i64 8, !744, i64 16, !744, i64 24, !744, i64 32, !760, i64 40, !760, i64 41, !744, i64 48, !744, i64 56, !744, i64 64, !744, i64 72, !761, i64 80, !761, i64 84, !744, i64 88}
!902 = !DILocation(line: 221, column: 31, scope: !825)
!903 = !DILocation(line: 221, column: 19, scope: !825)
!904 = !DILocation(line: 221, column: 3, scope: !825)
!905 = !DILocation(line: 221, column: 7, scope: !825)
!906 = !DILocation(line: 221, column: 17, scope: !825)
!907 = !{!901, !744, i64 16}
!908 = !DILocation(line: 222, column: 17, scope: !825)
!909 = !DILocation(line: 222, column: 3, scope: !825)
!910 = !DILocation(line: 222, column: 7, scope: !825)
!911 = !DILocation(line: 222, column: 15, scope: !825)
!912 = !{!901, !744, i64 24}
!913 = !DILocation(line: 223, column: 3, scope: !825)
!914 = !DILocation(line: 223, column: 7, scope: !825)
!915 = !DILocation(line: 223, column: 32, scope: !825)
!916 = !{!901, !761, i64 80}
!917 = !DILocation(line: 224, column: 3, scope: !825)
!918 = !DILocation(line: 224, column: 7, scope: !825)
!919 = !DILocation(line: 224, column: 32, scope: !825)
!920 = !{!901, !761, i64 84}
!921 = !DILocation(line: 225, column: 21, scope: !825)
!922 = !DILocation(line: 225, column: 3, scope: !825)
!923 = !DILocation(line: 225, column: 7, scope: !825)
!924 = !DILocation(line: 225, column: 19, scope: !825)
!925 = !{!901, !744, i64 88}
!926 = !DILocation(line: 226, column: 10, scope: !825)
!927 = !DILocation(line: 227, column: 1, scope: !825)
!928 = !DILocation(line: 226, column: 3, scope: !825)
!929 = !DISubprogram(name: "strlen", scope: !930, file: !930, line: 407, type: !931, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!930 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!931 = !DISubroutineType(types: !932)
!932 = !{!681, !690}
!933 = !DISubprogram(name: "__ctype_b_loc", scope: !623, file: !623, line: 79, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!934 = !DISubroutineType(types: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!939 = !DISubprogram(name: "gt_calloc_mem", scope: !940, file: !940, line: 62, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!940 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!941 = !DISubroutineType(types: !942)
!942 = !{!651, !816, !816, !690, !649}
!943 = !DISubprogram(name: "gt_cstr_dup", scope: !944, file: !944, line: 29, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!944 = !DIFile(filename: "src/core/cstr_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "fd09ef1c089bfd450bf6a9b92876658b")
!945 = !DISubroutineType(types: !946)
!946 = !{!777, !690}
!947 = !DISubprogram(name: "gt_array_new", scope: !718, file: !718, line: 30, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!948 = !DISubroutineType(types: !949)
!949 = !{!716, !816}
!950 = !DISubprogram(name: "gt_hashmap_new", scope: !638, file: !638, line: 49, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!951 = !DISubroutineType(types: !952)
!952 = !{!858, !953, !954, !954}
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtHashType", file: !638, line: 31, baseType: !637)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtFree", file: !955, line: 32, baseType: !956)
!955 = !DIFile(filename: "src/core/fptr_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "d793c53bd8610c5e0713924496ef4c73")
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !651}
!959 = distinct !DISubprogram(name: "gt_option_parser_add_option", scope: !2, file: !2, line: 229, type: !960, scopeLine: 230, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !962)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !828, !653}
!962 = !{!963, !964}
!963 = !DILocalVariable(name: "op", arg: 1, scope: !959, file: !2, line: 229, type: !828)
!964 = !DILocalVariable(name: "o", arg: 2, scope: !959, file: !2, line: 229, type: !653)
!965 = !DILocation(line: 229, column: 50, scope: !959)
!966 = !DILocation(line: 229, column: 64, scope: !959)
!967 = !DILocation(line: 231, column: 3, scope: !959)
!968 = !DILocation(line: 231, column: 3, scope: !969)
!969 = distinct !DILexicalBlock(scope: !970, file: !2, line: 231, column: 3)
!970 = distinct !DILexicalBlock(scope: !959, file: !2, line: 231, column: 3)
!971 = !DILocation(line: 231, column: 3, scope: !970)
!972 = !DILocation(line: 231, column: 3, scope: !973)
!973 = distinct !DILexicalBlock(scope: !969, file: !2, line: 231, column: 3)
!974 = !DILocation(line: 232, column: 3, scope: !959)
!975 = !DILocation(line: 233, column: 18, scope: !959)
!976 = !DILocation(line: 233, column: 22, scope: !959)
!977 = !DILocation(line: 233, column: 46, scope: !959)
!978 = !DILocation(line: 233, column: 49, scope: !959)
!979 = !{!759, !744, i64 8}
!980 = !DILocation(line: 233, column: 35, scope: !959)
!981 = !DILocation(line: 233, column: 62, scope: !959)
!982 = !DILocation(line: 233, column: 3, scope: !959)
!983 = !DILocation(line: 234, column: 1, scope: !959)
!984 = !DISubprogram(name: "gt_array_add_elem", scope: !718, file: !718, line: 57, type: !985, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !716, !651, !816}
!987 = !DISubprogram(name: "gt_hashmap_add", scope: !638, file: !638, line: 64, type: !988, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!988 = !DISubroutineType(types: !989)
!989 = !{null, !858, !651, !651}
!990 = !DISubprogram(name: "gt_str_get", scope: !662, file: !662, line: 40, type: !991, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!991 = !DISubroutineType(types: !992)
!992 = !{!777, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!995 = distinct !DISubprogram(name: "gt_option_parser_get_option", scope: !2, file: !2, line: 236, type: !996, scopeLine: 238, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !998)
!996 = !DISubroutineType(types: !997)
!997 = !{!653, !828, !690}
!998 = !{!999, !1000}
!999 = !DILocalVariable(name: "op", arg: 1, scope: !995, file: !2, line: 236, type: !828)
!1000 = !DILocalVariable(name: "option_str", arg: 2, scope: !995, file: !2, line: 237, type: !690)
!1001 = !DILocation(line: 236, column: 55, scope: !995)
!1002 = !DILocation(line: 237, column: 51, scope: !995)
!1003 = !DILocation(line: 239, column: 3, scope: !995)
!1004 = !DILocation(line: 239, column: 3, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !2, line: 239, column: 3)
!1006 = distinct !DILexicalBlock(scope: !995, file: !2, line: 239, column: 3)
!1007 = !DILocation(line: 239, column: 3, scope: !1006)
!1008 = !DILocation(line: 239, column: 3, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !2, line: 239, column: 3)
!1010 = !DILocation(line: 240, column: 25, scope: !995)
!1011 = !DILocation(line: 240, column: 29, scope: !995)
!1012 = !DILocation(line: 240, column: 42, scope: !995)
!1013 = !DILocation(line: 240, column: 10, scope: !995)
!1014 = !DILocation(line: 240, column: 3, scope: !995)
!1015 = !DISubprogram(name: "gt_hashmap_get", scope: !638, file: !638, line: 59, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!651, !858, !1018}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1020 = distinct !DISubprogram(name: "gt_option_parser_refer_to_manual", scope: !2, file: !2, line: 243, type: !1021, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !1023)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null, !828}
!1023 = !{!1024}
!1024 = !DILocalVariable(name: "op", arg: 1, scope: !1020, file: !2, line: 243, type: !828)
!1025 = !DILocation(line: 243, column: 55, scope: !1020)
!1026 = !DILocation(line: 245, column: 3, scope: !1020)
!1027 = !DILocation(line: 245, column: 3, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 245, column: 3)
!1029 = distinct !DILexicalBlock(scope: !1020, file: !2, line: 245, column: 3)
!1030 = !DILocation(line: 245, column: 3, scope: !1029)
!1031 = !DILocation(line: 245, column: 3, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1028, file: !2, line: 245, column: 3)
!1033 = !DILocation(line: 246, column: 3, scope: !1020)
!1034 = !DILocation(line: 246, column: 7, scope: !1020)
!1035 = !DILocation(line: 246, column: 23, scope: !1020)
!1036 = !{!901, !760, i64 41}
!1037 = !DILocation(line: 247, column: 1, scope: !1020)
!1038 = distinct !DISubprogram(name: "gt_option_parser_set_comment_func", scope: !2, file: !2, line: 249, type: !1039, scopeLine: 252, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !1041)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !828, !840, !651}
!1041 = !{!1042, !1043, !1044}
!1042 = !DILocalVariable(name: "op", arg: 1, scope: !1038, file: !2, line: 249, type: !828)
!1043 = !DILocalVariable(name: "comment_func", arg: 2, scope: !1038, file: !2, line: 250, type: !840)
!1044 = !DILocalVariable(name: "data", arg: 3, scope: !1038, file: !2, line: 251, type: !651)
!1045 = !DILocation(line: 249, column: 56, scope: !1038)
!1046 = !DILocation(line: 250, column: 58, scope: !1038)
!1047 = !DILocation(line: 251, column: 46, scope: !1038)
!1048 = !DILocation(line: 253, column: 3, scope: !1038)
!1049 = !DILocation(line: 253, column: 3, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !2, line: 253, column: 3)
!1051 = distinct !DILexicalBlock(scope: !1038, file: !2, line: 253, column: 3)
!1052 = !DILocation(line: 253, column: 3, scope: !1051)
!1053 = !DILocation(line: 253, column: 3, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !2, line: 253, column: 3)
!1055 = !DILocation(line: 254, column: 22, scope: !1038)
!1056 = !DILocation(line: 254, column: 3, scope: !1038)
!1057 = !DILocation(line: 254, column: 7, scope: !1038)
!1058 = !DILocation(line: 254, column: 20, scope: !1038)
!1059 = !{!901, !744, i64 48}
!1060 = !DILocation(line: 255, column: 27, scope: !1038)
!1061 = !DILocation(line: 255, column: 3, scope: !1038)
!1062 = !DILocation(line: 255, column: 7, scope: !1038)
!1063 = !DILocation(line: 255, column: 25, scope: !1038)
!1064 = !{!901, !744, i64 56}
!1065 = !DILocation(line: 256, column: 1, scope: !1038)
!1066 = distinct !DISubprogram(name: "gt_option_parser_set_version_func", scope: !2, file: !2, line: 258, type: !1067, scopeLine: 260, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !1069)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{null, !828, !850}
!1069 = !{!1070, !1071}
!1070 = !DILocalVariable(name: "op", arg: 1, scope: !1066, file: !2, line: 258, type: !828)
!1071 = !DILocalVariable(name: "version_func", arg: 2, scope: !1066, file: !2, line: 259, type: !850)
!1072 = !DILocation(line: 258, column: 56, scope: !1066)
!1073 = !DILocation(line: 259, column: 58, scope: !1066)
!1074 = !DILocation(line: 261, column: 3, scope: !1066)
!1075 = !DILocation(line: 261, column: 3, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !2, line: 261, column: 3)
!1077 = distinct !DILexicalBlock(scope: !1066, file: !2, line: 261, column: 3)
!1078 = !DILocation(line: 261, column: 3, scope: !1077)
!1079 = !DILocation(line: 261, column: 3, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1076, file: !2, line: 261, column: 3)
!1081 = !DILocation(line: 262, column: 22, scope: !1066)
!1082 = !DILocation(line: 262, column: 3, scope: !1066)
!1083 = !DILocation(line: 262, column: 7, scope: !1066)
!1084 = !DILocation(line: 262, column: 20, scope: !1066)
!1085 = !{!901, !744, i64 64}
!1086 = !DILocation(line: 263, column: 1, scope: !1066)
!1087 = distinct !DISubprogram(name: "gt_option_parser_register_hook", scope: !2, file: !2, line: 265, type: !1088, scopeLine: 268, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !1094)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null, !828, !1090, !651}
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOptionParserHookFunc", file: !643, line: 52, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!649, !651, !844}
!1094 = !{!1095, !1096, !1097, !1098}
!1095 = !DILocalVariable(name: "op", arg: 1, scope: !1087, file: !2, line: 265, type: !828)
!1096 = !DILocalVariable(name: "hook", arg: 2, scope: !1087, file: !2, line: 266, type: !1090)
!1097 = !DILocalVariable(name: "data", arg: 3, scope: !1087, file: !2, line: 267, type: !651)
!1098 = !DILocalVariable(name: "hookinfo", scope: !1087, file: !2, line: 269, type: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "HookInfo", file: !2, line: 60, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 57, size: 128, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !1100, file: !2, line: 58, baseType: !1090, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1100, file: !2, line: 59, baseType: !651, size: 64, offset: 64)
!1104 = !DILocation(line: 265, column: 53, scope: !1087)
!1105 = !DILocation(line: 266, column: 60, scope: !1087)
!1106 = !DILocation(line: 267, column: 43, scope: !1087)
!1107 = !DILocation(line: 269, column: 3, scope: !1087)
!1108 = !DILocation(line: 269, column: 12, scope: !1087)
!1109 = !DILocation(line: 270, column: 3, scope: !1087)
!1110 = !DILocation(line: 270, column: 3, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !2, line: 270, column: 3)
!1112 = distinct !DILexicalBlock(scope: !1087, file: !2, line: 270, column: 3)
!1113 = !DILocation(line: 270, column: 3, scope: !1112)
!1114 = !DILocation(line: 270, column: 3, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !2, line: 270, column: 3)
!1116 = !DILocation(line: 271, column: 8, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1087, file: !2, line: 271, column: 7)
!1118 = !DILocation(line: 271, column: 12, scope: !1117)
!1119 = !{!901, !744, i64 32}
!1120 = !DILocation(line: 271, column: 7, scope: !1087)
!1121 = !DILocation(line: 272, column: 17, scope: !1117)
!1122 = !DILocation(line: 272, column: 5, scope: !1117)
!1123 = !DILocation(line: 272, column: 9, scope: !1117)
!1124 = !DILocation(line: 272, column: 15, scope: !1117)
!1125 = !DILocation(line: 273, column: 19, scope: !1087)
!1126 = !DILocation(line: 273, column: 12, scope: !1087)
!1127 = !DILocation(line: 273, column: 17, scope: !1087)
!1128 = !{!1129, !744, i64 0}
!1129 = !{!"", !744, i64 0, !744, i64 8}
!1130 = !DILocation(line: 274, column: 19, scope: !1087)
!1131 = !DILocation(line: 274, column: 12, scope: !1087)
!1132 = !DILocation(line: 274, column: 17, scope: !1087)
!1133 = !{!1129, !744, i64 8}
!1134 = !DILocation(line: 275, column: 3, scope: !1087)
!1135 = !DILocation(line: 276, column: 1, scope: !1087)
!1136 = distinct !DISubprogram(name: "gt_option_parser_reset", scope: !2, file: !2, line: 286, type: !1021, scopeLine: 287, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !1137)
!1137 = !{!1138, !1139}
!1138 = !DILocalVariable(name: "op", arg: 1, scope: !1136, file: !2, line: 286, type: !828)
!1139 = !DILocalVariable(name: "rval", scope: !1136, file: !2, line: 288, type: !649)
!1140 = !DILocation(line: 286, column: 45, scope: !1136)
!1141 = !DILocation(line: 288, column: 3, scope: !1136)
!1142 = !DILocation(line: 288, column: 17, scope: !1136)
!1143 = !DILocation(line: 289, column: 3, scope: !1136)
!1144 = !DILocation(line: 289, column: 3, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1146, file: !2, line: 289, column: 3)
!1146 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 289, column: 3)
!1147 = !DILocation(line: 289, column: 3, scope: !1146)
!1148 = !DILocation(line: 289, column: 3, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1145, file: !2, line: 289, column: 3)
!1150 = !DILocation(line: 290, column: 29, scope: !1136)
!1151 = !DILocation(line: 290, column: 33, scope: !1136)
!1152 = !DILocation(line: 290, column: 10, scope: !1136)
!1153 = !DILocation(line: 290, column: 8, scope: !1136)
!1154 = !{!761, !761, i64 0}
!1155 = !DILocation(line: 291, column: 3, scope: !1136)
!1156 = !DILocation(line: 291, column: 3, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !2, line: 291, column: 3)
!1158 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 291, column: 3)
!1159 = !DILocation(line: 291, column: 3, scope: !1158)
!1160 = !DILocation(line: 291, column: 3, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1157, file: !2, line: 291, column: 3)
!1162 = !DILocation(line: 292, column: 1, scope: !1136)
!1163 = !DISubprogram(name: "gt_hashmap_foreach", scope: !638, file: !638, line: 74, type: !1164, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1164 = !DISubroutineType(types: !1165)
