; ModuleID = 'samples/435.bc'
source_filename = "mod_include.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.command_struct = type { ptr, %union.cmd_func, ptr, i32, i32, ptr }
%union.cmd_func = type { ptr }
%struct.module_struct = type { i32, i32, i32, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct.apr_bucket_type_t = type { ptr, i32, i32, ptr, ptr, ptr, ptr, ptr }
%struct.include_dir_config = type { ptr, ptr, ptr, i32, i8, i8, i8 }
%struct.include_server_config = type { ptr, ptr }
%struct.cmd_parms_struct = type { ptr, i32, i32, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.server_rec = type { ptr, ptr, ptr, ptr, %struct.ap_logconf, ptr, ptr, ptr, i32, i8, i16, ptr, ptr, ptr, ptr, i64, i64, i32, i32, ptr, ptr, ptr, i32, i32, i32, i32, ptr, i8 }
%struct.ap_logconf = type { ptr, i32 }
%struct.include_ctx_t = type { ptr, ptr, i32, i32, i32, i32, ptr, ptr, ptr, ptr }
%struct.ssi_internal_ctx = type { i32, i32, i32, i8, i64, i64, ptr, ptr, ptr, ptr, i64, ptr, i64, ptr, ptr, ptr, ptr, i64, i8, ptr, ptr, ptr }
%struct.arg_item = type { ptr, ptr, i64, ptr, i64 }
%struct.result_item = type { ptr, i64, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4231, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "mod_include.c", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/filters", checksumkind: CSK_MD5, checksum: "f145e8d90574fd90c28461b39bc7551c")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 14)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "includes_cmds", scope: !9, file: !2, line: 4183, type: !1455, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !219, globals: !811, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !28, !34, !49, !107, !131, !140, !148, !160, !165, !170, !182, !202}
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cmd_how", file: !12, line: 49, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "include/http_config.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "478a5811bd142d8034ca8ebc320f852f")
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!15 = !DIEnumerator(name: "RAW_ARGS", value: 0)
!16 = !DIEnumerator(name: "TAKE1", value: 1)
!17 = !DIEnumerator(name: "TAKE2", value: 2)
!18 = !DIEnumerator(name: "ITERATE", value: 3)
!19 = !DIEnumerator(name: "ITERATE2", value: 4)
!20 = !DIEnumerator(name: "FLAG", value: 5)
!21 = !DIEnumerator(name: "NO_ARGS", value: 6)
!22 = !DIEnumerator(name: "TAKE12", value: 7)
!23 = !DIEnumerator(name: "TAKE3", value: 8)
!24 = !DIEnumerator(name: "TAKE23", value: 9)
!25 = !DIEnumerator(name: "TAKE123", value: 10)
!26 = !DIEnumerator(name: "TAKE13", value: 11)
!27 = !DIEnumerator(name: "TAKE_ARGV", value: 12)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 108, baseType: !13, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "XBITHACK_OFF", value: 0)
!31 = !DIEnumerator(name: "XBITHACK_ON", value: 1)
!32 = !DIEnumerator(name: "XBITHACK_FULL", value: 2)
!33 = !DIEnumerator(name: "XBITHACK_UNSET", value: 3)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 46, baseType: !13, size: 32, elements: !36)
!35 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!37 = !DIEnumerator(name: "_ISupper", value: 256)
!38 = !DIEnumerator(name: "_ISlower", value: 512)
!39 = !DIEnumerator(name: "_ISalpha", value: 1024)
!40 = !DIEnumerator(name: "_ISdigit", value: 2048)
!41 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!42 = !DIEnumerator(name: "_ISspace", value: 8192)
!43 = !DIEnumerator(name: "_ISprint", value: 16384)
!44 = !DIEnumerator(name: "_ISgraph", value: 32768)
!45 = !DIEnumerator(name: "_ISblank", value: 1)
!46 = !DIEnumerator(name: "_IScntrl", value: 2)
!47 = !DIEnumerator(name: "_ISpunct", value: 4)
!48 = !DIEnumerator(name: "_ISalnum", value: 8)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !51, file: !50, line: 151, baseType: !13, size: 32, elements: !128)
!50 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_buckets.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "afcd28b2e200d46cb3a438f3ad8fc6de")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_type_t", file: !50, line: 131, size: 448, elements: !52)
!52 = !{!53, !56, !58, !59, !64, !111, !119, !123}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !51, file: !50, line: 135, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "num_func", scope: !51, file: !50, line: 140, baseType: !57, size: 32, offset: 64)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "is_metadata", scope: !51, file: !50, line: 156, baseType: !49, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !51, file: !50, line: 164, baseType: !60, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !51, file: !50, line: 176, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !70, !104, !105, !106}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !69, line: 44, baseType: !57)
!69 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_errno.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "571a7b9d4a9f11f6d27db63c8ba4bc85")
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket", file: !50, line: 121, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket", file: !50, line: 224, size: 512, elements: !73)
!73 = !{!74, !81, !85, !91, !98, !99, !100}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !72, file: !50, line: 226, baseType: !75, size: 128)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !72, file: !50, line: 226, size: 128, elements: !76)
!76 = !{!77, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !75, file: !50, line: 226, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !75, file: !50, line: 226, baseType: !78, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !50, line: 228, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_type_t", file: !50, line: 126, baseType: !51)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !72, file: !50, line: 234, baseType: !86, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !87, line: 379, baseType: !88)
!87 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "73077acfd8398d55139f48047843856b")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 70, baseType: !90)
!89 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!90 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !72, file: !50, line: 242, baseType: !92, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !87, line: 381, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !94, line: 85, baseType: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !96, line: 152, baseType: !97)
!96 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!97 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !72, file: !50, line: 244, baseType: !63, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !72, file: !50, line: 252, baseType: !60, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !72, file: !50, line: 254, baseType: !101, size: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_alloc_t", file: !50, line: 123, baseType: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_alloc_t", file: !50, line: 123, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_read_type_e", file: !50, line: 60, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 57, baseType: !13, size: 32, elements: !108)
!108 = !{!109, !110}
!109 = !DIEnumerator(name: "APR_BLOCK_READ", value: 0)
!110 = !DIEnumerator(name: "APR_NONBLOCK_READ", value: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "setaside", scope: !51, file: !50, line: 192, baseType: !112, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!68, !70, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !117, line: 60, baseType: !118)
!117 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_pools.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "ca846d53df1698194c1a577ccf147813")
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !117, line: 60, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !51, file: !50, line: 203, baseType: !120, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!68, !70, !86}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !51, file: !50, line: 211, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!68, !70, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!128 = !{!129, !130}
!129 = !DIEnumerator(name: "APR_BUCKET_DATA", value: 0)
!130 = !DIEnumerator(name: "APR_BUCKET_METADATA", value: 1)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !132, line: 41, baseType: !13, size: 32, elements: !133)
!132 = !DIFile(filename: "include/util_filter.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "894e51124b630754ca6243e0c50426ad")
!133 = !{!134, !135, !136, !137, !138, !139}
!134 = !DIEnumerator(name: "AP_MODE_READBYTES", value: 0)
!135 = !DIEnumerator(name: "AP_MODE_GETLINE", value: 1)
!136 = !DIEnumerator(name: "AP_MODE_EATCRLF", value: 2)
!137 = !DIEnumerator(name: "AP_MODE_SPECULATIVE", value: 3)
!138 = !DIEnumerator(name: "AP_MODE_EXHAUSTIVE", value: 4)
!139 = !DIEnumerator(name: "AP_MODE_INIT", value: 5)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !132, line: 158, baseType: !13, size: 32, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147}
!142 = !DIEnumerator(name: "AP_FTYPE_RESOURCE", value: 10)
!143 = !DIEnumerator(name: "AP_FTYPE_CONTENT_SET", value: 20)
!144 = !DIEnumerator(name: "AP_FTYPE_PROTOCOL", value: 30)
!145 = !DIEnumerator(name: "AP_FTYPE_TRANSCODE", value: 40)
!146 = !DIEnumerator(name: "AP_FTYPE_CONNECTION", value: 50)
!147 = !DIEnumerator(name: "AP_FTYPE_NETWORK", value: 60)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !149, line: 1251, baseType: !13, size: 32, elements: !150)
!149 = !DIFile(filename: "include/httpd.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "13796706810e88ffd526cf3216ebbaab")
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158, !159}
!151 = !DIEnumerator(name: "CONN_STATE_CHECK_REQUEST_LINE_READABLE", value: 0)
!152 = !DIEnumerator(name: "CONN_STATE_READ_REQUEST_LINE", value: 1)
!153 = !DIEnumerator(name: "CONN_STATE_HANDLER", value: 2)
!154 = !DIEnumerator(name: "CONN_STATE_WRITE_COMPLETION", value: 3)
!155 = !DIEnumerator(name: "CONN_STATE_SUSPENDED", value: 4)
!156 = !DIEnumerator(name: "CONN_STATE_LINGER", value: 5)
!157 = !DIEnumerator(name: "CONN_STATE_LINGER_NORMAL", value: 6)
!158 = !DIEnumerator(name: "CONN_STATE_LINGER_SHORT", value: 7)
!159 = !DIEnumerator(name: "CONN_STATE_NUM", value: 8)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !149, line: 1264, baseType: !13, size: 32, elements: !161)
!161 = !{!162, !163, !164}
!162 = !DIEnumerator(name: "CONN_SENSE_DEFAULT", value: 0)
!163 = !DIEnumerator(name: "CONN_SENSE_WANT_READ", value: 1)
!164 = !DIEnumerator(name: "CONN_SENSE_WANT_WRITE", value: 2)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !149, line: 1136, baseType: !13, size: 32, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIEnumerator(name: "AP_CONN_UNKNOWN", value: 0)
!168 = !DIEnumerator(name: "AP_CONN_CLOSE", value: 1)
!169 = !DIEnumerator(name: "AP_CONN_KEEPALIVE", value: 2)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !171, line: 62, baseType: !13, size: 32, elements: !172)
!171 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_info.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "58895203e42ced4eaee1557b60315f00")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181}
!173 = !DIEnumerator(name: "APR_NOFILE", value: 0)
!174 = !DIEnumerator(name: "APR_REG", value: 1)
!175 = !DIEnumerator(name: "APR_DIR", value: 2)
!176 = !DIEnumerator(name: "APR_CHR", value: 3)
!177 = !DIEnumerator(name: "APR_BLK", value: 4)
!178 = !DIEnumerator(name: "APR_PIPE", value: 5)
!179 = !DIEnumerator(name: "APR_LNK", value: 6)
!180 = !DIEnumerator(name: "APR_SOCK", value: 7)
!181 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 131, baseType: !13, size: 32, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!184 = !DIEnumerator(name: "PARSE_PRE_HEAD", value: 0)
!185 = !DIEnumerator(name: "PARSE_HEAD", value: 1)
!186 = !DIEnumerator(name: "PARSE_DIRECTIVE", value: 2)
!187 = !DIEnumerator(name: "PARSE_DIRECTIVE_POSTNAME", value: 3)
!188 = !DIEnumerator(name: "PARSE_DIRECTIVE_TAIL", value: 4)
!189 = !DIEnumerator(name: "PARSE_DIRECTIVE_POSTTAIL", value: 5)
!190 = !DIEnumerator(name: "PARSE_PRE_ARG", value: 6)
!191 = !DIEnumerator(name: "PARSE_ARG", value: 7)
!192 = !DIEnumerator(name: "PARSE_ARG_NAME", value: 8)
!193 = !DIEnumerator(name: "PARSE_ARG_POSTNAME", value: 9)
!194 = !DIEnumerator(name: "PARSE_ARG_EQ", value: 10)
!195 = !DIEnumerator(name: "PARSE_ARG_PREVAL", value: 11)
!196 = !DIEnumerator(name: "PARSE_ARG_VAL", value: 12)
!197 = !DIEnumerator(name: "PARSE_ARG_VAL_ESC", value: 13)
!198 = !DIEnumerator(name: "PARSE_ARG_POSTVAL", value: 14)
!199 = !DIEnumerator(name: "PARSE_TAIL", value: 15)
!200 = !DIEnumerator(name: "PARSE_TAIL_SEQ", value: 16)
!201 = !DIEnumerator(name: "PARSE_EXECUTE", value: 17)
!202 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 70, baseType: !13, size: 32, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218}
!204 = !DIEnumerator(name: "TOKEN_STRING", value: 0)
!205 = !DIEnumerator(name: "TOKEN_RE", value: 1)
!206 = !DIEnumerator(name: "TOKEN_AND", value: 2)
!207 = !DIEnumerator(name: "TOKEN_OR", value: 3)
!208 = !DIEnumerator(name: "TOKEN_NOT", value: 4)
!209 = !DIEnumerator(name: "TOKEN_EQ", value: 5)
!210 = !DIEnumerator(name: "TOKEN_NE", value: 6)
!211 = !DIEnumerator(name: "TOKEN_RBRACE", value: 7)
!212 = !DIEnumerator(name: "TOKEN_LBRACE", value: 8)
!213 = !DIEnumerator(name: "TOKEN_GROUP", value: 9)
!214 = !DIEnumerator(name: "TOKEN_GE", value: 10)
!215 = !DIEnumerator(name: "TOKEN_LE", value: 11)
!216 = !DIEnumerator(name: "TOKEN_GT", value: 12)
!217 = !DIEnumerator(name: "TOKEN_LT", value: 13)
!218 = !DIEnumerator(name: "TOKEN_ACCESS", value: 14)
!219 = !{!63, !220, !57, !233, !234, !235, !236, !241, !243, !245, !79, !250, !97, !54, !803, !251}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "include_dir_config", file: !2, line: 123, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 115, size: 256, elements: !223)
!223 = !{!224, !225, !226, !227, !229, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "default_error_msg", scope: !222, file: !2, line: 116, baseType: !54, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "default_time_fmt", scope: !222, file: !2, line: 117, baseType: !54, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_echo", scope: !222, file: !2, line: 118, baseType: !54, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "xbithack", scope: !222, file: !2, line: 119, baseType: !228, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "xbithack_t", file: !2, line: 113, baseType: !28)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !222, file: !2, line: 120, baseType: !230, size: 8, offset: 224)
!230 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !222, file: !2, line: 121, baseType: !230, size: 8, offset: 232)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_expr", scope: !222, file: !2, line: 122, baseType: !230, size: 8, offset: 240)
!233 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!234 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_opt_fn_t", file: !238, line: 59, baseType: !239)
!238 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_optional.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9d84a07cc1a598073ddbf179f8094c5d")
!239 = !DISubroutineType(types: !240)
!240 = !{null}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_OFN_ap_register_include_handler_t", file: !247, line: 116, baseType: !248)
!247 = !DIFile(filename: "./mod_include.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/filters", checksumkind: CSK_MD5, checksum: "4c4915522826b3e72f7354d9e0e364f3")
!248 = !DISubroutineType(types: !249)
!249 = !{null, !250, !251}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "include_handler_fn_t", file: !247, line: 105, baseType: !253)
!253 = !DISubroutineType(types: !254)
!254 = !{!68, !255, !482, !484}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "include_ctx_t", file: !247, line: 103, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 69, size: 512, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !706}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !257, file: !247, line: 71, baseType: !115, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "dpool", scope: !257, file: !247, line: 74, baseType: !115, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !257, file: !247, line: 77, baseType: !57, size: 32, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "if_nesting_level", scope: !257, file: !247, line: 80, baseType: !57, size: 32, offset: 160)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flush_now", scope: !257, file: !247, line: 86, baseType: !57, size: 32, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !257, file: !247, line: 89, baseType: !13, size: 32, offset: 224)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "error_str", scope: !257, file: !247, line: 92, baseType: !54, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "time_str", scope: !257, file: !247, line: 95, baseType: !54, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !257, file: !247, line: 98, baseType: !268, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_rec", file: !149, line: 811, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request_rec", file: !149, line: 838, size: 5888, elements: !271)
!271 = !{!272, !273, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !565, !566, !567, !568, !569, !570, !571, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !626, !627, !628, !629, !630, !631, !632, !637, !658, !695, !696, !697, !698, !699, !700, !701}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !270, file: !149, line: 840, baseType: !115, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !270, file: !149, line: 842, baseType: !274, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_rec", file: !149, line: 809, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_rec", file: !149, line: 1145, size: 1664, elements: !277)
!277 = !{!278, !279, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !463, !520, !521, !522, !524, !533, !534, !535, !536, !537, !538, !540, !541, !544, !545, !550, !551}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !276, file: !149, line: 1147, baseType: !115, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "base_server", scope: !276, file: !149, line: 1149, baseType: !280, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_rec", file: !149, line: 807, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_rec", file: !149, line: 1315, size: 1536, elements: !283)
!283 = !{!284, !296, !297, !298, !303, !309, !312, !313, !314, !315, !316, !320, !321, !322, !323, !420, !427, !428, !429, !430, !441, !442, !443, !444, !445, !446, !447, !448}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !282, file: !149, line: 1317, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "process_rec", file: !149, line: 805, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "process_rec", file: !149, line: 822, size: 320, elements: !288)
!288 = !{!289, !290, !291, !292, !295}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !287, file: !149, line: 824, baseType: !115, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pconf", scope: !287, file: !149, line: 826, baseType: !115, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !287, file: !149, line: 828, baseType: !54, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !287, file: !149, line: 830, baseType: !293, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !287, file: !149, line: 832, baseType: !57, size: 32, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !149, line: 1319, baseType: !280, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "error_fname", scope: !282, file: !149, line: 1324, baseType: !250, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "error_log", scope: !282, file: !149, line: 1326, baseType: !299, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !301, line: 188, baseType: !302)
!301 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9f1a845f7255d07e28e3a10d24320b5d")
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !171, line: 212, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !282, file: !149, line: 1328, baseType: !304, size: 128, offset: 256)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_logconf", file: !149, line: 1305, size: 128, elements: !305)
!305 = !{!306, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "module_levels", scope: !304, file: !149, line: 1307, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !304, file: !149, line: 1310, baseType: !57, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "module_config", scope: !282, file: !149, line: 1334, baseType: !310, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_conf_vector_t", file: !149, line: 791, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_defaults", scope: !282, file: !149, line: 1336, baseType: !310, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "defn_name", scope: !282, file: !149, line: 1339, baseType: !54, size: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "defn_line_number", scope: !282, file: !149, line: 1341, baseType: !13, size: 32, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "is_virtual", scope: !282, file: !149, line: 1343, baseType: !4, size: 8, offset: 608)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !282, file: !149, line: 1349, baseType: !317, size: 16, offset: 624)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_port_t", file: !318, line: 230, baseType: !319)
!318 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_network_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "d28b53dbcb33f6acce926c2efb3f7365")
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint16_t", file: !87, line: 331, baseType: !234)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "server_scheme", scope: !282, file: !149, line: 1351, baseType: !54, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "server_admin", scope: !282, file: !149, line: 1356, baseType: !250, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "server_hostname", scope: !282, file: !149, line: 1358, baseType: !250, size: 64, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !282, file: !149, line: 1363, baseType: !324, size: 64, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_addr_rec", file: !149, line: 1293, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_addr_rec", file: !149, line: 1294, size: 256, elements: !327)
!327 = !{!328, !329, !330, !419}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !149, line: 1296, baseType: !324, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "virthost", scope: !326, file: !149, line: 1298, baseType: !250, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !326, file: !149, line: 1300, baseType: !331, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_sockaddr_t", file: !318, line: 235, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_sockaddr_t", file: !318, line: 239, size: 1536, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !341, !346, !347, !348, !349, !350}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !333, file: !318, line: 241, baseType: !115, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !333, file: !318, line: 243, baseType: !250, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "servname", scope: !333, file: !318, line: 245, baseType: !250, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !333, file: !318, line: 247, baseType: !317, size: 16, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !333, file: !318, line: 249, baseType: !340, size: 32, offset: 224)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !87, line: 333, baseType: !57)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !333, file: !318, line: 251, baseType: !342, size: 32, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_socklen_t", file: !87, line: 382, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !344, line: 33, baseType: !345)
!344 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !96, line: 210, baseType: !13)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_len", scope: !333, file: !318, line: 253, baseType: !57, size: 32, offset: 288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "addr_str_len", scope: !333, file: !318, line: 256, baseType: !57, size: 32, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_ptr", scope: !333, file: !318, line: 259, baseType: !63, size: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !318, line: 262, baseType: !331, size: 64, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !333, file: !318, line: 280, baseType: !351, size: 1024, offset: 512)
!351 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !333, file: !318, line: 264, size: 1024, elements: !352)
!352 = !{!353, !376, !401, !410}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !351, file: !318, line: 266, baseType: !354, size: 128)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !355, line: 245, size: 128, elements: !356)
!355 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!356 = !{!357, !360, !365, !372}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !354, file: !355, line: 247, baseType: !358, size: 16)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !359, line: 28, baseType: !234)
!359 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !354, file: !355, line: 248, baseType: !361, size: 16, offset: 16)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !355, line: 123, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !363, line: 25, baseType: !364)
!363 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !96, line: 40, baseType: !234)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !354, file: !355, line: 249, baseType: !366, size: 32, offset: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !355, line: 31, size: 32, elements: !367)
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !366, file: !355, line: 33, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !355, line: 30, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !363, line: 26, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !96, line: 42, baseType: !13)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !354, file: !355, line: 252, baseType: !373, size: 64, offset: 64)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 64, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 8)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !351, file: !318, line: 269, baseType: !377, size: 224)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !355, line: 260, size: 224, elements: !378)
!378 = !{!379, !380, !381, !382, !400}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !377, file: !355, line: 262, baseType: !358, size: 16)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !377, file: !355, line: 263, baseType: !361, size: 16, offset: 16)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !377, file: !355, line: 264, baseType: !370, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !377, file: !355, line: 265, baseType: !383, size: 128, offset: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !355, line: 219, size: 128, elements: !384)
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !383, file: !355, line: 226, baseType: !386, size: 128)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !383, file: !355, line: 221, size: 128, elements: !387)
!387 = !{!388, !394, !396}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !386, file: !355, line: 223, baseType: !389, size: 128)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 128, elements: !392)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !363, line: 24, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !96, line: 38, baseType: !233)
!392 = !{!393}
!393 = !DISubrange(count: 16)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !386, file: !355, line: 224, baseType: !395, size: 128)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 128, elements: !374)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !386, file: !355, line: 225, baseType: !397, size: 128)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 128, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 4)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !377, file: !355, line: 266, baseType: !370, size: 32, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sas", scope: !351, file: !318, line: 274, baseType: !402, size: 1024)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !344, line: 193, size: 1024, elements: !403)
!403 = !{!404, !405, !409}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !402, file: !344, line: 195, baseType: !358, size: 16)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !402, file: !344, line: 196, baseType: !406, size: 944, offset: 16)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 944, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 118)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !402, file: !344, line: 197, baseType: !90, size: 64, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "unx", scope: !351, file: !318, line: 278, baseType: !411, size: 880)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !412, line: 29, size: 880, elements: !413)
!412 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !411, file: !412, line: 31, baseType: !358, size: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !411, file: !412, line: 32, baseType: !416, size: 864, offset: 16)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 864, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 108)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "host_port", scope: !326, file: !149, line: 1302, baseType: !317, size: 16, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !282, file: !149, line: 1365, baseType: !421, size: 64, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !422, line: 55, baseType: !423)
!422 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_time.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "1a8b9732d4ee010f71e3eb03e6e3a16e")
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !87, line: 371, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !425, line: 27, baseType: !426)
!425 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !96, line: 44, baseType: !97)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !282, file: !149, line: 1367, baseType: !421, size: 64, offset: 960)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !282, file: !149, line: 1369, baseType: !57, size: 32, offset: 1024)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !282, file: !149, line: 1371, baseType: !57, size: 32, offset: 1056)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !282, file: !149, line: 1374, baseType: !431, size: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_array_header_t", file: !433, line: 59, baseType: !434)
!433 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_tables.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "82dd315cfdbab9381cd05a1d2abe34a2")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_array_header_t", file: !433, line: 62, size: 256, elements: !435)
!435 = !{!436, !437, !438, !439, !440}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !434, file: !433, line: 64, baseType: !115, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !434, file: !433, line: 66, baseType: !57, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !434, file: !433, line: 68, baseType: !57, size: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !434, file: !433, line: 70, baseType: !57, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !434, file: !433, line: 72, baseType: !250, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "wild_names", scope: !282, file: !149, line: 1376, baseType: !431, size: 64, offset: 1152)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !282, file: !149, line: 1379, baseType: !54, size: 64, offset: 1216)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pathlen", scope: !282, file: !149, line: 1381, baseType: !57, size: 32, offset: 1280)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_line", scope: !282, file: !149, line: 1384, baseType: !57, size: 32, offset: 1312)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fieldsize", scope: !282, file: !149, line: 1386, baseType: !57, size: 32, offset: 1344)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fields", scope: !282, file: !149, line: 1388, baseType: !57, size: 32, offset: 1376)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !282, file: !149, line: 1391, baseType: !63, size: 64, offset: 1408)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout_set", scope: !282, file: !149, line: 1396, baseType: !13, size: 1, offset: 1472, flags: DIFlagBitField, extraData: i64 1472)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "vhost_lookup_data", scope: !276, file: !149, line: 1151, baseType: !63, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !276, file: !149, line: 1155, baseType: !331, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "client_addr", scope: !276, file: !149, line: 1159, baseType: !331, size: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "client_ip", scope: !276, file: !149, line: 1164, baseType: !250, size: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "remote_host", scope: !276, file: !149, line: 1168, baseType: !250, size: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "remote_logname", scope: !276, file: !149, line: 1171, baseType: !250, size: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !276, file: !149, line: 1174, baseType: !250, size: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "local_host", scope: !276, file: !149, line: 1177, baseType: !250, size: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !276, file: !149, line: 1180, baseType: !97, size: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "conn_config", scope: !276, file: !149, line: 1183, baseType: !310, size: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !276, file: !149, line: 1186, baseType: !460, size: 64, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_table_t", file: !433, line: 56, baseType: !462)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_table_t", file: !433, line: 56, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "input_filters", scope: !276, file: !149, line: 1188, baseType: !464, size: 64, offset: 832)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_t", file: !132, line: 259, size: 320, elements: !466)
!466 = !{!467, !516, !517, !518, !519}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "frec", scope: !465, file: !132, line: 263, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_rec_t", file: !132, line: 199, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_rec_t", file: !132, line: 215, size: 448, elements: !471)
!471 = !{!472, !473, !501, !506, !508, !512, !514, !515}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !470, file: !132, line: 217, baseType: !54, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "filter_func", scope: !470, file: !132, line: 220, baseType: !474, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_func", file: !132, line: 146, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ap_filter_func", file: !132, line: 143, size: 64, elements: !476)
!476 = !{!477, !495}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "out_func", scope: !475, file: !132, line: 144, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_out_filter_func", file: !132, line: 134, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!68, !482, !484}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_t", file: !132, line: 94, baseType: !465)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_brigade", file: !50, line: 119, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_brigade", file: !50, line: 258, size: 256, elements: !487)
!487 = !{!488, !489, !494}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !486, file: !50, line: 264, baseType: !115, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !486, file: !50, line: 273, baseType: !490, size: 128, offset: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_list", file: !50, line: 273, size: 128, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !490, file: !50, line: 273, baseType: !78, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !490, file: !50, line: 273, baseType: !78, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_alloc", scope: !486, file: !50, line: 275, baseType: !101, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "in_func", scope: !475, file: !132, line: 145, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_in_filter_func", file: !132, line: 136, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!68, !482, !484, !500, !106, !92}
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_input_mode_t", file: !132, line: 63, baseType: !131)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "filter_init_func", scope: !470, file: !132, line: 230, baseType: !502, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_init_filter_func", file: !132, line: 141, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!57, !482}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !470, file: !132, line: 233, baseType: !507, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "providers", scope: !470, file: !132, line: 236, baseType: !509, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_provider_t", file: !132, line: 200, baseType: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_provider_t", file: !132, line: 200, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !470, file: !132, line: 243, baseType: !513, size: 32, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_type", file: !132, line: 184, baseType: !140)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !470, file: !132, line: 246, baseType: !57, size: 32, offset: 352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "proto_flags", scope: !470, file: !132, line: 249, baseType: !13, size: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !465, file: !132, line: 266, baseType: !63, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !465, file: !132, line: 269, baseType: !482, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !465, file: !132, line: 275, baseType: !268, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !465, file: !132, line: 280, baseType: !274, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "output_filters", scope: !276, file: !149, line: 1190, baseType: !464, size: 64, offset: 896)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sbh", scope: !276, file: !149, line: 1192, baseType: !63, size: 64, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_alloc", scope: !276, file: !149, line: 1194, baseType: !523, size: 64, offset: 1024)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !276, file: !149, line: 1196, baseType: !525, size: 64, offset: 1088)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_state_t", file: !149, line: 813, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_state_t", file: !149, line: 1273, size: 64, elements: !528)
!528 = !{!529, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !527, file: !149, line: 1275, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_state_e", file: !149, line: 1262, baseType: !148)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "sense", scope: !527, file: !149, line: 1277, baseType: !532, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_sense_e", file: !149, line: 1268, baseType: !160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data_in_input_filters", scope: !276, file: !149, line: 1198, baseType: !57, size: 32, offset: 1152)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data_in_output_filters", scope: !276, file: !149, line: 1200, baseType: !57, size: 32, offset: 1184)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "clogging_input_filters", scope: !276, file: !149, line: 1205, baseType: !13, size: 1, offset: 1216, flags: DIFlagBitField, extraData: i64 1216)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "double_reverse", scope: !276, file: !149, line: 1209, baseType: !57, size: 2, offset: 1217, flags: DIFlagBitField, extraData: i64 1216)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", scope: !276, file: !149, line: 1212, baseType: !13, size: 32, offset: 1248)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !276, file: !149, line: 1216, baseType: !539, size: 32, offset: 1280)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_conn_keepalive_e", file: !149, line: 1140, baseType: !165)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "keepalives", scope: !276, file: !149, line: 1219, baseType: !57, size: 32, offset: 1312)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !276, file: !149, line: 1223, baseType: !542, size: 64, offset: 1344)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !276, file: !149, line: 1228, baseType: !54, size: 64, offset: 1408)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "current_thread", scope: !276, file: !149, line: 1237, baseType: !546, size: 64, offset: 1472)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_thread_t", file: !548, line: 178, baseType: !549)
!548 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_thread_proc.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "86521d0dbb7f1fbad577c4bb2abede6c")
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_t", file: !548, line: 178, flags: DIFlagFwdDecl)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !276, file: !149, line: 1241, baseType: !274, size: 64, offset: 1536)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !276, file: !149, line: 1243, baseType: !57, size: 32, offset: 1600)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !270, file: !149, line: 844, baseType: !280, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !149, line: 847, baseType: !268, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !270, file: !149, line: 849, baseType: !268, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !270, file: !149, line: 853, baseType: !268, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "the_request", scope: !270, file: !149, line: 859, baseType: !250, size: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "assbackwards", scope: !270, file: !149, line: 861, baseType: !57, size: 32, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "proxyreq", scope: !270, file: !149, line: 866, baseType: !57, size: 32, offset: 480)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "header_only", scope: !270, file: !149, line: 868, baseType: !57, size: 32, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "proto_num", scope: !270, file: !149, line: 870, baseType: !57, size: 32, offset: 544)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !270, file: !149, line: 872, baseType: !250, size: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !270, file: !149, line: 876, baseType: !54, size: 64, offset: 640)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "request_time", scope: !270, file: !149, line: 879, baseType: !564, size: 64, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !422, line: 45, baseType: !423)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "status_line", scope: !270, file: !149, line: 882, baseType: !54, size: 64, offset: 768)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !270, file: !149, line: 884, baseType: !57, size: 32, offset: 832)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "method_number", scope: !270, file: !149, line: 891, baseType: !57, size: 32, offset: 864)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !270, file: !149, line: 893, baseType: !54, size: 64, offset: 896)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !270, file: !149, line: 915, baseType: !423, size: 64, offset: 960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_xmethods", scope: !270, file: !149, line: 917, baseType: !431, size: 64, offset: 1024)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_methods", scope: !270, file: !149, line: 919, baseType: !572, size: 64, offset: 1088)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_method_list_t", file: !149, line: 634, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_method_list_t", file: !149, line: 643, size: 128, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "method_mask", scope: !574, file: !149, line: 645, baseType: !423, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "method_list", scope: !574, file: !149, line: 647, baseType: !431, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bodyct", scope: !270, file: !149, line: 922, baseType: !92, size: 64, offset: 1152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_sent", scope: !270, file: !149, line: 924, baseType: !92, size: 64, offset: 1216)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !270, file: !149, line: 926, baseType: !564, size: 64, offset: 1280)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !270, file: !149, line: 931, baseType: !54, size: 64, offset: 1344)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "clength", scope: !270, file: !149, line: 933, baseType: !92, size: 64, offset: 1408)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "chunked", scope: !270, file: !149, line: 935, baseType: !57, size: 32, offset: 1472)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "read_body", scope: !270, file: !149, line: 940, baseType: !57, size: 32, offset: 1504)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "read_chunked", scope: !270, file: !149, line: 942, baseType: !57, size: 32, offset: 1536)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "expecting_100", scope: !270, file: !149, line: 944, baseType: !13, size: 32, offset: 1568)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "kept_body", scope: !270, file: !149, line: 946, baseType: !484, size: 64, offset: 1600)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "body_table", scope: !270, file: !149, line: 950, baseType: !460, size: 64, offset: 1664)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !270, file: !149, line: 952, baseType: !92, size: 64, offset: 1728)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !270, file: !149, line: 954, baseType: !92, size: 64, offset: 1792)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "headers_in", scope: !270, file: !149, line: 969, baseType: !460, size: 64, offset: 1856)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "headers_out", scope: !270, file: !149, line: 971, baseType: !460, size: 64, offset: 1920)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "err_headers_out", scope: !270, file: !149, line: 974, baseType: !460, size: 64, offset: 1984)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "subprocess_env", scope: !270, file: !149, line: 976, baseType: !460, size: 64, offset: 2048)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !270, file: !149, line: 978, baseType: !460, size: 64, offset: 2112)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !270, file: !149, line: 985, baseType: !54, size: 64, offset: 2176)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !270, file: !149, line: 987, baseType: !54, size: 64, offset: 2240)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "content_encoding", scope: !270, file: !149, line: 990, baseType: !54, size: 64, offset: 2304)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "content_languages", scope: !270, file: !149, line: 992, baseType: !431, size: 64, offset: 2368)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "vlist_validator", scope: !270, file: !149, line: 995, baseType: !250, size: 64, offset: 2432)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !270, file: !149, line: 998, baseType: !250, size: 64, offset: 2496)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ap_auth_type", scope: !270, file: !149, line: 1000, baseType: !250, size: 64, offset: 2560)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "unparsed_uri", scope: !270, file: !149, line: 1007, baseType: !250, size: 64, offset: 2624)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !270, file: !149, line: 1009, baseType: !250, size: 64, offset: 2688)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !270, file: !149, line: 1011, baseType: !250, size: 64, offset: 2752)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_filename", scope: !270, file: !149, line: 1015, baseType: !250, size: 64, offset: 2816)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "path_info", scope: !270, file: !149, line: 1017, baseType: !250, size: 64, offset: 2880)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !270, file: !149, line: 1019, baseType: !250, size: 64, offset: 2944)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "used_path_info", scope: !270, file: !149, line: 1029, baseType: !57, size: 32, offset: 3008)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "eos_sent", scope: !270, file: !149, line: 1032, baseType: !57, size: 32, offset: 3040)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "per_dir_config", scope: !270, file: !149, line: 1040, baseType: !310, size: 64, offset: 3072)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "request_config", scope: !270, file: !149, line: 1042, baseType: !310, size: 64, offset: 3136)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !270, file: !149, line: 1047, baseType: !542, size: 64, offset: 3200)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !270, file: !149, line: 1052, baseType: !54, size: 64, offset: 3264)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "htaccess", scope: !270, file: !149, line: 1060, baseType: !616, size: 64, offset: 3328)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htaccess_result", file: !149, line: 781, size: 320, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !618, file: !149, line: 783, baseType: !54, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !618, file: !149, line: 785, baseType: !57, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "override_opts", scope: !618, file: !149, line: 787, baseType: !57, size: 32, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "override_list", scope: !618, file: !149, line: 789, baseType: !460, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "htaccess", scope: !618, file: !149, line: 791, baseType: !310, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !618, file: !149, line: 793, baseType: !616, size: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "output_filters", scope: !270, file: !149, line: 1063, baseType: !464, size: 64, offset: 3392)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "input_filters", scope: !270, file: !149, line: 1065, baseType: !464, size: 64, offset: 3456)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "proto_output_filters", scope: !270, file: !149, line: 1069, baseType: !464, size: 64, offset: 3520)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "proto_input_filters", scope: !270, file: !149, line: 1072, baseType: !464, size: 64, offset: 3584)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "no_cache", scope: !270, file: !149, line: 1075, baseType: !57, size: 32, offset: 3648)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "no_local_copy", scope: !270, file: !149, line: 1077, baseType: !57, size: 32, offset: 3680)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "invoke_mtx", scope: !270, file: !149, line: 1082, baseType: !633, size: 64, offset: 3712)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_thread_mutex_t", file: !635, line: 41, baseType: !636)
!635 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_thread_mutex.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "333d6b386ebd5ebf2a57c53b3ab4b684")
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !635, line: 41, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "parsed_uri", scope: !270, file: !149, line: 1085, baseType: !638, size: 704, offset: 3776)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uri_t", file: !639, line: 80, baseType: !640)
!639 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_uri.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9269047179f727bd075392a12871b578")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_uri_t", file: !639, line: 85, size: 704, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !654, !655, !656, !657}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !640, file: !639, line: 87, baseType: !250, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "hostinfo", scope: !640, file: !639, line: 89, baseType: !250, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !640, file: !639, line: 91, baseType: !250, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !640, file: !639, line: 93, baseType: !250, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !640, file: !639, line: 95, baseType: !250, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "port_str", scope: !640, file: !639, line: 97, baseType: !250, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !640, file: !639, line: 99, baseType: !250, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !640, file: !639, line: 101, baseType: !250, size: 64, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !640, file: !639, line: 103, baseType: !250, size: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "hostent", scope: !640, file: !639, line: 106, baseType: !652, size: 64, offset: 576)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", file: !639, line: 106, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !640, file: !639, line: 109, baseType: !317, size: 16, offset: 640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !640, file: !639, line: 112, baseType: !13, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 656)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dns_looked_up", scope: !640, file: !639, line: 115, baseType: !13, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 656)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "dns_resolved", scope: !640, file: !639, line: 117, baseType: !13, size: 1, offset: 658, flags: DIFlagBitField, extraData: i64 656)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "finfo", scope: !270, file: !149, line: 1087, baseType: !659, size: 960, offset: 4480)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_finfo_t", file: !171, line: 143, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !171, line: 174, size: 960, elements: !661)
!661 = !{!662, !663, !664, !666, !668, !673, !677, !681, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !660, file: !171, line: 176, baseType: !115, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !660, file: !171, line: 179, baseType: !340, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !660, file: !171, line: 181, baseType: !665, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !171, line: 125, baseType: !340)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !660, file: !171, line: 186, baseType: !667, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !171, line: 72, baseType: !170)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !660, file: !171, line: 188, baseType: !669, size: 32, offset: 160)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !670, line: 45, baseType: !671)
!670 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_user.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "724f26fd838740b0ca4b55f59030741b")
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !94, line: 79, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !96, line: 146, baseType: !13)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !660, file: !171, line: 190, baseType: !674, size: 32, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !670, line: 54, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !94, line: 64, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !96, line: 147, baseType: !13)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !660, file: !171, line: 192, baseType: !678, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !87, line: 383, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !94, line: 47, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !96, line: 148, baseType: !90)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !660, file: !171, line: 194, baseType: !682, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !171, line: 135, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !94, line: 59, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !96, line: 145, baseType: !90)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !660, file: !171, line: 196, baseType: !340, size: 32, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !660, file: !171, line: 198, baseType: !92, size: 64, offset: 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !660, file: !171, line: 200, baseType: !92, size: 64, offset: 512)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !660, file: !171, line: 202, baseType: !564, size: 64, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !660, file: !171, line: 204, baseType: !564, size: 64, offset: 640)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !660, file: !171, line: 206, baseType: !564, size: 64, offset: 704)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !660, file: !171, line: 208, baseType: !54, size: 64, offset: 768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !660, file: !171, line: 210, baseType: !54, size: 64, offset: 832)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !660, file: !171, line: 212, baseType: !694, size: 64, offset: 896)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_addr", scope: !270, file: !149, line: 1093, baseType: !331, size: 64, offset: 5440)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_ip", scope: !270, file: !149, line: 1094, baseType: !250, size: 64, offset: 5504)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "trailers_in", scope: !270, file: !149, line: 1097, baseType: !460, size: 64, offset: 5568)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "trailers_out", scope: !270, file: !149, line: 1099, baseType: !460, size: 64, offset: 5632)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_host", scope: !270, file: !149, line: 1104, baseType: !250, size: 64, offset: 5696)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "double_reverse", scope: !270, file: !149, line: 1108, baseType: !57, size: 32, offset: 5760)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bnotes", scope: !270, file: !149, line: 1113, baseType: !702, size: 64, offset: 5824)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_request_bnotes_t", file: !149, line: 662, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint64_t", file: !87, line: 372, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !363, line: 27, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !96, line: 45, baseType: !90)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "intern", scope: !257, file: !247, line: 101, baseType: !707, size: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssi_internal_ctx", file: !2, line: 174, size: 1280, elements: !709)
!709 = !{!710, !712, !713, !714, !715, !716, !717, !718, !719, !730, !731, !732, !733, !734, !745, !746, !765, !766, !767, !768, !801, !802}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !708, file: !2, line: 175, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "parse_state_t", file: !2, line: 150, baseType: !182)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "seen_eos", scope: !708, file: !2, line: 176, baseType: !57, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !708, file: !2, line: 177, baseType: !57, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !708, file: !2, line: 178, baseType: !4, size: 8, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "parse_pos", scope: !708, file: !2, line: 179, baseType: !86, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !708, file: !2, line: 180, baseType: !86, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_bb", scope: !708, file: !2, line: 182, baseType: !484, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "start_seq", scope: !708, file: !2, line: 184, baseType: !54, size: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "start_seq_pat", scope: !708, file: !2, line: 185, baseType: !720, size: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "bndm_t", file: !2, line: 172, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 168, size: 8320, elements: !723)
!723 = !{!724, !728, !729}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !722, file: !2, line: 169, baseType: !725, size: 8192)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8192, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !722, file: !2, line: 170, baseType: !13, size: 32, offset: 8192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_len", scope: !722, file: !2, line: 171, baseType: !86, size: 64, offset: 8256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "end_seq", scope: !708, file: !2, line: 186, baseType: !54, size: 64, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "end_seq_len", scope: !708, file: !2, line: 187, baseType: !86, size: 64, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !708, file: !2, line: 188, baseType: !250, size: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "directive_len", scope: !708, file: !2, line: 189, baseType: !86, size: 64, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "current_arg", scope: !708, file: !2, line: 191, baseType: !735, size: 64, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_item_t", file: !2, line: 158, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arg_item", file: !2, line: 152, size: 320, elements: !738)
!738 = !{!739, !741, !742, !743, !744}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !737, file: !2, line: 153, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !737, file: !2, line: 154, baseType: !250, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "name_len", scope: !737, file: !2, line: 155, baseType: !86, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !737, file: !2, line: 156, baseType: !250, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "value_len", scope: !737, file: !2, line: 157, baseType: !86, size: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !708, file: !2, line: 192, baseType: !735, size: 64, offset: 768)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !708, file: !2, line: 194, baseType: !747, size: 64, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "backref_t", file: !2, line: 166, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 160, size: 896, elements: !750)
!750 = !{!751, !752, !753, !754, !764}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !749, file: !2, line: 161, baseType: !54, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rexp", scope: !749, file: !2, line: 162, baseType: !54, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "nsub", scope: !749, file: !2, line: 163, baseType: !86, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !749, file: !2, line: 164, baseType: !755, size: 640, offset: 192)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 640, elements: !762)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_regmatch_t", file: !757, line: 118, baseType: !758)
!757 = !DIFile(filename: "include/ap_regex.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "905446d0f9865d718cde44e31accf928")
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !757, line: 115, size: 64, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rm_so", scope: !758, file: !757, line: 116, baseType: !57, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rm_eo", scope: !758, file: !757, line: 117, baseType: !57, size: 32, offset: 32)
!762 = !{!763}
!763 = !DISubrange(count: 10)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "have_match", scope: !749, file: !2, line: 165, baseType: !57, size: 32, offset: 832)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_echo", scope: !708, file: !2, line: 196, baseType: !54, size: 64, offset: 896)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_echo_len", scope: !708, file: !2, line: 197, baseType: !86, size: 64, offset: 960)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_expr", scope: !708, file: !2, line: 199, baseType: !4, size: 8, offset: 1024)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "expr_eval_ctx", scope: !708, file: !2, line: 202, baseType: !769, size: 64, offset: 1088)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_expr_eval_ctx_t", file: !771, line: 135, baseType: !772)
!771 = !DIFile(filename: "include/ap_expr.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "82c67dfabcf4ba312395b07632707f98")
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !771, line: 105, size: 832, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !793, !795, !796, !797, !798, !799, !800}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !772, file: !771, line: 107, baseType: !268, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !772, file: !771, line: 109, baseType: !274, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !772, file: !771, line: 111, baseType: !280, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !772, file: !771, line: 113, baseType: !115, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !772, file: !771, line: 115, baseType: !104, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !772, file: !771, line: 117, baseType: !780, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_expr_info_t", file: !771, line: 54, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !771, line: 41, size: 256, elements: !784)
!784 = !{!785, !789, !790, !791, !792}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "root_node", scope: !783, file: !771, line: 43, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_expr_t", file: !771, line: 38, baseType: !788)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_expr_node", file: !771, line: 38, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !783, file: !771, line: 47, baseType: !54, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !783, file: !771, line: 49, baseType: !13, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !783, file: !771, line: 51, baseType: !13, size: 32, offset: 160)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "module_index", scope: !783, file: !771, line: 53, baseType: !57, size: 32, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "re_pmatch", scope: !772, file: !771, line: 119, baseType: !794, size: 64, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "re_nmatch", scope: !772, file: !771, line: 121, baseType: !86, size: 64, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "re_source", scope: !772, file: !771, line: 123, baseType: !104, size: 64, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "vary_this", scope: !772, file: !771, line: 128, baseType: !104, size: 64, offset: 576)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "result_string", scope: !772, file: !771, line: 130, baseType: !104, size: 64, offset: 640)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !772, file: !771, line: 132, baseType: !63, size: 64, offset: 704)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "reclvl", scope: !772, file: !771, line: 134, baseType: !57, size: 32, offset: 768)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "expr_vary_this", scope: !708, file: !2, line: 203, baseType: !54, size: 64, offset: 1152)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "expr_err", scope: !708, file: !2, line: 204, baseType: !54, size: 64, offset: 1216)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_table_entry_t", file: !433, line: 78, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_table_entry_t", file: !433, line: 81, size: 192, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !805, file: !433, line: 83, baseType: !250, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !805, file: !433, line: 87, baseType: !250, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "key_checksum", scope: !805, file: !433, line: 90, baseType: !810, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint32_t", file: !87, line: 334, baseType: !13)
!811 = !{!0, !812, !945, !948, !953, !958, !963, !968, !970, !972, !977, !979, !984, !987, !992, !994, !999, !1004, !1009, !1012, !1017, !1020, !7, !1025, !1027, !1032, !1037, !1042, !1047, !1052, !1057, !1059, !1064, !1066, !1071, !1076, !1081, !1086, !1091, !1104, !1106, !1108, !1113, !1115, !1120, !1125, !1127, !1132, !1134, !1136, !1138, !1140, !1146, !1148, !1150, !1152, !1154, !1156, !1158, !1160, !1162, !1164, !1166, !1168, !1170, !1172, !1177, !1182, !1184, !1189, !1191, !1193, !1198, !1203, !1205, !1207, !1209, !1211, !1216, !1221, !1223, !1225, !1230, !1235, !1240, !1242, !1244, !1246, !1248, !1250, !1252, !1254, !1256, !1258, !1260, !1265, !1267, !1269, !1271, !1273, !1275, !1280, !1282, !1284, !1286, !1288, !1290, !1292, !1294, !1296, !1301, !1303, !1305, !1307, !1309, !1311, !1313, !1318, !1323, !1328, !1330, !1332, !1334, !1339, !1341, !1343, !1345, !1347, !1349, !1351, !1356, !1358, !1360, !1362, !1364, !1369, !1371, !1373, !1378, !1383, !1385, !1387, !1389, !1391, !1393, !1395, !1397, !1402, !1407, !1409, !1411, !1413, !1415, !1417, !1419, !1424, !1426, !1428, !1430, !1432, !1434, !1439, !1444, !1446, !1451, !1453}
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "include_module", scope: !9, file: !2, line: 4229, type: !814, isLocal: false, isDefinition: true)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "module", file: !12, line: 344, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_struct", file: !12, line: 345, size: 896, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !824, !825, !829, !833, !837, !841, !842, !940, !944}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !815, file: !12, line: 349, baseType: !57, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "minor_version", scope: !815, file: !12, line: 352, baseType: !57, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "module_index", scope: !815, file: !12, line: 354, baseType: !57, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !815, file: !12, line: 357, baseType: !54, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_load_handle", scope: !815, file: !12, line: 359, baseType: !63, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !815, file: !12, line: 364, baseType: !823, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !815, file: !12, line: 368, baseType: !90, size: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rewrite_args", scope: !815, file: !12, line: 374, baseType: !826, size: 64, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !285}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "create_dir_config", scope: !815, file: !12, line: 381, baseType: !830, size: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!63, !115, !250}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "merge_dir_config", scope: !815, file: !12, line: 389, baseType: !834, size: 64, offset: 512)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!63, !115, !63, !63}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_config", scope: !815, file: !12, line: 396, baseType: !838, size: 64, offset: 576)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!63, !115, !280}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "merge_server_config", scope: !815, file: !12, line: 404, baseType: !834, size: 64, offset: 640)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "cmds", scope: !815, file: !12, line: 409, baseType: !843, size: 64, offset: 704)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "command_rec", file: !12, line: 203, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "command_struct", file: !12, line: 204, size: 320, elements: !847)
!847 = !{!848, !849, !936, !937, !938, !939}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !846, file: !12, line: 206, baseType: !54, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !846, file: !12, line: 208, baseType: !850, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmd_func", file: !12, line: 101, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 82, size: 64, elements: !852)
!852 = !{!853, !913, !917, !923, !924, !928, !932}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "no_args", scope: !851, file: !12, line: 84, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!54, !857, !63}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmd_parms", file: !12, line: 74, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmd_parms_struct", file: !12, line: 288, size: 960, elements: !860)
