; ModuleID = 'samples/438.bc'
source_filename = "src/match/apmeoveridx.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AbstractDfstransformer = type { i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ApmeoveridxLimdfsconstinfo = type { i8, i64, i64, i64, ptr }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.ApmeoveridxLimdfsstate = type { i64, i64, i64, i64 }
%struct.Limdfsresult = type { i32, i64, i64 }

@gt_apme_AbstractDfstransformer.apme_adfst = internal constant %struct.AbstractDfstransformer { i64 32, ptr @apme_allocatedfsconstinfo, ptr @apme_initdfsconstinfo, ptr null, ptr @apme_freedfsconstinfo, ptr @apme_initLimdfsstate, ptr null, ptr null, ptr null, ptr @apme_fullmatchLimdfsstate, ptr @apme_nextLimdfsstate, ptr @apme_inplacenextLimdfsstate }, align 8, !dbg !0
@.str = private unnamed_addr constant [24 x i8] c"src/match/apmeoveridx.c\00", align 1, !dbg !122
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !128

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "apme_adfst", scope: !2, file: !3, line: 425, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "gt_apme_AbstractDfstransformer", scope: !3, file: !3, line: 423, type: !4, scopeLine: 424, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94)
!3 = !DIFile(filename: "src/match/apmeoveridx.c", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "5956e5b376e0e1bd0079b95f2c7d4f10")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "AbstractDfstransformer", file: !9, line: 21, baseType: !10)
!9 = !DIFile(filename: "src/match/absdfstrans-def.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "ac385f36206f0033bd784edaff6b4cee")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AbstractDfstransformer", file: !11, line: 45, size: 768, elements: !12)
!11 = !DIFile(filename: "src/match/absdfstrans-imp.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "6f2b1d006379cd77fb71b6142f22e81b")
!12 = !{!13, !17, !25, !29, !43, !48, !54, !58, !59, !65, !82, !90}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "sizeofdfsstate", scope: !10, file: !11, line: 47, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 70, baseType: !16)
!15 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!16 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "allocatedfsconstinfo", scope: !10, file: !11, line: 48, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !24}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Limdfsconstinfo", file: !9, line: 23, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Limdfsconstinfo", file: !9, line: 23, flags: DIFlagFwdDecl)
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "initdfsconstinfo", scope: !10, file: !11, line: 49, baseType: !26, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !21, !24, null}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "extractdfsconstinfo", scope: !10, file: !11, line: 52, baseType: !30, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33, !38, !39, !21}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "Processresult", file: !34, line: 39, baseType: !35)
!34 = !DIFile(filename: "src/match/procmatch.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e53d8bc6dafbd9ae1a3f315a13f3f7a5")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !39, !41, !41, !41, !41}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !42, line: 83, baseType: !16)
!42 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!43 = !DIDerivedType(tag: DW_TAG_member, name: "freedfsconstinfo", scope: !10, file: !11, line: 56, baseType: !44, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "initrootLimdfsstate", scope: !10, file: !11, line: 57, baseType: !49, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !52, !21}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "Aliasdfsstate", file: !11, line: 24, baseType: !41)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "initLimdfsstackelem", scope: !10, file: !11, line: 59, baseType: !55, size: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !52}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "freeLimdfsstackelem", scope: !10, file: !11, line: 60, baseType: !55, size: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "copyLimdfsstate", scope: !10, file: !11, line: 61, baseType: !60, size: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !52, !63, !21}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "fullmatchLimdfsstate", scope: !10, file: !11, line: 64, baseType: !66, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69, !52, !41, !41, !41, !41, !21}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "Limdfsresult", file: !11, line: 43, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 38, size: 192, elements: !72)
!72 = !{!73, !80, !81}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !71, file: !11, line: 40, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "Limdfsstatus", file: !11, line: 36, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 31, baseType: !24, size: 32, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIEnumerator(name: "Limdfssuccess", value: 0)
!78 = !DIEnumerator(name: "Limdfscontinue", value: 1)
!79 = !DIEnumerator(name: "Limdfsstop", value: 2)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pprefixlen", scope: !71, file: !11, line: 41, baseType: !41, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !71, file: !11, line: 42, baseType: !41, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nextLimdfsstate", scope: !10, file: !11, line: 71, baseType: !83, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86, !52, !41, !88, !63}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUchar", file: !42, line: 102, baseType: !89)
!89 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "inplacenextLimdfsstate", scope: !10, file: !11, line: 76, baseType: !91, size: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !86, !52, !41, !88}
!94 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !96, globals: !121, splitDebugInlining: false, nameTableKind: None)
!95 = !{!75}
!96 = !{!38, !21, !97, !102, !41, !108, !109, !117, !119, !88}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ApmeoveridxLimdfsconstinfo", file: !3, line: 51, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 44, size: 320, elements: !100)
!100 = !{!101, !103, !104, !105, !106}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "skpp", scope: !99, file: !3, line: 46, baseType: !102, size: 8)
!102 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "maxintervalwidth", scope: !99, file: !3, line: 47, baseType: !41, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "patternlength", scope: !99, file: !3, line: 48, baseType: !41, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "maxdistance", scope: !99, file: !3, line: 49, baseType: !41, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "eqsvector", scope: !99, file: !3, line: 50, baseType: !107, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ApmeoveridxLimdfsstate", file: !3, line: 42, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 33, size: 256, elements: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Pv", scope: !111, file: !3, line: 35, baseType: !41, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Mv", scope: !111, file: !3, line: 36, baseType: !41, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "maxleqk", scope: !111, file: !3, line: 37, baseType: !41, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "lastdistvalue", scope: !111, file: !3, line: 41, baseType: !41, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!121 = !{!0, !122, !128, !133, !138, !144, !149, !154, !159, !164, !169, !171, !176, !181}
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(scope: null, file: !3, line: 189, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 192, elements: !126)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!126 = !{!127}
!127 = !DISubrange(count: 24)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !3, line: 181, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 2376, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 297)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !3, line: 181, type: !135, isLocal: true, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 304, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 38)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !3, line: 181, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 176, elements: !142)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!142 = !{!143}
!143 = !DISubrange(count: 22)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !3, line: 253, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 136, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 17)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !3, line: 253, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 208, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 26)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !3, line: 280, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 248, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 31)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(scope: null, file: !3, line: 280, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 168, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 21)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !3, line: 281, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 496, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 62)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !3, line: 282, type: !135, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 232, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 29)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 224, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 28)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 480, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 60)
!186 = !{i32 7, !"Dwarf Version", i32 5}
!187 = !{i32 2, !"Debug Info Version", i32 3}
!188 = !{i32 1, !"wchar_size", i32 4}
!189 = !{i32 8, !"PIC Level", i32 2}
!190 = !{i32 7, !"uwtable", i32 2}
!191 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!192 = !DILocation(line: 443, column: 3, scope: !2)
!193 = distinct !DISubprogram(name: "apme_allocatedfsconstinfo", scope: !3, file: !3, line: 186, type: !19, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !194)
!194 = !{!195, !196}
!195 = !DILocalVariable(name: "alphasize", arg: 1, scope: !193, file: !3, line: 186, type: !24)
!196 = !DILocalVariable(name: "mti", scope: !193, file: !3, line: 188, type: !97)
!197 = !{!198, !198, i64 0}
!198 = !{!"int", !199, i64 0}
!199 = !{!"omnipotent char", !200, i64 0}
!200 = !{!"Simple C/C++ TBAA"}
!201 = !DILocation(line: 186, column: 64, scope: !193)
!202 = !DILocation(line: 188, column: 3, scope: !193)
!203 = !DILocation(line: 188, column: 31, scope: !193)
!204 = !DILocation(line: 189, column: 34, scope: !193)
!205 = !{!206, !206, i64 0}
!206 = !{!"any pointer", !199, i64 0}
!207 = !DILocation(line: 190, column: 20, scope: !193)
!208 = !DILocation(line: 190, column: 3, scope: !193)
!209 = !DILocation(line: 190, column: 8, scope: !193)
!210 = !DILocation(line: 190, column: 18, scope: !193)
!211 = !{!212, !206, i64 32}
!212 = !{!"", !213, i64 0, !214, i64 8, !214, i64 16, !214, i64 24, !206, i64 32}
!213 = !{!"_Bool", !199, i64 0}
!214 = !{!"long", !199, i64 0}
!215 = !DILocation(line: 191, column: 29, scope: !193)
!216 = !DILocation(line: 192, column: 1, scope: !193)
!217 = !DILocation(line: 191, column: 3, scope: !193)
!218 = distinct !DISubprogram(name: "apme_initdfsconstinfo", scope: !3, file: !3, line: 158, type: !27, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !219)
!219 = !{!220, !221, !222, !237, !240}
!220 = !DILocalVariable(name: "mt", arg: 1, scope: !218, file: !3, line: 158, type: !21)
!221 = !DILocalVariable(name: "alphasize", arg: 2, scope: !218, file: !3, line: 159, type: !24)
!222 = !DILocalVariable(name: "ap", scope: !218, file: !3, line: 170, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !224, line: 52, baseType: !225)
!224 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !226, line: 35, baseType: !227)
!226 = !DIFile(filename: "/usr/lib/clang/18/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "95ff2da58c2c75d7c246cff7935ff18b")
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 192, elements: !235)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !230)
!230 = !{!231, !232, !233, !234}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !229, file: !3, line: 170, baseType: !24, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !229, file: !3, line: 170, baseType: !24, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !229, file: !3, line: 170, baseType: !38, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !229, file: !3, line: 170, baseType: !38, size: 64, offset: 128)
!235 = !{!236}
!236 = !DISubrange(count: 1)
!237 = !DILocalVariable(name: "pattern", scope: !218, file: !3, line: 171, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!240 = !DILocalVariable(name: "mti", scope: !218, file: !3, line: 172, type: !97)
!241 = !DILocation(line: 158, column: 52, scope: !218)
!242 = !DILocation(line: 159, column: 48, scope: !218)
!243 = !DILocation(line: 170, column: 3, scope: !218)
!244 = !DILocation(line: 170, column: 11, scope: !218)
!245 = !DILocation(line: 171, column: 3, scope: !218)
!246 = !DILocation(line: 171, column: 18, scope: !218)
!247 = !DILocation(line: 172, column: 3, scope: !218)
!248 = !DILocation(line: 172, column: 31, scope: !218)
!249 = !DILocation(line: 172, column: 68, scope: !218)
!250 = !DILocation(line: 174, column: 3, scope: !218)
!251 = !DILocation(line: 175, column: 13, scope: !218)
!252 = !DILocation(line: 175, column: 11, scope: !218)
!253 = !DILocation(line: 176, column: 24, scope: !218)
!254 = !DILocation(line: 176, column: 3, scope: !218)
!255 = !DILocation(line: 176, column: 8, scope: !218)
!256 = !DILocation(line: 176, column: 22, scope: !218)
!257 = !{!212, !214, i64 16}
!258 = !DILocation(line: 177, column: 22, scope: !218)
!259 = !DILocation(line: 177, column: 3, scope: !218)
!260 = !DILocation(line: 177, column: 8, scope: !218)
!261 = !DILocation(line: 177, column: 20, scope: !218)
!262 = !{!212, !214, i64 24}
!263 = !DILocation(line: 178, column: 27, scope: !218)
!264 = !DILocation(line: 178, column: 3, scope: !218)
!265 = !DILocation(line: 178, column: 8, scope: !218)
!266 = !DILocation(line: 178, column: 25, scope: !218)
!267 = !{!212, !214, i64 8}
!268 = !DILocation(line: 179, column: 22, scope: !218)
!269 = !DILocation(line: 179, column: 15, scope: !218)
!270 = !DILocation(line: 179, column: 3, scope: !218)
!271 = !DILocation(line: 179, column: 8, scope: !218)
!272 = !DILocation(line: 179, column: 13, scope: !218)
!273 = !{!212, !213, i64 0}
!274 = !DILocation(line: 180, column: 3, scope: !218)
!275 = !DILocation(line: 181, column: 3, scope: !218)
!276 = !DILocation(line: 181, column: 3, scope: !277)
!277 = distinct !DILexicalBlock(scope: !278, file: !3, line: 181, column: 3)
!278 = distinct !DILexicalBlock(scope: !218, file: !3, line: 181, column: 3)
!279 = !DILocation(line: 181, column: 3, scope: !278)
!280 = !DILocation(line: 181, column: 3, scope: !281)
!281 = distinct !DILexicalBlock(scope: !277, file: !3, line: 181, column: 3)
!282 = !DILocation(line: 182, column: 20, scope: !218)
!283 = !DILocation(line: 182, column: 25, scope: !218)
!284 = !DILocation(line: 182, column: 45, scope: !218)
!285 = !DILocation(line: 182, column: 35, scope: !218)
!286 = !DILocation(line: 183, column: 17, scope: !218)
!287 = !DILocation(line: 183, column: 25, scope: !218)
!288 = !DILocation(line: 183, column: 30, scope: !218)
!289 = !DILocation(line: 182, column: 3, scope: !218)
!290 = !DILocation(line: 184, column: 1, scope: !218)
!291 = distinct !DISubprogram(name: "apme_freedfsconstinfo", scope: !3, file: !3, line: 194, type: !45, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !292)
!292 = !{!293, !294}
!293 = !DILocalVariable(name: "mtptr", arg: 1, scope: !291, file: !3, line: 194, type: !47)
!294 = !DILocalVariable(name: "mtiptr", scope: !291, file: !3, line: 196, type: !108)
!295 = !DILocation(line: 194, column: 53, scope: !291)
!296 = !DILocation(line: 196, column: 3, scope: !291)
!297 = !DILocation(line: 196, column: 32, scope: !291)
!298 = !DILocation(line: 196, column: 73, scope: !291)
!299 = !DILocation(line: 197, column: 3, scope: !291)
!300 = !DILocation(line: 198, column: 3, scope: !291)
!301 = !DILocation(line: 199, column: 4, scope: !291)
!302 = !DILocation(line: 199, column: 11, scope: !291)
!303 = !DILocation(line: 200, column: 1, scope: !291)
!304 = distinct !DISubprogram(name: "apme_initLimdfsstate", scope: !3, file: !3, line: 202, type: !50, scopeLine: 204, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !305)
!305 = !{!306, !307, !308, !309}
!306 = !DILocalVariable(name: "aliascolumn", arg: 1, scope: !304, file: !3, line: 202, type: !52)
!307 = !DILocalVariable(name: "mt", arg: 2, scope: !304, file: !3, line: 203, type: !21)
!308 = !DILocalVariable(name: "column", scope: !304, file: !3, line: 205, type: !109)
!309 = !DILocalVariable(name: "mti", scope: !304, file: !3, line: 206, type: !97)
!310 = !DILocation(line: 202, column: 34, scope: !304)
!311 = !DILocation(line: 203, column: 51, scope: !304)
!312 = !DILocation(line: 205, column: 3, scope: !304)
!313 = !DILocation(line: 205, column: 27, scope: !304)
!314 = !DILocation(line: 205, column: 63, scope: !304)
!315 = !DILocation(line: 206, column: 3, scope: !304)
!316 = !DILocation(line: 206, column: 31, scope: !304)
!317 = !DILocation(line: 206, column: 68, scope: !304)
!318 = !DILocation(line: 208, column: 3, scope: !304)
!319 = !DILocation(line: 208, column: 11, scope: !304)
!320 = !DILocation(line: 208, column: 14, scope: !304)
!321 = !{!322, !214, i64 8}
!322 = !{!"", !214, i64 0, !214, i64 8, !214, i64 16, !214, i64 24}
!323 = !DILocation(line: 209, column: 7, scope: !324)
!324 = distinct !DILexicalBlock(scope: !304, file: !3, line: 209, column: 7)
!325 = !DILocation(line: 209, column: 12, scope: !324)
!326 = !{i8 0, i8 2}
!327 = !{}
!328 = !DILocation(line: 209, column: 7, scope: !304)
!329 = !DILocation(line: 211, column: 5, scope: !330)
!330 = distinct !DILexicalBlock(scope: !324, file: !3, line: 210, column: 3)
!331 = !DILocation(line: 211, column: 13, scope: !330)
!332 = !DILocation(line: 211, column: 16, scope: !330)
!333 = !{!322, !214, i64 0}
!334 = !DILocation(line: 212, column: 23, scope: !330)
!335 = !DILocation(line: 212, column: 28, scope: !330)
!336 = !DILocation(line: 212, column: 5, scope: !330)
!337 = !DILocation(line: 212, column: 13, scope: !330)
!338 = !DILocation(line: 212, column: 21, scope: !330)
!339 = !{!322, !214, i64 16}
!340 = !DILocation(line: 213, column: 5, scope: !330)
!341 = !DILocation(line: 213, column: 13, scope: !330)
!342 = !DILocation(line: 213, column: 27, scope: !330)
!343 = !{!322, !214, i64 24}
!344 = !DILocation(line: 214, column: 3, scope: !330)
!345 = !DILocation(line: 216, column: 5, scope: !346)
!346 = distinct !DILexicalBlock(scope: !324, file: !3, line: 215, column: 3)
!347 = !DILocation(line: 216, column: 13, scope: !346)
!348 = !DILocation(line: 216, column: 16, scope: !346)
!349 = !DILocation(line: 217, column: 23, scope: !346)
!350 = !DILocation(line: 217, column: 28, scope: !346)
!351 = !DILocation(line: 217, column: 5, scope: !346)
!352 = !DILocation(line: 217, column: 13, scope: !346)
!353 = !DILocation(line: 217, column: 21, scope: !346)
!354 = !DILocation(line: 218, column: 29, scope: !346)
!355 = !DILocation(line: 218, column: 34, scope: !346)
!356 = !DILocation(line: 218, column: 5, scope: !346)
!357 = !DILocation(line: 218, column: 13, scope: !346)
!358 = !DILocation(line: 218, column: 27, scope: !346)
!359 = !DILocation(line: 220, column: 1, scope: !304)
!360 = distinct !DISubprogram(name: "apme_fullmatchLimdfsstate", scope: !3, file: !3, line: 222, type: !67, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !361)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370}
!362 = !DILocalVariable(name: "limdfsresult", arg: 1, scope: !360, file: !3, line: 222, type: !69)
!363 = !DILocalVariable(name: "aliascolumn", arg: 2, scope: !360, file: !3, line: 223, type: !52)
!364 = !DILocalVariable(name: "leftbound", arg: 3, scope: !360, file: !3, line: 224, type: !41)
!365 = !DILocalVariable(name: "rightbound", arg: 4, scope: !360, file: !3, line: 225, type: !41)
!366 = !DILocalVariable(name: "width", arg: 5, scope: !360, file: !3, line: 226, type: !41)
!367 = !DILocalVariable(name: "currentdepth", arg: 6, scope: !360, file: !3, line: 227, type: !41)
!368 = !DILocalVariable(name: "mt", arg: 7, scope: !360, file: !3, line: 228, type: !21)
!369 = !DILocalVariable(name: "col", scope: !360, file: !3, line: 230, type: !109)
!370 = !DILocalVariable(name: "mti", scope: !360, file: !3, line: 231, type: !97)
!371 = !DILocation(line: 222, column: 53, scope: !360)
!372 = !DILocation(line: 223, column: 39, scope: !360)
!373 = !{!214, !214, i64 0}
!374 = !DILocation(line: 224, column: 57, scope: !360)
!375 = !DILocation(line: 225, column: 57, scope: !360)
!376 = !DILocation(line: 226, column: 47, scope: !360)
!377 = !DILocation(line: 227, column: 57, scope: !360)
!378 = !DILocation(line: 228, column: 56, scope: !360)
!379 = !DILocation(line: 230, column: 3, scope: !360)
!380 = !DILocation(line: 230, column: 27, scope: !360)
!381 = !DILocation(line: 230, column: 60, scope: !360)
!382 = !DILocation(line: 231, column: 3, scope: !360)
!383 = !DILocation(line: 231, column: 31, scope: !360)
!384 = !DILocation(line: 231, column: 68, scope: !360)
!385 = !DILocation(line: 233, column: 7, scope: !386)
!386 = distinct !DILexicalBlock(scope: !360, file: !3, line: 233, column: 7)
!387 = !DILocation(line: 233, column: 12, scope: !386)
!388 = !DILocation(line: 233, column: 23, scope: !386)
!389 = !DILocation(line: 233, column: 20, scope: !386)
!390 = !DILocation(line: 233, column: 7, scope: !360)
!391 = !DILocation(line: 235, column: 5, scope: !392)
!392 = distinct !DILexicalBlock(scope: !386, file: !3, line: 234, column: 3)
!393 = !DILocation(line: 235, column: 19, scope: !392)
!394 = !DILocation(line: 235, column: 26, scope: !392)
!395 = !{!396, !199, i64 0}
!396 = !{!"", !199, i64 0, !214, i64 8, !214, i64 16}
!397 = !DILocation(line: 236, column: 5, scope: !392)
!398 = !DILocation(line: 238, column: 7, scope: !399)
!399 = distinct !DILexicalBlock(scope: !360, file: !3, line: 238, column: 7)
!400 = !DILocation(line: 238, column: 12, scope: !399)
!401 = !DILocation(line: 238, column: 29, scope: !399)
!402 = !DILocation(line: 238, column: 34, scope: !399)
!403 = !DILocation(line: 238, column: 37, scope: !399)
!404 = !DILocation(line: 238, column: 43, scope: !399)
!405 = !DILocation(line: 238, column: 7, scope: !360)
!406 = !DILocation(line: 240, column: 9, scope: !407)
!407 = distinct !DILexicalBlock(scope: !408, file: !3, line: 240, column: 9)
!408 = distinct !DILexicalBlock(scope: !399, file: !3, line: 239, column: 3)
!409 = !DILocation(line: 240, column: 14, scope: !407)
!410 = !DILocation(line: 240, column: 25, scope: !407)
!411 = !DILocation(line: 240, column: 22, scope: !407)
!412 = !DILocation(line: 240, column: 9, scope: !408)
!413 = !DILocation(line: 243, column: 7, scope: !414)
!414 = distinct !DILexicalBlock(scope: !407, file: !3, line: 241, column: 5)
!415 = !DILocation(line: 243, column: 21, scope: !414)
!416 = !DILocation(line: 243, column: 28, scope: !414)
!417 = !DILocation(line: 244, column: 34, scope: !414)
!418 = !DILocation(line: 244, column: 39, scope: !414)
!419 = !DILocation(line: 244, column: 7, scope: !414)
!420 = !DILocation(line: 244, column: 21, scope: !414)
!421 = !DILocation(line: 244, column: 32, scope: !414)
!422 = !{!396, !214, i64 8}
!423 = !DILocation(line: 245, column: 32, scope: !414)
!424 = !DILocation(line: 245, column: 37, scope: !414)
!425 = !DILocation(line: 245, column: 7, scope: !414)
!426 = !DILocation(line: 245, column: 21, scope: !414)
!427 = !DILocation(line: 245, column: 30, scope: !414)
!428 = !{!396, !214, i64 16}
!429 = !DILocation(line: 246, column: 7, scope: !414)
!430 = !DILocation(line: 248, column: 3, scope: !408)
!431 = !DILocation(line: 250, column: 9, scope: !432)
!432 = distinct !DILexicalBlock(scope: !433, file: !3, line: 250, column: 9)
!433 = distinct !DILexicalBlock(scope: !399, file: !3, line: 249, column: 3)
!434 = !DILocation(line: 250, column: 28, scope: !432)
!435 = !DILocation(line: 250, column: 33, scope: !432)
!436 = !DILocation(line: 250, column: 15, scope: !432)
!437 = !DILocation(line: 250, column: 9, scope: !433)
!438 = !DILocation(line: 253, column: 7, scope: !439)
!439 = distinct !DILexicalBlock(scope: !432, file: !3, line: 251, column: 5)
!440 = !DILocation(line: 253, column: 7, scope: !441)
!441 = distinct !DILexicalBlock(scope: !442, file: !3, line: 253, column: 7)
!442 = distinct !DILexicalBlock(scope: !439, file: !3, line: 253, column: 7)
!443 = !DILocation(line: 253, column: 7, scope: !442)
!444 = !DILocation(line: 253, column: 7, scope: !445)
!445 = distinct !DILexicalBlock(scope: !441, file: !3, line: 253, column: 7)
!446 = !DILocation(line: 254, column: 7, scope: !439)
!447 = !DILocation(line: 254, column: 21, scope: !439)
!448 = !DILocation(line: 254, column: 28, scope: !439)
!449 = !DILocation(line: 255, column: 34, scope: !439)
!450 = !DILocation(line: 255, column: 39, scope: !439)
!451 = !DILocation(line: 255, column: 7, scope: !439)
!452 = !DILocation(line: 255, column: 21, scope: !439)
!453 = !DILocation(line: 255, column: 32, scope: !439)
!454 = !DILocation(line: 256, column: 32, scope: !439)
!455 = !DILocation(line: 256, column: 37, scope: !439)
!456 = !DILocation(line: 256, column: 7, scope: !439)
!457 = !DILocation(line: 256, column: 21, scope: !439)
!458 = !DILocation(line: 256, column: 30, scope: !439)
!459 = !DILocation(line: 257, column: 7, scope: !439)
!460 = !DILocation(line: 261, column: 3, scope: !360)
!461 = !DILocation(line: 261, column: 17, scope: !360)
!462 = !DILocation(line: 261, column: 24, scope: !360)
!463 = !DILocation(line: 262, column: 1, scope: !360)
!464 = distinct !DISubprogram(name: "apme_nextLimdfsstate", scope: !3, file: !3, line: 264, type: !84, scopeLine: 269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!466 = !DILocalVariable(name: "mt", arg: 1, scope: !464, file: !3, line: 264, type: !86)
!467 = !DILocalVariable(name: "aliasoutcol", arg: 2, scope: !464, file: !3, line: 265, type: !52)
!468 = !DILocalVariable(name: "currentdepth", arg: 3, scope: !464, file: !3, line: 266, type: !41)
!469 = !DILocalVariable(name: "currentchar", arg: 4, scope: !464, file: !3, line: 267, type: !88)
!470 = !DILocalVariable(name: "aliasincol", arg: 5, scope: !464, file: !3, line: 268, type: !63)
!471 = !DILocalVariable(name: "Eq", scope: !464, file: !3, line: 270, type: !41)
!472 = !DILocalVariable(name: "Xv", scope: !464, file: !3, line: 270, type: !41)
!473 = !DILocalVariable(name: "Xh", scope: !464, file: !3, line: 270, type: !41)
!474 = !DILocalVariable(name: "Ph", scope: !464, file: !3, line: 270, type: !41)
!475 = !DILocalVariable(name: "Mh", scope: !464, file: !3, line: 270, type: !41)
!476 = !DILocalVariable(name: "backmask", scope: !464, file: !3, line: 271, type: !41)
!477 = !DILocalVariable(name: "idx", scope: !464, file: !3, line: 272, type: !41)
!478 = !DILocalVariable(name: "score", scope: !464, file: !3, line: 273, type: !41)
!479 = !DILocalVariable(name: "outcol", scope: !464, file: !3, line: 274, type: !109)
!480 = !DILocalVariable(name: "incol", scope: !464, file: !3, line: 275, type: !117)
!481 = !DILocalVariable(name: "mti", scope: !464, file: !3, line: 277, type: !119)
!482 = !DILocation(line: 264, column: 57, scope: !464)
!483 = !DILocation(line: 265, column: 34, scope: !464)
!484 = !DILocation(line: 266, column: 52, scope: !464)
!485 = !{!199, !199, i64 0}
!486 = !DILocation(line: 267, column: 42, scope: !464)
!487 = !DILocation(line: 268, column: 40, scope: !464)
!488 = !DILocation(line: 270, column: 3, scope: !464)
!489 = !DILocation(line: 270, column: 11, scope: !464)
!490 = !DILocation(line: 270, column: 19, scope: !464)
!491 = !DILocation(line: 270, column: 23, scope: !464)
!492 = !DILocation(line: 270, column: 27, scope: !464)
!493 = !DILocation(line: 270, column: 31, scope: !464)
!494 = !DILocation(line: 271, column: 17, scope: !464)
!495 = !DILocation(line: 272, column: 17, scope: !464)
!496 = !DILocation(line: 273, column: 17, scope: !464)
!497 = !DILocation(line: 274, column: 3, scope: !464)
!498 = !DILocation(line: 274, column: 27, scope: !464)
!499 = !DILocation(line: 274, column: 63, scope: !464)
!500 = !DILocation(line: 275, column: 3, scope: !464)
!501 = !DILocation(line: 275, column: 33, scope: !464)
!502 = !DILocation(line: 276, column: 70, scope: !464)
!503 = !DILocation(line: 277, column: 3, scope: !464)
!504 = !DILocation(line: 277, column: 37, scope: !464)
!505 = !DILocation(line: 278, column: 78, scope: !464)
!506 = !DILocation(line: 280, column: 3, scope: !464)
!507 = !DILocation(line: 280, column: 3, scope: !508)
!508 = distinct !DILexicalBlock(scope: !509, file: !3, line: 280, column: 3)
!509 = distinct !DILexicalBlock(scope: !464, file: !3, line: 280, column: 3)
!510 = !DILocation(line: 280, column: 3, scope: !509)
!511 = !DILocation(line: 280, column: 3, scope: !512)
!512 = distinct !DILexicalBlock(scope: !508, file: !3, line: 280, column: 3)
!513 = !DILocation(line: 281, column: 3, scope: !464)
!514 = !DILocation(line: 281, column: 3, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !3, line: 281, column: 3)
!516 = distinct !DILexicalBlock(scope: !464, file: !3, line: 281, column: 3)
!517 = !DILocation(line: 281, column: 3, scope: !516)
!518 = !DILocation(line: 281, column: 3, scope: !519)
!519 = distinct !DILexicalBlock(scope: !515, file: !3, line: 281, column: 3)
!520 = !DILocation(line: 282, column: 3, scope: !464)
!521 = !DILocation(line: 282, column: 3, scope: !522)
!522 = distinct !DILexicalBlock(scope: !523, file: !3, line: 282, column: 3)
!523 = distinct !DILexicalBlock(scope: !464, file: !3, line: 282, column: 3)
!524 = !DILocation(line: 282, column: 3, scope: !523)
!525 = !DILocation(line: 282, column: 3, scope: !526)
!526 = distinct !DILexicalBlock(scope: !522, file: !3, line: 282, column: 3)
!527 = !DILocation(line: 283, column: 7, scope: !528)
!528 = distinct !DILexicalBlock(scope: !464, file: !3, line: 283, column: 7)
!529 = !DILocation(line: 283, column: 19, scope: !528)
!530 = !DILocation(line: 283, column: 7, scope: !464)
!531 = !DILocation(line: 285, column: 10, scope: !532)
!532 = distinct !DILexicalBlock(scope: !528, file: !3, line: 284, column: 3)
!533 = !DILocation(line: 285, column: 15, scope: !532)
!534 = !DILocation(line: 285, column: 35, scope: !532)
!535 = !DILocation(line: 285, column: 25, scope: !532)
!536 = !DILocation(line: 285, column: 8, scope: !532)
!537 = !DILocation(line: 286, column: 3, scope: !532)
!538 = !DILocation(line: 287, column: 8, scope: !464)
!539 = !DILocation(line: 287, column: 13, scope: !464)
!540 = !DILocation(line: 287, column: 20, scope: !464)
!541 = !DILocation(line: 287, column: 11, scope: !464)
!542 = !DILocation(line: 287, column: 6, scope: !464)
!543 = !DILocation(line: 288, column: 11, scope: !464)
!544 = !DILocation(line: 288, column: 16, scope: !464)
!545 = !DILocation(line: 288, column: 23, scope: !464)
!546 = !DILocation(line: 288, column: 14, scope: !464)
!547 = !DILocation(line: 288, column: 29, scope: !464)
!548 = !DILocation(line: 288, column: 36, scope: !464)
!549 = !DILocation(line: 288, column: 27, scope: !464)
!550 = !DILocation(line: 288, column: 42, scope: !464)
!551 = !DILocation(line: 288, column: 49, scope: !464)
!552 = !DILocation(line: 288, column: 40, scope: !464)
!553 = !DILocation(line: 288, column: 55, scope: !464)
!554 = !DILocation(line: 288, column: 53, scope: !464)
!555 = !DILocation(line: 288, column: 6, scope: !464)
!556 = !DILocation(line: 290, column: 8, scope: !464)
!557 = !DILocation(line: 290, column: 15, scope: !464)
!558 = !DILocation(line: 290, column: 23, scope: !464)
!559 = !DILocation(line: 290, column: 28, scope: !464)
!560 = !DILocation(line: 290, column: 35, scope: !464)
!561 = !DILocation(line: 290, column: 26, scope: !464)
!562 = !DILocation(line: 290, column: 20, scope: !464)
!563 = !DILocation(line: 290, column: 18, scope: !464)
!564 = !DILocation(line: 290, column: 6, scope: !464)
!565 = !DILocation(line: 291, column: 8, scope: !464)
!566 = !DILocation(line: 291, column: 15, scope: !464)
!567 = !DILocation(line: 291, column: 20, scope: !464)
!568 = !DILocation(line: 291, column: 18, scope: !464)
!569 = !DILocation(line: 291, column: 6, scope: !464)
!570 = !DILocation(line: 293, column: 9, scope: !464)
!571 = !DILocation(line: 293, column: 12, scope: !464)
!572 = !DILocation(line: 293, column: 18, scope: !464)
!573 = !DILocation(line: 293, column: 6, scope: !464)
!574 = !DILocation(line: 294, column: 17, scope: !464)
!575 = !DILocation(line: 294, column: 20, scope: !464)
!576 = !DILocation(line: 294, column: 31, scope: !464)
!577 = !DILocation(line: 294, column: 36, scope: !464)
!578 = !DILocation(line: 294, column: 34, scope: !464)
!579 = !DILocation(line: 294, column: 28, scope: !464)
!580 = !DILocation(line: 294, column: 26, scope: !464)
!581 = !DILocation(line: 294, column: 3, scope: !464)
!582 = !DILocation(line: 294, column: 11, scope: !464)
!583 = !DILocation(line: 294, column: 14, scope: !464)
!584 = !DILocation(line: 295, column: 16, scope: !464)
!585 = !DILocation(line: 295, column: 21, scope: !464)
!586 = !DILocation(line: 295, column: 19, scope: !464)
!587 = !DILocation(line: 295, column: 3, scope: !464)
!588 = !DILocation(line: 295, column: 11, scope: !464)
!589 = !DILocation(line: 295, column: 14, scope: !464)
!590 = !DILocation(line: 296, column: 21, scope: !464)
!591 = !DILocation(line: 296, column: 28, scope: !464)
!592 = !DILocation(line: 296, column: 18, scope: !464)
!593 = !DILocation(line: 296, column: 12, scope: !464)
!594 = !DILocation(line: 297, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !464, file: !3, line: 297, column: 7)
!596 = !DILocation(line: 297, column: 12, scope: !595)
!597 = !DILocation(line: 297, column: 10, scope: !595)
!598 = !DILocation(line: 297, column: 21, scope: !595)
!599 = !DILocation(line: 297, column: 24, scope: !595)
!600 = !DILocation(line: 297, column: 29, scope: !595)
!601 = !DILocation(line: 297, column: 27, scope: !595)
!602 = !DILocation(line: 297, column: 7, scope: !464)
!603 = !DILocation(line: 299, column: 23, scope: !604)
!604 = distinct !DILexicalBlock(scope: !595, file: !3, line: 298, column: 3)
!605 = !DILocation(line: 299, column: 30, scope: !604)
!606 = !DILocation(line: 299, column: 38, scope: !604)
!607 = !DILocation(line: 299, column: 5, scope: !604)
!608 = !DILocation(line: 299, column: 13, scope: !604)
!609 = !DILocation(line: 299, column: 21, scope: !604)
!610 = !DILocation(line: 300, column: 29, scope: !604)
!611 = !DILocation(line: 300, column: 36, scope: !604)
!612 = !DILocation(line: 300, column: 5, scope: !604)
!613 = !DILocation(line: 300, column: 13, scope: !604)
!614 = !DILocation(line: 300, column: 27, scope: !604)
!615 = !DILocation(line: 301, column: 3, scope: !604)
!616 = !DILocation(line: 303, column: 9, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !3, line: 303, column: 9)
!618 = distinct !DILexicalBlock(scope: !595, file: !3, line: 302, column: 3)
!619 = !DILocation(line: 303, column: 14, scope: !617)
!620 = !DILocation(line: 303, column: 12, scope: !617)
!621 = !DILocation(line: 303, column: 9, scope: !618)
!622 = !DILocation(line: 305, column: 15, scope: !623)
!623 = distinct !DILexicalBlock(scope: !617, file: !3, line: 304, column: 5)
!624 = !DILocation(line: 305, column: 20, scope: !623)
!625 = !DILocation(line: 305, column: 31, scope: !623)
!626 = !DILocation(line: 305, column: 13, scope: !623)
!627 = !DILocation(line: 306, column: 25, scope: !623)
!628 = !DILocation(line: 306, column: 7, scope: !623)
!629 = !DILocation(line: 306, column: 15, scope: !623)
!630 = !DILocation(line: 306, column: 23, scope: !623)
!631 = !DILocation(line: 307, column: 11, scope: !632)
!632 = distinct !DILexicalBlock(scope: !623, file: !3, line: 307, column: 11)
!633 = !DILocation(line: 307, column: 18, scope: !632)
!634 = !DILocation(line: 307, column: 26, scope: !632)
!635 = !DILocation(line: 307, column: 11, scope: !623)
!636 = !DILocation(line: 309, column: 20, scope: !637)
!637 = distinct !DILexicalBlock(scope: !638, file: !3, line: 309, column: 9)
!638 = distinct !DILexicalBlock(scope: !632, file: !3, line: 308, column: 7)
!639 = !DILocation(line: 309, column: 27, scope: !637)
!640 = !DILocation(line: 309, column: 35, scope: !637)
!641 = !DILocation(line: 309, column: 18, scope: !637)
!642 = !DILocation(line: 309, column: 49, scope: !637)
!643 = !DILocation(line: 309, column: 14, scope: !637)
!644 = !DILocation(line: 313, column: 15, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !3, line: 313, column: 15)
!646 = distinct !DILexicalBlock(scope: !647, file: !3, line: 312, column: 9)
!647 = distinct !DILexicalBlock(scope: !637, file: !3, line: 309, column: 9)
!648 = !DILocation(line: 313, column: 23, scope: !645)
!649 = !DILocation(line: 313, column: 28, scope: !645)
!650 = !DILocation(line: 313, column: 26, scope: !645)
!651 = !DILocation(line: 313, column: 15, scope: !646)
!652 = !DILocation(line: 315, column: 18, scope: !653)
!653 = distinct !DILexicalBlock(scope: !645, file: !3, line: 314, column: 11)
!654 = !DILocation(line: 316, column: 17, scope: !655)
!655 = distinct !DILexicalBlock(scope: !653, file: !3, line: 316, column: 17)
!656 = !DILocation(line: 316, column: 26, scope: !655)
!657 = !DILocation(line: 316, column: 31, scope: !655)
!658 = !DILocation(line: 316, column: 23, scope: !655)
!659 = !DILocation(line: 316, column: 17, scope: !653)
!660 = !DILocation(line: 318, column: 33, scope: !661)
!661 = distinct !DILexicalBlock(scope: !655, file: !3, line: 317, column: 13)
!662 = !DILocation(line: 318, column: 15, scope: !661)
!663 = !DILocation(line: 318, column: 23, scope: !661)
!664 = !DILocation(line: 318, column: 31, scope: !661)
!665 = !DILocation(line: 319, column: 39, scope: !661)
!666 = !DILocation(line: 319, column: 15, scope: !661)
!667 = !DILocation(line: 319, column: 23, scope: !661)
!668 = !DILocation(line: 319, column: 37, scope: !661)
!669 = !DILocation(line: 320, column: 15, scope: !661)
!670 = !DILocation(line: 322, column: 11, scope: !653)
!671 = !DILocation(line: 324, column: 17, scope: !672)
!672 = distinct !DILexicalBlock(scope: !673, file: !3, line: 324, column: 17)
!673 = distinct !DILexicalBlock(scope: !645, file: !3, line: 323, column: 11)
!674 = !DILocation(line: 324, column: 25, scope: !672)
!675 = !DILocation(line: 324, column: 30, scope: !672)
!676 = !DILocation(line: 324, column: 28, scope: !672)
!677 = !DILocation(line: 324, column: 17, scope: !673)
!678 = !DILocation(line: 326, column: 20, scope: !679)
!679 = distinct !DILexicalBlock(scope: !672, file: !3, line: 325, column: 13)
!680 = !DILocation(line: 327, column: 13, scope: !679)
!681 = !DILocation(line: 329, column: 15, scope: !682)
!682 = distinct !DILexicalBlock(scope: !646, file: !3, line: 329, column: 15)
!683 = !DILocation(line: 329, column: 19, scope: !682)
!684 = !DILocation(line: 329, column: 15, scope: !646)
!685 = !DILocation(line: 331, column: 16, scope: !686)
!686 = distinct !DILexicalBlock(scope: !682, file: !3, line: 330, column: 11)
!687 = !DILocation(line: 332, column: 11, scope: !686)
!688 = !DILocation(line: 334, column: 13, scope: !689)
!689 = distinct !DILexicalBlock(scope: !682, file: !3, line: 333, column: 11)
!690 = !DILocation(line: 336, column: 9, scope: !646)
!691 = !DILocation(line: 311, column: 23, scope: !647)
!692 = !DILocation(line: 309, column: 9, scope: !647)
!693 = distinct !{!693, !694, !695}
!694 = !DILocation(line: 309, column: 9, scope: !637)
!695 = !DILocation(line: 336, column: 9, scope: !637)
!696 = !DILocation(line: 337, column: 7, scope: !638)
!697 = !DILocation(line: 338, column: 5, scope: !623)
!698 = !DILocation(line: 340, column: 25, scope: !699)
!699 = distinct !DILexicalBlock(scope: !617, file: !3, line: 339, column: 5)
!700 = !DILocation(line: 340, column: 32, scope: !699)
!701 = !DILocation(line: 340, column: 7, scope: !699)
!702 = !DILocation(line: 340, column: 15, scope: !699)
!703 = !DILocation(line: 340, column: 23, scope: !699)
!704 = !DILocation(line: 341, column: 31, scope: !699)
!705 = !DILocation(line: 341, column: 38, scope: !699)
!706 = !DILocation(line: 341, column: 7, scope: !699)
!707 = !DILocation(line: 341, column: 15, scope: !699)
!708 = !DILocation(line: 341, column: 29, scope: !699)
!709 = !DILocation(line: 347, column: 1, scope: !464)
!710 = distinct !DISubprogram(name: "apme_inplacenextLimdfsstate", scope: !3, file: !3, line: 349, type: !92, scopeLine: 353, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726}
!712 = !DILocalVariable(name: "mt", arg: 1, scope: !710, file: !3, line: 349, type: !86)
!713 = !DILocalVariable(name: "aliascol", arg: 2, scope: !710, file: !3, line: 350, type: !52)
!714 = !DILocalVariable(name: "currentdepth", arg: 3, scope: !710, file: !3, line: 351, type: !41)
!715 = !DILocalVariable(name: "currentchar", arg: 4, scope: !710, file: !3, line: 352, type: !88)
!716 = !DILocalVariable(name: "Eq", scope: !710, file: !3, line: 354, type: !41)
!717 = !DILocalVariable(name: "Xv", scope: !710, file: !3, line: 354, type: !41)
!718 = !DILocalVariable(name: "Xh", scope: !710, file: !3, line: 354, type: !41)
!719 = !DILocalVariable(name: "Ph", scope: !710, file: !3, line: 354, type: !41)
!720 = !DILocalVariable(name: "Mh", scope: !710, file: !3, line: 354, type: !41)
!721 = !DILocalVariable(name: "backmask", scope: !710, file: !3, line: 355, type: !41)
!722 = !DILocalVariable(name: "idx", scope: !710, file: !3, line: 356, type: !41)
!723 = !DILocalVariable(name: "score", scope: !710, file: !3, line: 357, type: !41)
!724 = !DILocalVariable(name: "col", scope: !710, file: !3, line: 358, type: !109)
!725 = !DILocalVariable(name: "mti", scope: !710, file: !3, line: 359, type: !119)
!726 = !DILocalVariable(name: "tmpmaxleqk", scope: !727, file: !3, line: 385, type: !41)
!727 = distinct !DILexicalBlock(scope: !728, file: !3, line: 384, column: 5)
!728 = distinct !DILexicalBlock(scope: !729, file: !3, line: 383, column: 9)
!729 = distinct !DILexicalBlock(scope: !730, file: !3, line: 382, column: 3)
!730 = distinct !DILexicalBlock(scope: !710, file: !3, line: 378, column: 7)
!731 = !DILocation(line: 349, column: 64, scope: !710)
!732 = !DILocation(line: 350, column: 41, scope: !710)
!733 = !DILocation(line: 351, column: 59, scope: !710)
!734 = !DILocation(line: 352, column: 49, scope: !710)
!735 = !DILocation(line: 354, column: 3, scope: !710)
!736 = !DILocation(line: 354, column: 11, scope: !710)
!737 = !DILocation(line: 354, column: 19, scope: !710)
!738 = !DILocation(line: 354, column: 23, scope: !710)
!739 = !DILocation(line: 354, column: 27, scope: !710)
!740 = !DILocation(line: 354, column: 31, scope: !710)
!741 = !DILocation(line: 355, column: 17, scope: !710)
!742 = !DILocation(line: 356, column: 17, scope: !710)
!743 = !DILocation(line: 357, column: 17, scope: !710)
!744 = !DILocation(line: 358, column: 3, scope: !710)
!745 = !DILocation(line: 358, column: 27, scope: !710)
!746 = !DILocation(line: 358, column: 60, scope: !710)
!747 = !DILocation(line: 359, column: 3, scope: !710)
!748 = !DILocation(line: 359, column: 37, scope: !710)
!749 = !DILocation(line: 360, column: 78, scope: !710)
!750 = !DILocation(line: 362, column: 3, scope: !710)
!751 = !DILocation(line: 362, column: 3, scope: !752)
!752 = distinct !DILexicalBlock(scope: !753, file: !3, line: 362, column: 3)
!753 = distinct !DILexicalBlock(scope: !710, file: !3, line: 362, column: 3)
!754 = !DILocation(line: 362, column: 3, scope: !753)
!755 = !DILocation(line: 362, column: 3, scope: !756)
!756 = distinct !DILexicalBlock(scope: !752, file: !3, line: 362, column: 3)
!757 = !DILocation(line: 363, column: 3, scope: !710)
!758 = !DILocation(line: 363, column: 3, scope: !759)
!759 = distinct !DILexicalBlock(scope: !760, file: !3, line: 363, column: 3)
!760 = distinct !DILexicalBlock(scope: !710, file: !3, line: 363, column: 3)
!761 = !DILocation(line: 363, column: 3, scope: !760)
!762 = !DILocation(line: 363, column: 3, scope: !763)
!763 = distinct !DILexicalBlock(scope: !759, file: !3, line: 363, column: 3)
!764 = !DILocation(line: 364, column: 7, scope: !765)
!765 = distinct !DILexicalBlock(scope: !710, file: !3, line: 364, column: 7)
!766 = !DILocation(line: 364, column: 19, scope: !765)
!767 = !DILocation(line: 364, column: 7, scope: !710)
!768 = !DILocation(line: 366, column: 10, scope: !769)
!769 = distinct !DILexicalBlock(scope: !765, file: !3, line: 365, column: 3)
!770 = !DILocation(line: 366, column: 15, scope: !769)
!771 = !DILocation(line: 366, column: 35, scope: !769)
!772 = !DILocation(line: 366, column: 25, scope: !769)
!773 = !DILocation(line: 366, column: 8, scope: !769)
!774 = !DILocation(line: 367, column: 3, scope: !769)
!775 = !DILocation(line: 368, column: 8, scope: !710)
!776 = !DILocation(line: 368, column: 13, scope: !710)
!777 = !DILocation(line: 368, column: 18, scope: !710)
!778 = !DILocation(line: 368, column: 11, scope: !710)
!779 = !DILocation(line: 368, column: 6, scope: !710)
!780 = !DILocation(line: 369, column: 11, scope: !710)
!781 = !DILocation(line: 369, column: 16, scope: !710)
!782 = !DILocation(line: 369, column: 21, scope: !710)
!783 = !DILocation(line: 369, column: 14, scope: !710)
!784 = !DILocation(line: 369, column: 27, scope: !710)
!785 = !DILocation(line: 369, column: 32, scope: !710)
!786 = !DILocation(line: 369, column: 25, scope: !710)
!787 = !DILocation(line: 369, column: 38, scope: !710)
!788 = !DILocation(line: 369, column: 43, scope: !710)
!789 = !DILocation(line: 369, column: 36, scope: !710)
!790 = !DILocation(line: 369, column: 49, scope: !710)
!791 = !DILocation(line: 369, column: 47, scope: !710)
!792 = !DILocation(line: 369, column: 6, scope: !710)
!793 = !DILocation(line: 371, column: 8, scope: !710)
!794 = !DILocation(line: 371, column: 13, scope: !710)
!795 = !DILocation(line: 371, column: 21, scope: !710)
!796 = !DILocation(line: 371, column: 26, scope: !710)
!797 = !DILocation(line: 371, column: 31, scope: !710)
!798 = !DILocation(line: 371, column: 24, scope: !710)
!799 = !DILocation(line: 371, column: 18, scope: !710)
!800 = !DILocation(line: 371, column: 16, scope: !710)
!801 = !DILocation(line: 371, column: 6, scope: !710)
!802 = !DILocation(line: 372, column: 8, scope: !710)
!803 = !DILocation(line: 372, column: 13, scope: !710)
!804 = !DILocation(line: 372, column: 18, scope: !710)
!805 = !DILocation(line: 372, column: 16, scope: !710)
!806 = !DILocation(line: 372, column: 6, scope: !710)
!807 = !DILocation(line: 374, column: 9, scope: !710)
!808 = !DILocation(line: 374, column: 12, scope: !710)
!809 = !DILocation(line: 374, column: 18, scope: !710)
!810 = !DILocation(line: 374, column: 6, scope: !710)
!811 = !DILocation(line: 375, column: 14, scope: !710)
!812 = !DILocation(line: 375, column: 17, scope: !710)
!813 = !DILocation(line: 375, column: 28, scope: !710)
!814 = !DILocation(line: 375, column: 33, scope: !710)
!815 = !DILocation(line: 375, column: 31, scope: !710)
!816 = !DILocation(line: 375, column: 25, scope: !710)
!817 = !DILocation(line: 375, column: 23, scope: !710)
!818 = !DILocation(line: 375, column: 3, scope: !710)
!819 = !DILocation(line: 375, column: 8, scope: !710)
!820 = !DILocation(line: 375, column: 11, scope: !710)
!821 = !DILocation(line: 376, column: 13, scope: !710)
!822 = !DILocation(line: 376, column: 18, scope: !710)
!823 = !DILocation(line: 376, column: 16, scope: !710)
!824 = !DILocation(line: 376, column: 3, scope: !710)
!825 = !DILocation(line: 376, column: 8, scope: !710)
!826 = !DILocation(line: 376, column: 11, scope: !710)
!827 = !DILocation(line: 377, column: 21, scope: !710)
!828 = !DILocation(line: 377, column: 26, scope: !710)
!829 = !DILocation(line: 377, column: 18, scope: !710)
!830 = !DILocation(line: 377, column: 12, scope: !710)
!831 = !DILocation(line: 378, column: 7, scope: !730)
!832 = !DILocation(line: 378, column: 12, scope: !730)
!833 = !DILocation(line: 378, column: 10, scope: !730)
!834 = !DILocation(line: 378, column: 21, scope: !730)
!835 = !DILocation(line: 378, column: 24, scope: !730)
!836 = !DILocation(line: 378, column: 29, scope: !730)
!837 = !DILocation(line: 378, column: 27, scope: !730)
!838 = !DILocation(line: 378, column: 7, scope: !710)
!839 = !DILocation(line: 380, column: 5, scope: !840)
!840 = distinct !DILexicalBlock(scope: !730, file: !3, line: 379, column: 3)
!841 = !DILocation(line: 380, column: 10, scope: !840)
!842 = !DILocation(line: 380, column: 17, scope: !840)
!843 = !DILocation(line: 381, column: 3, scope: !840)
!844 = !DILocation(line: 383, column: 9, scope: !728)
!845 = !DILocation(line: 383, column: 14, scope: !728)
!846 = !DILocation(line: 383, column: 12, scope: !728)
!847 = !DILocation(line: 383, column: 9, scope: !729)
!848 = !DILocation(line: 385, column: 7, scope: !727)
!849 = !DILocation(line: 385, column: 15, scope: !727)
!850 = !DILocation(line: 385, column: 28, scope: !727)
!851 = !DILocation(line: 386, column: 15, scope: !727)
!852 = !DILocation(line: 386, column: 20, scope: !727)
!853 = !DILocation(line: 386, column: 31, scope: !727)
!854 = !DILocation(line: 386, column: 13, scope: !727)
!855 = !DILocation(line: 387, column: 11, scope: !856)
!856 = distinct !DILexicalBlock(scope: !727, file: !3, line: 387, column: 11)
!857 = !DILocation(line: 387, column: 16, scope: !856)
!858 = !DILocation(line: 387, column: 24, scope: !856)
!859 = !DILocation(line: 387, column: 11, scope: !727)
!860 = !DILocation(line: 389, column: 20, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !3, line: 389, column: 9)
!862 = distinct !DILexicalBlock(scope: !856, file: !3, line: 388, column: 7)
!863 = !DILocation(line: 389, column: 25, scope: !861)
!864 = !DILocation(line: 389, column: 33, scope: !861)
!865 = !DILocation(line: 389, column: 18, scope: !861)
!866 = !DILocation(line: 389, column: 47, scope: !861)
!867 = !DILocation(line: 389, column: 14, scope: !861)
!868 = !DILocation(line: 393, column: 15, scope: !869)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 393, column: 15)
!870 = distinct !DILexicalBlock(scope: !871, file: !3, line: 392, column: 9)
!871 = distinct !DILexicalBlock(scope: !861, file: !3, line: 389, column: 9)
!872 = !DILocation(line: 393, column: 20, scope: !869)
!873 = !DILocation(line: 393, column: 25, scope: !869)
!874 = !DILocation(line: 393, column: 23, scope: !869)
!875 = !DILocation(line: 393, column: 15, scope: !870)
!876 = !DILocation(line: 395, column: 18, scope: !877)
!877 = distinct !DILexicalBlock(scope: !869, file: !3, line: 394, column: 11)
!878 = !DILocation(line: 396, column: 17, scope: !879)
!879 = distinct !DILexicalBlock(scope: !877, file: !3, line: 396, column: 17)
!880 = !DILocation(line: 396, column: 26, scope: !879)
!881 = !DILocation(line: 396, column: 31, scope: !879)
!882 = !DILocation(line: 396, column: 23, scope: !879)
!883 = !DILocation(line: 396, column: 17, scope: !877)
!884 = !DILocation(line: 398, column: 28, scope: !885)
!885 = distinct !DILexicalBlock(scope: !879, file: !3, line: 397, column: 13)
!886 = !DILocation(line: 398, column: 26, scope: !885)
!887 = !DILocation(line: 399, column: 36, scope: !885)
!888 = !DILocation(line: 399, column: 15, scope: !885)
!889 = !DILocation(line: 399, column: 20, scope: !885)
!890 = !DILocation(line: 399, column: 34, scope: !885)
!891 = !DILocation(line: 400, column: 15, scope: !885)
!892 = !DILocation(line: 402, column: 11, scope: !877)
!893 = !DILocation(line: 404, column: 17, scope: !894)
!894 = distinct !DILexicalBlock(scope: !895, file: !3, line: 404, column: 17)
!895 = distinct !DILexicalBlock(scope: !869, file: !3, line: 403, column: 11)
!896 = !DILocation(line: 404, column: 22, scope: !894)
!897 = !DILocation(line: 404, column: 27, scope: !894)
!898 = !DILocation(line: 404, column: 25, scope: !894)
!899 = !DILocation(line: 404, column: 17, scope: !895)
!900 = !DILocation(line: 406, column: 20, scope: !901)
!901 = distinct !DILexicalBlock(scope: !894, file: !3, line: 405, column: 13)
!902 = !DILocation(line: 407, column: 13, scope: !901)
!903 = !DILocation(line: 409, column: 15, scope: !904)
!904 = distinct !DILexicalBlock(scope: !870, file: !3, line: 409, column: 15)
!905 = !DILocation(line: 409, column: 19, scope: !904)
!906 = !DILocation(line: 409, column: 15, scope: !870)
!907 = !DILocation(line: 411, column: 16, scope: !908)
!908 = distinct !DILexicalBlock(scope: !904, file: !3, line: 410, column: 11)
!909 = !DILocation(line: 412, column: 11, scope: !908)
!910 = !DILocation(line: 414, column: 13, scope: !911)
!911 = distinct !DILexicalBlock(scope: !904, file: !3, line: 413, column: 11)
!912 = !DILocation(line: 416, column: 9, scope: !870)
!913 = !DILocation(line: 391, column: 23, scope: !871)
!914 = !DILocation(line: 389, column: 9, scope: !871)
!915 = distinct !{!915, !916, !917}
!916 = !DILocation(line: 389, column: 9, scope: !861)
!917 = !DILocation(line: 416, column: 9, scope: !861)
!918 = !DILocation(line: 417, column: 7, scope: !862)
!919 = !DILocation(line: 418, column: 22, scope: !727)
!920 = !DILocation(line: 418, column: 7, scope: !727)
!921 = !DILocation(line: 418, column: 12, scope: !727)
!922 = !DILocation(line: 418, column: 20, scope: !727)
!923 = !DILocation(line: 419, column: 5, scope: !728)
!924 = !DILocation(line: 419, column: 5, scope: !727)
!925 = !DILocation(line: 421, column: 1, scope: !710)
!926 = !DISubprogram(name: "gt_malloc_mem", scope: !927, file: !927, line: 56, type: !928, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!927 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!928 = !DISubroutineType(types: !929)
!929 = !{!38, !14, !930, !931}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!931 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!932 = !DISubprogram(name: "fprintf", scope: !224, file: !224, line: 350, type: !933, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!933 = !DISubroutineType(types: !934)
!934 = !{!931, !935, !991, null}
!935 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !938, line: 7, baseType: !939)
!938 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !940, line: 49, size: 1728, elements: !941)
!940 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!941 = !{!942, !943, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !958, !960, !961, !962, !966, !968, !970, !972, !975, !977, !980, !983, !984, !985, !986, !987}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !939, file: !940, line: 51, baseType: !931, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !939, file: !940, line: 54, baseType: !944, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !939, file: !940, line: 55, baseType: !944, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !939, file: !940, line: 56, baseType: !944, size: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !939, file: !940, line: 57, baseType: !944, size: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !939, file: !940, line: 58, baseType: !944, size: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !939, file: !940, line: 59, baseType: !944, size: 64, offset: 384)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !939, file: !940, line: 60, baseType: !944, size: 64, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !939, file: !940, line: 61, baseType: !944, size: 64, offset: 512)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !939, file: !940, line: 64, baseType: !944, size: 64, offset: 576)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !939, file: !940, line: 65, baseType: !944, size: 64, offset: 640)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !939, file: !940, line: 66, baseType: !944, size: 64, offset: 704)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !939, file: !940, line: 68, baseType: !956, size: 64, offset: 768)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !940, line: 36, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !939, file: !940, line: 70, baseType: !959, size: 64, offset: 832)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !939, file: !940, line: 72, baseType: !931, size: 32, offset: 896)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !939, file: !940, line: 73, baseType: !931, size: 32, offset: 928)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !939, file: !940, line: 74, baseType: !963, size: 64, offset: 960)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !964, line: 152, baseType: !965)
!964 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!965 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !939, file: !940, line: 77, baseType: !967, size: 16, offset: 1024)
!967 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !939, file: !940, line: 78, baseType: !969, size: 8, offset: 1040)
!969 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !939, file: !940, line: 79, baseType: !971, size: 8, offset: 1048)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 8, elements: !235)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !939, file: !940, line: 81, baseType: !973, size: 64, offset: 1088)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !940, line: 43, baseType: null)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !939, file: !940, line: 89, baseType: !976, size: 64, offset: 1152)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !964, line: 153, baseType: !965)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !939, file: !940, line: 91, baseType: !978, size: 64, offset: 1216)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !940, line: 37, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !939, file: !940, line: 92, baseType: !981, size: 64, offset: 1280)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !940, line: 38, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !939, file: !940, line: 93, baseType: !959, size: 64, offset: 1344)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !939, file: !940, line: 94, baseType: !38, size: 64, offset: 1408)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !939, file: !940, line: 95, baseType: !14, size: 64, offset: 1472)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !939, file: !940, line: 96, baseType: !931, size: 32, offset: 1536)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !939, file: !940, line: 98, baseType: !988, size: 160, offset: 1568)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 160, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 20)
!991 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !930)
!992 = !DISubprogram(name: "abort", scope: !993, file: !993, line: 598, type: !994, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!993 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!994 = !DISubroutineType(types: !995)
!995 = !{null}
!996 = !DISubprogram(name: "gt_initeqsvector", scope: !997, file: !997, line: 23, type: !998, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!997 = !DIFile(filename: "src/match/initeqsvec.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "388b8f66e6c5345148668ff38080cccf")
!998 = !DISubroutineType(types: !999)
!999 = !{null, !107, !41, !238, !41}
!1000 = !DISubprogram(name: "gt_free_mem", scope: !927, file: !927, line: 75, type: !1001, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !38, !930, !931}
