; ModuleID = 'samples/439.bc'
source_filename = "ll.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.fuse_opt = type { ptr, i64, i32 }
%struct.fuse_args = type { i32, ptr, i32 }
%struct.sqfs_opts = type { ptr, ptr, i32, i64, i32 }
%struct.fuse_cmdline_opts = type { i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32 }
%struct.fuse_lowlevel_ops = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.sqfs_ll_chan = type { i32, ptr }
%struct.sqfs_ll_i = type { ptr, %struct.sqfs_inode }
%struct.sqfs_inode = type { %struct.squashfs_base_inode, i32, i32, %struct.sqfs_md_cursor, %union.anon }
%struct.squashfs_base_inode = type { i16, i16, i16, i16, i32, i32 }
%struct.sqfs_md_cursor = type { i64, i64 }
%union.anon = type { %struct.anon.0 }
%struct.anon.0 = type { i64, i64, i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, [3 x i64] }
%struct.sqfs_ll = type { %struct.sqfs, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 563, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "ll.c", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build/aidengro/spack-stage-squashfuse-0.1.104-56ds4hojz5mre6erdixwkyufs6wgoe4q/spack-src", checksumkind: CSK_MD5, checksum: "28d7adaaf20a986652e4043a03fcb3c0")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 11)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 564, type: !3, isLocal: true, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "last_access", scope: !11, file: !2, line: 48, type: !267, isLocal: true, isDefinition: true)
!11 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !12, retainedTypes: !29, globals: !236, splitDebugInlining: false, nameTableKind: None)
!12 = !{!13, !23}
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 43, baseType: !15, size: 32, elements: !16)
!14 = !DIFile(filename: "./common.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build/aidengro/spack-stage-squashfuse-0.1.104-56ds4hojz5mre6erdixwkyufs6wgoe4q/spack-src", checksumkind: CSK_MD5, checksum: "14d63e8b50564c475a5631ac35c0a2da")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !18, !19, !20, !21, !22}
!17 = !DIEnumerator(name: "SQFS_OK", value: 0)
!18 = !DIEnumerator(name: "SQFS_ERR", value: 1)
!19 = !DIEnumerator(name: "SQFS_BADFORMAT", value: 2)
!20 = !DIEnumerator(name: "SQFS_BADVERSION", value: 3)
!21 = !DIEnumerator(name: "SQFS_BADCOMP", value: 4)
!22 = !DIEnumerator(name: "SQFS_UNSUP", value: 5)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fuse_buf_flags", file: !24, line: 672, baseType: !15, size: 32, elements: !25)
!24 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__sp/linux-ubuntu22.04-zen2/clang-18.0.0/libfuse-3.16.2-ific6yhvc57qgq74coytjkk7cvkqpuxo/include/fuse3/fuse_common.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build", checksumkind: CSK_MD5, checksum: "5b719e9d4bd964477c4bc265bdeb150a")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "FUSE_BUF_IS_FD", value: 2)
!27 = !DIEnumerator(name: "FUSE_BUF_FD_SEEK", value: 4)
!28 = !DIEnumerator(name: "FUSE_BUF_FD_RETRY", value: 8)
!29 = !{!30, !31, !34, !235}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !32, line: 87, baseType: !33)
!32 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!33 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_ll_i", file: !36, line: 68, baseType: !37)
!36 = !DIFile(filename: "./ll.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build/aidengro/spack-stage-squashfuse-0.1.104-56ds4hojz5mre6erdixwkyufs6wgoe4q/spack-src", checksumkind: CSK_MD5, checksum: "03f3af6a9ff44813261808b4136dd06b")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 65, size: 576, elements: !38)
!38 = !{!39, !187}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ll", scope: !37, file: !36, line: 66, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_ll", file: !36, line: 36, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqfs_ll", file: !36, line: 37, size: 3584, elements: !43)
!43 = !{!44, !142, !149, !153, !177, !181, !182, !183}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !42, file: !36, line: 38, baseType: !45, size: 3136)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs", file: !14, line: 56, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqfs", file: !47, line: 36, size: 3136, elements: !48)
!47 = !DIFile(filename: "./fs.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build/aidengro/spack-stage-squashfuse-0.1.104-56ds4hojz5mre6erdixwkyufs6wgoe4q/spack-src", checksumkind: CSK_MD5, checksum: "14795cff48dbbc35c1633ef4bdefc24f")
!48 = !{!49, !52, !56, !89, !101, !102, !103, !124, !125, !126, !127, !135, !141}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !46, file: !47, line: 37, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_fd_t", file: !14, line: 40, baseType: !51)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !46, file: !47, line: 38, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !54, line: 70, baseType: !55)
!54 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!55 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "sb", scope: !46, file: !47, line: 39, baseType: !57, size: 768, offset: 128)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "squashfs_super_block", file: !58, line: 131, size: 768, elements: !59)
!58 = !DIFile(filename: "./squashfs_fs.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build/aidengro/spack-stage-squashfuse-0.1.104-56ds4hojz5mre6erdixwkyufs6wgoe4q/spack-src", checksumkind: CSK_MD5, checksum: "de4ce044a84b303a67f933f76b20ea89")
!59 = !{!60, !65, !66, !67, !68, !69, !73, !74, !75, !76, !77, !78, !82, !83, !84, !85, !86, !87, !88}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "s_magic", scope: !57, file: !58, line: 132, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le32", file: !62, line: 26, baseType: !63)
!62 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !64, line: 27, baseType: !15)
!64 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !57, file: !58, line: 133, baseType: !61, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "mkfs_time", scope: !57, file: !58, line: 134, baseType: !61, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !57, file: !58, line: 135, baseType: !61, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fragments", scope: !57, file: !58, line: 136, baseType: !61, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !57, file: !58, line: 137, baseType: !70, size: 16, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le16", file: !62, line: 24, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !64, line: 24, baseType: !72)
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "block_log", scope: !57, file: !58, line: 138, baseType: !70, size: 16, offset: 176)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !57, file: !58, line: 139, baseType: !70, size: 16, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "no_ids", scope: !57, file: !58, line: 140, baseType: !70, size: 16, offset: 208)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "s_major", scope: !57, file: !58, line: 141, baseType: !70, size: 16, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "s_minor", scope: !57, file: !58, line: 142, baseType: !70, size: 16, offset: 240)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "root_inode", scope: !57, file: !58, line: 143, baseType: !79, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le64", file: !62, line: 28, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !64, line: 31, baseType: !81)
!81 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !57, file: !58, line: 144, baseType: !79, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "id_table_start", scope: !57, file: !58, line: 145, baseType: !79, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_id_table_start", scope: !57, file: !58, line: 146, baseType: !79, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "inode_table_start", scope: !57, file: !58, line: 147, baseType: !79, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "directory_table_start", scope: !57, file: !58, line: 148, baseType: !79, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_table_start", scope: !57, file: !58, line: 149, baseType: !79, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_table_start", scope: !57, file: !58, line: 150, baseType: !79, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "id_table", scope: !46, file: !47, line: 40, baseType: !90, size: 128, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_table", file: !91, line: 33, baseType: !92)
!91 = !DIFile(filename: "./table.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build/aidengro/spack-stage-squashfuse-0.1.104-56ds4hojz5mre6erdixwkyufs6wgoe4q/spack-src", checksumkind: CSK_MD5, checksum: "b2c4c22f00f23376ded02b576dc08a28")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 30, size: 128, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "each", scope: !92, file: !91, line: 31, baseType: !53, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !92, file: !91, line: 32, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !98, line: 27, baseType: !99)
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !100, line: 45, baseType: !55)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!101 = !DIDerivedType(tag: DW_TAG_member, name: "frag_table", scope: !46, file: !47, line: 41, baseType: !90, size: 128, offset: 1024)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "export_table", scope: !46, file: !47, line: 42, baseType: !90, size: 128, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "md_cache", scope: !46, file: !47, line: 43, baseType: !104, size: 384, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_cache", file: !105, line: 49, baseType: !106)
!105 = !DIFile(filename: "./cache.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build/aidengro/spack-stage-squashfuse-0.1.104-56ds4hojz5mre6erdixwkyufs6wgoe4q/spack-src", checksumkind: CSK_MD5, checksum: "e4dede871e626f8ee6015d9a1116626c")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 41, size: 384, elements: !107)
!107 = !{!108, !111, !116, !121, !122, !123}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "idxs", scope: !106, file: !105, line: 42, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_cache_idx", file: !105, line: 38, baseType: !97)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !106, file: !105, line: 43, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !98, line: 24, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !100, line: 38, baseType: !115)
!115 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !106, file: !105, line: 45, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_cache_dispose", file: !105, line: 39, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !30}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !106, file: !105, line: 47, baseType: !53, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !106, file: !105, line: 47, baseType: !53, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !105, line: 48, baseType: !53, size: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data_cache", scope: !46, file: !47, line: 44, baseType: !104, size: 384, offset: 1664)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "frag_cache", scope: !46, file: !47, line: 45, baseType: !104, size: 384, offset: 2048)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "blockidx", scope: !46, file: !47, line: 46, baseType: !104, size: 384, offset: 2432)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "decompressor", scope: !46, file: !47, line: 47, baseType: !128, size: 64, offset: 2816)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_decompressor", file: !129, line: 41, baseType: !130)
!129 = !DIFile(filename: "./decompress.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build/aidengro/spack-stage-squashfuse-0.1.104-56ds4hojz5mre6erdixwkyufs6wgoe4q/spack-src", checksumkind: CSK_MD5, checksum: "b4aad19a6341104c5ca278f89d286aeb")
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !30, !53, !30, !134}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_err", file: !14, line: 50, baseType: !13)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_info", scope: !46, file: !47, line: 49, baseType: !136, size: 128, offset: 2880)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "squashfs_xattr_id_table", file: !58, line: 316, size: 128, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_table_start", scope: !136, file: !58, line: 317, baseType: !79, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_ids", scope: !136, file: !58, line: 318, baseType: !61, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !136, file: !58, line: 319, baseType: !61, size: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_table", scope: !46, file: !47, line: 50, baseType: !90, size: 128, offset: 3008)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ino_fuse", scope: !42, file: !36, line: 41, baseType: !143, size: 64, offset: 3136)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !40, !148}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "fuse_ino_t", file: !147, line: 46, baseType: !97)
!147 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__sp/linux-ubuntu22.04-zen2/clang-18.0.0/libfuse-3.16.2-ific6yhvc57qgq74coytjkk7cvkqpuxo/include/fuse3/fuse_lowlevel.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build", checksumkind: CSK_MD5, checksum: "7ca39013e5c64e3065e2a0624d3e78df")
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_inode_id", file: !14, line: 53, baseType: !97)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ino_sqfs", scope: !42, file: !36, line: 42, baseType: !150, size: 64, offset: 3200)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!148, !40, !146}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ino_register", scope: !42, file: !36, line: 45, baseType: !154, size: 64, offset: 3264)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!146, !40, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_dir_entry", file: !159, line: 45, baseType: !160)
!159 = !DIFile(filename: "./dir.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build/aidengro/spack-stage-squashfuse-0.1.104-56ds4hojz5mre6erdixwkyufs6wgoe4q/spack-src", checksumkind: CSK_MD5, checksum: "18fe41c55b727999f58eea5c5dcb7e40")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !159, line: 38, size: 384, elements: !161)
!161 = !{!162, !163, !167, !168, !170, !171, !176}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !160, file: !159, line: 39, baseType: !148, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "inode_number", scope: !160, file: !159, line: 40, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_inode_num", file: !14, line: 54, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !98, line: 26, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !100, line: 42, baseType: !15)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !160, file: !159, line: 41, baseType: !51, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !159, line: 42, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name_size", scope: !160, file: !159, line: 43, baseType: !53, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !160, file: !159, line: 44, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_off_t", file: !14, line: 39, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !174, line: 85, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !100, line: 152, baseType: !33)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next_offset", scope: !160, file: !159, line: 44, baseType: !172, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ino_forget", scope: !42, file: !36, line: 46, baseType: !178, size: 64, offset: 3328)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !40, !146, !53}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ino_fuse_num", scope: !42, file: !36, line: 49, baseType: !154, size: 64, offset: 3392)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ino_data", scope: !42, file: !36, line: 52, baseType: !30, size: 64, offset: 3456)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ino_destroy", scope: !42, file: !36, line: 53, baseType: !184, size: 64, offset: 3520)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !40}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !37, file: !36, line: 67, baseType: !188, size: 512, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_inode", file: !14, line: 57, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sqfs_inode", file: !47, line: 54, size: 512, elements: !190)
!190 = !{!191, !200, !201, !203, !209}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !189, file: !47, line: 55, baseType: !192, size: 128)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "squashfs_base_inode", file: !58, line: 159, size: 128, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "inode_type", scope: !192, file: !58, line: 160, baseType: !70, size: 16)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !192, file: !58, line: 161, baseType: !70, size: 16, offset: 16)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !192, file: !58, line: 162, baseType: !70, size: 16, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !192, file: !58, line: 163, baseType: !70, size: 16, offset: 48)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !192, file: !58, line: 164, baseType: !61, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "inode_number", scope: !192, file: !58, line: 165, baseType: !61, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !189, file: !47, line: 56, baseType: !51, size: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "xattr", scope: !189, file: !47, line: 57, baseType: !202, size: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_xattr_idx", file: !47, line: 53, baseType: !165)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !47, line: 59, baseType: !204, size: 128, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_md_cursor", file: !14, line: 67, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 64, size: 128, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !205, file: !14, line: 65, baseType: !172, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !205, file: !14, line: 66, baseType: !53, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "xtra", scope: !189, file: !47, line: 79, baseType: !210, size: 192, offset: 320)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !47, line: 61, size: 192, elements: !211)
!211 = !{!212, !217, !218, !225}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !210, file: !47, line: 64, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !47, line: 62, size: 64, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !213, file: !47, line: 63, baseType: !51, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !213, file: !47, line: 63, baseType: !51, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "symlink_size", scope: !210, file: !47, line: 65, baseType: !53, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !210, file: !47, line: 71, baseType: !219, size: 192)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !47, line: 66, size: 192, elements: !220)
!220 = !{!221, !222, !223, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "start_block", scope: !219, file: !47, line: 67, baseType: !97, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !219, file: !47, line: 68, baseType: !97, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "frag_idx", scope: !219, file: !47, line: 69, baseType: !165, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !219, file: !47, line: 70, baseType: !165, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !210, file: !47, line: 78, baseType: !226, size: 160)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !47, line: 72, size: 160, elements: !227)
!227 = !{!228, !229, !232, !233, !234}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "start_block", scope: !226, file: !47, line: 73, baseType: !165, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !226, file: !47, line: 74, baseType: !230, size: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !98, line: 25, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !100, line: 40, baseType: !72)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "dir_size", scope: !226, file: !47, line: 75, baseType: !165, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "idx_count", scope: !226, file: !47, line: 76, baseType: !230, size: 16, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "parent_inode", scope: !226, file: !47, line: 77, baseType: !165, size: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!236 = !{!0, !7, !237, !9, !241, !246, !251, !256, !261, !263}
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression(DW_OP_constu, 9218868437227405311, DW_OP_stack_value))
!238 = distinct !DIGlobalVariable(name: "SQFS_TIMEOUT", scope: !11, file: !2, line: 40, type: !239, isLocal: true, isDefinition: true)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "open_refcount", scope: !11, file: !2, line: 51, type: !243, isLocal: true, isDefinition: true)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !244, line: 8, baseType: !245)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sig_atomic_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d9236f7e3e7f10f53aa9d4cd97f503cf")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !100, line: 215, baseType: !51)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 530, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 22)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !2, line: 536, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 35)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 36)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "idle_timeout_secs", scope: !11, file: !2, line: 46, type: !15, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "fuse_instance", scope: !11, file: !2, line: 53, type: !265, isLocal: true, isDefinition: true)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_session", file: !24, line: 578, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !268, line: 10, baseType: !269)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !100, line: 160, baseType: !33)
!270 = !{i32 7, !"Dwarf Version", i32 5}
!271 = !{i32 2, !"Debug Info Version", i32 3}
!272 = !{i32 1, !"wchar_size", i32 4}
!273 = !{i32 8, !"PIC Level", i32 2}
!274 = !{i32 7, !"PIE Level", i32 2}
!275 = !{i32 7, !"uwtable", i32 2}
!276 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!277 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 547, type: !278, scopeLine: 547, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !281)
!278 = !DISubroutineType(types: !279)
!279 = !{!51, !51, !280}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!281 = !{!282, !283, !284, !291, !303, !316, !317, !318, !327, !575}
!282 = !DILocalVariable(name: "argc", arg: 1, scope: !277, file: !2, line: 547, type: !51)
!283 = !DILocalVariable(name: "argv", arg: 2, scope: !277, file: !2, line: 547, type: !280)
!284 = !DILocalVariable(name: "args", scope: !277, file: !2, line: 548, type: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_args", file: !286, line: 109, size: 192, elements: !287)
!286 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__sp/linux-ubuntu22.04-zen2/clang-18.0.0/libfuse-3.16.2-ific6yhvc57qgq74coytjkk7cvkqpuxo/include/fuse3/fuse_opt.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build", checksumkind: CSK_MD5, checksum: "6ace7fc31e8f6e294875806e9271bf5b")
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !285, file: !286, line: 111, baseType: !51, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !285, file: !286, line: 114, baseType: !280, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !285, file: !286, line: 117, baseType: !51, size: 32, offset: 128)
!291 = !DILocalVariable(name: "opts", scope: !277, file: !2, line: 549, type: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_opts", file: !293, line: 52, baseType: !294)
!293 = !DIFile(filename: "./fuseprivate.h", directory: "/local-ssd/squashfuse-56ds4hojz5mre6erdixwkyufs6wgoe4q-build/aidengro/spack-stage-squashfuse-0.1.104-56ds4hojz5mre6erdixwkyufs6wgoe4q/spack-src", checksumkind: CSK_MD5, checksum: "5fb46e4cb1b6658d6b2922e06439a7e7")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 46, size: 320, elements: !295)
!295 = !{!296, !297, !300, !301, !302}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "progname", scope: !294, file: !293, line: 47, baseType: !169, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !294, file: !293, line: 48, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mountpoint", scope: !294, file: !293, line: 49, baseType: !51, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !294, file: !293, line: 50, baseType: !53, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout_secs", scope: !294, file: !293, line: 51, baseType: !15, size: 32, offset: 256)
!303 = !DILocalVariable(name: "fuse_cmdline_opts", scope: !277, file: !2, line: 552, type: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_cmdline_opts", file: !147, line: 1941, size: 384, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "singlethread", scope: !304, file: !147, line: 1942, baseType: !51, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "foreground", scope: !304, file: !147, line: 1943, baseType: !51, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !304, file: !147, line: 1944, baseType: !51, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nodefault_subtype", scope: !304, file: !147, line: 1945, baseType: !51, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mountpoint", scope: !304, file: !147, line: 1946, baseType: !169, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "show_version", scope: !304, file: !147, line: 1947, baseType: !51, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "show_help", scope: !304, file: !147, line: 1948, baseType: !51, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "clone_fd", scope: !304, file: !147, line: 1949, baseType: !51, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "max_idle_threads", scope: !304, file: !147, line: 1950, baseType: !15, size: 32, offset: 288)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "max_threads", scope: !304, file: !147, line: 1954, baseType: !15, size: 32, offset: 320)
!316 = !DILocalVariable(name: "err", scope: !277, file: !2, line: 560, type: !51)
!317 = !DILocalVariable(name: "ll", scope: !277, file: !2, line: 561, type: !40)
!318 = !DILocalVariable(name: "fuse_opts", scope: !277, file: !2, line: 562, type: !319)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 576, elements: !325)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_opt", file: !286, line: 77, size: 192, elements: !321)
!321 = !{!322, !323, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "templ", scope: !320, file: !286, line: 79, baseType: !298, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !320, file: !286, line: 85, baseType: !55, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !320, file: !286, line: 91, baseType: !51, size: 32, offset: 128)
!325 = !{!326}
!326 = !DISubrange(count: 3)
!327 = !DILocalVariable(name: "sqfs_ll_ops", scope: !277, file: !2, line: 568, type: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_lowlevel_ops", file: !147, line: 201, size: 2816, elements: !329)
!329 = !{!330, !349, !350, !357, !361, !383, !420, !424, !430, !434, !435, !436, !440, !444, !448, !449, !453, !457, !458, !459, !463, !464, !465, !466, !467, !468, !472, !476, !480, !481, !485, !489, !504, !508, !512, !518, !524, !545, !549, !558, !562, !566, !567, !571}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !328, file: !147, line: 218, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !30, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_conn_info", file: !24, line: 467, size: 1024, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "proto_major", scope: !335, file: !24, line: 471, baseType: !15, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "proto_minor", scope: !335, file: !24, line: 476, baseType: !15, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "max_write", scope: !335, file: !24, line: 481, baseType: !15, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_read", scope: !335, file: !24, line: 495, baseType: !15, size: 32, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "max_readahead", scope: !335, file: !24, line: 500, baseType: !15, size: 32, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "capable", scope: !335, file: !24, line: 505, baseType: !15, size: 32, offset: 160)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !335, file: !24, line: 513, baseType: !15, size: 32, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "max_background", scope: !335, file: !24, line: 543, baseType: !15, size: 32, offset: 224)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "congestion_threshold", scope: !335, file: !24, line: 553, baseType: !15, size: 32, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "time_gran", scope: !335, file: !24, line: 570, baseType: !15, size: 32, offset: 288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !335, file: !24, line: 575, baseType: !348, size: 704, offset: 320)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 704, elements: !249)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !328, file: !147, line: 231, baseType: !118, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !328, file: !147, line: 244, baseType: !351, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !354, !146, !298}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "fuse_req_t", file: !147, line: 49, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_req", file: !147, line: 49, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "forget", scope: !328, file: !147, line: 282, baseType: !358, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !354, !146, !97}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !328, file: !147, line: 303, baseType: !362, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !354, !146, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_file_info", file: !24, line: 50, size: 320, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !366, file: !24, line: 52, baseType: !51, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !366, file: !24, line: 60, baseType: !15, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "direct_io", scope: !366, file: !24, line: 63, baseType: !15, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "keep_cache", scope: !366, file: !24, line: 69, baseType: !15, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "parallel_direct_writes", scope: !366, file: !24, line: 73, baseType: !15, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !366, file: !24, line: 78, baseType: !15, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nonseekable", scope: !366, file: !24, line: 82, baseType: !15, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flock_release", scope: !366, file: !24, line: 87, baseType: !15, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "cache_readdir", scope: !366, file: !24, line: 93, baseType: !15, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "noflush", scope: !366, file: !24, line: 97, baseType: !15, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !366, file: !24, line: 100, baseType: !15, size: 23, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "padding2", scope: !366, file: !24, line: 101, baseType: !15, size: 32, offset: 64, flags: DIFlagBitField, extraData: i64 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !366, file: !24, line: 106, baseType: !97, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lock_owner", scope: !366, file: !24, line: 109, baseType: !97, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !366, file: !24, line: 113, baseType: !165, size: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !328, file: !147, line: 340, baseType: !384, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !354, !146, !387, !51, !365}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !389, line: 26, size: 1152, elements: !390)
!389 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!390 = !{!391, !393, !395, !397, !399, !401, !403, !404, !405, !406, !408, !410, !411, !413, !414, !415, !416, !417}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !388, file: !389, line: 31, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !100, line: 145, baseType: !55)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !388, file: !389, line: 36, baseType: !394, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !100, line: 148, baseType: !55)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !388, file: !389, line: 44, baseType: !396, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !100, line: 151, baseType: !55)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !388, file: !389, line: 45, baseType: !398, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !100, line: 150, baseType: !15)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !388, file: !389, line: 47, baseType: !400, size: 32, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !100, line: 146, baseType: !15)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !388, file: !389, line: 48, baseType: !402, size: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !100, line: 147, baseType: !15)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !388, file: !389, line: 50, baseType: !51, size: 32, offset: 288)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !388, file: !389, line: 52, baseType: !392, size: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !388, file: !389, line: 57, baseType: !175, size: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !388, file: !389, line: 61, baseType: !407, size: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !100, line: 175, baseType: !33)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !388, file: !389, line: 63, baseType: !409, size: 64, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !100, line: 180, baseType: !33)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !388, file: !389, line: 81, baseType: !269, size: 64, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimensec", scope: !388, file: !389, line: 82, baseType: !412, size: 64, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_ulong_t", file: !100, line: 199, baseType: !55)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !388, file: !389, line: 83, baseType: !269, size: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimensec", scope: !388, file: !389, line: 84, baseType: !412, size: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !388, file: !389, line: 85, baseType: !269, size: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimensec", scope: !388, file: !389, line: 86, baseType: !412, size: 64, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !388, file: !389, line: 89, baseType: !418, size: 192, offset: 960)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 192, elements: !325)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !100, line: 197, baseType: !33)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !328, file: !147, line: 353, baseType: !421, size: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !354, !146}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !328, file: !147, line: 371, baseType: !425, size: 64, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !354, !146, !298, !428, !429}
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !174, line: 69, baseType: !398)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !174, line: 59, baseType: !392)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !328, file: !147, line: 386, baseType: !431, size: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !354, !146, !298, !428}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !328, file: !147, line: 404, baseType: !351, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !328, file: !147, line: 421, baseType: !351, size: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !328, file: !147, line: 435, baseType: !437, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !354, !298, !146, !298}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !328, file: !147, line: 467, baseType: !441, size: 64, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !354, !146, !298, !146, !298, !15}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !328, file: !147, line: 483, baseType: !445, size: 64, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !354, !146, !146, !298}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !328, file: !147, line: 542, baseType: !362, size: 64, offset: 896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !328, file: !147, line: 570, baseType: !450, size: 64, offset: 960)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !354, !146, !53, !173, !365}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !328, file: !147, line: 599, baseType: !454, size: 64, offset: 1024)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !354, !146, !298, !53, !173, !365}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !328, file: !147, line: 640, baseType: !362, size: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !328, file: !147, line: 668, baseType: !362, size: 64, offset: 1152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fsync", scope: !328, file: !147, line: 690, baseType: !460, size: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !354, !146, !51, !365}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "opendir", scope: !328, file: !147, line: 715, baseType: !362, size: 64, offset: 1280)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "readdir", scope: !328, file: !147, line: 761, baseType: !450, size: 64, offset: 1344)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "releasedir", scope: !328, file: !147, line: 780, baseType: !362, size: 64, offset: 1408)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "fsyncdir", scope: !328, file: !147, line: 805, baseType: !460, size: 64, offset: 1472)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !328, file: !147, line: 818, baseType: !421, size: 64, offset: 1536)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "setxattr", scope: !328, file: !147, line: 831, baseType: !469, size: 64, offset: 1600)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !354, !146, !298, !298, !53, !51}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "getxattr", scope: !328, file: !147, line: 862, baseType: !473, size: 64, offset: 1664)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !354, !146, !298, !53}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !328, file: !147, line: 893, baseType: !477, size: 64, offset: 1728)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !354, !146, !53}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "removexattr", scope: !328, file: !147, line: 910, baseType: !351, size: 64, offset: 1792)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !328, file: !147, line: 932, baseType: !482, size: 64, offset: 1856)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !354, !146, !51}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !328, file: !147, line: 961, baseType: !486, size: 64, offset: 1920)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !354, !146, !298, !428, !365}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "getlk", scope: !328, file: !147, line: 976, baseType: !490, size: 64, offset: 1984)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !354, !146, !365, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flock", file: !495, line: 35, size: 256, elements: !496)
!495 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "3ed8466d7581e54a3f782dda83e77be7")
!496 = !{!497, !499, !500, !501, !502}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "l_type", scope: !494, file: !495, line: 37, baseType: !498, size: 16)
!498 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "l_whence", scope: !494, file: !495, line: 38, baseType: !498, size: 16, offset: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "l_start", scope: !494, file: !495, line: 40, baseType: !175, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "l_len", scope: !494, file: !495, line: 41, baseType: !175, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "l_pid", scope: !494, file: !495, line: 46, baseType: !503, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !100, line: 154, baseType: !51)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "setlk", scope: !328, file: !147, line: 1001, baseType: !505, size: 64, offset: 2048)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !354, !146, !365, !493, !51}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !328, file: !147, line: 1025, baseType: !509, size: 64, offset: 2112)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !354, !146, !53, !97}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl", scope: !328, file: !147, line: 1029, baseType: !513, size: 64, offset: 2176)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !354, !146, !51, !30, !365, !15, !516, !53, !53}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !328, file: !147, line: 1095, baseType: !519, size: 64, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !354, !146, !365, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_pollhandle", file: !24, line: 579, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !328, file: !147, line: 1125, baseType: !525, size: 64, offset: 2304)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !354, !146, !528, !173, !365}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_bufvec", file: !24, line: 789, size: 512, elements: !530)
!530 = !{!531, !532, !533, !534}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !529, file: !24, line: 793, baseType: !53, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !529, file: !24, line: 798, baseType: !53, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !529, file: !24, line: 803, baseType: !53, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !529, file: !24, line: 808, baseType: !535, size: 320, offset: 192)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 320, elements: !543)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_buf", file: !24, line: 748, size: 320, elements: !537)
!537 = !{!538, !539, !540, !541, !542}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !536, file: !24, line: 752, baseType: !53, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !536, file: !24, line: 757, baseType: !23, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !536, file: !24, line: 764, baseType: !30, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !536, file: !24, line: 771, baseType: !51, size: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !536, file: !24, line: 778, baseType: !173, size: 64, offset: 256)
!543 = !{!544}
!544 = !DISubrange(count: 1)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "retrieve_reply", scope: !328, file: !147, line: 1141, baseType: !546, size: 64, offset: 2368)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !354, !30, !146, !173, !528}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "forget_multi", scope: !328, file: !147, line: 1155, baseType: !550, size: 64, offset: 2432)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !354, !53, !553}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_forget_data", file: !147, line: 125, size: 128, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !554, file: !147, line: 126, baseType: !146, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "nlookup", scope: !554, file: !147, line: 127, baseType: !97, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flock", scope: !328, file: !147, line: 1173, baseType: !559, size: 64, offset: 2496)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !354, !146, !365, !51}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "fallocate", scope: !328, file: !147, line: 1196, baseType: !563, size: 64, offset: 2560)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !354, !146, !51, !173, !173, !365}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "readdirplus", scope: !328, file: !147, line: 1224, baseType: !450, size: 64, offset: 2624)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "copy_file_range", scope: !328, file: !147, line: 1257, baseType: !568, size: 64, offset: 2688)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !354, !146, !173, !365, !146, !173, !365, !53, !51}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "lseek", scope: !328, file: !147, line: 1281, baseType: !572, size: 64, offset: 2752)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !354, !146, !173, !51, !365}
!575 = !DILocalVariable(name: "ch", scope: !576, file: !2, line: 615, type: !578)
!576 = distinct !DILexicalBlock(scope: !577, file: !2, line: 614, column: 12)
!577 = distinct !DILexicalBlock(scope: !277, file: !2, line: 614, column: 6)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_ll_chan", file: !2, line: 396, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 390, size: 128, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !579, file: !2, line: 391, baseType: !51, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !579, file: !2, line: 392, baseType: !265, size: 64, offset: 64)
!583 = !{!584, !584, i64 0}
!584 = !{!"int", !585, i64 0}
!585 = !{!"omnipotent char", !586, i64 0}
!586 = !{!"Simple C/C++ TBAA"}
!587 = !DILocation(line: 547, column: 14, scope: !277)
!588 = !{!589, !589, i64 0}
!589 = !{!"any pointer", !585, i64 0}
!590 = !DILocation(line: 547, column: 26, scope: !277)
!591 = !DILocation(line: 548, column: 2, scope: !277)
!592 = !DILocation(line: 548, column: 19, scope: !277)
!593 = !DILocation(line: 549, column: 2, scope: !277)
!594 = !DILocation(line: 549, column: 12, scope: !277)
!595 = !DILocation(line: 552, column: 2, scope: !277)
!596 = !DILocation(line: 552, column: 27, scope: !277)
!597 = !DILocation(line: 560, column: 2, scope: !277)
!598 = !DILocation(line: 560, column: 6, scope: !277)
!599 = !DILocation(line: 561, column: 2, scope: !277)
!600 = !DILocation(line: 561, column: 11, scope: !277)
!601 = !DILocation(line: 562, column: 2, scope: !277)
!602 = !DILocation(line: 562, column: 18, scope: !277)
!603 = !DILocation(line: 568, column: 2, scope: !277)
!604 = !DILocation(line: 568, column: 27, scope: !277)
!605 = !DILocation(line: 569, column: 2, scope: !277)
!606 = !DILocation(line: 570, column: 14, scope: !277)
!607 = !DILocation(line: 570, column: 23, scope: !277)
!608 = !{!609, !589, i64 32}
!609 = !{!"fuse_lowlevel_ops", !589, i64 0, !589, i64 8, !589, i64 16, !589, i64 24, !589, i64 32, !589, i64 40, !589, i64 48, !589, i64 56, !589, i64 64, !589, i64 72, !589, i64 80, !589, i64 88, !589, i64 96, !589, i64 104, !589, i64 112, !589, i64 120, !589, i64 128, !589, i64 136, !589, i64 144, !589, i64 152, !589, i64 160, !589, i64 168, !589, i64 176, !589, i64 184, !589, i64 192, !589, i64 200, !589, i64 208, !589, i64 216, !589, i64 224, !589, i64 232, !589, i64 240, !589, i64 248, !589, i64 256, !589, i64 264, !589, i64 272, !589, i64 280, !589, i64 288, !589, i64 296, !589, i64 304, !589, i64 312, !589, i64 320, !589, i64 328, !589, i64 336, !589, i64 344}
!610 = !DILocation(line: 571, column: 14, scope: !277)
!611 = !DILocation(line: 571, column: 23, scope: !277)
!612 = !{!609, !589, i64 160}
!613 = !DILocation(line: 572, column: 14, scope: !277)
!614 = !DILocation(line: 572, column: 25, scope: !277)
!615 = !{!609, !589, i64 176}
!616 = !DILocation(line: 573, column: 14, scope: !277)
!617 = !DILocation(line: 573, column: 23, scope: !277)
!618 = !{!609, !589, i64 168}
!619 = !DILocation(line: 574, column: 14, scope: !277)
!620 = !DILocation(line: 574, column: 22, scope: !277)
!621 = !{!609, !589, i64 16}
!622 = !DILocation(line: 575, column: 14, scope: !277)
!623 = !DILocation(line: 575, column: 20, scope: !277)
!624 = !{!609, !589, i64 112}
!625 = !DILocation(line: 576, column: 14, scope: !277)
!626 = !DILocation(line: 576, column: 22, scope: !277)
!627 = !{!609, !589, i64 240}
!628 = !DILocation(line: 577, column: 14, scope: !277)
!629 = !DILocation(line: 577, column: 23, scope: !277)
!630 = !{!609, !589, i64 144}
!631 = !DILocation(line: 578, column: 14, scope: !277)
!632 = !DILocation(line: 578, column: 20, scope: !277)
!633 = !{!609, !589, i64 120}
!634 = !DILocation(line: 579, column: 14, scope: !277)
!635 = !DILocation(line: 579, column: 23, scope: !277)
!636 = !{!609, !589, i64 48}
!637 = !DILocation(line: 580, column: 14, scope: !277)
!638 = !DILocation(line: 580, column: 24, scope: !277)
!639 = !{!609, !589, i64 216}
!640 = !DILocation(line: 581, column: 14, scope: !277)
!641 = !DILocation(line: 581, column: 23, scope: !277)
!642 = !{!609, !589, i64 208}
!643 = !DILocation(line: 582, column: 14, scope: !277)
!644 = !DILocation(line: 582, column: 22, scope: !277)
!645 = !{!609, !589, i64 24}
!646 = !DILocation(line: 583, column: 14, scope: !277)
!647 = !DILocation(line: 583, column: 24, scope: !277)
!648 = !{!609, !589, i64 192}
!649 = !DILocation(line: 586, column: 14, scope: !277)
!650 = !DILocation(line: 586, column: 7, scope: !277)
!651 = !DILocation(line: 586, column: 12, scope: !277)
!652 = !{!653, !584, i64 0}
!653 = !{!"fuse_args", !584, i64 0, !589, i64 8, !584, i64 16}
!654 = !DILocation(line: 587, column: 14, scope: !277)
!655 = !DILocation(line: 587, column: 7, scope: !277)
!656 = !DILocation(line: 587, column: 12, scope: !277)
!657 = !{!653, !589, i64 8}
!658 = !DILocation(line: 588, column: 7, scope: !277)
!659 = !DILocation(line: 588, column: 17, scope: !277)
!660 = !{!653, !584, i64 16}
!661 = !DILocation(line: 590, column: 18, scope: !277)
!662 = !DILocation(line: 590, column: 7, scope: !277)
!663 = !DILocation(line: 590, column: 16, scope: !277)
!664 = !{!665, !589, i64 0}
!665 = !{!"", !589, i64 0, !589, i64 8, !584, i64 16, !666, i64 24, !584, i64 32}
!666 = !{!"long", !585, i64 0}
!667 = !DILocation(line: 591, column: 7, scope: !277)
!668 = !DILocation(line: 591, column: 13, scope: !277)
!669 = !{!665, !589, i64 8}
!670 = !DILocation(line: 592, column: 7, scope: !277)
!671 = !DILocation(line: 592, column: 18, scope: !277)
!672 = !{!665, !584, i64 16}
!673 = !DILocation(line: 593, column: 7, scope: !277)
!674 = !DILocation(line: 593, column: 14, scope: !277)
!675 = !{!665, !666, i64 24}
!676 = !DILocation(line: 594, column: 7, scope: !277)
!677 = !DILocation(line: 594, column: 25, scope: !277)
!678 = !{!665, !584, i64 32}
!679 = !DILocation(line: 595, column: 35, scope: !680)
!680 = distinct !DILexicalBlock(scope: !277, file: !2, line: 595, column: 6)
!681 = !DILocation(line: 595, column: 6, scope: !680)
!682 = !DILocation(line: 595, column: 61, scope: !680)
!683 = !DILocation(line: 595, column: 6, scope: !277)
!684 = !DILocation(line: 596, column: 14, scope: !680)
!685 = !DILocation(line: 596, column: 3, scope: !680)
!686 = !DILocation(line: 599, column: 6, scope: !687)
!687 = distinct !DILexicalBlock(scope: !277, file: !2, line: 599, column: 6)
!688 = !DILocation(line: 599, column: 52, scope: !687)
!689 = !DILocation(line: 599, column: 6, scope: !277)
!690 = !DILocation(line: 606, column: 14, scope: !687)
!691 = !DILocation(line: 606, column: 3, scope: !687)
!692 = !DILocation(line: 607, column: 24, scope: !693)
!693 = distinct !DILexicalBlock(scope: !277, file: !2, line: 607, column: 6)
!694 = !{!695, !589, i64 16}
!695 = !{!"fuse_cmdline_opts", !584, i64 0, !584, i64 4, !584, i64 8, !584, i64 12, !589, i64 16, !584, i64 24, !584, i64 28, !584, i64 32, !584, i64 36, !584, i64 40}
!696 = !DILocation(line: 607, column: 35, scope: !693)
!697 = !DILocation(line: 607, column: 6, scope: !277)
!698 = !DILocation(line: 608, column: 14, scope: !693)
!699 = !DILocation(line: 608, column: 3, scope: !693)
!700 = !DILocation(line: 611, column: 33, scope: !277)
!701 = !DILocation(line: 611, column: 45, scope: !277)
!702 = !DILocation(line: 611, column: 15, scope: !277)
!703 = !DILocation(line: 611, column: 13, scope: !277)
!704 = !DILocation(line: 611, column: 8, scope: !277)
!705 = !DILocation(line: 611, column: 6, scope: !277)
!706 = !DILocation(line: 614, column: 7, scope: !577)
!707 = !DILocation(line: 614, column: 6, scope: !277)
!708 = !DILocation(line: 615, column: 3, scope: !576)
!709 = !DILocation(line: 615, column: 16, scope: !576)
!710 = !DILocation(line: 616, column: 7, scope: !576)
!711 = !DILocation(line: 619, column: 43, scope: !712)
!712 = distinct !DILexicalBlock(scope: !576, file: !2, line: 617, column: 7)
!713 = !DILocation(line: 623, column: 25, scope: !712)
!714 = !DILocation(line: 617, column: 7, scope: !712)
!715 = !DILocation(line: 623, column: 29, scope: !712)
!716 = !DILocation(line: 617, column: 7, scope: !576)
!717 = !DILocation(line: 624, column: 44, scope: !718)
!718 = distinct !DILexicalBlock(scope: !719, file: !2, line: 624, column: 8)
!719 = distinct !DILexicalBlock(scope: !712, file: !2, line: 623, column: 41)
!720 = !{!695, !584, i64 4}
!721 = !DILocation(line: 624, column: 8, scope: !718)
!722 = !DILocation(line: 624, column: 56, scope: !718)
!723 = !DILocation(line: 624, column: 8, scope: !719)
!724 = !DILocation(line: 625, column: 37, scope: !725)
!725 = distinct !DILexicalBlock(scope: !726, file: !2, line: 625, column: 9)
!726 = distinct !DILexicalBlock(scope: !718, file: !2, line: 624, column: 63)
!727 = !{!728, !589, i64 8}
!728 = !{!"", !584, i64 0, !589, i64 8}
!729 = !DILocation(line: 625, column: 9, scope: !725)
!730 = !DILocation(line: 625, column: 46, scope: !725)
!731 = !DILocation(line: 625, column: 9, scope: !726)
!732 = !DILocation(line: 626, column: 15, scope: !733)
!733 = distinct !DILexicalBlock(scope: !734, file: !2, line: 626, column: 10)
!734 = distinct !DILexicalBlock(scope: !725, file: !2, line: 625, column: 53)
!735 = !DILocation(line: 626, column: 10, scope: !733)
!736 = !DILocation(line: 626, column: 10, scope: !734)
!737 = !DILocation(line: 627, column: 29, scope: !738)
!738 = distinct !DILexicalBlock(scope: !733, file: !2, line: 626, column: 34)
!739 = !DILocation(line: 627, column: 43, scope: !738)
!740 = !DILocation(line: 627, column: 7, scope: !738)
!741 = !DILocation(line: 628, column: 6, scope: !738)
!742 = !DILocation(line: 630, column: 33, scope: !734)
!743 = !DILocation(line: 630, column: 12, scope: !734)
!744 = !DILocation(line: 630, column: 10, scope: !734)
!745 = !DILocation(line: 631, column: 6, scope: !734)
!746 = !DILocation(line: 632, column: 37, scope: !734)
!747 = !DILocation(line: 632, column: 6, scope: !734)
!748 = !DILocation(line: 633, column: 5, scope: !734)
!749 = !DILocation(line: 634, column: 4, scope: !726)
!750 = !DILocation(line: 635, column: 20, scope: !719)
!751 = !DILocation(line: 635, column: 4, scope: !719)
!752 = !DILocation(line: 636, column: 43, scope: !719)
!753 = !DILocation(line: 636, column: 4, scope: !719)
!754 = !DILocation(line: 637, column: 3, scope: !719)
!755 = !DILocation(line: 638, column: 2, scope: !577)
!756 = !DILocation(line: 638, column: 2, scope: !576)
!757 = !DILocation(line: 639, column: 2, scope: !277)
!758 = !DILocation(line: 640, column: 7, scope: !277)
!759 = !DILocation(line: 640, column: 2, scope: !277)
!760 = !DILocation(line: 641, column: 25, scope: !277)
!761 = !DILocation(line: 641, column: 2, scope: !277)
!762 = !DILocation(line: 643, column: 10, scope: !277)
!763 = !DILocation(line: 643, column: 9, scope: !277)
!764 = !DILocation(line: 644, column: 1, scope: !277)
!765 = !DILocation(line: 643, column: 2, scope: !277)
!766 = distinct !DISubprogram(name: "sqfs_ll_op_getattr", scope: !2, file: !2, line: 55, type: !363, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !767)
!767 = !{!768, !769, !770, !771, !772}
!768 = !DILocalVariable(name: "req", arg: 1, scope: !766, file: !2, line: 55, type: !354)
!769 = !DILocalVariable(name: "ino", arg: 2, scope: !766, file: !2, line: 55, type: !146)
!770 = !DILocalVariable(name: "fi", arg: 3, scope: !766, file: !2, line: 56, type: !365)
!771 = !DILocalVariable(name: "lli", scope: !766, file: !2, line: 57, type: !35)
!772 = !DILocalVariable(name: "st", scope: !766, file: !2, line: 58, type: !388)
!773 = !DILocation(line: 55, column: 43, scope: !766)
!774 = !{!666, !666, i64 0}
!775 = !DILocation(line: 55, column: 59, scope: !766)
!776 = !DILocation(line: 56, column: 26, scope: !766)
!777 = !DILocation(line: 57, column: 2, scope: !766)
!778 = !DILocation(line: 57, column: 12, scope: !766)
!779 = !DILocation(line: 58, column: 2, scope: !766)
!780 = !DILocation(line: 58, column: 14, scope: !766)
!781 = !DILocation(line: 59, column: 16, scope: !766)
!782 = !DILocation(line: 59, column: 14, scope: !766)
!783 = !DILocation(line: 60, column: 19, scope: !784)
!784 = distinct !DILexicalBlock(scope: !766, file: !2, line: 60, column: 6)
!785 = !DILocation(line: 60, column: 30, scope: !784)
!786 = !DILocation(line: 60, column: 6, scope: !784)
!787 = !DILocation(line: 60, column: 6, scope: !766)
!788 = !DILocation(line: 61, column: 3, scope: !784)
!789 = !DILocation(line: 63, column: 21, scope: !790)
!790 = distinct !DILexicalBlock(scope: !766, file: !2, line: 63, column: 6)
!791 = !{!792, !589, i64 0}
!792 = !{!"", !589, i64 0, !793, i64 8}
!793 = !{!"sqfs_inode", !794, i64 0, !584, i64 16, !584, i64 20, !796, i64 24, !585, i64 40}
!794 = !{!"squashfs_base_inode", !795, i64 0, !795, i64 2, !795, i64 4, !795, i64 6, !584, i64 8, !584, i64 12}
!795 = !{!"short", !585, i64 0}
!796 = !{!"", !666, i64 0, !666, i64 8}
!797 = !DILocation(line: 63, column: 25, scope: !790)
!798 = !DILocation(line: 63, column: 34, scope: !790)
!799 = !DILocation(line: 63, column: 6, scope: !790)
!800 = !DILocation(line: 63, column: 6, scope: !766)
!801 = !DILocation(line: 64, column: 18, scope: !802)
!802 = distinct !DILexicalBlock(scope: !790, file: !2, line: 63, column: 47)
!803 = !DILocation(line: 64, column: 3, scope: !802)
!804 = !DILocation(line: 65, column: 2, scope: !802)
!805 = !DILocation(line: 66, column: 15, scope: !806)
!806 = distinct !DILexicalBlock(scope: !790, file: !2, line: 65, column: 9)
!807 = !DILocation(line: 66, column: 6, scope: !806)
!808 = !DILocation(line: 66, column: 13, scope: !806)
!809 = !{!810, !666, i64 8}
!810 = !{!"stat", !666, i64 0, !666, i64 8, !666, i64 16, !584, i64 24, !584, i64 28, !584, i64 32, !584, i64 36, !666, i64 40, !666, i64 48, !666, i64 56, !666, i64 64, !666, i64 72, !666, i64 80, !666, i64 88, !666, i64 96, !666, i64 104, !666, i64 112, !585, i64 120}
!811 = !DILocation(line: 67, column: 19, scope: !806)
!812 = !DILocation(line: 67, column: 3, scope: !806)
!813 = !DILocation(line: 69, column: 1, scope: !766)
!814 = distinct !DISubprogram(name: "sqfs_ll_op_opendir", scope: !2, file: !2, line: 71, type: !363, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !815)
!815 = !{!816, !817, !818, !819}
!816 = !DILocalVariable(name: "req", arg: 1, scope: !814, file: !2, line: 71, type: !354)
!817 = !DILocalVariable(name: "ino", arg: 2, scope: !814, file: !2, line: 71, type: !146)
!818 = !DILocalVariable(name: "fi", arg: 3, scope: !814, file: !2, line: 72, type: !365)
!819 = !DILocalVariable(name: "lli", scope: !814, file: !2, line: 73, type: !34)
!820 = !DILocation(line: 71, column: 43, scope: !814)
!821 = !DILocation(line: 71, column: 59, scope: !814)
!822 = !DILocation(line: 72, column: 26, scope: !814)
!823 = !DILocation(line: 73, column: 2, scope: !814)
!824 = !DILocation(line: 73, column: 13, scope: !814)
!825 = !DILocation(line: 74, column: 16, scope: !814)
!826 = !DILocation(line: 74, column: 14, scope: !814)
!827 = !DILocation(line: 76, column: 2, scope: !814)
!828 = !DILocation(line: 76, column: 6, scope: !814)
!829 = !DILocation(line: 76, column: 9, scope: !814)
!830 = !{!831, !666, i64 16}
!831 = !{!"fuse_file_info", !584, i64 0, !584, i64 4, !584, i64 4, !584, i64 4, !584, i64 4, !584, i64 4, !584, i64 4, !584, i64 4, !584, i64 4, !584, i64 5, !584, i64 5, !584, i64 8, !666, i64 16, !666, i64 24, !584, i64 32}
!832 = !DILocation(line: 78, column: 8, scope: !814)
!833 = !DILocation(line: 78, column: 6, scope: !814)
!834 = !DILocation(line: 79, column: 7, scope: !835)
!835 = distinct !DILexicalBlock(scope: !814, file: !2, line: 79, column: 6)
!836 = !DILocation(line: 79, column: 6, scope: !814)
!837 = !DILocation(line: 80, column: 18, scope: !838)
!838 = distinct !DILexicalBlock(scope: !835, file: !2, line: 79, column: 12)
!839 = !DILocation(line: 80, column: 3, scope: !838)
!840 = !DILocation(line: 81, column: 3, scope: !838)
!841 = !DILocation(line: 84, column: 19, scope: !842)
!842 = distinct !DILexicalBlock(scope: !814, file: !2, line: 84, column: 6)
!843 = !DILocation(line: 84, column: 24, scope: !842)
!844 = !DILocation(line: 84, column: 29, scope: !842)
!845 = !DILocation(line: 84, column: 6, scope: !842)
!846 = !DILocation(line: 84, column: 34, scope: !842)
!847 = !DILocation(line: 84, column: 6, scope: !814)
!848 = !DILocation(line: 85, column: 8, scope: !849)
!849 = distinct !DILexicalBlock(scope: !850, file: !2, line: 85, column: 7)
!850 = distinct !DILexicalBlock(scope: !842, file: !2, line: 84, column: 46)
!851 = !{!792, !795, i64 10}
!852 = !DILocation(line: 85, column: 7, scope: !850)
!853 = !DILocation(line: 86, column: 19, scope: !854)
!854 = distinct !DILexicalBlock(scope: !849, file: !2, line: 85, column: 39)
!855 = !DILocation(line: 86, column: 4, scope: !854)
!856 = !DILocation(line: 87, column: 3, scope: !854)
!857 = !DILocation(line: 88, column: 23, scope: !858)
!858 = distinct !DILexicalBlock(scope: !849, file: !2, line: 87, column: 10)
!859 = !DILocation(line: 88, column: 13, scope: !858)
!860 = !DILocation(line: 88, column: 4, scope: !858)
!861 = !DILocation(line: 88, column: 8, scope: !858)
!862 = !DILocation(line: 88, column: 11, scope: !858)
!863 = !DILocation(line: 89, column: 4, scope: !858)
!864 = !DILocation(line: 90, column: 20, scope: !858)
!865 = !DILocation(line: 90, column: 25, scope: !858)
!866 = !DILocation(line: 90, column: 4, scope: !858)
!867 = !DILocation(line: 91, column: 4, scope: !858)
!868 = !DILocation(line: 93, column: 2, scope: !850)
!869 = !DILocation(line: 94, column: 7, scope: !814)
!870 = !DILocation(line: 94, column: 2, scope: !814)
!871 = !DILocation(line: 95, column: 1, scope: !814)
!872 = distinct !DISubprogram(name: "sqfs_ll_op_releasedir", scope: !2, file: !2, line: 103, type: !363, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !873)
!873 = !{!874, !875, !876}
!874 = !DILocalVariable(name: "req", arg: 1, scope: !872, file: !2, line: 103, type: !354)
!875 = !DILocalVariable(name: "ino", arg: 2, scope: !872, file: !2, line: 103, type: !146)
!876 = !DILocalVariable(name: "fi", arg: 3, scope: !872, file: !2, line: 104, type: !365)
!877 = !DILocation(line: 103, column: 46, scope: !872)
!878 = !DILocation(line: 103, column: 62, scope: !872)
!879 = !DILocation(line: 104, column: 26, scope: !872)
!880 = !DILocation(line: 105, column: 16, scope: !872)
!881 = !DILocation(line: 105, column: 14, scope: !872)
!882 = !DILocation(line: 106, column: 2, scope: !872)
!883 = !DILocation(line: 107, column: 29, scope: !872)
!884 = !DILocation(line: 107, column: 33, scope: !872)
!885 = !DILocation(line: 107, column: 7, scope: !872)
!886 = !DILocation(line: 107, column: 2, scope: !872)
!887 = !DILocation(line: 108, column: 17, scope: !872)
!888 = !DILocation(line: 108, column: 2, scope: !872)
!889 = !DILocation(line: 109, column: 1, scope: !872)
!890 = distinct !DISubprogram(name: "sqfs_ll_op_readdir", scope: !2, file: !2, line: 122, type: !451, scopeLine: 123, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !891)
!891 = !{!892, !893, !894, !895, !896, !897, !898, !911, !916, !917, !918, !919, !920, !921, !922}
!892 = !DILocalVariable(name: "req", arg: 1, scope: !890, file: !2, line: 122, type: !354)
!893 = !DILocalVariable(name: "ino", arg: 2, scope: !890, file: !2, line: 122, type: !146)
!894 = !DILocalVariable(name: "size", arg: 3, scope: !890, file: !2, line: 122, type: !53)
!895 = !DILocalVariable(name: "off", arg: 4, scope: !890, file: !2, line: 123, type: !173)
!896 = !DILocalVariable(name: "fi", arg: 5, scope: !890, file: !2, line: 123, type: !365)
!897 = !DILocalVariable(name: "sqerr", scope: !890, file: !2, line: 124, type: !133)
!898 = !DILocalVariable(name: "dir", scope: !890, file: !2, line: 125, type: !899)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_dir", file: !159, line: 36, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !159, line: 32, size: 384, elements: !901)
!901 = !{!902, !903, !904, !905}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !900, file: !159, line: 33, baseType: !204, size: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !900, file: !159, line: 34, baseType: !172, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !900, file: !159, line: 34, baseType: !172, size: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !900, file: !159, line: 35, baseType: !906, size: 96, offset: 256)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "squashfs_dir_header", file: !58, line: 289, size: 96, elements: !907)
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !906, file: !58, line: 290, baseType: !61, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "start_block", scope: !906, file: !58, line: 291, baseType: !61, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "inode_number", scope: !906, file: !58, line: 292, baseType: !61, size: 32, offset: 64)
!911 = !DILocalVariable(name: "namebuf", scope: !890, file: !2, line: 126, type: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqfs_name", file: !159, line: 47, baseType: !913)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2056, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 257)
!916 = !DILocalVariable(name: "entry", scope: !890, file: !2, line: 127, type: !158)
!917 = !DILocalVariable(name: "esize", scope: !890, file: !2, line: 128, type: !53)
!918 = !DILocalVariable(name: "st", scope: !890, file: !2, line: 129, type: !388)
!919 = !DILocalVariable(name: "buf", scope: !890, file: !2, line: 131, type: !169)
!920 = !DILocalVariable(name: "bufpos", scope: !890, file: !2, line: 131, type: !169)
!921 = !DILocalVariable(name: "lli", scope: !890, file: !2, line: 132, type: !34)
!922 = !DILocalVariable(name: "err", scope: !890, file: !2, line: 133, type: !51)
!923 = !DILocation(line: 122, column: 43, scope: !890)
!924 = !DILocation(line: 122, column: 59, scope: !890)
!925 = !DILocation(line: 122, column: 71, scope: !890)
!926 = !DILocation(line: 123, column: 9, scope: !890)
!927 = !DILocation(line: 123, column: 37, scope: !890)
!928 = !DILocation(line: 124, column: 2, scope: !890)
!929 = !DILocation(line: 124, column: 11, scope: !890)
!930 = !DILocation(line: 125, column: 2, scope: !890)
!931 = !DILocation(line: 125, column: 11, scope: !890)
!932 = !DILocation(line: 126, column: 2, scope: !890)
!933 = !DILocation(line: 126, column: 12, scope: !890)
!934 = !DILocation(line: 127, column: 2, scope: !890)
!935 = !DILocation(line: 127, column: 17, scope: !890)
!936 = !DILocation(line: 128, column: 2, scope: !890)
!937 = !DILocation(line: 128, column: 9, scope: !890)
!938 = !DILocation(line: 129, column: 2, scope: !890)
!939 = !DILocation(line: 129, column: 14, scope: !890)
!940 = !DILocation(line: 131, column: 2, scope: !890)
!941 = !DILocation(line: 131, column: 8, scope: !890)
!942 = !DILocation(line: 131, column: 21, scope: !890)
!943 = !DILocation(line: 132, column: 2, scope: !890)
!944 = !DILocation(line: 132, column: 13, scope: !890)
!945 = !DILocation(line: 132, column: 41, scope: !890)
!946 = !DILocation(line: 132, column: 45, scope: !890)
!947 = !DILocation(line: 132, column: 19, scope: !890)
!948 = !DILocation(line: 133, column: 2, scope: !890)
!949 = !DILocation(line: 133, column: 6, scope: !890)
!950 = !DILocation(line: 135, column: 16, scope: !890)
!951 = !DILocation(line: 135, column: 14, scope: !890)
!952 = !DILocation(line: 136, column: 21, scope: !953)
!953 = distinct !DILexicalBlock(scope: !890, file: !2, line: 136, column: 6)
!954 = !DILocation(line: 136, column: 26, scope: !953)
!955 = !DILocation(line: 136, column: 30, scope: !953)
!956 = !DILocation(line: 136, column: 35, scope: !953)
!957 = !DILocation(line: 136, column: 40, scope: !953)
!958 = !DILocation(line: 136, column: 53, scope: !953)
!959 = !DILocation(line: 136, column: 6, scope: !953)
!960 = !DILocation(line: 136, column: 6, scope: !890)
!961 = !DILocation(line: 137, column: 7, scope: !953)
!962 = !DILocation(line: 137, column: 3, scope: !953)
!963 = !DILocation(line: 138, column: 7, scope: !964)
!964 = distinct !DILexicalBlock(scope: !890, file: !2, line: 138, column: 6)
!965 = !DILocation(line: 138, column: 11, scope: !964)
!966 = !DILocation(line: 138, column: 38, scope: !964)
!967 = !DILocation(line: 138, column: 31, scope: !964)
!968 = !DILocation(line: 138, column: 29, scope: !964)
!969 = !DILocation(line: 138, column: 23, scope: !964)
!970 = !DILocation(line: 138, column: 6, scope: !890)
!971 = !DILocation(line: 139, column: 7, scope: !964)
!972 = !DILocation(line: 139, column: 3, scope: !964)
!973 = !DILocation(line: 141, column: 7, scope: !974)
!974 = distinct !DILexicalBlock(scope: !890, file: !2, line: 141, column: 6)
!975 = !DILocation(line: 141, column: 6, scope: !890)
!976 = !DILocation(line: 142, column: 3, scope: !977)
!977 = distinct !DILexicalBlock(scope: !974, file: !2, line: 141, column: 12)
!978 = !DILocation(line: 143, column: 28, scope: !977)
!979 = !DILocation(line: 143, column: 3, scope: !977)
!980 = !DILocation(line: 144, column: 3, scope: !977)
!981 = !DILocation(line: 144, column: 25, scope: !977)
!982 = !DILocation(line: 144, column: 30, scope: !977)
!983 = !DILocation(line: 144, column: 34, scope: !977)
!984 = !DILocation(line: 144, column: 10, scope: !977)
!985 = !DILocation(line: 145, column: 16, scope: !986)
!986 = distinct !DILexicalBlock(scope: !977, file: !2, line: 144, column: 61)
!987 = !DILocation(line: 145, column: 21, scope: !986)
!988 = !DILocation(line: 145, column: 25, scope: !986)
!989 = !{!990, !589, i64 424}
!990 = !{!"sqfs_ll", !991, i64 0, !589, i64 392, !589, i64 400, !589, i64 408, !589, i64 416, !589, i64 424, !589, i64 432, !589, i64 440}
!991 = !{!"sqfs", !584, i64 0, !666, i64 8, !992, i64 16, !994, i64 112, !994, i64 128, !994, i64 144, !995, i64 160, !995, i64 208, !995, i64 256, !995, i64 304, !589, i64 352, !996, i64 360, !994, i64 376}
!992 = !{!"squashfs_super_block", !584, i64 0, !584, i64 4, !584, i64 8, !584, i64 12, !584, i64 16, !795, i64 20, !795, i64 22, !795, i64 24, !795, i64 26, !795, i64 28, !795, i64 30, !993, i64 32, !993, i64 40, !993, i64 48, !993, i64 56, !993, i64 64, !993, i64 72, !993, i64 80, !993, i64 88}
!993 = !{!"long long", !585, i64 0}
!994 = !{!"", !666, i64 0, !589, i64 8}
!995 = !{!"", !589, i64 0, !589, i64 8, !589, i64 16, !666, i64 24, !666, i64 32, !666, i64 40}
!996 = !{!"squashfs_xattr_id_table", !993, i64 0, !584, i64 8, !584, i64 12}
!997 = !DILocation(line: 145, column: 38, scope: !986)
!998 = !DILocation(line: 145, column: 43, scope: !986)
!999 = !DILocation(line: 145, column: 7, scope: !986)
!1000 = !DILocation(line: 145, column: 14, scope: !986)
!1001 = !DILocation(line: 146, column: 17, scope: !986)
!1002 = !DILocation(line: 146, column: 7, scope: !986)
!1003 = !DILocation(line: 146, column: 15, scope: !986)
!1004 = !{!810, !584, i64 24}
!1005 = !DILocation(line: 148, column: 33, scope: !986)
!1006 = !DILocation(line: 148, column: 38, scope: !986)
!1007 = !DILocation(line: 148, column: 46, scope: !986)
!1008 = !DILocation(line: 148, column: 52, scope: !986)
!1009 = !DILocation(line: 149, column: 10, scope: !986)
!1010 = !DILocation(line: 148, column: 12, scope: !986)
!1011 = !DILocation(line: 148, column: 10, scope: !986)
!1012 = !DILocation(line: 150, column: 8, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !986, file: !2, line: 150, column: 8)
!1014 = !DILocation(line: 150, column: 16, scope: !1013)
!1015 = !DILocation(line: 150, column: 14, scope: !1013)
!1016 = !DILocation(line: 150, column: 8, scope: !986)
!1017 = !DILocation(line: 151, column: 5, scope: !1013)
!1018 = !DILocation(line: 153, column: 14, scope: !986)
!1019 = !DILocation(line: 153, column: 11, scope: !986)
!1020 = !DILocation(line: 154, column: 12, scope: !986)
!1021 = !DILocation(line: 154, column: 9, scope: !986)
!1022 = distinct !{!1022, !980, !1023, !1024}
!1023 = !DILocation(line: 155, column: 3, scope: !977)
!1024 = !{!"llvm.loop.mustprogress"}
!1025 = !DILocation(line: 156, column: 7, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !977, file: !2, line: 156, column: 7)
!1027 = !{!585, !585, i64 0}
!1028 = !DILocation(line: 156, column: 7, scope: !977)
!1029 = !DILocation(line: 157, column: 8, scope: !1026)
!1030 = !DILocation(line: 157, column: 4, scope: !1026)
!1031 = !DILocation(line: 158, column: 2, scope: !977)
!1032 = !DILocation(line: 160, column: 6, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !890, file: !2, line: 160, column: 6)
!1034 = !DILocation(line: 160, column: 6, scope: !890)
!1035 = !DILocation(line: 161, column: 18, scope: !1033)
!1036 = !DILocation(line: 161, column: 23, scope: !1033)
!1037 = !DILocation(line: 161, column: 3, scope: !1033)
!1038 = !DILocation(line: 163, column: 18, scope: !1033)
!1039 = !DILocation(line: 163, column: 23, scope: !1033)
!1040 = !DILocation(line: 163, column: 28, scope: !1033)
!1041 = !DILocation(line: 163, column: 37, scope: !1033)
!1042 = !DILocation(line: 163, column: 35, scope: !1033)
!1043 = !DILocation(line: 163, column: 3, scope: !1033)
!1044 = !DILocation(line: 164, column: 7, scope: !890)
!1045 = !DILocation(line: 164, column: 2, scope: !890)
!1046 = !DILocation(line: 165, column: 1, scope: !890)
!1047 = distinct !DISubprogram(name: "sqfs_ll_op_lookup", scope: !2, file: !2, line: 167, type: !352, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1058, !1059}
!1049 = !DILocalVariable(name: "req", arg: 1, scope: !1047, file: !2, line: 167, type: !354)
!1050 = !DILocalVariable(name: "parent", arg: 2, scope: !1047, file: !2, line: 167, type: !146)
!1051 = !DILocalVariable(name: "name", arg: 3, scope: !1047, file: !2, line: 168, type: !298)
!1052 = !DILocalVariable(name: "lli", scope: !1047, file: !2, line: 169, type: !35)
!1053 = !DILocalVariable(name: "sqerr", scope: !1047, file: !2, line: 170, type: !133)
!1054 = !DILocalVariable(name: "namebuf", scope: !1047, file: !2, line: 171, type: !912)
!1055 = !DILocalVariable(name: "entry", scope: !1047, file: !2, line: 172, type: !158)
!1056 = !DILocalVariable(name: "found", scope: !1047, file: !2, line: 173, type: !1057)
!1057 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!1058 = !DILocalVariable(name: "inode", scope: !1047, file: !2, line: 174, type: !188)
!1059 = !DILocalVariable(name: "fentry", scope: !1060, file: !2, line: 200, type: !1062)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !2, line: 199, column: 9)
!1061 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 197, column: 6)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fuse_entry_param", file: !147, line: 59, size: 1408, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1062, file: !147, line: 67, baseType: !146, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "generation", scope: !1062, file: !147, line: 79, baseType: !97, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !1062, file: !147, line: 88, baseType: !388, size: 1152, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "attr_timeout", scope: !1062, file: !147, line: 94, baseType: !240, size: 64, offset: 1280)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "entry_timeout", scope: !1062, file: !147, line: 100, baseType: !240, size: 64, offset: 1344)
!1069 = !DILocation(line: 167, column: 42, scope: !1047)
!1070 = !DILocation(line: 167, column: 58, scope: !1047)
!1071 = !DILocation(line: 168, column: 15, scope: !1047)
!1072 = !DILocation(line: 169, column: 2, scope: !1047)
!1073 = !DILocation(line: 169, column: 12, scope: !1047)
!1074 = !DILocation(line: 170, column: 2, scope: !1047)
!1075 = !DILocation(line: 170, column: 11, scope: !1047)
!1076 = !DILocation(line: 171, column: 2, scope: !1047)
!1077 = !DILocation(line: 171, column: 12, scope: !1047)
!1078 = !DILocation(line: 172, column: 2, scope: !1047)
!1079 = !DILocation(line: 172, column: 17, scope: !1047)
!1080 = !DILocation(line: 173, column: 2, scope: !1047)
!1081 = !DILocation(line: 173, column: 7, scope: !1047)
!1082 = !DILocation(line: 174, column: 2, scope: !1047)
!1083 = !DILocation(line: 174, column: 13, scope: !1047)
!1084 = !DILocation(line: 176, column: 16, scope: !1047)
!1085 = !DILocation(line: 176, column: 14, scope: !1047)
!1086 = !DILocation(line: 177, column: 19, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 177, column: 6)
!1088 = !DILocation(line: 177, column: 30, scope: !1087)
!1089 = !DILocation(line: 177, column: 6, scope: !1087)
!1090 = !DILocation(line: 177, column: 6, scope: !1047)
!1091 = !DILocation(line: 178, column: 3, scope: !1087)
!1092 = !DILocation(line: 180, column: 7, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 180, column: 6)
!1094 = !DILocation(line: 180, column: 6, scope: !1047)
!1095 = !DILocation(line: 181, column: 18, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1093, file: !2, line: 180, column: 37)
!1097 = !DILocation(line: 181, column: 3, scope: !1096)
!1098 = !DILocation(line: 182, column: 3, scope: !1096)
!1099 = !DILocation(line: 185, column: 27, scope: !1047)
!1100 = !DILocation(line: 185, column: 2, scope: !1047)
!1101 = !DILocation(line: 186, column: 31, scope: !1047)
!1102 = !DILocation(line: 186, column: 35, scope: !1047)
!1103 = !DILocation(line: 186, column: 44, scope: !1047)
!1104 = !DILocation(line: 186, column: 51, scope: !1047)
!1105 = !DILocation(line: 186, column: 64, scope: !1047)
!1106 = !DILocation(line: 186, column: 57, scope: !1047)
!1107 = !DILocation(line: 186, column: 10, scope: !1047)
!1108 = !DILocation(line: 186, column: 8, scope: !1047)
!1109 = !DILocation(line: 188, column: 6, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 188, column: 6)
!1111 = !DILocation(line: 188, column: 6, scope: !1047)
!1112 = !DILocation(line: 189, column: 18, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1110, file: !2, line: 188, column: 13)
!1114 = !DILocation(line: 189, column: 3, scope: !1113)
!1115 = !DILocation(line: 190, column: 3, scope: !1113)
!1116 = !DILocation(line: 192, column: 7, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 192, column: 6)
!1118 = !{!1119, !1119, i64 0}
!1119 = !{!"_Bool", !585, i64 0}
!1120 = !{i8 0, i8 2}
!1121 = !{}
!1122 = !DILocation(line: 192, column: 6, scope: !1047)
!1123 = !DILocation(line: 193, column: 18, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1117, file: !2, line: 192, column: 14)
!1125 = !DILocation(line: 193, column: 3, scope: !1124)
!1126 = !DILocation(line: 194, column: 3, scope: !1124)
!1127 = !DILocation(line: 197, column: 26, scope: !1061)
!1128 = !DILocation(line: 197, column: 30, scope: !1061)
!1129 = !DILocation(line: 197, column: 42, scope: !1061)
!1130 = !DILocation(line: 197, column: 6, scope: !1061)
!1131 = !DILocation(line: 197, column: 6, scope: !1047)
!1132 = !DILocation(line: 198, column: 18, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1061, file: !2, line: 197, column: 70)
!1134 = !DILocation(line: 198, column: 3, scope: !1133)
!1135 = !DILocation(line: 199, column: 2, scope: !1133)
!1136 = !DILocation(line: 200, column: 3, scope: !1060)
!1137 = !DILocation(line: 200, column: 27, scope: !1060)
!1138 = !DILocation(line: 201, column: 3, scope: !1060)
!1139 = !DILocation(line: 202, column: 22, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1060, file: !2, line: 202, column: 7)
!1141 = !DILocation(line: 202, column: 26, scope: !1140)
!1142 = !DILocation(line: 202, column: 46, scope: !1140)
!1143 = !DILocation(line: 202, column: 7, scope: !1140)
!1144 = !DILocation(line: 202, column: 7, scope: !1060)
!1145 = !DILocation(line: 203, column: 19, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1140, file: !2, line: 202, column: 53)
!1147 = !DILocation(line: 203, column: 4, scope: !1146)
!1148 = !DILocation(line: 204, column: 3, scope: !1146)
!1149 = !DILocation(line: 205, column: 33, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1140, file: !2, line: 204, column: 10)
!1151 = !DILocation(line: 205, column: 47, scope: !1150)
!1152 = !{!1153, !1154, i64 168}
!1153 = !{!"fuse_entry_param", !666, i64 0, !666, i64 8, !810, i64 16, !1154, i64 160, !1154, i64 168}
!1154 = !{!"double", !585, i64 0}
!1155 = !DILocation(line: 205, column: 11, scope: !1150)
!1156 = !DILocation(line: 205, column: 24, scope: !1150)
!1157 = !{!1153, !1154, i64 160}
!1158 = !DILocation(line: 206, column: 21, scope: !1150)
!1159 = !DILocation(line: 206, column: 25, scope: !1150)
!1160 = !{!990, !589, i64 408}
!1161 = !DILocation(line: 206, column: 42, scope: !1150)
!1162 = !DILocation(line: 206, column: 17, scope: !1150)
!1163 = !DILocation(line: 206, column: 11, scope: !1150)
!1164 = !DILocation(line: 206, column: 15, scope: !1150)
!1165 = !{!1153, !666, i64 0}
!1166 = !DILocation(line: 207, column: 32, scope: !1150)
!1167 = !DILocation(line: 207, column: 11, scope: !1150)
!1168 = !DILocation(line: 207, column: 16, scope: !1150)
!1169 = !DILocation(line: 207, column: 23, scope: !1150)
!1170 = !{!1153, !666, i64 24}
!1171 = !DILocation(line: 208, column: 21, scope: !1150)
!1172 = !DILocation(line: 208, column: 4, scope: !1150)
!1173 = !DILocation(line: 210, column: 2, scope: !1061)
!1174 = !DILocation(line: 211, column: 1, scope: !1047)
!1175 = distinct !DISubprogram(name: "sqfs_ll_op_open", scope: !2, file: !2, line: 213, type: !363, scopeLine: 214, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1181}
!1177 = !DILocalVariable(name: "req", arg: 1, scope: !1175, file: !2, line: 213, type: !354)
!1178 = !DILocalVariable(name: "ino", arg: 2, scope: !1175, file: !2, line: 213, type: !146)
!1179 = !DILocalVariable(name: "fi", arg: 3, scope: !1175, file: !2, line: 214, type: !365)
!1180 = !DILocalVariable(name: "inode", scope: !1175, file: !2, line: 215, type: !235)
!1181 = !DILocalVariable(name: "ll", scope: !1175, file: !2, line: 216, type: !40)
!1182 = !DILocation(line: 213, column: 40, scope: !1175)
!1183 = !DILocation(line: 213, column: 56, scope: !1175)
!1184 = !DILocation(line: 214, column: 26, scope: !1175)
