; ModuleID = 'samples/442.bc'
source_filename = "nco_omp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ident_t = type { i32, i32, i32, i32, ptr }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [63 x i8] c"%s: ERROR User-requested thread number = %d is less than zero\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [380 x i8] c"%s: INFO User did not specify thread request > 0 on command line. NCO will automatically assign threads based on OMP_NUM_THREADS environment and machine capabilities.\0AHINT: Not specifying any --thr_nbr (or specifying --thr_nbr=0) causes NCO to try to pick the optimal thread number. Specifying --thr_nbr=1 tells NCO to execute in Uni-Processor (UP) (i.e., single-threaded) mode.\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [78 x i8] c"%s: ERROR Attempted to get maximum thread number from within parallel region\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [16 x i8] c"OMP_NUM_THREADS\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [7 x i8] c"strtol\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [47 x i8] c"%s: INFO Environment variable OMP_NUM_THREADS \00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [6 x i8] c"= %d\0A\00", align 1, !dbg !32

!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1496, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 187)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !71, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 280, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1504, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 188)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !2, line: 286, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 11)
!148 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !185, globals: !187, splitDebugInlining: false, nameTableKind: None)
!149 = !{!150, !169}
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nco_dbg_typ_enm", file: !151, line: 687, baseType: !152, size: 32, elements: !153)
!151 = !DIFile(filename: "./nco.h", directory: "/local-ssd/nco-sz3tspkp5snjjx4xkjuuma7nkymdp3lp-build/aidengro/spack-stage-nco-5.1.6-sz3tspkp5snjjx4xkjuuma7nkymdp3lp/spack-src/src/nco", checksumkind: CSK_MD5, checksum: "0340887c94ed7a88d98f42bc8aee20f6")
!152 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168}
!154 = !DIEnumerator(name: "nco_dbg_quiet", value: 0)
!155 = !DIEnumerator(name: "nco_dbg_std", value: 1)
!156 = !DIEnumerator(name: "nco_dbg_fl", value: 2)
!157 = !DIEnumerator(name: "nco_dbg_scl", value: 3)
!158 = !DIEnumerator(name: "nco_dbg_grp", value: 4)
!159 = !DIEnumerator(name: "nco_dbg_var", value: 5)
!160 = !DIEnumerator(name: "nco_dbg_crr", value: 6)
!161 = !DIEnumerator(name: "nco_dbg_sbr", value: 7)
!162 = !DIEnumerator(name: "nco_dbg_io", value: 8)
!163 = !DIEnumerator(name: "nco_dbg_vec", value: 9)
!164 = !DIEnumerator(name: "nco_dbg_vrb", value: 10)
!165 = !DIEnumerator(name: "nco_dbg_old", value: 11)
!166 = !DIEnumerator(name: "nco_dbg_dev", value: 12)
!167 = !DIEnumerator(name: "nco_dbg_sup", value: 13)
!168 = !DIEnumerator(name: "nco_dbg_nbr", value: 14)
!169 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nco_prg_id", file: !151, line: 670, baseType: !152, size: 32, elements: !170)
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!171 = !DIEnumerator(name: "ncap", value: 0)
!172 = !DIEnumerator(name: "ncatted", value: 1)
!173 = !DIEnumerator(name: "ncbo", value: 2)
!174 = !DIEnumerator(name: "ncfe", value: 3)
!175 = !DIEnumerator(name: "ncecat", value: 4)
!176 = !DIEnumerator(name: "ncflint", value: 5)
!177 = !DIEnumerator(name: "ncks", value: 6)
!178 = !DIEnumerator(name: "ncpdq", value: 7)
!179 = !DIEnumerator(name: "ncra", value: 8)
!180 = !DIEnumerator(name: "ncrcat", value: 9)
!181 = !DIEnumerator(name: "ncrename", value: 10)
!182 = !DIEnumerator(name: "ncwa", value: 11)
!183 = !DIEnumerator(name: "ncge", value: 12)
!184 = !DIEnumerator(name: "ncmv", value: 13)
!185 = !{!186}
!186 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!187 = !{!0, !7, !12, !17, !22, !27, !32, !37, !39, !44, !49, !54, !59, !64, !69, !74, !76, !81, !86, !91, !96, !101, !106, !111, !116, !121, !126, !131, !136, !138, !143}
!188 = !{i32 7, !"Dwarf Version", i32 5}
!189 = !{i32 2, !"Debug Info Version", i32 3}
!190 = !{i32 1, !"wchar_size", i32 4}
!191 = !{i32 7, !"openmp", i32 51}
!192 = !{i32 8, !"PIC Level", i32 2}
!193 = !{i32 7, !"uwtable", i32 2}
!194 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!195 = distinct !DISubprogram(name: "nco_openmp_ini", scope: !2, file: !2, line: 30, type: !196, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !148, retainedNodes: !199)
!196 = !DISubroutineType(types: !197)
!197 = !{!186, !198}
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!199 = !{!200, !201, !203, !204, !263, !264, !265, !266, !267, !268, !269, !270}
!200 = !DILocalVariable(name: "thr_nbr", arg: 1, scope: !195, file: !2, line: 31, type: !198)
!201 = !DILocalVariable(name: "nvr_OMP_NUM_THREADS", scope: !195, file: !2, line: 47, type: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!203 = !DILocalVariable(name: "sng_cnv_rcd", scope: !195, file: !2, line: 48, type: !202)
!204 = !DILocalVariable(name: "fp_stderr", scope: !195, file: !2, line: 49, type: !205)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !208, line: 7, baseType: !209)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !210, line: 49, size: 1728, elements: !211)
!210 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !227, !229, !230, !231, !235, !237, !239, !240, !243, !245, !248, !251, !252, !254, !258, !259}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !209, file: !210, line: 51, baseType: !186, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !209, file: !210, line: 54, baseType: !202, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !209, file: !210, line: 55, baseType: !202, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !209, file: !210, line: 56, baseType: !202, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !209, file: !210, line: 57, baseType: !202, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !209, file: !210, line: 58, baseType: !202, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !209, file: !210, line: 59, baseType: !202, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !209, file: !210, line: 60, baseType: !202, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !209, file: !210, line: 61, baseType: !202, size: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !209, file: !210, line: 64, baseType: !202, size: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !209, file: !210, line: 65, baseType: !202, size: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !209, file: !210, line: 66, baseType: !202, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !209, file: !210, line: 68, baseType: !225, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !210, line: 36, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !209, file: !210, line: 70, baseType: !228, size: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !209, file: !210, line: 72, baseType: !186, size: 32, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !209, file: !210, line: 73, baseType: !186, size: 32, offset: 928)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !209, file: !210, line: 74, baseType: !232, size: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !233, line: 152, baseType: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!234 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !209, file: !210, line: 77, baseType: !236, size: 16, offset: 1024)
!236 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !209, file: !210, line: 78, baseType: !238, size: 8, offset: 1040)
!238 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !209, file: !210, line: 79, baseType: !61, size: 8, offset: 1048)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !209, file: !210, line: 81, baseType: !241, size: 64, offset: 1088)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !210, line: 43, baseType: null)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !209, file: !210, line: 89, baseType: !244, size: 64, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !233, line: 153, baseType: !234)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !209, file: !210, line: 91, baseType: !246, size: 64, offset: 1216)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !210, line: 37, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !209, file: !210, line: 92, baseType: !249, size: 64, offset: 1280)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !210, line: 38, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !209, file: !210, line: 93, baseType: !228, size: 64, offset: 1344)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !209, file: !210, line: 94, baseType: !253, size: 64, offset: 1408)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !209, file: !210, line: 95, baseType: !255, size: 64, offset: 1472)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !256, line: 70, baseType: !257)
!256 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!257 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !209, file: !210, line: 96, baseType: !186, size: 32, offset: 1536)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !209, file: !210, line: 98, baseType: !260, size: 160, offset: 1568)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 20)
!263 = !DILocalVariable(name: "USR_SPC_THR_RQS", scope: !195, file: !2, line: 51, type: !186)
!264 = !DILocalVariable(name: "dyn_thr", scope: !195, file: !2, line: 53, type: !186)
!265 = !DILocalVariable(name: "ntg_OMP_NUM_THREADS", scope: !195, file: !2, line: 55, type: !186)
!266 = !DILocalVariable(name: "prc_nbr_max", scope: !195, file: !2, line: 56, type: !186)
!267 = !DILocalVariable(name: "thr_nbr_act", scope: !195, file: !2, line: 57, type: !186)
!268 = !DILocalVariable(name: "thr_nbr_max_fsh", scope: !195, file: !2, line: 58, type: !186)
!269 = !DILocalVariable(name: "thr_nbr_max", scope: !195, file: !2, line: 59, type: !186)
!270 = !DILocalVariable(name: "thr_nbr_rqs", scope: !195, file: !2, line: 60, type: !186)
!271 = !{!272, !272, i64 0}
!272 = !{!"int", !273, i64 0}
!273 = !{!"omnipotent char", !274, i64 0}
!274 = !{!"Simple C/C++ TBAA"}
!275 = !DILocation(line: 31, column: 12, scope: !195)
!276 = !DILocation(line: 47, column: 3, scope: !195)
!277 = !DILocation(line: 47, column: 9, scope: !195)
!278 = !DILocation(line: 48, column: 3, scope: !195)
!279 = !DILocation(line: 48, column: 9, scope: !195)
!280 = !{!281, !281, i64 0}
!281 = !{!"any pointer", !273, i64 0}
!282 = !DILocation(line: 49, column: 3, scope: !195)
!283 = !DILocation(line: 49, column: 16, scope: !195)
!284 = !DILocation(line: 49, column: 26, scope: !195)
!285 = !DILocation(line: 51, column: 3, scope: !195)
!286 = !DILocation(line: 51, column: 12, scope: !195)
!287 = !DILocation(line: 53, column: 3, scope: !195)
!288 = !DILocation(line: 53, column: 7, scope: !195)
!289 = !DILocation(line: 55, column: 3, scope: !195)
!290 = !DILocation(line: 55, column: 7, scope: !195)
!291 = !DILocation(line: 56, column: 3, scope: !195)
!292 = !DILocation(line: 56, column: 7, scope: !195)
!293 = !DILocation(line: 57, column: 3, scope: !195)
!294 = !DILocation(line: 57, column: 7, scope: !195)
!295 = !DILocation(line: 58, column: 3, scope: !195)
!296 = !DILocation(line: 58, column: 7, scope: !195)
!297 = !DILocation(line: 59, column: 3, scope: !195)
!298 = !DILocation(line: 59, column: 7, scope: !195)
!299 = !DILocation(line: 60, column: 3, scope: !195)
!300 = !DILocation(line: 60, column: 7, scope: !195)
!301 = !DILocation(line: 75, column: 6, scope: !302)
!302 = distinct !DILexicalBlock(scope: !195, file: !2, line: 75, column: 6)
!303 = !DILocation(line: 75, column: 14, scope: !302)
!304 = !DILocation(line: 75, column: 6, scope: !195)
!305 = !DILocation(line: 76, column: 19, scope: !306)
!306 = distinct !DILexicalBlock(scope: !302, file: !2, line: 75, column: 18)
!307 = !DILocation(line: 76, column: 95, scope: !306)
!308 = !DILocation(line: 76, column: 112, scope: !306)
!309 = !DILocation(line: 76, column: 11, scope: !306)
!310 = !DILocation(line: 77, column: 5, scope: !306)
!311 = !DILocation(line: 78, column: 3, scope: !306)
!312 = !DILocation(line: 80, column: 6, scope: !313)
!313 = distinct !DILexicalBlock(scope: !195, file: !2, line: 80, column: 6)
!314 = !DILocation(line: 80, column: 14, scope: !313)
!315 = !DILocation(line: 80, column: 6, scope: !195)
!316 = !DILocation(line: 81, column: 8, scope: !317)
!317 = distinct !DILexicalBlock(scope: !313, file: !2, line: 81, column: 8)
!318 = !DILocation(line: 81, column: 26, scope: !317)
!319 = !DILocation(line: 81, column: 41, scope: !317)
!320 = !DILocation(line: 81, column: 44, scope: !317)
!321 = !DILocation(line: 81, column: 62, scope: !317)
!322 = !DILocation(line: 81, column: 8, scope: !313)
!323 = !DILocation(line: 82, column: 21, scope: !317)
!324 = !DILocation(line: 82, column: 415, scope: !317)
!325 = !DILocation(line: 82, column: 13, scope: !317)
!326 = !DILocation(line: 82, column: 7, scope: !317)
!327 = !DILocation(line: 81, column: 65, scope: !317)
