; ModuleID = 'samples/454.bc'
source_filename = "src/annotationsketch/element.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtRange = type { i64, i64 }
%struct.GtElement = type { ptr, i64, i32, ptr, %struct.GtRange, %struct.GtDrawingRange, i8 }
%struct.GtDrawingRange = type { double, double, i32 }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"node\00", align 1, !dbg !7
@__func__.gt_element_new = private unnamed_addr constant [15 x i8] c"gt_element_new\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [31 x i8] c"src/annotationsketch/element.c\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [5 x i8] c"elem\00", align 1, !dbg !23
@__func__.gt_element_ref = private unnamed_addr constant [15 x i8] c"gt_element_ref\00", align 1, !dbg !25
@.str.4 = private unnamed_addr constant [8 x i8] c"element\00", align 1, !dbg !27

!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 45)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 153, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 46)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(scope: null, file: !2, line: 157, type: !114, isLocal: true, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 26)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !119, isLocal: true, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 27)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 28)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(scope: null, file: !2, line: 100, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 9)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 100, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 152, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 19)
!137 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, retainedTypes: !148, globals: !157, splitDebugInlining: false, nameTableKind: None)
!138 = !{!139}
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GtStrand", file: !140, line: 21, baseType: !141, size: 32, elements: !142)
!140 = !DIFile(filename: "src/core/strand_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "5c7a103ad5a6a6a01ca9604fb681ddb9")
!141 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!142 = !{!143, !144, !145, !146, !147}
!143 = !DIEnumerator(name: "GT_STRAND_FORWARD", value: 0)
!144 = !DIEnumerator(name: "GT_STRAND_REVERSE", value: 1)
!145 = !DIEnumerator(name: "GT_STRAND_BOTH", value: 2)
!146 = !DIEnumerator(name: "GT_STRAND_UNKNOWN", value: 3)
!147 = !DIEnumerator(name: "GT_NUM_OF_STRAND_TYPES", value: 4)
!148 = !{!149, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtGenomeNode", file: !151, line: 31, baseType: !152)
!151 = !DIFile(filename: "src/extended/genome_node_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0daef5af22904690d9e19c33d22b6470")
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtGenomeNode", file: !151, line: 31, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtFeatureNode", file: !155, line: 61, baseType: !156)
!155 = !DIFile(filename: "src/extended/feature_node_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "8d9f1b07cc008e77bf422e0e72b408f4")
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtFeatureNode", file: !155, line: 61, flags: DIFlagFwdDecl)
!157 = !{!0, !7, !12, !18, !23, !25, !27, !32, !37, !39, !44, !46, !51, !53, !56, !61, !66, !71, !73, !78, !80, !85, !90, !92, !97, !102, !107, !112, !117, !122, !127, !132}
!158 = !{i32 7, !"Dwarf Version", i32 5}
!159 = !{i32 2, !"Debug Info Version", i32 3}
!160 = !{i32 1, !"wchar_size", i32 4}
!161 = !{i32 8, !"PIC Level", i32 2}
!162 = !{i32 7, !"uwtable", i32 2}
!163 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!164 = distinct !DISubprogram(name: "gt_element_new", scope: !2, file: !2, line: 38, type: !165, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !137, retainedNodes: !200)
!165 = !DISubroutineType(types: !166)
!166 = !{!167, !153}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtElement", file: !169, line: 23, baseType: !170)
!169 = !DIFile(filename: "src/annotationsketch/element.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "f83ec593b7b83c3824db8252981b4151")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtElement", file: !2, line: 28, size: 640, elements: !171)
!171 = !{!172, !174, !178, !180, !181, !188, !198}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !2, line: 29, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !170, file: !2, line: 30, baseType: !175, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !176, line: 83, baseType: !177)
!176 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!177 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "strand", scope: !170, file: !2, line: 31, baseType: !179, size: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStrand", file: !140, line: 32, baseType: !139)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "gn", scope: !170, file: !2, line: 32, baseType: !153, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !170, file: !2, line: 33, baseType: !182, size: 128, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtRange", file: !183, line: 29, baseType: !184)
!183 = !DIFile(filename: "src/core/range_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "05971597f0a8f239b91be35d4168fb4b")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtRange", file: !183, line: 31, size: 128, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !184, file: !183, line: 32, baseType: !175, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !184, file: !183, line: 33, baseType: !175, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "drange", scope: !170, file: !2, line: 34, baseType: !189, size: 192, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtDrawingRange", file: !190, line: 27, baseType: !191)
!190 = !DIFile(filename: "src/annotationsketch/drawing_range.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "09398660841c2c38c0320b42a401eca7")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !190, line: 23, size: 192, elements: !192)
!192 = !{!193, !195, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !191, file: !190, line: 25, baseType: !194, size: 64)
!194 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !191, file: !190, line: 25, baseType: !194, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !191, file: !190, line: 26, baseType: !197, size: 32, offset: 128)
!197 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !170, file: !2, line: 35, baseType: !199, size: 8, offset: 576)
!199 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!200 = !{!201, !202}
!201 = !DILocalVariable(name: "node", arg: 1, scope: !164, file: !2, line: 38, type: !153)
!202 = !DILocalVariable(name: "element", scope: !164, file: !2, line: 40, type: !167)
!203 = !{!204, !204, i64 0}
!204 = !{!"any pointer", !205, i64 0}
!205 = !{!"omnipotent char", !206, i64 0}
!206 = !{!"Simple C/C++ TBAA"}
!207 = !DILocation(line: 38, column: 42, scope: !164)
!208 = !DILocation(line: 40, column: 3, scope: !164)
!209 = !DILocation(line: 40, column: 14, scope: !164)
!210 = !DILocation(line: 41, column: 3, scope: !164)
!211 = !DILocation(line: 41, column: 3, scope: !212)
!212 = distinct !DILexicalBlock(scope: !213, file: !2, line: 41, column: 3)
!213 = distinct !DILexicalBlock(scope: !164, file: !2, line: 41, column: 3)
!214 = !DILocation(line: 41, column: 3, scope: !213)
!215 = !DILocation(line: 41, column: 3, scope: !216)
!216 = distinct !DILexicalBlock(scope: !212, file: !2, line: 41, column: 3)
!217 = !DILocation(line: 42, column: 13, scope: !164)
!218 = !DILocation(line: 42, column: 11, scope: !164)
!219 = !DILocation(line: 43, column: 23, scope: !164)
!220 = !DILocation(line: 43, column: 57, scope: !164)
!221 = !DILocation(line: 43, column: 32, scope: !164)
!222 = !DILocation(line: 43, column: 3, scope: !164)
!223 = !DILocation(line: 44, column: 24, scope: !164)
!224 = !DILocation(line: 44, column: 3, scope: !164)
!225 = !DILocation(line: 44, column: 74, scope: !164)
!226 = !DILocation(line: 44, column: 33, scope: !164)
!227 = !DILocation(line: 45, column: 48, scope: !164)
!228 = !DILocation(line: 45, column: 21, scope: !164)
!229 = !DILocation(line: 45, column: 3, scope: !164)
!230 = !DILocation(line: 45, column: 12, scope: !164)
!231 = !DILocation(line: 45, column: 19, scope: !164)
!232 = !{!233, !205, i64 16}
!233 = !{!"GtElement", !204, i64 0, !234, i64 8, !205, i64 16, !204, i64 24, !235, i64 32, !236, i64 48, !239, i64 72}
!234 = !{!"long", !205, i64 0}
!235 = !{!"GtRange", !234, i64 0, !234, i64 8}
!236 = !{!"", !237, i64 0, !237, i64 8, !238, i64 16}
!237 = !{!"double", !205, i64 0}
!238 = !{!"int", !205, i64 0}
!239 = !{!"_Bool", !205, i64 0}
!240 = !DILocation(line: 46, column: 45, scope: !164)
!241 = !DILocation(line: 46, column: 19, scope: !164)
!242 = !DILocation(line: 46, column: 3, scope: !164)
!243 = !DILocation(line: 46, column: 12, scope: !164)
!244 = !DILocation(line: 46, column: 17, scope: !164)
!245 = !{!233, !239, i64 72}
!246 = !DILocation(line: 47, column: 69, scope: !164)
!247 = !DILocation(line: 47, column: 34, scope: !164)
!248 = !DILocation(line: 47, column: 3, scope: !164)
!249 = !DILocation(line: 47, column: 12, scope: !164)
!250 = !DILocation(line: 47, column: 15, scope: !164)
!251 = !{!233, !204, i64 24}
!252 = !DILocation(line: 48, column: 10, scope: !164)
!253 = !DILocation(line: 49, column: 1, scope: !164)
!254 = !DILocation(line: 48, column: 3, scope: !164)
!255 = !DISubprogram(name: "fprintf", scope: !256, file: !256, line: 350, type: !257, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!256 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!257 = !DISubroutineType(types: !258)
!258 = !{!197, !259, !318, null}
!259 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !262, line: 7, baseType: !263)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !264, line: 49, size: 1728, elements: !265)
!264 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!265 = !{!266, !267, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !282, !284, !285, !286, !290, !292, !294, !298, !301, !303, !306, !309, !310, !312, !315, !316}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !263, file: !264, line: 51, baseType: !197, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !263, file: !264, line: 54, baseType: !268, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !263, file: !264, line: 55, baseType: !268, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !263, file: !264, line: 56, baseType: !268, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !263, file: !264, line: 57, baseType: !268, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !263, file: !264, line: 58, baseType: !268, size: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !263, file: !264, line: 59, baseType: !268, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !263, file: !264, line: 60, baseType: !268, size: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !263, file: !264, line: 61, baseType: !268, size: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !263, file: !264, line: 64, baseType: !268, size: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !263, file: !264, line: 65, baseType: !268, size: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !263, file: !264, line: 66, baseType: !268, size: 64, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !263, file: !264, line: 68, baseType: !280, size: 64, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !264, line: 36, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !263, file: !264, line: 70, baseType: !283, size: 64, offset: 832)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !263, file: !264, line: 72, baseType: !197, size: 32, offset: 896)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !263, file: !264, line: 73, baseType: !197, size: 32, offset: 928)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !263, file: !264, line: 74, baseType: !287, size: 64, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !288, line: 152, baseType: !289)
!288 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!289 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !263, file: !264, line: 77, baseType: !291, size: 16, offset: 1024)
!291 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !263, file: !264, line: 78, baseType: !293, size: 8, offset: 1040)
!293 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !263, file: !264, line: 79, baseType: !295, size: 8, offset: 1048)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 1)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !263, file: !264, line: 81, baseType: !299, size: 64, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !264, line: 43, baseType: null)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !263, file: !264, line: 89, baseType: !302, size: 64, offset: 1152)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !288, line: 153, baseType: !289)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !263, file: !264, line: 91, baseType: !304, size: 64, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !264, line: 37, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !263, file: !264, line: 92, baseType: !307, size: 64, offset: 1280)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !264, line: 38, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !263, file: !264, line: 93, baseType: !283, size: 64, offset: 1344)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !263, file: !264, line: 94, baseType: !311, size: 64, offset: 1408)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !263, file: !264, line: 95, baseType: !313, size: 64, offset: 1472)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !314, line: 70, baseType: !177)
!314 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !263, file: !264, line: 96, baseType: !197, size: 32, offset: 1536)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !263, file: !264, line: 98, baseType: !317, size: 160, offset: 1568)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !42)
!318 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !173)
!319 = !DISubprogram(name: "abort", scope: !320, file: !320, line: 598, type: !321, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!320 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!321 = !DISubroutineType(types: !322)
!322 = !{null}
!323 = distinct !DISubprogram(name: "gt_element_new_empty", scope: !2, file: !2, line: 58, type: !324, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !137)
!324 = !DISubroutineType(types: !325)
!325 = !{!167}
!326 = !DILocation(line: 60, column: 10, scope: !323)
!327 = !DILocation(line: 60, column: 3, scope: !323)
!328 = distinct !DISubprogram(name: "gt_element_set_type", scope: !2, file: !2, line: 81, type: !329, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !137, retainedNodes: !331)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !167, !173}
!331 = !{!332, !333}
!332 = !DILocalVariable(name: "element", arg: 1, scope: !328, file: !2, line: 81, type: !167)
!333 = !DILocalVariable(name: "type", arg: 2, scope: !328, file: !2, line: 81, type: !173)
!334 = !DILocation(line: 81, column: 37, scope: !328)
!335 = !DILocation(line: 81, column: 58, scope: !328)
!336 = !DILocation(line: 83, column: 3, scope: !328)
!337 = !DILocation(line: 83, column: 3, scope: !338)
!338 = distinct !DILexicalBlock(scope: !339, file: !2, line: 83, column: 3)
!339 = distinct !DILexicalBlock(scope: !328, file: !2, line: 83, column: 3)
!340 = !DILocation(line: 83, column: 3, scope: !339)
!341 = !DILocation(line: 83, column: 3, scope: !342)
!342 = distinct !DILexicalBlock(scope: !338, file: !2, line: 83, column: 3)
!343 = !DILocation(line: 84, column: 19, scope: !328)
!344 = !DILocation(line: 84, column: 3, scope: !328)
!345 = !DILocation(line: 84, column: 12, scope: !328)
!346 = !DILocation(line: 84, column: 17, scope: !328)
!347 = !{!233, !204, i64 0}
!348 = !DILocation(line: 85, column: 1, scope: !328)
!349 = !DISubprogram(name: "gt_feature_node_get_type", scope: !155, file: !155, line: 112, type: !350, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DISubroutineType(types: !351)
!351 = !{!173, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!354 = distinct !DISubprogram(name: "gt_element_set_range", scope: !2, file: !2, line: 69, type: !355, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !137, retainedNodes: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !167, !182}
!357 = !{!358, !359}
!358 = !DILocalVariable(name: "element", arg: 1, scope: !354, file: !2, line: 69, type: !167)
!359 = !DILocalVariable(name: "r", arg: 2, scope: !354, file: !2, line: 69, type: !182)
!360 = !DILocation(line: 69, column: 38, scope: !354)
!361 = !DILocation(line: 69, column: 55, scope: !354)
!362 = !DILocation(line: 71, column: 3, scope: !354)
!363 = !DILocation(line: 71, column: 3, scope: !364)
!364 = distinct !DILexicalBlock(scope: !365, file: !2, line: 71, column: 3)
!365 = distinct !DILexicalBlock(scope: !354, file: !2, line: 71, column: 3)
!366 = !DILocation(line: 71, column: 3, scope: !365)
!367 = !DILocation(line: 71, column: 3, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !2, line: 71, column: 3)
!369 = !DILocation(line: 72, column: 3, scope: !354)
!370 = !DILocation(line: 72, column: 12, scope: !354)
!371 = !DILocation(line: 72, column: 20, scope: !354)
!372 = !{i64 0, i64 8, !373, i64 8, i64 8, !373}
