; ModuleID = 'samples/458.bc'
source_filename = "src/core/xbzlib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [41 x i8] c"BZ2_bzopen(): cannot open file '%s': %s\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [41 x i8] c"cannot put character to compressed file\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [38 x i8] c"cannot put string to compressed file\0A\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [34 x i8] c"cannot read from compressed file\0A\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [4 x i8] c"buf\00", align 1, !dbg !24
@__func__.gt_xbzwrite = private unnamed_addr constant [12 x i8] c"gt_xbzwrite\00", align 1, !dbg !29
@.str.6 = private unnamed_addr constant [18 x i8] c"src/core/xbzlib.c\00", align 1, !dbg !35
@.str.7 = private unnamed_addr constant [33 x i8] c"cannot write it compressed file\0A\00", align 1, !dbg !40


!23 = !DISubrange(count: 297)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 4)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, elements: !33)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!33 = !{!34}
!34 = !DISubrange(count: 12)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 18)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(scope: null, file: !2, line: 84, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 33)
!45 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !46, globals: !48, splitDebugInlining: false, nameTableKind: None)
!46 = !{!4, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!48 = !{!0, !7, !9, !14, !19, !24, !29, !35, !40}
!49 = !{i32 7, !"Dwarf Version", i32 5}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = !{i32 8, !"PIC Level", i32 2}
!53 = !{i32 7, !"uwtable", i32 2}
!54 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!55 = distinct !DISubprogram(name: "gt_xbzopen", scope: !2, file: !2, line: 25, type: !56, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !45, retainedNodes: !62)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !61, !61}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "BZFILE", file: !60, line: 137, baseType: null)
!60 = !DIFile(filename: "src/external/bzip2-1.0.6/bzlib.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "99d0b7adebfb15e0cd62c628cdb8946d")
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!62 = !{!63, !64, !65}
!63 = !DILocalVariable(name: "path", arg: 1, scope: !55, file: !2, line: 25, type: !61)
!64 = !DILocalVariable(name: "mode", arg: 2, scope: !55, file: !2, line: 25, type: !61)
!65 = !DILocalVariable(name: "file", scope: !55, file: !2, line: 27, type: !58)
!66 = !{!67, !67, i64 0}
!67 = !{!"any pointer", !68, i64 0}
!68 = !{!"omnipotent char", !69, i64 0}
!69 = !{!"Simple C/C++ TBAA"}
!70 = !DILocation(line: 25, column: 32, scope: !55)
!71 = !DILocation(line: 25, column: 50, scope: !55)
!72 = !DILocation(line: 27, column: 3, scope: !55)
!73 = !DILocation(line: 27, column: 11, scope: !55)
!74 = !DILocation(line: 28, column: 27, scope: !75)
!75 = distinct !DILexicalBlock(scope: !55, file: !2, line: 28, column: 7)
!76 = !DILocation(line: 28, column: 33, scope: !75)
!77 = !DILocation(line: 28, column: 16, scope: !75)
!78 = !DILocation(line: 28, column: 14, scope: !75)
!79 = !DILocation(line: 28, column: 7, scope: !55)
!80 = !DILocation(line: 29, column: 13, scope: !81)
!81 = distinct !DILexicalBlock(scope: !75, file: !2, line: 28, column: 41)
!82 = !DILocation(line: 29, column: 66, scope: !81)
!83 = !DILocation(line: 30, column: 22, scope: !81)
!84 = !{!85, !85, i64 0}
!85 = !{!"int", !68, i64 0}
!86 = !DILocation(line: 30, column: 13, scope: !81)
!87 = !DILocation(line: 29, column: 5, scope: !81)
!88 = !DILocation(line: 31, column: 5, scope: !81)
!89 = !DILocation(line: 33, column: 10, scope: !55)
!90 = !DILocation(line: 34, column: 1, scope: !55)
!91 = !DILocation(line: 33, column: 3, scope: !55)
!92 = !DISubprogram(name: "BZ2_bzopen", scope: !60, file: !60, line: 238, type: !56, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!93 = !DISubprogram(name: "fprintf", scope: !94, file: !94, line: 350, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!94 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !98, !159, null}
!97 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !101, line: 7, baseType: !102)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !103, line: 49, size: 1728, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !120, !122, !123, !124, !128, !130, !132, !136, !139, !141, !144, !147, !148, !150, !154, !155}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !102, file: !103, line: 51, baseType: !97, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !102, file: !103, line: 54, baseType: !47, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !102, file: !103, line: 55, baseType: !47, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !102, file: !103, line: 56, baseType: !47, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !102, file: !103, line: 57, baseType: !47, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !102, file: !103, line: 58, baseType: !47, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !102, file: !103, line: 59, baseType: !47, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !102, file: !103, line: 60, baseType: !47, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !102, file: !103, line: 61, baseType: !47, size: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !102, file: !103, line: 64, baseType: !47, size: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !102, file: !103, line: 65, baseType: !47, size: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !102, file: !103, line: 66, baseType: !47, size: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !102, file: !103, line: 68, baseType: !118, size: 64, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !103, line: 36, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !102, file: !103, line: 70, baseType: !121, size: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !102, file: !103, line: 72, baseType: !97, size: 32, offset: 896)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !102, file: !103, line: 73, baseType: !97, size: 32, offset: 928)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !102, file: !103, line: 74, baseType: !125, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !126, line: 152, baseType: !127)
!126 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!127 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !102, file: !103, line: 77, baseType: !129, size: 16, offset: 1024)
!129 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !102, file: !103, line: 78, baseType: !131, size: 8, offset: 1040)
!131 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !102, file: !103, line: 79, baseType: !133, size: 8, offset: 1048)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 1)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !102, file: !103, line: 81, baseType: !137, size: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !103, line: 43, baseType: null)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !102, file: !103, line: 89, baseType: !140, size: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !126, line: 153, baseType: !127)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !102, file: !103, line: 91, baseType: !142, size: 64, offset: 1216)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !103, line: 37, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !102, file: !103, line: 92, baseType: !145, size: 64, offset: 1280)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !103, line: 38, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !102, file: !103, line: 93, baseType: !121, size: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !102, file: !103, line: 94, baseType: !149, size: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !102, file: !103, line: 95, baseType: !151, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 70, baseType: !153)
!152 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!153 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !102, file: !103, line: 96, baseType: !97, size: 32, offset: 1536)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !102, file: !103, line: 98, baseType: !156, size: 160, offset: 1568)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 20)
!159 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!160 = !DISubprogram(name: "strerror", scope: !161, file: !161, line: 419, type: !162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!161 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!162 = !DISubroutineType(types: !163)
!163 = !{!47, !97}
!164 = !DISubprogram(name: "__errno_location", scope: !165, file: !165, line: 37, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!165 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!166 = !DISubroutineType(types: !167)
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!169 = !DISubprogram(name: "exit", scope: !170, file: !170, line: 624, type: !171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!170 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!171 = !DISubroutineType(types: !172)
!172 = !{null, !97}
!173 = distinct !DISubprogram(name: "gt_xbzfgetc", scope: !2, file: !2, line: 36, type: !174, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !45, retainedNodes: !176)
!174 = !DISubroutineType(types: !175)
!175 = !{!97, !58}
!176 = !{!177, !178}
!177 = !DILocalVariable(name: "bzfile", arg: 1, scope: !173, file: !2, line: 36, type: !58)
!178 = !DILocalVariable(name: "c", scope: !173, file: !2, line: 38, type: !4)
!179 = !DILocation(line: 36, column: 25, scope: !173)
!180 = !DILocation(line: 38, column: 3, scope: !173)
!181 = !DILocation(line: 38, column: 8, scope: !173)
!182 = !DILocation(line: 39, column: 21, scope: !173)
!183 = !DILocation(line: 39, column: 10, scope: !173)
!184 = !DILocation(line: 39, column: 38, scope: !173)
!185 = !{!68, !68, i64 0}
!186 = !DILocation(line: 40, column: 1, scope: !173)
!187 = !DILocation(line: 39, column: 3, scope: !173)
!188 = distinct !DISubprogram(name: "gt_xbzread", scope: !2, file: !2, line: 70, type: !189, scopeLine: 71, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !45, retainedNodes: !192)
!189 = !DISubroutineType(types: !190)
!190 = !{!97, !58, !149, !191}
!191 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!192 = !{!193, !194, !195, !196}
!193 = !DILocalVariable(name: "file", arg: 1, scope: !188, file: !2, line: 70, type: !58)
!194 = !DILocalVariable(name: "buf", arg: 2, scope: !188, file: !2, line: 70, type: !149)
!195 = !DILocalVariable(name: "len", arg: 3, scope: !188, file: !2, line: 70, type: !191)
!196 = !DILocalVariable(name: "rval", scope: !188, file: !2, line: 72, type: !97)
!197 = !DILocation(line: 70, column: 24, scope: !188)
!198 = !DILocation(line: 70, column: 36, scope: !188)
!199 = !DILocation(line: 70, column: 50, scope: !188)
!200 = !DILocation(line: 72, column: 3, scope: !188)
!201 = !DILocation(line: 72, column: 7, scope: !188)
!202 = !DILocation(line: 73, column: 26, scope: !203)
!203 = distinct !DILexicalBlock(scope: !188, file: !2, line: 73, column: 7)
!204 = !DILocation(line: 73, column: 32, scope: !203)
!205 = !DILocation(line: 73, column: 37, scope: !203)
!206 = !DILocation(line: 73, column: 15, scope: !203)
!207 = !DILocation(line: 73, column: 13, scope: !203)
!208 = !DILocation(line: 73, column: 43, scope: !203)
!209 = !DILocation(line: 73, column: 7, scope: !188)
!210 = !DILocation(line: 74, column: 13, scope: !211)
!211 = distinct !DILexicalBlock(scope: !203, file: !2, line: 73, column: 50)
