; ModuleID = 'samples/460.bc'
source_filename = "src/core/ext/upb-generated/envoy/admin/v3/config_dump_shared.upb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.upb_MiniTable_Sub = type { ptr }
%struct.upb_MiniTable_Field = type { i32, i16, i16, i16, i8, i8 }
%struct.upb_MiniTable = type { ptr, ptr, i16, i16, i8, i8, i8, i8, [0 x %struct._upb_FastTable_Entry] }
%struct._upb_FastTable_Entry = type { i64, ptr }
%struct.upb_MiniTable_File = type { ptr, ptr, ptr, i32, i32, i32 }

@envoy_admin_v3_UpdateFailureState_submsgs = internal constant [2 x %union.upb_MiniTable_Sub] [%union.upb_MiniTable_Sub { ptr @google_protobuf_Any_msginit }, %union.upb_MiniTable_Sub { ptr @google_protobuf_Timestamp_msginit }], align 16, !dbg !0
@envoy_admin_v3_UpdateFailureState__fields = internal constant [4 x %struct.upb_MiniTable_Field] [%struct.upb_MiniTable_Field { i32 1, i16 8, i16 1, i16 0, i8 11, i8 98 }, %struct.upb_MiniTable_Field { i32 2, i16 16, i16 2, i16 1, i8 11, i8 98 }, %struct.upb_MiniTable_Field { i32 3, i16 24, i16 0, i16 -1, i8 9, i8 66 }, %struct.upb_MiniTable_Field { i32 4, i16 40, i16 0, i16 -1, i8 9, i8 66 }], align 16, !dbg !153

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "envoy_admin_v3_UpdateFailureState_submsgs", scope: !2, file: !3, line: 19, type: !160, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !11, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/core/ext/upb-generated/envoy/admin/v3/config_dump_shared.upb.c", directory: "/local-ssd/py-grpcio-ona3o4hxrwcumc5bj36xxurhwz2hlb4f-build/aidengro/spack-stage-py-grpcio-1.52.0-ona3o4hxrwcumc5bj36xxurhwz2hlb4f/spack-src", checksumkind: CSK_MD5, checksum: "65f01bf3da6ed5caecabf493771e1e47")
!4 = !{!5, !6}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !7, line: 25, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !9, line: 40, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!10 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!11 = !{!12, !97, !99, !101, !103, !105, !107, !109, !111, !113, !115, !117, !119, !121, !123, !125, !127, !129, !0, !153, !158, !163, !168, !170, !173, !175, !177, !180, !185, !188, !190, !192, !194, !196, !201, !203, !205, !207, !209, !211, !213, !215, !217, !219, !221, !223, !225, !227, !229, !231, !233, !235, !237}
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "envoy_admin_v3_UpdateFailureState_msginit", scope: !2, file: !3, line: 31, type: !14, isLocal: false, isDefinition: true)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable", file: !16, line: 54, baseType: !17)
!16 = !DIFile(filename: "third_party/upb/upb/msg.h", directory: "/local-ssd/py-grpcio-ona3o4hxrwcumc5bj36xxurhwz2hlb4f-build/aidengro/spack-stage-py-grpcio-1.52.0-ona3o4hxrwcumc5bj36xxurhwz2hlb4f/spack-src", checksumkind: CSK_MD5, checksum: "bd85072d28b38de71402a2fc88a45678")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upb_MiniTable", file: !18, line: 174, size: 192, elements: !19)
!18 = !DIFile(filename: "third_party/upb/upb/msg_internal.h", directory: "/local-ssd/py-grpcio-ona3o4hxrwcumc5bj36xxurhwz2hlb4f-build/aidengro/spack-stage-py-grpcio-1.52.0-ona3o4hxrwcumc5bj36xxurhwz2hlb4f/spack-src", checksumkind: CSK_MD5, checksum: "230d56cd9ef81e26bc203e59aa64fab1")
!19 = !{!20, !47, !68, !69, !70, !71, !72, !73, !74}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !17, file: !18, line: 175, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable_Sub", file: !18, line: 146, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !18, line: 143, size: 64, elements: !25)
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "submsg", scope: !24, file: !18, line: 144, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "subenum", scope: !24, file: !18, line: 145, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable_Enum", file: !18, line: 141, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 137, size: 192, elements: !34)
!34 = !{!35, !42, !46}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !33, file: !18, line: 138, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !39, line: 26, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !9, line: 41, baseType: !41)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !33, file: !18, line: 139, baseType: !43, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !7, line: 27, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !9, line: 45, baseType: !45)
!45 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "value_count", scope: !33, file: !18, line: 140, baseType: !41, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !17, file: !18, line: 176, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable_Field", file: !18, line: 80, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 72, size: 96, elements: !52)
!52 = !{!53, !57, !58, !62, !63, !67}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !51, file: !18, line: 73, baseType: !54, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 26, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !9, line: 42, baseType: !56)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !51, file: !18, line: 74, baseType: !6, size: 16, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "presence", scope: !51, file: !18, line: 75, baseType: !59, size: 16, offset: 48)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !39, line: 25, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !9, line: 39, baseType: !61)
!61 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "submsg_index", scope: !51, file: !18, line: 76, baseType: !6, size: 16, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "descriptortype", scope: !51, file: !18, line: 77, baseType: !64, size: 8, offset: 80)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !7, line: 24, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !9, line: 38, baseType: !66)
!66 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !51, file: !18, line: 78, baseType: !64, size: 8, offset: 88)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !18, line: 179, baseType: !6, size: 16, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "field_count", scope: !17, file: !18, line: 180, baseType: !6, size: 16, offset: 144)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !17, file: !18, line: 181, baseType: !64, size: 8, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dense_below", scope: !17, file: !18, line: 182, baseType: !64, size: 8, offset: 168)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "table_mask", scope: !17, file: !18, line: 183, baseType: !64, size: 8, offset: 176)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "required_count", scope: !17, file: !18, line: 184, baseType: !64, size: 8, offset: 184)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "fasttable", scope: !17, file: !18, line: 188, baseType: !75, offset: 192)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, elements: !95)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "_upb_FastTable_Entry", file: !18, line: 135, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 132, size: 128, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "field_data", scope: !77, file: !18, line: 133, baseType: !43, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "field_parser", scope: !77, file: !18, line: 134, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_upb_FieldParser", file: !18, line: 128, baseType: !83)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !88, !85, !90, !92, !43, !43}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "upb_Decoder", file: !18, line: 125, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_Message", file: !16, line: 49, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !93, line: 87, baseType: !94)
!93 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!94 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!95 = !{!96}
!96 = !DISubrange(count: -1)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_msginit", scope: !2, file: !3, line: 48, type: !14, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_StaticListener_msginit", scope: !2, file: !3, line: 64, type: !14, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_DynamicListenerState_msginit", scope: !2, file: !3, line: 81, type: !14, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_DynamicListener_msginit", scope: !2, file: !3, line: 103, type: !14, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ClustersConfigDump_msginit", scope: !2, file: !3, line: 122, type: !14, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ClustersConfigDump_StaticCluster_msginit", scope: !2, file: !3, line: 138, type: !14, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ClustersConfigDump_DynamicCluster_msginit", scope: !2, file: !3, line: 158, type: !14, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "envoy_admin_v3_RoutesConfigDump_msginit", scope: !2, file: !3, line: 174, type: !14, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "envoy_admin_v3_RoutesConfigDump_StaticRouteConfig_msginit", scope: !2, file: !3, line: 190, type: !14, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "envoy_admin_v3_RoutesConfigDump_DynamicRouteConfig_msginit", scope: !2, file: !3, line: 210, type: !14, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ScopedRoutesConfigDump_msginit", scope: !2, file: !3, line: 226, type: !14, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ScopedRoutesConfigDump_InlineScopedRouteConfigs_msginit", scope: !2, file: !3, line: 243, type: !14, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ScopedRoutesConfigDump_DynamicScopedRouteConfigs_msginit", scope: !2, file: !3, line: 264, type: !14, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "envoy_admin_v3_EndpointsConfigDump_msginit", scope: !2, file: !3, line: 280, type: !14, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "envoy_admin_v3_EndpointsConfigDump_StaticEndpointConfig_msginit", scope: !2, file: !3, line: 296, type: !14, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "envoy_admin_v3_EndpointsConfigDump_DynamicEndpointConfig_msginit", scope: !2, file: !3, line: 316, type: !14, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "envoy_admin_v3_config_dump_shared_proto_upb_file_layout", scope: !2, file: !3, line: 342, type: !131, isLocal: false, isDefinition: true)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable_File", file: !18, line: 204, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 197, size: 320, elements: !134)
!134 = !{!135, !138, !140, !150, !151, !152}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "msgs", scope: !133, file: !18, line: 198, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "enums", scope: !133, file: !18, line: 199, baseType: !139, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "exts", scope: !133, file: !18, line: 200, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable_Extension", file: !18, line: 195, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 191, size: 256, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !145, file: !18, line: 192, baseType: !50, size: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "extendee", scope: !145, file: !18, line: 193, baseType: !137, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !145, file: !18, line: 194, baseType: !23, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "msg_count", scope: !133, file: !18, line: 201, baseType: !41, size: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "enum_count", scope: !133, file: !18, line: 202, baseType: !41, size: 32, offset: 224)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ext_count", scope: !133, file: !18, line: 203, baseType: !41, size: 32, offset: 256)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "envoy_admin_v3_UpdateFailureState__fields", scope: !2, file: !3, line: 24, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 384, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 4)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_submsgs", scope: !2, file: !3, line: 37, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 2)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump__fields", scope: !2, file: !3, line: 42, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 288, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 3)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_StaticListener_submsgs", scope: !2, file: !3, line: 54, type: !160, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_StaticListener__fields", scope: !2, file: !3, line: 59, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 192, elements: !161)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_DynamicListenerState_submsgs", scope: !2, file: !3, line: 70, type: !160, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_DynamicListenerState__fields", scope: !2, file: !3, line: 75, type: !165, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_DynamicListener_submsgs", scope: !2, file: !3, line: 87, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 256, elements: !156)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ListenersConfigDump_DynamicListener__fields", scope: !2, file: !3, line: 94, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 576, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 6)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ClustersConfigDump_submsgs", scope: !2, file: !3, line: 109, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 192, elements: !166)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ClustersConfigDump__fields", scope: !2, file: !3, line: 115, type: !155, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "envoy_admin_v3_ClustersConfigDump_StaticCluster_submsgs", scope: !2, file: !3, line: 128, type: !160, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
