; ModuleID = 'samples/478.bc'
source_filename = "samplerate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SRC_PRIVATE_tag = type { double, double, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr }
%struct.SRC_DATA = type { ptr, ptr, i64, i64, i64, i64, i32, double }

@.str = private unnamed_addr constant [54 x i8] c"libsamplerate-0.1.9 (c) 2002-2008 Erik de Castro Lopo\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [10 x i8] c"No error.\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [15 x i8] c"Malloc failed.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [27 x i8] c"SRC_STATE pointer is NULL.\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [26 x i8] c"SRC_DATA pointer is NULL.\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [49 x i8] c"SRC_DATA->data_out or SRC_DATA->data_in is NULL.\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [33 x i8] c"Internal error. No private data.\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [38 x i8] c"SRC ratio outside [1/256, 256] range.\00", align 1, !dbg !37
@.str.8 = private unnamed_addr constant [55 x i8] c"src_process() called without reset after end_of_input.\00", align 1, !dbg !42
@.str.9 = private unnamed_addr constant [36 x i8] c"Internal error. No process pointer.\00", align 1, !dbg !47

!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 44)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(scope: null, file: !2, line: 415, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 71)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !2, line: 417, type: !95, isLocal: true, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 59)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !44, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !2, line: 421, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 48)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 423, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 51)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(scope: null, file: !2, line: 426, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 53)
!115 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !116, retainedTypes: !151, globals: !206, splitDebugInlining: false, nameTableKind: None)
!116 = !{!117, !145}
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !118, line: 62, baseType: !119, size: 32, elements: !120)
!118 = !DIFile(filename: "./common.h", directory: "/local-ssd/libsamplerate-7ognhrgyu53tdwtmng3bd4pksqnapcxz-build/aidengro/spack-stage-libsamplerate-0.1.9-7ognhrgyu53tdwtmng3bd4pksqnapcxz/spack-src/src", checksumkind: CSK_MD5, checksum: "af94f54890c37cba0b080de67ba84329")
!119 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!121 = !DIEnumerator(name: "SRC_ERR_NO_ERROR", value: 0)
!122 = !DIEnumerator(name: "SRC_ERR_MALLOC_FAILED", value: 1)
!123 = !DIEnumerator(name: "SRC_ERR_BAD_STATE", value: 2)
!124 = !DIEnumerator(name: "SRC_ERR_BAD_DATA", value: 3)
!125 = !DIEnumerator(name: "SRC_ERR_BAD_DATA_PTR", value: 4)
!126 = !DIEnumerator(name: "SRC_ERR_NO_PRIVATE", value: 5)
!127 = !DIEnumerator(name: "SRC_ERR_BAD_SRC_RATIO", value: 6)
!128 = !DIEnumerator(name: "SRC_ERR_BAD_PROC_PTR", value: 7)
!129 = !DIEnumerator(name: "SRC_ERR_SHIFT_BITS", value: 8)
!130 = !DIEnumerator(name: "SRC_ERR_FILTER_LEN", value: 9)
!131 = !DIEnumerator(name: "SRC_ERR_BAD_CONVERTER", value: 10)
!132 = !DIEnumerator(name: "SRC_ERR_BAD_CHANNEL_COUNT", value: 11)
!133 = !DIEnumerator(name: "SRC_ERR_SINC_BAD_BUFFER_LEN", value: 12)
!134 = !DIEnumerator(name: "SRC_ERR_SIZE_INCOMPATIBILITY", value: 13)
!135 = !DIEnumerator(name: "SRC_ERR_BAD_PRIV_PTR", value: 14)
!136 = !DIEnumerator(name: "SRC_ERR_BAD_SINC_STATE", value: 15)
!137 = !DIEnumerator(name: "SRC_ERR_DATA_OVERLAP", value: 16)
!138 = !DIEnumerator(name: "SRC_ERR_BAD_CALLBACK", value: 17)
!139 = !DIEnumerator(name: "SRC_ERR_BAD_MODE", value: 18)
!140 = !DIEnumerator(name: "SRC_ERR_NULL_CALLBACK", value: 19)
!141 = !DIEnumerator(name: "SRC_ERR_NO_VARIABLE_RATIO", value: 20)
!142 = !DIEnumerator(name: "SRC_ERR_SINC_PREPARE_DATA_BAD_LEN", value: 21)
!143 = !DIEnumerator(name: "SRC_ERR_BAD_INTERNAL_STATE", value: 22)
!144 = !DIEnumerator(name: "SRC_ERR_MAX_ERROR", value: 23)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !118, line: 54, baseType: !119, size: 32, elements: !146)
!146 = !{!147, !148, !149, !150}
!147 = !DIEnumerator(name: "SRC_FALSE", value: 0)
!148 = !DIEnumerator(name: "SRC_TRUE", value: 1)
!149 = !DIEnumerator(name: "SRC_MODE_PROCESS", value: 555)
!150 = !DIEnumerator(name: "SRC_MODE_CALLBACK", value: 556)
!151 = !{!152, !153, !157, !181, !205}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "SRC_STATE", file: !155, line: 23, baseType: !156)
!155 = !DIFile(filename: "./samplerate.h", directory: "/local-ssd/libsamplerate-7ognhrgyu53tdwtmng3bd4pksqnapcxz-build/aidengro/spack-stage-libsamplerate-0.1.9-7ognhrgyu53tdwtmng3bd4pksqnapcxz/spack-src/src", checksumkind: CSK_MD5, checksum: "df663b9c0c4943a64ee8f8faf7c9eb40")
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "SRC_STATE_tag", file: !155, line: 23, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "SRC_PRIVATE", file: !118, line: 118, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SRC_PRIVATE_tag", file: !118, line: 92, size: 768, elements: !160)
!160 = !{!161, !163, !164, !166, !167, !168, !169, !191, !192, !196, !202, !203, !204}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "last_ratio", scope: !159, file: !118, line: 93, baseType: !162, size: 64)
!162 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "last_position", scope: !159, file: !118, line: 93, baseType: !162, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !159, file: !118, line: 95, baseType: !165, size: 32, offset: 128)
!165 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !159, file: !118, line: 96, baseType: !165, size: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !159, file: !118, line: 99, baseType: !165, size: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !159, file: !118, line: 102, baseType: !152, size: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "vari_process", scope: !159, file: !118, line: 105, baseType: !170, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!165, !173, !174}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "SRC_DATA", file: !155, line: 36, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 26, size: 512, elements: !177)
!177 = !{!178, !182, !184, !186, !187, !188, !189, !190}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "data_in", scope: !176, file: !155, line: 27, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data_out", scope: !176, file: !155, line: 28, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "input_frames", scope: !176, file: !155, line: 30, baseType: !185, size: 64, offset: 128)
!185 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "output_frames", scope: !176, file: !155, line: 30, baseType: !185, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "input_frames_used", scope: !176, file: !155, line: 31, baseType: !185, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "output_frames_gen", scope: !176, file: !155, line: 31, baseType: !185, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "end_of_input", scope: !176, file: !155, line: 33, baseType: !165, size: 32, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "src_ratio", scope: !176, file: !155, line: 35, baseType: !162, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "const_process", scope: !159, file: !118, line: 108, baseType: !170, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !159, file: !118, line: 111, baseType: !193, size: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !173}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "callback_func", scope: !159, file: !118, line: 114, baseType: !197, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "src_callback_t", file: !155, line: 47, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!185, !152, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "user_callback_data", scope: !159, file: !118, line: 115, baseType: !152, size: 64, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "saved_frames", scope: !159, file: !118, line: 116, baseType: !185, size: 64, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "saved_data", scope: !159, file: !118, line: 117, baseType: !179, size: 64, offset: 704)
!205 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!206 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !54, !59, !64, !69, !71, !76, !81, !83, !88, !93, !98, !100, !105, !110}
!207 = !{i32 7, !"Dwarf Version", i32 5}
!208 = !{i32 2, !"Debug Info Version", i32 3}
!209 = !{i32 1, !"wchar_size", i32 4}
!210 = !{i32 8, !"PIC Level", i32 2}
!211 = !{i32 7, !"uwtable", i32 2}
!212 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!213 = distinct !DISubprogram(name: "src_new", scope: !2, file: !2, line: 23, type: !214, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !115, retainedNodes: !217)
!214 = !DISubroutineType(types: !215)
!215 = !{!153, !165, !165, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!217 = !{!218, !219, !220, !221}
!218 = !DILocalVariable(name: "converter_type", arg: 1, scope: !213, file: !2, line: 23, type: !165)
!219 = !DILocalVariable(name: "channels", arg: 2, scope: !213, file: !2, line: 23, type: !165)
!220 = !DILocalVariable(name: "error", arg: 3, scope: !213, file: !2, line: 23, type: !216)
!221 = !DILocalVariable(name: "psrc", scope: !213, file: !2, line: 24, type: !157)
!222 = !{!223, !223, i64 0}
!223 = !{!"int", !224, i64 0}
!224 = !{!"omnipotent char", !225, i64 0}
!225 = !{!"Simple C/C++ TBAA"}
!226 = !DILocation(line: 23, column: 14, scope: !213)
!227 = !DILocation(line: 23, column: 34, scope: !213)
!228 = !{!229, !229, i64 0}
!229 = !{!"any pointer", !224, i64 0}
!230 = !DILocation(line: 23, column: 49, scope: !213)
!231 = !DILocation(line: 24, column: 3, scope: !213)
!232 = !DILocation(line: 24, column: 16, scope: !213)
!233 = !DILocation(line: 26, column: 6, scope: !234)
!234 = distinct !DILexicalBlock(scope: !213, file: !2, line: 26, column: 6)
!235 = !DILocation(line: 26, column: 6, scope: !213)
!236 = !DILocation(line: 27, column: 4, scope: !234)
!237 = !DILocation(line: 27, column: 10, scope: !234)
!238 = !DILocation(line: 27, column: 3, scope: !234)
!239 = !DILocation(line: 29, column: 6, scope: !240)
!240 = distinct !DILexicalBlock(scope: !213, file: !2, line: 29, column: 6)
!241 = !DILocation(line: 29, column: 15, scope: !240)
!242 = !DILocation(line: 29, column: 6, scope: !213)
!243 = !DILocation(line: 30, column: 8, scope: !244)
!244 = distinct !DILexicalBlock(scope: !245, file: !2, line: 30, column: 8)
!245 = distinct !DILexicalBlock(scope: !240, file: !2, line: 30, column: 2)
!246 = !DILocation(line: 30, column: 8, scope: !245)
!247 = !DILocation(line: 31, column: 5, scope: !244)
!248 = !DILocation(line: 31, column: 11, scope: !244)
!249 = !DILocation(line: 31, column: 4, scope: !244)
!250 = !DILocation(line: 32, column: 3, scope: !245)
!251 = !DILocation(line: 35, column: 14, scope: !252)
!252 = distinct !DILexicalBlock(scope: !213, file: !2, line: 35, column: 6)
!253 = !DILocation(line: 35, column: 12, scope: !252)
!254 = !DILocation(line: 35, column: 42, scope: !252)
!255 = !DILocation(line: 35, column: 6, scope: !213)
!256 = !DILocation(line: 36, column: 8, scope: !257)
!257 = distinct !DILexicalBlock(scope: !258, file: !2, line: 36, column: 8)
!258 = distinct !DILexicalBlock(scope: !252, file: !2, line: 36, column: 2)
!259 = !DILocation(line: 36, column: 8, scope: !258)
!260 = !DILocation(line: 37, column: 5, scope: !257)
!261 = !DILocation(line: 37, column: 11, scope: !257)
!262 = !DILocation(line: 37, column: 4, scope: !257)
!263 = !DILocation(line: 38, column: 3, scope: !258)
!264 = !DILocation(line: 41, column: 19, scope: !213)
!265 = !DILocation(line: 41, column: 2, scope: !213)
!266 = !DILocation(line: 41, column: 8, scope: !213)
!267 = !DILocation(line: 41, column: 17, scope: !213)
!268 = !{!269, !223, i64 20}
