; ModuleID = 'samples/483.bc'
source_filename = "../ngx_stream_lua-0.0.7/src/ngx_stream_lua_log.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_stream_lua_request_s = type { ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_connection_s = type { ptr, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, i32, ptr, i32, %struct.ngx_str_t, %struct.ngx_str_t, i16, ptr, ptr, ptr, i32, ptr, %struct.ngx_queue_s, i64, i64, i32 }
%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_queue_s = type { ptr, ptr }
%struct.ngx_cycle_s = type { ptr, ptr, ptr, %struct.ngx_log_s, i64, ptr, ptr, i64, ptr, i64, i64, %struct.ngx_queue_s, i64, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i64, i64, ptr, ptr, ptr, ptr, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, ptr, ptr, i32 }
%struct.ngx_log_s = type { i64, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }
%struct.ngx_rbtree_s = type { ptr, ptr, ptr }
%struct.ngx_rbtree_node_s = type { i64, ptr, ptr, ptr, i8, i8 }
%struct.ngx_list_t = type { ptr, %struct.ngx_list_part_s, i64, i64, ptr }
%struct.ngx_list_part_s = type { ptr, i64, ptr }
%struct.ngx_stream_lua_log_ringbuf_t = type { i64, ptr, ptr, ptr, ptr, i64, i64 }

!25 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 14)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !2, line: 120, type: !3, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 11)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(scope: null, file: !2, line: 175, type: !14, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(scope: null, file: !2, line: 192, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 49)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(scope: null, file: !2, line: 205, type: !45, isLocal: true, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 25)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 22)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !9, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(scope: null, file: !2, line: 298, type: !62, isLocal: true, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 7)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(scope: null, file: !2, line: 301, type: !9, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(scope: null, file: !2, line: 304, type: !9, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !2, line: 307, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 5)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !3, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(scope: null, file: !2, line: 313, type: !71, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(scope: null, file: !2, line: 316, type: !62, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(scope: null, file: !2, line: 319, type: !71, isLocal: true, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !9, isLocal: true, isDefinition: true)
!84 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !85, globals: !121, splitDebugInlining: false, nameTableKind: None)
!85 = !{!86, !106, !107, !108, !109, !92, !110, !116, !118, !103}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_lua_log_ringbuf_t", file: !88, line: 25, baseType: !89)
!88 = !DIFile(filename: "../ngx_stream_lua-0.0.7/src/ngx_stream_lua_log_ringbuf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "350109297ac1408c26b307eb225c3438")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 17, size: 448, elements: !90)
!90 = !{!91, !97, !99, !100, !101, !102, !105}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "filter_level", scope: !89, file: !88, line: 18, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !93, line: 79, baseType: !94)
!93 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !95, line: 90, baseType: !96)
!95 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!96 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !89, file: !88, line: 19, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !89, file: !88, line: 20, baseType: !98, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !88, line: 21, baseType: !98, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !89, file: !88, line: 22, baseType: !98, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !89, file: !88, line: 23, baseType: !103, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 29, baseType: !96)
!104 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !89, file: !88, line: 24, baseType: !103, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!108 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !112, line: 33, baseType: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !114, line: 31, baseType: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!115 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !112, line: 87, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !114, line: 153, baseType: !120)
!120 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!121 = !{!0, !7, !12, !17, !22, !24, !29, !31, !36, !38, !43, !48, !53, !58, !60, !65, !67, !69, !74, !76, !78, !80, !82}
!122 = !{i32 7, !"Dwarf Version", i32 5}
!123 = !{i32 2, !"Debug Info Version", i32 3}
!124 = !{i32 1, !"wchar_size", i32 4}
!125 = !{i32 8, !"PIC Level", i32 2}
!126 = !{i32 7, !"PIE Level", i32 2}
!127 = !{i32 7, !"uwtable", i32 2}
!128 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!129 = distinct !DISubprogram(name: "ngx_stream_lua_inject_log_api", scope: !2, file: !2, line: 281, type: !130, scopeLine: 282, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !136)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !134, line: 51, baseType: !135)
!134 = !DIFile(filename: "luajit-root/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/luajit/include/luajit-2.1/lua.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build", checksumkind: CSK_MD5, checksum: "255fa697efe8afbe3c913e4a8fc1e62f")
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !134, line: 51, flags: DIFlagFwdDecl)
!136 = !{!137}
!137 = !DILocalVariable(name: "L", arg: 1, scope: !129, file: !2, line: 281, type: !132)
!138 = !{!139, !139, i64 0}
!139 = !{!"any pointer", !140, i64 0}
!140 = !{!"omnipotent char", !141, i64 0}
!141 = !{!"Simple C/C++ TBAA"}
!142 = !DILocation(line: 281, column: 42, scope: !129)
!143 = !DILocation(line: 283, column: 38, scope: !129)
!144 = !DILocation(line: 283, column: 5, scope: !129)
!145 = !DILocation(line: 285, column: 5, scope: !129)
!146 = !DILocation(line: 286, column: 18, scope: !129)
!147 = !DILocation(line: 286, column: 5, scope: !129)
!148 = !DILocation(line: 288, column: 5, scope: !129)
!149 = !DILocation(line: 289, column: 5, scope: !129)
!150 = !DILocation(line: 290, column: 1, scope: !129)
!151 = distinct !DISubprogram(name: "ngx_stream_lua_inject_log_consts", scope: !2, file: !2, line: 294, type: !130, scopeLine: 295, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !152)
!152 = !{!153}
!153 = !DILocalVariable(name: "L", arg: 1, scope: !151, file: !2, line: 294, type: !132)
!154 = !DILocation(line: 294, column: 45, scope: !151)
!155 = !DILocation(line: 297, column: 21, scope: !151)
!156 = !DILocation(line: 297, column: 5, scope: !151)
!157 = !DILocation(line: 298, column: 18, scope: !151)
!158 = !DILocation(line: 298, column: 5, scope: !151)
!159 = !DILocation(line: 300, column: 21, scope: !151)
!160 = !DILocation(line: 300, column: 5, scope: !151)
!161 = !DILocation(line: 301, column: 18, scope: !151)
!162 = !DILocation(line: 301, column: 5, scope: !151)
!163 = !DILocation(line: 303, column: 21, scope: !151)
!164 = !DILocation(line: 303, column: 5, scope: !151)
!165 = !DILocation(line: 304, column: 18, scope: !151)
!166 = !DILocation(line: 304, column: 5, scope: !151)
!167 = !DILocation(line: 306, column: 21, scope: !151)
!168 = !DILocation(line: 306, column: 5, scope: !151)
!169 = !DILocation(line: 307, column: 18, scope: !151)
!170 = !DILocation(line: 307, column: 5, scope: !151)
!171 = !DILocation(line: 309, column: 21, scope: !151)
!172 = !DILocation(line: 309, column: 5, scope: !151)
!173 = !DILocation(line: 310, column: 18, scope: !151)
!174 = !DILocation(line: 310, column: 5, scope: !151)
!175 = !DILocation(line: 312, column: 21, scope: !151)
!176 = !DILocation(line: 312, column: 5, scope: !151)
!177 = !DILocation(line: 313, column: 18, scope: !151)
!178 = !DILocation(line: 313, column: 5, scope: !151)
!179 = !DILocation(line: 315, column: 21, scope: !151)
!180 = !DILocation(line: 315, column: 5, scope: !151)
!181 = !DILocation(line: 316, column: 18, scope: !151)
!182 = !DILocation(line: 316, column: 5, scope: !151)
!183 = !DILocation(line: 318, column: 21, scope: !151)
!184 = !DILocation(line: 318, column: 5, scope: !151)
!185 = !DILocation(line: 319, column: 18, scope: !151)
!186 = !DILocation(line: 319, column: 5, scope: !151)
!187 = !DILocation(line: 321, column: 21, scope: !151)
!188 = !DILocation(line: 321, column: 5, scope: !151)
!189 = !DILocation(line: 322, column: 18, scope: !151)
!190 = !DILocation(line: 322, column: 5, scope: !151)
!191 = !DILocation(line: 324, column: 1, scope: !151)
!192 = !DISubprogram(name: "lua_pushcclosure", scope: !134, file: !134, line: 169, type: !193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !132, !195, !109}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !134, line: 53, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!109, !132}
!199 = distinct !DISubprogram(name: "ngx_stream_lua_ngx_log", scope: !2, file: !2, line: 43, type: !197, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !200)
!200 = !{!201, !202, !252, !1129, !1130}
!201 = !DILocalVariable(name: "L", arg: 1, scope: !199, file: !2, line: 43, type: !132)
!202 = !DILocalVariable(name: "log", scope: !199, file: !2, line: 45, type: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !205, line: 20, baseType: !206)
!205 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1c4d8383f329aa1de050d17038ecb169")
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !207, line: 50, size: 640, elements: !208)
!207 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f35895306f847777914ce99ffeccfabd")
!208 = !{!209, !210, !231, !234, !238, !243, !244, !249, !250, !251}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !206, file: !207, line: 51, baseType: !92, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !206, file: !207, line: 52, baseType: !211, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !205, line: 21, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !214, line: 89, size: 320, elements: !215)
!214 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6ae6b72e2fd6bbb6ecc9de2e6386072c")
!215 = !{!216, !219, !226, !230}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !213, file: !214, line: 90, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !218, line: 16, baseType: !109)
!218 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "7b9a751e8c1ad1afef5467d60ed94e69")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !214, line: 91, baseType: !220, size: 128, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !221, line: 19, baseType: !222)
!221 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "aecf67ab89c624000ba2e2684dbcfdc8")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 16, size: 128, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !222, file: !221, line: 17, baseType: !103, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !222, file: !221, line: 18, baseType: !110, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !213, file: !214, line: 93, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !211, !203}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !214, line: 94, baseType: !106, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !206, file: !207, line: 54, baseType: !232, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !233, line: 98, baseType: !96)
!233 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "eac8f0294f941da9268c3a72c9fca0e1")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !206, file: !207, line: 56, baseType: !235, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !236, line: 10, baseType: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !114, line: 160, baseType: !120)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !206, file: !207, line: 58, baseType: !239, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !207, line: 45, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!110, !203, !110, !103}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !207, line: 59, baseType: !106, size: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !206, file: !207, line: 61, baseType: !245, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !207, line: 46, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !203, !92, !110, !103}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !206, file: !207, line: 62, baseType: !106, size: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !206, file: !207, line: 70, baseType: !98, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !207, line: 72, baseType: !203, size: 64, offset: 576)
!252 = !DILocalVariable(name: "r", scope: !199, file: !2, line: 46, type: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_lua_request_t", file: !255, line: 22, baseType: !256)
!255 = !DIFile(filename: "../ngx_stream_lua-0.0.7/src/ngx_stream_lua_request.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ccaa5a9459f8752c4a35875ca3232d17")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_stream_lua_request_s", file: !255, line: 27, size: 384, elements: !257)
!257 = !{!258, !618, !1113, !1114, !1123, !1128}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !256, file: !255, line: 28, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !205, line: 26, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !262, line: 124, size: 1920, elements: !263)
!262 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf513a87e959064e14502903e9282b0e")
!263 = !{!264, !265, !322, !323, !326, !334, !336, !422, !427, !503, !504, !505, !542, !543, !544, !545, !546, !547, !553, !594, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !262, line: 125, baseType: !106, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !261, file: !262, line: 126, baseType: !266, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !205, line: 24, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !269, line: 30, size: 768, elements: !270)
!269 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c79f651cc4aca504d9d912404beb8bf3")
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !299, !300, !301, !314}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !269, line: 31, baseType: !106, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !268, file: !269, line: 33, baseType: !108, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !268, file: !269, line: 35, baseType: !108, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !268, file: !269, line: 38, baseType: !108, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !268, file: !269, line: 44, baseType: !108, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !268, file: !269, line: 46, baseType: !108, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !268, file: !269, line: 49, baseType: !108, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !268, file: !269, line: 51, baseType: !108, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !268, file: !269, line: 54, baseType: !108, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !268, file: !269, line: 56, baseType: !108, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !268, file: !269, line: 57, baseType: !108, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !268, file: !269, line: 59, baseType: !108, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !268, file: !269, line: 60, baseType: !108, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !268, file: !269, line: 62, baseType: !108, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !268, file: !269, line: 64, baseType: !108, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !268, file: !269, line: 67, baseType: !108, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !268, file: !269, line: 69, baseType: !108, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !268, file: !269, line: 71, baseType: !108, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !268, file: !269, line: 74, baseType: !108, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !268, file: !269, line: 75, baseType: !108, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "skip_socket_leak_check", scope: !268, file: !269, line: 77, baseType: !108, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !268, file: !269, line: 80, baseType: !108, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !268, file: !269, line: 110, baseType: !108, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !268, file: !269, line: 113, baseType: !295, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !205, line: 32, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !266}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !268, file: !269, line: 120, baseType: !92, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !268, file: !269, line: 122, baseType: !203, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !268, file: !269, line: 124, baseType: !302, size: 320, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !303, line: 20, baseType: !304)
!303 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ee5b3151c1c48b156833d321f8e1946a")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !303, line: 22, size: 320, elements: !305)
!305 = !{!306, !308, !310, !311, !312, !313}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !304, file: !303, line: 23, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !303, line: 16, baseType: !92)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !304, file: !303, line: 24, baseType: !309, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !304, file: !303, line: 25, baseType: !309, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !304, file: !303, line: 26, baseType: !309, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !304, file: !303, line: 27, baseType: !111, size: 8, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !303, line: 28, baseType: !111, size: 8, offset: 264)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !268, file: !269, line: 127, baseType: !315, size: 128, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !316, line: 16, baseType: !317)
!316 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !316, line: 18, size: 128, elements: !318)
!318 = !{!319, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !317, file: !316, line: 19, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !316, line: 20, baseType: !320, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !261, file: !262, line: 127, baseType: !266, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !261, file: !262, line: 129, baseType: !324, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !325, line: 17, baseType: !109)
!325 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ad64fd7b9f2b4876e8c9dcdeeb2305ce")
!326 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !261, file: !262, line: 131, baseType: !327, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !328, line: 19, baseType: !329)
!328 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!332, !259, !110, !103}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !112, line: 108, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !114, line: 194, baseType: !120)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !261, file: !262, line: 132, baseType: !335, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !328, line: 22, baseType: !329)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !261, file: !262, line: 133, baseType: !337, size: 64, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !328, line: 20, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!332, !259, !341, !118}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !205, line: 19, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !344, line: 59, size: 128, elements: !345)
!344 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6fc45f3cccbbf41b239dcfa9e2c5b7b1")
!345 = !{!346, !421}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !343, file: !344, line: 60, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !344, line: 18, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !344, line: 20, size: 640, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !359, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !349, file: !344, line: 21, baseType: !110, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !349, file: !344, line: 22, baseType: !110, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !349, file: !344, line: 23, baseType: !118, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !349, file: !344, line: 24, baseType: !118, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !349, file: !344, line: 26, baseType: !110, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !349, file: !344, line: 27, baseType: !110, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !349, file: !344, line: 28, baseType: !358, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !344, line: 16, baseType: !106)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !349, file: !344, line: 29, baseType: !360, size: 64, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !205, line: 23, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !363, line: 16, size: 1600, elements: !364)
!363 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!364 = !{!365, !366, !367, !403, !404, !405, !406, !407}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !362, file: !363, line: 17, baseType: !217, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !362, file: !363, line: 18, baseType: !220, size: 128, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !362, file: !363, line: 19, baseType: !368, size: 1152, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !218, line: 17, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !370, line: 26, size: 1152, elements: !371)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!371 = !{!372, !374, !376, !378, !380, !382, !384, !385, !386, !388, !390, !392, !399, !400, !401}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !369, file: !370, line: 31, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !114, line: 145, baseType: !96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !369, file: !370, line: 36, baseType: !375, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !114, line: 148, baseType: !96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !369, file: !370, line: 44, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !114, line: 151, baseType: !96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !369, file: !370, line: 45, baseType: !379, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !114, line: 150, baseType: !108)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !369, file: !370, line: 47, baseType: !381, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !114, line: 146, baseType: !108)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !369, file: !370, line: 48, baseType: !383, size: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !114, line: 147, baseType: !108)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !369, file: !370, line: 50, baseType: !109, size: 32, offset: 288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !369, file: !370, line: 52, baseType: !373, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !369, file: !370, line: 57, baseType: !387, size: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !114, line: 152, baseType: !120)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !369, file: !370, line: 61, baseType: !389, size: 64, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !114, line: 175, baseType: !120)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !369, file: !370, line: 63, baseType: !391, size: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !114, line: 180, baseType: !120)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !369, file: !370, line: 74, baseType: !393, size: 128, offset: 576)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !394, line: 11, size: 128, elements: !395)
!394 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !393, file: !394, line: 16, baseType: !237, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !393, file: !394, line: 21, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !114, line: 197, baseType: !120)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !369, file: !370, line: 75, baseType: !393, size: 128, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !369, file: !370, line: 76, baseType: !393, size: 128, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !369, file: !370, line: 89, baseType: !402, size: 192, offset: 960)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 192, elements: !46)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !362, file: !363, line: 21, baseType: !118, size: 64, offset: 1344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !362, file: !363, line: 22, baseType: !118, size: 64, offset: 1408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !362, file: !363, line: 24, baseType: !203, size: 64, offset: 1472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !362, file: !363, line: 37, baseType: !108, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !362, file: !363, line: 38, baseType: !108, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !349, file: !344, line: 30, baseType: !347, size: 64, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !349, file: !344, line: 34, baseType: !108, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !349, file: !344, line: 40, baseType: !108, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !349, file: !344, line: 43, baseType: !108, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !349, file: !344, line: 45, baseType: !108, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !349, file: !344, line: 46, baseType: !108, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !349, file: !344, line: 47, baseType: !108, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !349, file: !344, line: 48, baseType: !108, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !349, file: !344, line: 49, baseType: !108, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !349, file: !344, line: 50, baseType: !108, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !349, file: !344, line: 52, baseType: !108, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !349, file: !344, line: 53, baseType: !108, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !349, file: !344, line: 55, baseType: !109, size: 32, offset: 608)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !344, line: 61, baseType: !341, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !261, file: !262, line: 134, baseType: !423, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !328, line: 23, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!341, !259, !341, !118}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !261, file: !262, line: 136, baseType: !428, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !262, line: 16, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !262, line: 18, size: 2432, elements: !431)
!431 = !{!432, !433, !443, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !461, !462, !463, !464, !465, !466, !469, !470, !471, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !430, file: !262, line: 19, baseType: !324, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !430, file: !262, line: 21, baseType: !434, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !436, line: 180, size: 128, elements: !437)
!436 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!437 = !{!438, !442}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !435, file: !436, line: 182, baseType: !439, size: 16)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !440, line: 28, baseType: !441)
!440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!441 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !435, file: !436, line: 183, baseType: !26, size: 112, offset: 16)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !430, file: !262, line: 22, baseType: !444, size: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !445, line: 274, baseType: !446)
!445 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !114, line: 210, baseType: !108)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !430, file: !262, line: 23, baseType: !103, size: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !430, file: !262, line: 24, baseType: !220, size: 128, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !430, file: !262, line: 26, baseType: !109, size: 32, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !430, file: !262, line: 28, baseType: !109, size: 32, offset: 416)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !430, file: !262, line: 29, baseType: !109, size: 32, offset: 448)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !430, file: !262, line: 30, baseType: !109, size: 32, offset: 480)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !430, file: !262, line: 32, baseType: !109, size: 32, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !430, file: !262, line: 33, baseType: !109, size: 32, offset: 544)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !430, file: !262, line: 34, baseType: !109, size: 32, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !430, file: !262, line: 38, baseType: !457, size: 64, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !205, line: 33, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !259}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !430, file: !262, line: 40, baseType: !106, size: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !430, file: !262, line: 42, baseType: !204, size: 640, offset: 768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !430, file: !262, line: 43, baseType: !203, size: 64, offset: 1408)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !430, file: !262, line: 45, baseType: !103, size: 64, offset: 1472)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !430, file: !262, line: 47, baseType: !103, size: 64, offset: 1536)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !430, file: !262, line: 49, baseType: !467, size: 64, offset: 1600)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !468, line: 16, baseType: !307)
!468 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!469 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !430, file: !262, line: 51, baseType: !428, size: 64, offset: 1664)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !430, file: !262, line: 52, baseType: !259, size: 64, offset: 1728)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !430, file: !262, line: 54, baseType: !472, size: 192, offset: 1792)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !303, line: 32, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !303, line: 37, size: 192, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !473, file: !303, line: 38, baseType: !309, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !473, file: !303, line: 39, baseType: !309, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !473, file: !303, line: 40, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !303, line: 34, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !309, !309, !309}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !430, file: !262, line: 55, baseType: !302, size: 320, offset: 1984)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !430, file: !262, line: 57, baseType: !92, size: 64, offset: 2304)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !430, file: !262, line: 59, baseType: !108, size: 1, offset: 2368, flags: DIFlagBitField, extraData: i64 2368)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !430, file: !262, line: 60, baseType: !108, size: 1, offset: 2369, flags: DIFlagBitField, extraData: i64 2368)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !430, file: !262, line: 61, baseType: !108, size: 1, offset: 2370, flags: DIFlagBitField, extraData: i64 2368)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !430, file: !262, line: 63, baseType: !108, size: 1, offset: 2371, flags: DIFlagBitField, extraData: i64 2368)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !430, file: !262, line: 64, baseType: !108, size: 1, offset: 2372, flags: DIFlagBitField, extraData: i64 2368)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !430, file: !262, line: 65, baseType: !108, size: 1, offset: 2373, flags: DIFlagBitField, extraData: i64 2368)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !430, file: !262, line: 66, baseType: !108, size: 1, offset: 2374, flags: DIFlagBitField, extraData: i64 2368)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !430, file: !262, line: 67, baseType: !108, size: 1, offset: 2375, flags: DIFlagBitField, extraData: i64 2368)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !430, file: !262, line: 68, baseType: !108, size: 1, offset: 2376, flags: DIFlagBitField, extraData: i64 2368)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !430, file: !262, line: 69, baseType: !108, size: 1, offset: 2377, flags: DIFlagBitField, extraData: i64 2368)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !430, file: !262, line: 70, baseType: !108, size: 1, offset: 2378, flags: DIFlagBitField, extraData: i64 2368)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !430, file: !262, line: 73, baseType: !108, size: 1, offset: 2379, flags: DIFlagBitField, extraData: i64 2368)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !430, file: !262, line: 75, baseType: !108, size: 1, offset: 2380, flags: DIFlagBitField, extraData: i64 2368)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !430, file: !262, line: 76, baseType: !108, size: 1, offset: 2381, flags: DIFlagBitField, extraData: i64 2368)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !430, file: !262, line: 77, baseType: !108, size: 2, offset: 2382, flags: DIFlagBitField, extraData: i64 2368)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !430, file: !262, line: 79, baseType: !108, size: 1, offset: 2384, flags: DIFlagBitField, extraData: i64 2368)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !430, file: !262, line: 80, baseType: !108, size: 1, offset: 2385, flags: DIFlagBitField, extraData: i64 2368)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !430, file: !262, line: 81, baseType: !108, size: 1, offset: 2386, flags: DIFlagBitField, extraData: i64 2368)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !430, file: !262, line: 90, baseType: !109, size: 32, offset: 2400)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !261, file: !262, line: 138, baseType: !118, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !261, file: !262, line: 140, baseType: !203, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !261, file: !262, line: 142, baseType: !506, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !205, line: 18, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !509, line: 57, size: 640, elements: !510)
!509 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!510 = !{!511, !519, !520, !521, !522, !529, !541}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !508, file: !509, line: 58, baseType: !512, size: 256)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !509, line: 54, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 49, size: 256, elements: !514)
!514 = !{!515, !516, !517, !518}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !513, file: !509, line: 50, baseType: !110, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !513, file: !509, line: 51, baseType: !110, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !513, file: !509, line: 52, baseType: !506, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !513, file: !509, line: 53, baseType: !92, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !508, file: !509, line: 59, baseType: !103, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !508, file: !509, line: 60, baseType: !506, size: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !508, file: !509, line: 61, baseType: !341, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !508, file: !509, line: 62, baseType: !523, size: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !509, line: 41, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !509, line: 43, size: 128, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !525, file: !509, line: 44, baseType: !523, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !525, file: !509, line: 45, baseType: !106, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !508, file: !509, line: 63, baseType: !530, size: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !509, line: 32, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !509, line: 34, size: 192, elements: !533)
!533 = !{!534, !539, !540}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !532, file: !509, line: 35, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !509, line: 30, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !106}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !532, file: !509, line: 36, baseType: !106, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !532, file: !509, line: 37, baseType: !530, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !508, file: !509, line: 64, baseType: !203, size: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !262, line: 144, baseType: !109, size: 32, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !261, file: !262, line: 146, baseType: !434, size: 64, offset: 832)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !261, file: !262, line: 147, baseType: !444, size: 32, offset: 896)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !261, file: !262, line: 148, baseType: !220, size: 128, offset: 960)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !261, file: !262, line: 150, baseType: !220, size: 128, offset: 1088)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !261, file: !262, line: 151, baseType: !548, size: 16, offset: 1216)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !549, line: 123, baseType: !550)
!549 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !551, line: 25, baseType: !552)
!551 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !114, line: 40, baseType: !441)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !261, file: !262, line: 154, baseType: !554, size: 64, offset: 1280)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !205, line: 29, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !557, line: 74, size: 704, elements: !558)
!557 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "51639b814b1b55c5b35047c033281672")
!558 = !{!559, !564, !568, !572, !573, !574, !575, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !556, file: !557, line: 75, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !562, line: 184, baseType: !563)
!562 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !562, line: 184, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !556, file: !557, line: 76, baseType: !565, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !562, line: 185, baseType: !567)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !562, line: 185, flags: DIFlagFwdDecl)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !556, file: !557, line: 78, baseType: !569, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !93, line: 78, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !445, line: 267, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !114, line: 207, baseType: !120)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !556, file: !557, line: 79, baseType: !347, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !556, file: !557, line: 80, baseType: !103, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !556, file: !557, line: 82, baseType: !457, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !556, file: !557, line: 84, baseType: !576, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !578, line: 231, baseType: !579)
!578 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "848d42aedd0da44ffda19088217823c7")
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !578, line: 231, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !556, file: !557, line: 85, baseType: !457, size: 64, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !556, file: !557, line: 87, baseType: !295, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !556, file: !557, line: 88, baseType: !295, size: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !556, file: !557, line: 90, baseType: !111, size: 8, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !556, file: !557, line: 92, baseType: !108, size: 1, offset: 648, flags: DIFlagBitField, extraData: i64 648)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !556, file: !557, line: 93, baseType: !108, size: 1, offset: 649, flags: DIFlagBitField, extraData: i64 648)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !556, file: !557, line: 94, baseType: !108, size: 1, offset: 650, flags: DIFlagBitField, extraData: i64 648)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !556, file: !557, line: 95, baseType: !108, size: 1, offset: 651, flags: DIFlagBitField, extraData: i64 648)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !556, file: !557, line: 96, baseType: !108, size: 1, offset: 652, flags: DIFlagBitField, extraData: i64 648)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !556, file: !557, line: 97, baseType: !108, size: 1, offset: 653, flags: DIFlagBitField, extraData: i64 648)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !556, file: !557, line: 98, baseType: !108, size: 1, offset: 654, flags: DIFlagBitField, extraData: i64 648)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !556, file: !557, line: 99, baseType: !108, size: 1, offset: 655, flags: DIFlagBitField, extraData: i64 648)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !556, file: !557, line: 100, baseType: !108, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 648)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !556, file: !557, line: 101, baseType: !108, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 648)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !261, file: !262, line: 157, baseType: !595, size: 64, offset: 1344)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !205, line: 30, baseType: !597)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !205, line: 30, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !261, file: !262, line: 159, baseType: !434, size: 64, offset: 1408)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !261, file: !262, line: 160, baseType: !444, size: 32, offset: 1472)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !261, file: !262, line: 162, baseType: !347, size: 64, offset: 1536)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !261, file: !262, line: 164, baseType: !315, size: 128, offset: 1600)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !261, file: !262, line: 166, baseType: !232, size: 64, offset: 1728)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !261, file: !262, line: 168, baseType: !92, size: 64, offset: 1792)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !261, file: !262, line: 170, baseType: !108, size: 8, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !261, file: !262, line: 172, baseType: !108, size: 3, offset: 1864, flags: DIFlagBitField, extraData: i64 1856)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !261, file: !262, line: 174, baseType: !108, size: 1, offset: 1867, flags: DIFlagBitField, extraData: i64 1856)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !261, file: !262, line: 175, baseType: !108, size: 1, offset: 1868, flags: DIFlagBitField, extraData: i64 1856)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !261, file: !262, line: 176, baseType: !108, size: 1, offset: 1869, flags: DIFlagBitField, extraData: i64 1856)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !261, file: !262, line: 178, baseType: !108, size: 1, offset: 1870, flags: DIFlagBitField, extraData: i64 1856)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !261, file: !262, line: 179, baseType: !108, size: 1, offset: 1871, flags: DIFlagBitField, extraData: i64 1856)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !261, file: !262, line: 180, baseType: !108, size: 1, offset: 1872, flags: DIFlagBitField, extraData: i64 1856)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !261, file: !262, line: 181, baseType: !108, size: 1, offset: 1873, flags: DIFlagBitField, extraData: i64 1856)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !261, file: !262, line: 183, baseType: !108, size: 1, offset: 1874, flags: DIFlagBitField, extraData: i64 1856)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !261, file: !262, line: 184, baseType: !108, size: 1, offset: 1875, flags: DIFlagBitField, extraData: i64 1856)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !261, file: !262, line: 185, baseType: !108, size: 2, offset: 1876, flags: DIFlagBitField, extraData: i64 1856)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !261, file: !262, line: 186, baseType: !108, size: 2, offset: 1878, flags: DIFlagBitField, extraData: i64 1856)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !261, file: !262, line: 188, baseType: !108, size: 1, offset: 1880, flags: DIFlagBitField, extraData: i64 1856)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !256, file: !255, line: 29, baseType: !619, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_session_t", file: !621, line: 20, baseType: !622)
!621 = !DIFile(filename: "src/stream/ngx_stream.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "5b43959b152802dd9a372cd63f29aa49")
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_stream_session_s", file: !621, line: 195, size: 960, elements: !623)
!623 = !{!624, !627, !628, !629, !630, !631, !632, !633, !634, !635, !1094, !1095, !1108, !1109, !1110, !1111, !1112}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !622, file: !621, line: 196, baseType: !625, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !551, line: 26, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !114, line: 42, baseType: !108)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !622, file: !621, line: 198, baseType: !259, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "received", scope: !622, file: !621, line: 200, baseType: !118, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !622, file: !621, line: 201, baseType: !235, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "start_msec", scope: !622, file: !621, line: 202, baseType: !467, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "log_handler", scope: !622, file: !621, line: 204, baseType: !239, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !622, file: !621, line: 206, baseType: !107, size: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !622, file: !621, line: 207, baseType: !107, size: 64, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !622, file: !621, line: 208, baseType: !107, size: 64, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !622, file: !621, line: 210, baseType: !636, size: 64, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_t", file: !638, line: 142, baseType: !639)
!638 = !DIFile(filename: "src/stream/ngx_stream_upstream.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "3f8e5475e314f6b689847c899b77180e")
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !638, line: 117, size: 3328, elements: !640)
!640 = !{!641, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !906, !1081, !1092, !1093}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !639, file: !638, line: 118, baseType: !642, size: 1024)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !643, line: 22, baseType: !644)
!643 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ac5aedde14d2cb26bc31b0019c79e36b")
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !643, line: 36, size: 1024, elements: !645)
!645 = !{!646, !647, !648, !649, !651, !652, !653, !659, !664, !666, !667, !669, !674, !683, !684, !685, !686, !687, !688, !689}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !644, file: !643, line: 37, baseType: !259, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !644, file: !643, line: 39, baseType: !434, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !644, file: !643, line: 40, baseType: !444, size: 32, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !643, line: 41, baseType: !650, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !644, file: !643, line: 43, baseType: !92, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !644, file: !643, line: 44, baseType: !467, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !644, file: !643, line: 46, baseType: !654, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !643, line: 24, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!569, !658, !106}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !644, file: !643, line: 47, baseType: !660, size: 64, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !643, line: 26, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !658, !106, !92}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !644, file: !643, line: 48, baseType: !665, size: 64, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !643, line: 28, baseType: !661)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !644, file: !643, line: 49, baseType: !106, size: 64, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "set_session", scope: !644, file: !643, line: 52, baseType: !668, size: 64, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_set_peer_session_pt", file: !643, line: 30, baseType: !655)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !644, file: !643, line: 53, baseType: !670, size: 64, offset: 704)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_save_peer_session_pt", file: !643, line: 32, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !658, !106}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !644, file: !643, line: 56, baseType: !675, size: 64, offset: 768)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !677, line: 78, baseType: !678)
!677 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6d8b5de9d803e9eabdd54c00fd750bd0")
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !677, line: 74, size: 256, elements: !679)
!679 = !{!680, !681, !682}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !678, file: !677, line: 75, baseType: !434, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !678, file: !677, line: 76, baseType: !444, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !677, line: 77, baseType: !220, size: 128, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !644, file: !643, line: 58, baseType: !109, size: 32, offset: 832)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !644, file: !643, line: 59, baseType: !109, size: 32, offset: 864)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !644, file: !643, line: 61, baseType: !203, size: 64, offset: 896)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !644, file: !643, line: 63, baseType: !108, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !644, file: !643, line: 64, baseType: !108, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "so_keepalive", scope: !644, file: !643, line: 65, baseType: !108, size: 1, offset: 962, flags: DIFlagBitField, extraData: i64 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !644, file: !643, line: 68, baseType: !108, size: 2, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_buf", scope: !639, file: !638, line: 120, baseType: !348, size: 640, offset: 1024)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_buf", scope: !639, file: !638, line: 121, baseType: !348, size: 640, offset: 1664)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !639, file: !638, line: 123, baseType: !341, size: 64, offset: 2304)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_out", scope: !639, file: !638, line: 124, baseType: !341, size: 64, offset: 2368)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_busy", scope: !639, file: !638, line: 125, baseType: !341, size: 64, offset: 2432)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_out", scope: !639, file: !638, line: 126, baseType: !341, size: 64, offset: 2496)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_busy", scope: !639, file: !638, line: 127, baseType: !341, size: 64, offset: 2560)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "received", scope: !639, file: !638, line: 129, baseType: !118, size: 64, offset: 2624)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !639, file: !638, line: 130, baseType: !235, size: 64, offset: 2688)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !639, file: !638, line: 131, baseType: !92, size: 64, offset: 2752)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "responses", scope: !639, file: !638, line: 132, baseType: !92, size: 64, offset: 2816)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !639, file: !638, line: 133, baseType: !467, size: 64, offset: 2880)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_name", scope: !639, file: !638, line: 135, baseType: !220, size: 128, offset: 2944)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !639, file: !638, line: 137, baseType: !704, size: 64, offset: 3072)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_srv_conf_t", file: !638, line: 36, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_stream_upstream_srv_conf_s", file: !638, line: 70, size: 832, elements: !707)
!707 = !{!708, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !706, file: !638, line: 71, baseType: !709, size: 192)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_peer_t", file: !638, line: 49, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !638, line: 45, size: 192, elements: !711)
!711 = !{!712, !868, !873}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !710, file: !638, line: 46, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_init_pt", file: !638, line: 39, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!569, !717, !704}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !205, line: 16, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !214, line: 116, size: 768, elements: !720)
!720 = !{!721, !722, !733, !850, !851, !852, !861, !862, !863, !864, !865, !867}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !719, file: !214, line: 117, baseType: !98, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !719, file: !214, line: 118, baseType: !723, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !725, line: 22, baseType: !726)
!725 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !725, line: 16, size: 320, elements: !727)
!727 = !{!728, !729, !730, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !726, file: !725, line: 17, baseType: !106, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !726, file: !725, line: 18, baseType: !92, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !726, file: !725, line: 19, baseType: !103, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !726, file: !725, line: 20, baseType: !92, size: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !726, file: !725, line: 21, baseType: !506, size: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !719, file: !214, line: 120, baseType: !734, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !205, line: 17, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !737, line: 47, size: 5184, elements: !738)
!737 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "084646d0d3ecf791b89c14281fd46376")
!738 = !{!739, !742, !743, !744, !745, !746, !748, !749, !750, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !848, !849}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !736, file: !737, line: 48, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !736, file: !737, line: 49, baseType: !506, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !736, file: !737, line: 51, baseType: !203, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !736, file: !737, line: 52, baseType: !204, size: 640, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !736, file: !737, line: 54, baseType: !92, size: 64, offset: 832)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !736, file: !737, line: 56, baseType: !747, size: 64, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !736, file: !737, line: 57, baseType: !259, size: 64, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !736, file: !737, line: 58, baseType: !92, size: 64, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !736, file: !737, line: 60, baseType: !751, size: 64, offset: 1088)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !205, line: 15, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !755, line: 222, size: 1600, elements: !756)
!755 = !DIFile(filename: "src/core/ngx_module.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1b2032f87974a892f93f4098e8fc0619")
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !779, !780, !784, !788, !789, !790, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !754, file: !755, line: 223, baseType: !92, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !754, file: !755, line: 224, baseType: !92, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !754, file: !755, line: 226, baseType: !98, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !754, file: !755, line: 228, baseType: !92, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !754, file: !755, line: 229, baseType: !92, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !754, file: !755, line: 231, baseType: !92, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !754, file: !755, line: 232, baseType: !116, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !754, file: !755, line: 234, baseType: !106, size: 64, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !754, file: !755, line: 235, baseType: !766, size: 64, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !205, line: 22, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !214, line: 77, size: 448, elements: !769)
!769 = !{!770, !771, !772, !776, !777, !778}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !214, line: 78, baseType: !220, size: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !768, file: !214, line: 79, baseType: !92, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !768, file: !214, line: 80, baseType: !773, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!98, !717, !766, !106}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !768, file: !214, line: 81, baseType: !92, size: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !768, file: !214, line: 82, baseType: !92, size: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !768, file: !214, line: 83, baseType: !106, size: 64, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !754, file: !755, line: 236, baseType: !92, size: 64, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !754, file: !755, line: 238, baseType: !781, size: 64, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!569, !203}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !754, file: !755, line: 240, baseType: !785, size: 64, offset: 704)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!569, !734}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !754, file: !755, line: 242, baseType: !785, size: 64, offset: 768)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !754, file: !755, line: 243, baseType: !785, size: 64, offset: 832)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !754, file: !755, line: 244, baseType: !791, size: 64, offset: 896)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !734}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !754, file: !755, line: 245, baseType: !791, size: 64, offset: 960)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !754, file: !755, line: 247, baseType: !791, size: 64, offset: 1024)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !754, file: !755, line: 249, baseType: !94, size: 64, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !754, file: !755, line: 250, baseType: !94, size: 64, offset: 1152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !754, file: !755, line: 251, baseType: !94, size: 64, offset: 1216)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !754, file: !755, line: 252, baseType: !94, size: 64, offset: 1280)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !754, file: !755, line: 253, baseType: !94, size: 64, offset: 1344)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !754, file: !755, line: 254, baseType: !94, size: 64, offset: 1408)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !754, file: !755, line: 255, baseType: !94, size: 64, offset: 1472)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !754, file: !755, line: 256, baseType: !94, size: 64, offset: 1536)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !736, file: !737, line: 61, baseType: !92, size: 64, offset: 1152)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !736, file: !737, line: 62, baseType: !92, size: 64, offset: 1216)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !736, file: !737, line: 64, baseType: !315, size: 128, offset: 1280)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !736, file: !737, line: 65, baseType: !92, size: 64, offset: 1408)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !736, file: !737, line: 67, baseType: !724, size: 320, offset: 1472)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !736, file: !737, line: 68, baseType: !724, size: 320, offset: 1792)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !736, file: !737, line: 70, baseType: !724, size: 320, offset: 2112)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !736, file: !737, line: 71, baseType: !472, size: 192, offset: 2432)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !736, file: !737, line: 72, baseType: !302, size: 320, offset: 2624)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !736, file: !737, line: 74, baseType: !814, size: 448, offset: 2944)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !815, line: 31, baseType: !816)
!815 = !DIFile(filename: "src/core/ngx_list.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "580525d954b127a1c35170a83ca4d8b1")
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !815, line: 25, size: 448, elements: !817)
!817 = !{!818, !826, !827, !828, !829}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !816, file: !815, line: 26, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !815, line: 16, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !815, line: 18, size: 192, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !821, file: !815, line: 19, baseType: !106, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !821, file: !815, line: 20, baseType: !92, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !821, file: !815, line: 21, baseType: !819, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !816, file: !815, line: 27, baseType: !820, size: 192, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !816, file: !815, line: 28, baseType: !103, size: 64, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !816, file: !815, line: 29, baseType: !92, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !816, file: !815, line: 30, baseType: !506, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !736, file: !737, line: 75, baseType: !814, size: 448, offset: 3392)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !736, file: !737, line: 77, baseType: !92, size: 64, offset: 3840)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !736, file: !737, line: 78, baseType: !92, size: 64, offset: 3904)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !736, file: !737, line: 80, baseType: !259, size: 64, offset: 3968)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !736, file: !737, line: 81, baseType: !266, size: 64, offset: 4032)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !736, file: !737, line: 82, baseType: !266, size: 64, offset: 4096)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !736, file: !737, line: 84, baseType: !734, size: 64, offset: 4160)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !736, file: !737, line: 86, baseType: !220, size: 128, offset: 4224)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !736, file: !737, line: 87, baseType: !220, size: 128, offset: 4352)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !736, file: !737, line: 88, baseType: !220, size: 128, offset: 4480)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !736, file: !737, line: 89, baseType: !220, size: 128, offset: 4608)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !736, file: !737, line: 90, baseType: !220, size: 128, offset: 4736)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !736, file: !737, line: 91, baseType: !220, size: 128, offset: 4864)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_handler", scope: !736, file: !737, line: 93, baseType: !844, size: 64, offset: 4992)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_intercept_pt", file: !737, line: 34, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!569, !203, !92, !110, !103}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_data", scope: !736, file: !737, line: 94, baseType: !106, size: 64, offset: 5056)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "entered_logger", scope: !736, file: !737, line: 95, baseType: !108, size: 32, offset: 5120)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !719, file: !214, line: 121, baseType: !506, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !719, file: !214, line: 122, baseType: !506, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !719, file: !214, line: 123, baseType: !853, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !214, line: 103, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 98, size: 1792, elements: !856)
!856 = !{!857, !858, !859, !860}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !855, file: !214, line: 99, baseType: !361, size: 1600)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !855, file: !214, line: 100, baseType: !347, size: 64, offset: 1600)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !855, file: !214, line: 101, baseType: !347, size: 64, offset: 1664)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !855, file: !214, line: 102, baseType: !92, size: 64, offset: 1728)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !719, file: !214, line: 124, baseType: !203, size: 64, offset: 384)
