; ModuleID = 'samples/5.bc'
source_filename = "../ngx_lua-0.10.15/src/ngx_http_lua_ssl_session_storeby.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_http_request_s = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct.ngx_http_headers_in_t, %struct.ngx_http_headers_out_t, ptr, i64, i64, i64, i64, i64, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, i64, ptr, i64, i64, i64, i64, i64, ptr, ptr, ptr, ptr, i112, i64, i64, i64, [32 x i8], ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct.ngx_http_headers_in_t = type { %struct.ngx_list_t, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct.ngx_array_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_array_t, %struct.ngx_str_t, i64, i64, i16 }
%struct.ngx_list_t = type { ptr, %struct.ngx_list_part_s, i64, i64, ptr }
%struct.ngx_list_part_s = type { ptr, i64, ptr }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }

!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !9, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(scope: null, file: !2, line: 346, type: !9, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(scope: null, file: !2, line: 412, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 15)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(scope: null, file: !2, line: 416, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 41)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(scope: null, file: !85, line: 302, type: !86, isLocal: true, isDefinition: true)
!85 = !DIFile(filename: "../ngx_lua-0.10.15/src/ngx_http_lua_util.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "263bda79d27023d44c17ea175243cd3d")
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 28)
!89 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !90, globals: !1993, splitDebugInlining: false, nameTableKind: None)
!90 = !{!91, !92, !999, !188, !243}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_lua_srv_conf_handler_pt", file: !93, line: 165, baseType: !94)
!93 = !DIFile(filename: "../ngx_lua-0.10.15/src/ngx_http_lua_common.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "24448ae47d4689905dbf6863a08ccbf0")
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !104, !1967, !1989}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !98, line: 78, baseType: !99)
!98 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !100, line: 267, baseType: !101)
!100 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !102, line: 207, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!103 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !106, line: 16, baseType: !107)
!106 = !DIFile(filename: "src/http/ngx_http.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "936639e5730ac898b9486f4f53b5f2f5")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !108, line: 371, size: 11456, elements: !109)
!108 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1757f93ddb5cd3c545713a957f23192d")
!109 = !{!110, !115, !539, !541, !542, !543, !544, !549, !550, !771, !1511, !1512, !1513, !1514, !1556, !1588, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1634, !1645, !1652, !1653, !1655, !1656, !1669, !1670, !1671, !1672, !1673, !1674, !1860, !1864, !1869, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !107, file: !108, line: 372, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !112, line: 26, baseType: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !102, line: 42, baseType: !114)
!114 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !107, file: !108, line: 374, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !118, line: 26, baseType: !119)
!118 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1c4d8383f329aa1de050d17038ecb169")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !120, line: 124, size: 1920, elements: !121)
!120 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf513a87e959064e14502903e9282b0e")
!121 = !{!122, !123, !241, !242, !245, !253, !255, !345, !350, !428, !429, !430, !467, !468, !469, !470, !471, !472, !477, !515, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !120, line: 125, baseType: !91, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !119, file: !120, line: 126, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !118, line: 24, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !127, line: 30, size: 768, elements: !128)
!127 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c79f651cc4aca504d9d912404beb8bf3")
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !157, !162, !220, !233}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !127, line: 31, baseType: !91, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !126, file: !127, line: 33, baseType: !114, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !126, file: !127, line: 35, baseType: !114, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !126, file: !127, line: 38, baseType: !114, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !126, file: !127, line: 44, baseType: !114, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !126, file: !127, line: 46, baseType: !114, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !126, file: !127, line: 49, baseType: !114, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !126, file: !127, line: 51, baseType: !114, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !126, file: !127, line: 54, baseType: !114, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !126, file: !127, line: 56, baseType: !114, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !126, file: !127, line: 57, baseType: !114, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !126, file: !127, line: 59, baseType: !114, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !126, file: !127, line: 60, baseType: !114, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !126, file: !127, line: 62, baseType: !114, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !126, file: !127, line: 64, baseType: !114, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !126, file: !127, line: 67, baseType: !114, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !126, file: !127, line: 69, baseType: !114, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !126, file: !127, line: 71, baseType: !114, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !126, file: !127, line: 74, baseType: !114, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !126, file: !127, line: 75, baseType: !114, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "skip_socket_leak_check", scope: !126, file: !127, line: 77, baseType: !114, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !126, file: !127, line: 80, baseType: !114, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !126, file: !127, line: 110, baseType: !114, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !126, file: !127, line: 113, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !118, line: 32, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !124}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !126, file: !127, line: 120, baseType: !158, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !98, line: 79, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !160, line: 90, baseType: !161)
!160 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!161 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !126, file: !127, line: 122, baseType: !163, size: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !118, line: 20, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !166, line: 50, size: 640, elements: !167)
!166 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f35895306f847777914ce99ffeccfabd")
!167 = !{!168, !169, !198, !201, !205, !210, !211, !216, !217, !219}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !165, file: !166, line: 51, baseType: !158, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !165, file: !166, line: 52, baseType: !170, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !118, line: 21, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !173, line: 89, size: 320, elements: !174)
!173 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6ae6b72e2fd6bbb6ecc9de2e6386072c")
!174 = !{!175, !179, !193, !197}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !172, file: !173, line: 90, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !177, line: 16, baseType: !178)
!177 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "7b9a751e8c1ad1afef5467d60ed94e69")
!178 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !173, line: 91, baseType: !180, size: 128, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !181, line: 19, baseType: !182)
!181 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "aecf67ab89c624000ba2e2684dbcfdc8")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 16, size: 128, elements: !183)
!183 = !{!184, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !182, file: !181, line: 17, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 29, baseType: !161)
!186 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !181, line: 18, baseType: !188, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !190, line: 33, baseType: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !102, line: 31, baseType: !192)
!192 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !172, file: !173, line: 93, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !170, !163}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !172, file: !173, line: 94, baseType: !91, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !165, file: !166, line: 54, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !200, line: 98, baseType: !161)
!200 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "eac8f0294f941da9268c3a72c9fca0e1")
!201 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !165, file: !166, line: 56, baseType: !202, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !203, line: 10, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !102, line: 160, baseType: !103)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !165, file: !166, line: 58, baseType: !206, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !166, line: 45, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!188, !163, !188, !185}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !165, file: !166, line: 59, baseType: !91, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !165, file: !166, line: 61, baseType: !212, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !166, line: 46, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !163, !158, !188, !185}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !165, file: !166, line: 62, baseType: !91, size: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !165, file: !166, line: 70, baseType: !218, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !166, line: 72, baseType: !163, size: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !126, file: !127, line: 124, baseType: !221, size: 320, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !222, line: 20, baseType: !223)
!222 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ee5b3151c1c48b156833d321f8e1946a")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !222, line: 22, size: 320, elements: !224)
!224 = !{!225, !227, !229, !230, !231, !232}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !223, file: !222, line: 23, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !222, line: 16, baseType: !158)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !223, file: !222, line: 24, baseType: !228, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !223, file: !222, line: 25, baseType: !228, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !223, file: !222, line: 26, baseType: !228, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !223, file: !222, line: 27, baseType: !189, size: 8, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !223, file: !222, line: 28, baseType: !189, size: 8, offset: 264)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !126, file: !127, line: 127, baseType: !234, size: 128, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !235, line: 16, baseType: !236)
!235 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !235, line: 18, size: 128, elements: !237)
!237 = !{!238, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !235, line: 19, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !235, line: 20, baseType: !239, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !119, file: !120, line: 127, baseType: !124, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !119, file: !120, line: 129, baseType: !243, size: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !244, line: 17, baseType: !178)
!244 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ad64fd7b9f2b4876e8c9dcdeeb2305ce")
!245 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !119, file: !120, line: 131, baseType: !246, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !247, line: 19, baseType: !248)
!247 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !116, !188, !185}
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !190, line: 108, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !102, line: 194, baseType: !103)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !119, file: !120, line: 132, baseType: !254, size: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !247, line: 22, baseType: !248)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !119, file: !120, line: 133, baseType: !256, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !247, line: 20, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!251, !116, !260, !273}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !118, line: 19, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !263, line: 59, size: 128, elements: !264)
!263 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6fc45f3cccbbf41b239dcfa9e2c5b7b1")
!264 = !{!265, !344}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !262, file: !263, line: 60, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !263, line: 18, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !263, line: 20, size: 640, elements: !269)
!269 = !{!270, !271, !272, !275, !276, !277, !278, !280, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !268, file: !263, line: 21, baseType: !188, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !268, file: !263, line: 22, baseType: !188, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !268, file: !263, line: 23, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !190, line: 87, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !268, file: !263, line: 24, baseType: !273, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !268, file: !263, line: 26, baseType: !188, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !268, file: !263, line: 27, baseType: !188, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !268, file: !263, line: 28, baseType: !279, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !263, line: 16, baseType: !91)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !268, file: !263, line: 29, baseType: !281, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !118, line: 23, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !284, line: 16, size: 1600, elements: !285)
!284 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!285 = !{!286, !287, !288, !326, !327, !328, !329, !330}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !283, file: !284, line: 17, baseType: !176, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !283, file: !284, line: 18, baseType: !180, size: 128, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !283, file: !284, line: 19, baseType: !289, size: 1152, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !177, line: 17, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !291, line: 26, size: 1152, elements: !292)
!291 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!292 = !{!293, !295, !297, !299, !301, !303, !305, !306, !307, !309, !311, !313, !320, !321, !322}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !290, file: !291, line: 31, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !102, line: 145, baseType: !161)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !290, file: !291, line: 36, baseType: !296, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !102, line: 148, baseType: !161)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !290, file: !291, line: 44, baseType: !298, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !102, line: 151, baseType: !161)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !290, file: !291, line: 45, baseType: !300, size: 32, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !102, line: 150, baseType: !114)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !290, file: !291, line: 47, baseType: !302, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !102, line: 146, baseType: !114)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !290, file: !291, line: 48, baseType: !304, size: 32, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !102, line: 147, baseType: !114)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !290, file: !291, line: 50, baseType: !178, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !290, file: !291, line: 52, baseType: !294, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !290, file: !291, line: 57, baseType: !308, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !290, file: !291, line: 61, baseType: !310, size: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !102, line: 175, baseType: !103)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !290, file: !291, line: 63, baseType: !312, size: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !102, line: 180, baseType: !103)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !290, file: !291, line: 74, baseType: !314, size: 128, offset: 576)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !315, line: 11, size: 128, elements: !316)
!315 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !314, file: !315, line: 16, baseType: !204, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !314, file: !315, line: 21, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !102, line: 197, baseType: !103)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !290, file: !291, line: 75, baseType: !314, size: 128, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !290, file: !291, line: 76, baseType: !314, size: 128, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !290, file: !291, line: 89, baseType: !323, size: 192, offset: 960)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 192, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 3)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !283, file: !284, line: 21, baseType: !273, size: 64, offset: 1344)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !283, file: !284, line: 22, baseType: !273, size: 64, offset: 1408)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !283, file: !284, line: 24, baseType: !163, size: 64, offset: 1472)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !283, file: !284, line: 37, baseType: !114, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !283, file: !284, line: 38, baseType: !114, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !268, file: !263, line: 30, baseType: !266, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !268, file: !263, line: 34, baseType: !114, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !268, file: !263, line: 40, baseType: !114, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !268, file: !263, line: 43, baseType: !114, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !268, file: !263, line: 45, baseType: !114, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !268, file: !263, line: 46, baseType: !114, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !268, file: !263, line: 47, baseType: !114, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !268, file: !263, line: 48, baseType: !114, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !268, file: !263, line: 49, baseType: !114, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !268, file: !263, line: 50, baseType: !114, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !268, file: !263, line: 52, baseType: !114, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !268, file: !263, line: 53, baseType: !114, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !268, file: !263, line: 55, baseType: !178, size: 32, offset: 608)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !262, file: !263, line: 61, baseType: !260, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !119, file: !120, line: 134, baseType: !346, size: 64, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !247, line: 23, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!260, !116, !260, !273}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !119, file: !120, line: 136, baseType: !351, size: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !120, line: 16, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !120, line: 18, size: 2432, elements: !354)
!354 = !{!355, !356, !369, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !386, !387, !388, !389, !390, !391, !394, !395, !396, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !353, file: !120, line: 19, baseType: !243, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !353, file: !120, line: 21, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !359, line: 180, size: 128, elements: !360)
!359 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!360 = !{!361, !365}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !358, file: !359, line: 182, baseType: !362, size: 16)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !363, line: 28, baseType: !364)
!363 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!364 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !358, file: !359, line: 183, baseType: !366, size: 112, offset: 16)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 14)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !353, file: !120, line: 22, baseType: !370, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !100, line: 274, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !102, line: 210, baseType: !114)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !353, file: !120, line: 23, baseType: !185, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !353, file: !120, line: 24, baseType: !180, size: 128, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !353, file: !120, line: 26, baseType: !178, size: 32, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !353, file: !120, line: 28, baseType: !178, size: 32, offset: 416)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !353, file: !120, line: 29, baseType: !178, size: 32, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !353, file: !120, line: 30, baseType: !178, size: 32, offset: 480)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !353, file: !120, line: 32, baseType: !178, size: 32, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !353, file: !120, line: 33, baseType: !178, size: 32, offset: 544)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !353, file: !120, line: 34, baseType: !178, size: 32, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !353, file: !120, line: 38, baseType: !382, size: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !118, line: 33, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !116}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !353, file: !120, line: 40, baseType: !91, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !353, file: !120, line: 42, baseType: !164, size: 640, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !353, file: !120, line: 43, baseType: !163, size: 64, offset: 1408)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !353, file: !120, line: 45, baseType: !185, size: 64, offset: 1472)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !353, file: !120, line: 47, baseType: !185, size: 64, offset: 1536)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !353, file: !120, line: 49, baseType: !392, size: 64, offset: 1600)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !393, line: 16, baseType: !226)
!393 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!394 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !353, file: !120, line: 51, baseType: !351, size: 64, offset: 1664)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !353, file: !120, line: 52, baseType: !116, size: 64, offset: 1728)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !353, file: !120, line: 54, baseType: !397, size: 192, offset: 1792)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !222, line: 32, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !222, line: 37, size: 192, elements: !399)
!399 = !{!400, !401, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !398, file: !222, line: 38, baseType: !228, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !398, file: !222, line: 39, baseType: !228, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !398, file: !222, line: 40, baseType: !403, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !222, line: 34, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !228, !228, !228}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !353, file: !120, line: 55, baseType: !221, size: 320, offset: 1984)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !353, file: !120, line: 57, baseType: !158, size: 64, offset: 2304)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !353, file: !120, line: 59, baseType: !114, size: 1, offset: 2368, flags: DIFlagBitField, extraData: i64 2368)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !353, file: !120, line: 60, baseType: !114, size: 1, offset: 2369, flags: DIFlagBitField, extraData: i64 2368)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !353, file: !120, line: 61, baseType: !114, size: 1, offset: 2370, flags: DIFlagBitField, extraData: i64 2368)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !353, file: !120, line: 63, baseType: !114, size: 1, offset: 2371, flags: DIFlagBitField, extraData: i64 2368)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !353, file: !120, line: 64, baseType: !114, size: 1, offset: 2372, flags: DIFlagBitField, extraData: i64 2368)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !353, file: !120, line: 65, baseType: !114, size: 1, offset: 2373, flags: DIFlagBitField, extraData: i64 2368)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !353, file: !120, line: 66, baseType: !114, size: 1, offset: 2374, flags: DIFlagBitField, extraData: i64 2368)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !353, file: !120, line: 67, baseType: !114, size: 1, offset: 2375, flags: DIFlagBitField, extraData: i64 2368)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !353, file: !120, line: 68, baseType: !114, size: 1, offset: 2376, flags: DIFlagBitField, extraData: i64 2368)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !353, file: !120, line: 69, baseType: !114, size: 1, offset: 2377, flags: DIFlagBitField, extraData: i64 2368)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !353, file: !120, line: 70, baseType: !114, size: 1, offset: 2378, flags: DIFlagBitField, extraData: i64 2368)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !353, file: !120, line: 73, baseType: !114, size: 1, offset: 2379, flags: DIFlagBitField, extraData: i64 2368)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !353, file: !120, line: 75, baseType: !114, size: 1, offset: 2380, flags: DIFlagBitField, extraData: i64 2368)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !353, file: !120, line: 76, baseType: !114, size: 1, offset: 2381, flags: DIFlagBitField, extraData: i64 2368)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !353, file: !120, line: 77, baseType: !114, size: 2, offset: 2382, flags: DIFlagBitField, extraData: i64 2368)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !353, file: !120, line: 79, baseType: !114, size: 1, offset: 2384, flags: DIFlagBitField, extraData: i64 2368)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !353, file: !120, line: 80, baseType: !114, size: 1, offset: 2385, flags: DIFlagBitField, extraData: i64 2368)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !353, file: !120, line: 81, baseType: !114, size: 1, offset: 2386, flags: DIFlagBitField, extraData: i64 2368)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !353, file: !120, line: 90, baseType: !178, size: 32, offset: 2400)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !119, file: !120, line: 138, baseType: !273, size: 64, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !119, file: !120, line: 140, baseType: !163, size: 64, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !119, file: !120, line: 142, baseType: !431, size: 64, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !118, line: 18, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !434, line: 57, size: 640, elements: !435)
!434 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!435 = !{!436, !444, !445, !446, !447, !454, !466}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !433, file: !434, line: 58, baseType: !437, size: 256)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !434, line: 54, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 49, size: 256, elements: !439)
!439 = !{!440, !441, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !438, file: !434, line: 50, baseType: !188, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !438, file: !434, line: 51, baseType: !188, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !434, line: 52, baseType: !431, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !438, file: !434, line: 53, baseType: !158, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !433, file: !434, line: 59, baseType: !185, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !433, file: !434, line: 60, baseType: !431, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !433, file: !434, line: 61, baseType: !260, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !433, file: !434, line: 62, baseType: !448, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !434, line: 41, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !434, line: 43, size: 128, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !450, file: !434, line: 44, baseType: !448, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !450, file: !434, line: 45, baseType: !91, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !433, file: !434, line: 63, baseType: !455, size: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !434, line: 32, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !434, line: 34, size: 192, elements: !458)
!458 = !{!459, !464, !465}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !457, file: !434, line: 35, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !434, line: 30, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !91}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !457, file: !434, line: 36, baseType: !91, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !434, line: 37, baseType: !455, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !433, file: !434, line: 64, baseType: !163, size: 64, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !120, line: 144, baseType: !178, size: 32, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !119, file: !120, line: 146, baseType: !357, size: 64, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !119, file: !120, line: 147, baseType: !370, size: 32, offset: 896)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !119, file: !120, line: 148, baseType: !180, size: 128, offset: 960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !119, file: !120, line: 150, baseType: !180, size: 128, offset: 1088)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !119, file: !120, line: 151, baseType: !473, size: 16, offset: 1216)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !474, line: 123, baseType: !475)
!474 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !112, line: 25, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !102, line: 40, baseType: !364)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !119, file: !120, line: 154, baseType: !478, size: 64, offset: 1280)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !118, line: 29, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !481, line: 74, size: 704, elements: !482)
!481 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "51639b814b1b55c5b35047c033281672")
!482 = !{!483, !488, !492, !493, !494, !495, !496, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !480, file: !481, line: 75, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !486, line: 184, baseType: !487)
!486 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !486, line: 184, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !480, file: !481, line: 76, baseType: !489, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !486, line: 185, baseType: !491)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !486, line: 185, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !480, file: !481, line: 78, baseType: !97, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !480, file: !481, line: 79, baseType: !266, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !480, file: !481, line: 80, baseType: !185, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !480, file: !481, line: 82, baseType: !382, size: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !480, file: !481, line: 84, baseType: !497, size: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !499, line: 231, baseType: !500)
!499 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "848d42aedd0da44ffda19088217823c7")
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !499, line: 231, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !480, file: !481, line: 85, baseType: !382, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !480, file: !481, line: 87, baseType: !153, size: 64, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !480, file: !481, line: 88, baseType: !153, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !480, file: !481, line: 90, baseType: !189, size: 8, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !480, file: !481, line: 92, baseType: !114, size: 1, offset: 648, flags: DIFlagBitField, extraData: i64 648)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !480, file: !481, line: 93, baseType: !114, size: 1, offset: 649, flags: DIFlagBitField, extraData: i64 648)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !480, file: !481, line: 94, baseType: !114, size: 1, offset: 650, flags: DIFlagBitField, extraData: i64 648)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !480, file: !481, line: 95, baseType: !114, size: 1, offset: 651, flags: DIFlagBitField, extraData: i64 648)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !480, file: !481, line: 96, baseType: !114, size: 1, offset: 652, flags: DIFlagBitField, extraData: i64 648)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !480, file: !481, line: 97, baseType: !114, size: 1, offset: 653, flags: DIFlagBitField, extraData: i64 648)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !480, file: !481, line: 98, baseType: !114, size: 1, offset: 654, flags: DIFlagBitField, extraData: i64 648)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !480, file: !481, line: 99, baseType: !114, size: 1, offset: 655, flags: DIFlagBitField, extraData: i64 648)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !480, file: !481, line: 100, baseType: !114, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 648)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !480, file: !481, line: 101, baseType: !114, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 648)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !119, file: !120, line: 157, baseType: !516, size: 64, offset: 1344)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !118, line: 30, baseType: !518)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !118, line: 30, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !119, file: !120, line: 159, baseType: !357, size: 64, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !119, file: !120, line: 160, baseType: !370, size: 32, offset: 1472)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !119, file: !120, line: 162, baseType: !266, size: 64, offset: 1536)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !119, file: !120, line: 164, baseType: !234, size: 128, offset: 1600)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !119, file: !120, line: 166, baseType: !199, size: 64, offset: 1728)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !119, file: !120, line: 168, baseType: !158, size: 64, offset: 1792)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !119, file: !120, line: 170, baseType: !114, size: 8, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !119, file: !120, line: 172, baseType: !114, size: 3, offset: 1864, flags: DIFlagBitField, extraData: i64 1856)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !119, file: !120, line: 174, baseType: !114, size: 1, offset: 1867, flags: DIFlagBitField, extraData: i64 1856)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !119, file: !120, line: 175, baseType: !114, size: 1, offset: 1868, flags: DIFlagBitField, extraData: i64 1856)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !119, file: !120, line: 176, baseType: !114, size: 1, offset: 1869, flags: DIFlagBitField, extraData: i64 1856)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !119, file: !120, line: 178, baseType: !114, size: 1, offset: 1870, flags: DIFlagBitField, extraData: i64 1856)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !119, file: !120, line: 179, baseType: !114, size: 1, offset: 1871, flags: DIFlagBitField, extraData: i64 1856)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !119, file: !120, line: 180, baseType: !114, size: 1, offset: 1872, flags: DIFlagBitField, extraData: i64 1856)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !119, file: !120, line: 181, baseType: !114, size: 1, offset: 1873, flags: DIFlagBitField, extraData: i64 1856)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !119, file: !120, line: 183, baseType: !114, size: 1, offset: 1874, flags: DIFlagBitField, extraData: i64 1856)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !119, file: !120, line: 184, baseType: !114, size: 1, offset: 1875, flags: DIFlagBitField, extraData: i64 1856)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !119, file: !120, line: 185, baseType: !114, size: 2, offset: 1876, flags: DIFlagBitField, extraData: i64 1856)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !119, file: !120, line: 186, baseType: !114, size: 2, offset: 1878, flags: DIFlagBitField, extraData: i64 1856)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !119, file: !120, line: 188, baseType: !114, size: 1, offset: 1880, flags: DIFlagBitField, extraData: i64 1856)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !107, file: !108, line: 376, baseType: !540, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !107, file: !108, line: 377, baseType: !540, size: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !107, file: !108, line: 378, baseType: !540, size: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !107, file: !108, line: 379, baseType: !540, size: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !107, file: !108, line: 381, baseType: !545, size: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !108, line: 368, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !104}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !107, file: !108, line: 382, baseType: !545, size: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !107, file: !108, line: 385, baseType: !551, size: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !106, line: 18, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !554, line: 65, size: 4800, elements: !555)
!554 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "04ea2ebc84c597718a4782ab3cabf19d")
!555 = !{!556, !557, !567, !568, !570, !571, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !729, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !553, file: !554, line: 66, baseType: !282, size: 1600)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !553, file: !554, line: 67, baseType: !558, size: 320, offset: 1600)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !559, line: 22, baseType: !560)
!559 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 16, size: 320, elements: !561)
!561 = !{!562, !563, !564, !565, !566}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !560, file: !559, line: 17, baseType: !91, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !560, file: !559, line: 18, baseType: !158, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !560, file: !559, line: 19, baseType: !185, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !560, file: !559, line: 20, baseType: !158, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !560, file: !559, line: 21, baseType: !431, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !553, file: !554, line: 68, baseType: !111, size: 32, offset: 1920)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !553, file: !554, line: 69, baseType: !569, size: 128, offset: 1952)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 128, elements: !34)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !553, file: !554, line: 70, baseType: !569, size: 128, offset: 2080)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !553, file: !554, line: 72, baseType: !572, size: 64, offset: 2240)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !177, line: 18, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !190, line: 49, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !102, line: 149, baseType: !161)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !553, file: !554, line: 73, baseType: !202, size: 64, offset: 2304)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !553, file: !554, line: 74, baseType: !202, size: 64, offset: 2368)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !553, file: !554, line: 75, baseType: !202, size: 64, offset: 2432)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !553, file: !554, line: 76, baseType: !202, size: 64, offset: 2496)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !553, file: !554, line: 77, baseType: !202, size: 64, offset: 2560)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !553, file: !554, line: 79, baseType: !180, size: 128, offset: 2624)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !553, file: !554, line: 80, baseType: !180, size: 128, offset: 2752)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !553, file: !554, line: 81, baseType: !569, size: 128, offset: 2880)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !553, file: !554, line: 83, baseType: !185, size: 64, offset: 3008)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !553, file: !554, line: 84, baseType: !185, size: 64, offset: 3072)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !553, file: !554, line: 85, baseType: !273, size: 64, offset: 3136)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !553, file: !554, line: 86, baseType: !273, size: 64, offset: 3200)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !553, file: !554, line: 88, baseType: !158, size: 64, offset: 3264)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !553, file: !554, line: 89, baseType: !158, size: 64, offset: 3328)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !553, file: !554, line: 90, baseType: !158, size: 64, offset: 3392)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !553, file: !554, line: 91, baseType: !158, size: 64, offset: 3456)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !553, file: !554, line: 93, baseType: !266, size: 64, offset: 3520)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !553, file: !554, line: 95, baseType: !593, size: 64, offset: 3584)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !106, line: 19, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !554, line: 157, size: 1088, elements: !596)
!596 = !{!597, !612, !670, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !728}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !595, file: !554, line: 158, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !554, line: 154, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 145, size: 960, elements: !601)
!601 = !{!602, !603, !604, !605, !608, !609, !610, !611}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !600, file: !554, line: 146, baseType: !397, size: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !600, file: !554, line: 147, baseType: !221, size: 320, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !600, file: !554, line: 148, baseType: !234, size: 128, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !600, file: !554, line: 149, baseType: !606, size: 64, offset: 640)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !200, line: 106, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !199)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !600, file: !554, line: 150, baseType: !606, size: 64, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !600, file: !554, line: 151, baseType: !273, size: 64, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !600, file: !554, line: 152, baseType: !158, size: 64, offset: 832)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !600, file: !554, line: 153, baseType: !158, size: 64, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !595, file: !554, line: 159, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !615, line: 59, baseType: !616)
!615 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6137611cd598fa2ecc498e6967a03177")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !615, line: 34, size: 1600, elements: !617)
!617 = !{!618, !625, !626, !627, !635, !636, !637, !646, !647, !648, !649, !665, !666, !667, !668, !669}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !616, file: !615, line: 35, baseType: !619, size: 128)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !620, line: 21, baseType: !621)
!620 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "56a332e5761f46e2bb83cbdaf8b18a9f")
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 16, size: 128, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !621, file: !620, line: 17, baseType: !606, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !621, file: !620, line: 19, baseType: !606, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !616, file: !615, line: 37, baseType: !185, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !616, file: !615, line: 38, baseType: !185, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !616, file: !615, line: 40, baseType: !628, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !615, line: 16, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !615, line: 18, size: 192, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !630, file: !615, line: 19, baseType: !159, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !630, file: !615, line: 20, baseType: !628, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !630, file: !615, line: 21, baseType: !159, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !616, file: !615, line: 41, baseType: !628, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !616, file: !615, line: 42, baseType: !629, size: 192, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !616, file: !615, line: 44, baseType: !638, size: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !615, line: 31, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !615, line: 25, size: 256, elements: !641)
!641 = !{!642, !643, !644, !645}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !640, file: !615, line: 26, baseType: !158, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !640, file: !615, line: 27, baseType: !158, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !640, file: !615, line: 29, baseType: !158, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !640, file: !615, line: 30, baseType: !158, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !616, file: !615, line: 45, baseType: !158, size: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !616, file: !615, line: 47, baseType: !188, size: 64, offset: 704)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !616, file: !615, line: 48, baseType: !188, size: 64, offset: 768)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !616, file: !615, line: 50, baseType: !650, size: 512, offset: 832)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !620, line: 37, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 24, size: 512, elements: !652)
!652 = !{!653, !655, !656, !657, !664}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !651, file: !620, line: 26, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !651, file: !620, line: 28, baseType: !654, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !651, file: !620, line: 29, baseType: !158, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !651, file: !620, line: 30, baseType: !658, size: 256, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !659, line: 39, baseType: !660)
!659 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!660 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !659, line: 35, size: 256, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !660, file: !659, line: 37, baseType: !3, size: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !660, file: !659, line: 38, baseType: !103, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !651, file: !620, line: 36, baseType: !158, size: 64, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !616, file: !615, line: 52, baseType: !188, size: 64, offset: 1344)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !616, file: !615, line: 53, baseType: !189, size: 8, offset: 1408)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !616, file: !615, line: 55, baseType: !114, size: 1, offset: 1416, flags: DIFlagBitField, extraData: i64 1416)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !616, file: !615, line: 57, baseType: !91, size: 64, offset: 1472)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !616, file: !615, line: 58, baseType: !91, size: 64, offset: 1536)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !595, file: !554, line: 161, baseType: !671, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !284, line: 62, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !284, line: 50, size: 768, elements: !674)
!674 = !{!675, !676, !677, !679, !684, !686, !688, !689, !690}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !673, file: !284, line: 51, baseType: !180, size: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !673, file: !284, line: 52, baseType: !185, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !673, file: !284, line: 53, baseType: !678, size: 192, offset: 192)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 192, elements: !324)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !673, file: !284, line: 55, baseType: !680, size: 64, offset: 384)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !284, line: 45, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!392, !91}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !673, file: !284, line: 56, baseType: !685, size: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !284, line: 46, baseType: !681)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !673, file: !284, line: 57, baseType: !687, size: 64, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !284, line: 47, baseType: !461)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !673, file: !284, line: 58, baseType: !91, size: 64, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !673, file: !284, line: 60, baseType: !188, size: 64, offset: 640)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !673, file: !284, line: 61, baseType: !158, size: 64, offset: 704)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !595, file: !554, line: 163, baseType: !273, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !595, file: !554, line: 164, baseType: !185, size: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !595, file: !554, line: 166, baseType: !202, size: 64, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !595, file: !554, line: 168, baseType: !202, size: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !595, file: !554, line: 170, baseType: !158, size: 64, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !595, file: !554, line: 171, baseType: !158, size: 64, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !595, file: !554, line: 172, baseType: !392, size: 64, offset: 576)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !595, file: !554, line: 173, baseType: !392, size: 64, offset: 640)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !595, file: !554, line: 174, baseType: !392, size: 64, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !595, file: !554, line: 176, baseType: !158, size: 64, offset: 768)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !595, file: !554, line: 177, baseType: !392, size: 64, offset: 832)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !595, file: !554, line: 178, baseType: !392, size: 64, offset: 896)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !595, file: !554, line: 180, baseType: !704, size: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !706, line: 31, baseType: !707)
!706 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "084646d0d3ecf791b89c14281fd46376")
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !706, line: 37, size: 704, elements: !708)
!708 = !{!709, !710, !720, !725, !726, !727}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !707, file: !706, line: 38, baseType: !91, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !707, file: !706, line: 39, baseType: !711, size: 384, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !712, line: 22, baseType: !713)
!712 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf27d4781f3b25ce5eb9a764f55ea2d4")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !712, line: 16, size: 384, elements: !714)
!714 = !{!715, !716, !717, !718, !719}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !713, file: !712, line: 17, baseType: !188, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !712, line: 18, baseType: !185, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !712, line: 19, baseType: !180, size: 128, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !713, file: !712, line: 20, baseType: !163, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !713, file: !712, line: 21, baseType: !158, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !707, file: !706, line: 40, baseType: !721, size: 64, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !706, line: 33, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!97, !704, !91}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !707, file: !706, line: 41, baseType: !91, size: 64, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !707, file: !706, line: 42, baseType: !91, size: 64, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !707, file: !706, line: 43, baseType: !158, size: 64, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !595, file: !554, line: 182, baseType: !158, size: 64, offset: 1024)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !553, file: !554, line: 96, baseType: !730, size: 64, offset: 3648)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !554, line: 62, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 39, size: 960, elements: !733)
!733 = !{!734, !735, !736, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !732, file: !554, line: 40, baseType: !221, size: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !732, file: !554, line: 41, baseType: !234, size: 128, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !732, file: !554, line: 43, baseType: !737, size: 64, offset: 448)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 64, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 8)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !732, file: !554, line: 46, baseType: !114, size: 20, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !732, file: !554, line: 47, baseType: !114, size: 10, offset: 532, flags: DIFlagBitField, extraData: i64 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !732, file: !554, line: 48, baseType: !114, size: 10, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !732, file: !554, line: 49, baseType: !114, size: 10, offset: 554, flags: DIFlagBitField, extraData: i64 544)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !732, file: !554, line: 50, baseType: !114, size: 1, offset: 564, flags: DIFlagBitField, extraData: i64 544)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !732, file: !554, line: 51, baseType: !114, size: 1, offset: 565, flags: DIFlagBitField, extraData: i64 544)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !732, file: !554, line: 52, baseType: !114, size: 1, offset: 566, flags: DIFlagBitField, extraData: i64 544)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !732, file: !554, line: 53, baseType: !114, size: 1, offset: 567, flags: DIFlagBitField, extraData: i64 544)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !732, file: !554, line: 56, baseType: !572, size: 64, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !732, file: !554, line: 57, baseType: !202, size: 64, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !732, file: !554, line: 58, baseType: !202, size: 64, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !732, file: !554, line: 59, baseType: !185, size: 64, offset: 768)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !732, file: !554, line: 60, baseType: !273, size: 64, offset: 832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !732, file: !554, line: 61, baseType: !392, size: 64, offset: 896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !553, file: !554, line: 102, baseType: !392, size: 64, offset: 3712)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !553, file: !554, line: 103, baseType: !392, size: 64, offset: 3776)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !553, file: !554, line: 104, baseType: !392, size: 64, offset: 3840)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !553, file: !554, line: 105, baseType: !392, size: 64, offset: 3904)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !553, file: !554, line: 107, baseType: !125, size: 768, offset: 3968)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !553, file: !554, line: 109, baseType: !114, size: 1, offset: 4736, flags: DIFlagBitField, extraData: i64 4736)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !553, file: !554, line: 110, baseType: !114, size: 1, offset: 4737, flags: DIFlagBitField, extraData: i64 4736)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !553, file: !554, line: 112, baseType: !114, size: 1, offset: 4738, flags: DIFlagBitField, extraData: i64 4736)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !553, file: !554, line: 113, baseType: !114, size: 1, offset: 4739, flags: DIFlagBitField, extraData: i64 4736)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !553, file: !554, line: 114, baseType: !114, size: 1, offset: 4740, flags: DIFlagBitField, extraData: i64 4736)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !553, file: !554, line: 115, baseType: !114, size: 1, offset: 4741, flags: DIFlagBitField, extraData: i64 4736)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !553, file: !554, line: 116, baseType: !114, size: 1, offset: 4742, flags: DIFlagBitField, extraData: i64 4736)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !553, file: !554, line: 117, baseType: !114, size: 1, offset: 4743, flags: DIFlagBitField, extraData: i64 4736)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !553, file: !554, line: 118, baseType: !114, size: 1, offset: 4744, flags: DIFlagBitField, extraData: i64 4736)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !553, file: !554, line: 119, baseType: !114, size: 1, offset: 4745, flags: DIFlagBitField, extraData: i64 4736)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !553, file: !554, line: 121, baseType: !114, size: 1, offset: 4746, flags: DIFlagBitField, extraData: i64 4736)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !553, file: !554, line: 122, baseType: !114, size: 1, offset: 4747, flags: DIFlagBitField, extraData: i64 4736)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !107, file: !108, line: 388, baseType: !772, size: 64, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !106, line: 17, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !775, line: 319, size: 8960, elements: !776)
!775 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c0fceda7aff0a351f062ef07edbc2de2")
!776 = !{!777, !782, !783, !832, !911, !912, !934, !943, !1226, !1227, !1228, !1229, !1230, !1231, !1271, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1452, !1456, !1457, !1461, !1462, !1463, !1464, !1465, !1469, !1473, !1477, !1478, !1492, !1493, !1494, !1495, !1496, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !774, file: !775, line: 320, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !775, line: 315, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !104, !772}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !774, file: !775, line: 321, baseType: !778, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !774, file: !775, line: 323, baseType: !784, size: 1024, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !785, line: 22, baseType: !786)
!785 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ac5aedde14d2cb26bc31b0019c79e36b")
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !785, line: 36, size: 1024, elements: !787)
!787 = !{!788, !789, !790, !791, !793, !794, !795, !801, !806, !808, !809, !811, !816, !825, !826, !827, !828, !829, !830, !831}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !786, file: !785, line: 37, baseType: !116, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !786, file: !785, line: 39, baseType: !357, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !786, file: !785, line: 40, baseType: !370, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !785, line: 41, baseType: !792, size: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !786, file: !785, line: 43, baseType: !158, size: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !786, file: !785, line: 44, baseType: !392, size: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !786, file: !785, line: 46, baseType: !796, size: 64, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !785, line: 24, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!97, !800, !91}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !786, file: !785, line: 47, baseType: !802, size: 64, offset: 448)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !785, line: 26, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !800, !91, !158}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !786, file: !785, line: 48, baseType: !807, size: 64, offset: 512)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !785, line: 28, baseType: !803)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !786, file: !785, line: 49, baseType: !91, size: 64, offset: 576)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "set_session", scope: !786, file: !785, line: 52, baseType: !810, size: 64, offset: 640)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_set_peer_session_pt", file: !785, line: 30, baseType: !797)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !786, file: !785, line: 53, baseType: !812, size: 64, offset: 704)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_save_peer_session_pt", file: !785, line: 32, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !800, !91}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !786, file: !785, line: 56, baseType: !817, size: 64, offset: 768)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !819, line: 78, baseType: !820)
!819 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6d8b5de9d803e9eabdd54c00fd750bd0")
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !819, line: 74, size: 256, elements: !821)
!821 = !{!822, !823, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !820, file: !819, line: 75, baseType: !357, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !820, file: !819, line: 76, baseType: !370, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !820, file: !819, line: 77, baseType: !180, size: 128, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !786, file: !785, line: 58, baseType: !178, size: 32, offset: 832)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !786, file: !785, line: 59, baseType: !178, size: 32, offset: 864)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !786, file: !785, line: 61, baseType: !163, size: 64, offset: 896)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !786, file: !785, line: 63, baseType: !114, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !786, file: !785, line: 64, baseType: !114, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "so_keepalive", scope: !786, file: !785, line: 65, baseType: !114, size: 1, offset: 962, flags: DIFlagBitField, extraData: i64 960)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !786, file: !785, line: 68, baseType: !114, size: 2, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !774, file: !775, line: 325, baseType: !833, size: 64, offset: 1152)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !835, line: 17, baseType: !836)
!835 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "d3e71392e0da0dbb3c5c631f1da185c7")
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !835, line: 25, size: 2240, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !844, !845, !846, !847, !848, !853, !854, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !910}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !836, file: !835, line: 26, baseType: !116, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !836, file: !835, line: 27, baseType: !116, size: 64, offset: 64)
