; ModuleID = 'samples/517.bc'
source_filename = "src/tools/gt_chain2dim.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtChain2Dimmatchvalues = type { [2 x i64], [2 x i64], i64 }
%struct.Counter = type { i64 }
%struct.GtChain2dimoptions = type { i8, i8, double, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [35 x i8] c"# chain %lu: length %lu score %ld\0A\00", align 1, !dbg !0
@stdout = external global ptr, align 8
@.str.1 = private unnamed_addr constant [25 x i8] c"src/tools/gt_chain2dim.c\00", align 1, !dbg !7
@stderr = external global ptr, align 8
@.str.2 = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [18 x i8] c"arguments != NULL\00", align 1, !dbg !17
@__func__.gt_chain2dim_option_parser_new = private unnamed_addr constant [31 x i8] c"gt_chain2dim_option_parser_new\00", align 1, !dbg !22
@.str.4 = private unnamed_addr constant [23 x i8] c"[options] -m matchfile\00", align 1, !dbg !28

!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 277, type: !75, isLocal: true, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !156, globals: !166, splitDebugInlining: false, nameTableKind: None)
!156 = !{!157, !165}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "Counter", file: !2, line: 197, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 194, size: 64, elements: !160)
!160 = !{!161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "chaincounter", scope: !159, file: !2, line: 196, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !163, line: 83, baseType: !164)
!163 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!164 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!166 = !{!0, !7, !12, !17, !22, !28, !33, !38, !43, !48, !53, !58, !63, !68, !73, !78, !83, !85, !90, !92, !97, !102, !107, !109, !114, !119, !121, !126, !131, !133, !135, !140, !145, !150, !153}
!167 = !{i32 7, !"Dwarf Version", i32 5}
!168 = !{i32 2, !"Debug Info Version", i32 3}
!169 = !{i32 1, !"wchar_size", i32 4}
!170 = !{i32 8, !"PIC Level", i32 2}
!171 = !{i32 7, !"uwtable", i32 2}
!172 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!173 = distinct !DISubprogram(name: "gt_outputformatchainsilent", scope: !2, file: !2, line: 234, type: !174, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !185)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !165, !176, !181}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtChain2Dimmatchtable", file: !179, line: 56, baseType: !180)
!179 = !DIFile(filename: "src/match/chain2dim.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "fa1968fc5dfd97ac37a8eb0fb2c7f49f")
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtChain2Dimmatchtable", file: !179, line: 56, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtChain2Dim", file: !179, line: 52, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtChain2Dim", file: !179, line: 52, flags: DIFlagFwdDecl)
!185 = !{!186, !187, !188}
!186 = !DILocalVariable(name: "data", arg: 1, scope: !173, file: !2, line: 234, type: !165)
!187 = !DILocalVariable(name: "matchtable", arg: 2, scope: !173, file: !2, line: 235, type: !176)
!188 = !DILocalVariable(name: "chain", arg: 3, scope: !173, file: !2, line: 236, type: !181)
!189 = !{!190, !190, i64 0}
!190 = !{!"any pointer", !191, i64 0}
!191 = !{!"omnipotent char", !192, i64 0}
!192 = !{!"Simple C/C++ TBAA"}
!193 = !DILocation(line: 234, column: 39, scope: !173)
!194 = !DILocation(line: 235, column: 61, scope: !173)
!195 = !DILocation(line: 236, column: 51, scope: !173)
!196 = !DILocation(line: 238, column: 36, scope: !173)
!197 = !DILocation(line: 238, column: 41, scope: !173)
!198 = !DILocation(line: 238, column: 52, scope: !173)
!199 = !DILocation(line: 238, column: 3, scope: !173)
!200 = !DILocation(line: 239, column: 1, scope: !173)
!201 = distinct !DISubprogram(name: "gt_outputformatchaingeneric", scope: !2, file: !2, line: 199, type: !202, scopeLine: 204, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !205)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !204, !165, !176, !181}
!204 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213}
!206 = !DILocalVariable(name: "silent", arg: 1, scope: !201, file: !2, line: 200, type: !204)
!207 = !DILocalVariable(name: "data", arg: 2, scope: !201, file: !2, line: 201, type: !165)
!208 = !DILocalVariable(name: "matchtable", arg: 3, scope: !201, file: !2, line: 202, type: !176)
!209 = !DILocalVariable(name: "chain", arg: 4, scope: !201, file: !2, line: 203, type: !181)
!210 = !DILocalVariable(name: "idx", scope: !201, file: !2, line: 205, type: !162)
!211 = !DILocalVariable(name: "chainlength", scope: !201, file: !2, line: 205, type: !162)
!212 = !DILocalVariable(name: "counter", scope: !201, file: !2, line: 206, type: !157)
!213 = !DILocalVariable(name: "value", scope: !214, file: !2, line: 213, type: !216)
!214 = distinct !DILexicalBlock(scope: !215, file: !2, line: 212, column: 3)
!215 = distinct !DILexicalBlock(scope: !201, file: !2, line: 211, column: 7)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtChain2Dimmatchvalues", file: !179, line: 67, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 61, size: 320, elements: !218)
!218 = !{!219, !222, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !217, file: !179, line: 63, baseType: !220, size: 128)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 128, elements: !46)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtChain2Dimpostype", file: !179, line: 44, baseType: !162)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !217, file: !179, line: 65, baseType: !220, size: 128, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !217, file: !179, line: 66, baseType: !224, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtChain2Dimscoretype", file: !179, line: 48, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtWord", file: !163, line: 94, baseType: !226)
!226 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!227 = !{!228, !228, i64 0}
!228 = !{!"_Bool", !191, i64 0}
!229 = !DILocation(line: 200, column: 38, scope: !201)
!230 = !DILocation(line: 201, column: 39, scope: !201)
!231 = !DILocation(line: 202, column: 62, scope: !201)
!232 = !DILocation(line: 203, column: 52, scope: !201)
!233 = !DILocation(line: 205, column: 3, scope: !201)
!234 = !DILocation(line: 205, column: 11, scope: !201)
!235 = !DILocation(line: 205, column: 16, scope: !201)
!236 = !DILocation(line: 206, column: 3, scope: !201)
!237 = !DILocation(line: 206, column: 12, scope: !201)
!238 = !DILocation(line: 206, column: 34, scope: !201)
!239 = !DILocation(line: 208, column: 38, scope: !201)
!240 = !DILocation(line: 208, column: 17, scope: !201)
!241 = !DILocation(line: 208, column: 15, scope: !201)
!242 = !{!243, !243, i64 0}
!243 = !{!"long", !191, i64 0}
!244 = !DILocation(line: 210, column: 10, scope: !201)
!245 = !DILocation(line: 210, column: 19, scope: !201)
!246 = !{!247, !243, i64 0}
!247 = !{!"", !243, i64 0}
!248 = !DILocation(line: 210, column: 32, scope: !201)
!249 = !DILocation(line: 210, column: 64, scope: !201)
!250 = !DILocation(line: 210, column: 44, scope: !201)
!251 = !DILocation(line: 209, column: 3, scope: !201)
!252 = !DILocation(line: 211, column: 8, scope: !215)
!253 = !{i8 0, i8 2}
!254 = !{}
!255 = !DILocation(line: 211, column: 7, scope: !201)
!256 = !DILocation(line: 213, column: 5, scope: !214)
!257 = !DILocation(line: 213, column: 28, scope: !214)
!258 = !DILocation(line: 215, column: 39, scope: !259)
!259 = distinct !DILexicalBlock(scope: !214, file: !2, line: 215, column: 9)
!260 = !DILocation(line: 215, column: 9, scope: !259)
!261 = !DILocation(line: 215, column: 9, scope: !214)
!262 = !DILocation(line: 217, column: 16, scope: !263)
!263 = distinct !DILexicalBlock(scope: !264, file: !2, line: 217, column: 7)
!264 = distinct !DILexicalBlock(scope: !259, file: !2, line: 216, column: 5)
!265 = !DILocation(line: 217, column: 15, scope: !263)
!266 = !DILocation(line: 217, column: 12, scope: !263)
!267 = !DILocation(line: 217, column: 29, scope: !268)
!268 = distinct !DILexicalBlock(scope: !263, file: !2, line: 217, column: 7)
!269 = !DILocation(line: 217, column: 33, scope: !268)
!270 = !DILocation(line: 217, column: 7, scope: !263)
!271 = !DILocation(line: 219, column: 43, scope: !272)
!272 = distinct !DILexicalBlock(scope: !268, file: !2, line: 218, column: 7)
!273 = !DILocation(line: 219, column: 55, scope: !272)
!274 = !DILocation(line: 219, column: 62, scope: !272)
!275 = !DILocation(line: 219, column: 66, scope: !272)
!276 = !DILocation(line: 219, column: 9, scope: !272)
!277 = !DILocation(line: 220, column: 33, scope: !272)
!278 = !DILocation(line: 220, column: 9, scope: !272)
!279 = !DILocation(line: 221, column: 7, scope: !272)
!280 = !DILocation(line: 217, column: 41, scope: !268)
!281 = !DILocation(line: 217, column: 7, scope: !268)
!282 = distinct !{!282, !270, !283, !284}
!283 = !DILocation(line: 221, column: 7, scope: !263)
!284 = !{!"llvm.loop.mustprogress"}
!285 = !DILocation(line: 222, column: 5, scope: !264)
!286 = !DILocation(line: 224, column: 15, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !2, line: 224, column: 7)
!288 = distinct !DILexicalBlock(scope: !259, file: !2, line: 223, column: 5)
!289 = !DILocation(line: 224, column: 12, scope: !287)
!290 = !DILocation(line: 224, column: 19, scope: !291)
!291 = distinct !DILexicalBlock(scope: !287, file: !2, line: 224, column: 7)
!292 = !DILocation(line: 224, column: 25, scope: !291)
!293 = !DILocation(line: 224, column: 23, scope: !291)
!294 = !DILocation(line: 224, column: 7, scope: !287)
!295 = !DILocation(line: 226, column: 43, scope: !296)
!296 = distinct !DILexicalBlock(scope: !291, file: !2, line: 225, column: 7)
!297 = !DILocation(line: 226, column: 55, scope: !296)
!298 = !DILocation(line: 226, column: 62, scope: !296)
!299 = !DILocation(line: 226, column: 9, scope: !296)
!300 = !DILocation(line: 227, column: 33, scope: !296)
!301 = !DILocation(line: 227, column: 9, scope: !296)
!302 = !DILocation(line: 228, column: 7, scope: !296)
!303 = !DILocation(line: 224, column: 41, scope: !291)
!304 = !DILocation(line: 224, column: 7, scope: !291)
!305 = distinct !{!305, !294, !306, !284}
!306 = !DILocation(line: 228, column: 7, scope: !287)
!307 = !DILocation(line: 230, column: 3, scope: !215)
!308 = !DILocation(line: 230, column: 3, scope: !214)
!309 = !DILocation(line: 231, column: 3, scope: !201)
!310 = !DILocation(line: 231, column: 12, scope: !201)
!311 = !DILocation(line: 231, column: 24, scope: !201)
!312 = !DILocation(line: 232, column: 1, scope: !201)
!313 = distinct !DISubprogram(name: "gt_outputformatchain", scope: !2, file: !2, line: 241, type: !174, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !314)
!314 = !{!315, !316, !317}
!315 = !DILocalVariable(name: "data", arg: 1, scope: !313, file: !2, line: 241, type: !165)
!316 = !DILocalVariable(name: "matchtable", arg: 2, scope: !313, file: !2, line: 242, type: !176)
!317 = !DILocalVariable(name: "chain", arg: 3, scope: !313, file: !2, line: 243, type: !181)
!318 = !DILocation(line: 241, column: 33, scope: !313)
!319 = !DILocation(line: 242, column: 56, scope: !313)
!320 = !DILocation(line: 243, column: 46, scope: !313)
!321 = !DILocation(line: 245, column: 37, scope: !313)
!322 = !DILocation(line: 245, column: 42, scope: !313)
!323 = !DILocation(line: 245, column: 53, scope: !313)
!324 = !DILocation(line: 245, column: 3, scope: !313)
!325 = !DILocation(line: 246, column: 1, scope: !313)
!326 = distinct !DISubprogram(name: "gt_chain2dim", scope: !2, file: !2, line: 302, type: !327, scopeLine: 303, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !155)
!327 = !DISubroutineType(types: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtTool", file: !331, line: 26, baseType: !332)
!331 = !DIFile(filename: "src/core/tool_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e867124201284063b8eb5758ec6a469a")
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtTool", file: !331, line: 26, flags: DIFlagFwdDecl)
!333 = !DILocation(line: 304, column: 10, scope: !326)
!334 = !DILocation(line: 304, column: 3, scope: !326)
!335 = !DISubprogram(name: "gt_tool_new", scope: !331, file: !331, line: 66, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!336 = !DISubroutineType(types: !337)
!337 = !{!329, !338, !342, !346, !354, !363}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsNew", file: !331, line: 30, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!165}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsDelete", file: !331, line: 33, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !165}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolOptionParserNew", file: !331, line: 36, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!350, !165}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOptionParser", file: !352, line: 27, baseType: !353)
!352 = !DIFile(filename: "src/core/option_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "4af8e95b11f2236d309c3019659f4935")
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtOptionParser", file: !352, line: 27, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsCheck", file: !331, line: 41, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!358, !358, !165, !359}
!358 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !361, line: 44, baseType: !362)
!361 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !361, line: 44, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolRunner", file: !331, line: 52, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!358, !358, !367, !358, !165, !359}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!369 = distinct !DISubprogram(name: "gt_chain2dim_arguments_new", scope: !2, file: !2, line: 24, type: !340, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155)
!370 = !DILocation(line: 26, column: 10, scope: !369)
!371 = !DILocation(line: 26, column: 3, scope: !369)
!372 = distinct !DISubprogram(name: "gt_chain2dim_arguments_delete", scope: !2, file: !2, line: 29, type: !344, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !373)
!373 = !{!374, !375}
!374 = !DILocalVariable(name: "tool_arguments", arg: 1, scope: !372, file: !2, line: 29, type: !165)
!375 = !DILocalVariable(name: "arguments", scope: !372, file: !2, line: 31, type: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtChain2dimoptions", file: !378, line: 43, baseType: !379)
!378 = !DIFile(filename: "src/tools/gt_chain2dim.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e98b9d2ba6e9c76f6515cadace7e0b24")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 29, size: 704, elements: !380)
!380 = !{!381, !382, !383, !385, !386, !391, !396, !397, !401, !402, !403, !404}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !379, file: !378, line: 31, baseType: !204, size: 8)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !379, file: !378, line: 32, baseType: !204, size: 8, offset: 8)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "weightfactor", scope: !379, file: !378, line: 33, baseType: !384, size: 64, offset: 64)
!384 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "maxgap", scope: !379, file: !378, line: 34, baseType: !162, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "matchfile", scope: !379, file: !378, line: 35, baseType: !387, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStr", file: !389, line: 27, baseType: !390)
!389 = !DIFile(filename: "src/core/str_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "654ceffd2f9ff17a42a8522fe21401e1")
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStr", file: !389, line: 27, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "globalargs", scope: !379, file: !378, line: 36, baseType: !392, size: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStrArray", file: !394, line: 24, baseType: !395)
!394 = !DIFile(filename: "src/core/str_array_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "d2f5724ae7121552c301a489d5e7f125")
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStrArray", file: !394, line: 24, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "localargs", scope: !379, file: !378, line: 37, baseType: !392, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "refoptionmaxgap", scope: !379, file: !378, line: 38, baseType: !398, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOption", file: !352, line: 33, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtOption", file: !352, line: 33, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "refoptionweightfactor", scope: !379, file: !378, line: 39, baseType: !398, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "refoptionglobal", scope: !379, file: !378, line: 40, baseType: !398, size: 64, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "refoptionlocal", scope: !379, file: !378, line: 41, baseType: !398, size: 64, offset: 576)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "gtchainmode", scope: !379, file: !378, line: 42, baseType: !405, size: 64, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtChain2Dimmode", file: !179, line: 79, baseType: !407)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtChain2Dimmode", file: !179, line: 79, flags: DIFlagFwdDecl)
!408 = !DILocation(line: 29, column: 50, scope: !372)
!409 = !DILocation(line: 31, column: 3, scope: !372)
!410 = !DILocation(line: 31, column: 23, scope: !372)
!411 = !DILocation(line: 31, column: 35, scope: !372)
!412 = !DILocation(line: 33, column: 8, scope: !413)
!413 = distinct !DILexicalBlock(scope: !372, file: !2, line: 33, column: 7)
!414 = !DILocation(line: 33, column: 7, scope: !372)
!415 = !DILocation(line: 35, column: 5, scope: !416)
!416 = distinct !DILexicalBlock(scope: !413, file: !2, line: 34, column: 3)
!417 = !DILocation(line: 37, column: 18, scope: !372)
!418 = !DILocation(line: 37, column: 29, scope: !372)
!419 = !{!420, !190, i64 24}
!420 = !{!"", !228, i64 0, !228, i64 1, !421, i64 8, !243, i64 16, !190, i64 24, !190, i64 32, !190, i64 40, !190, i64 48, !190, i64 56, !190, i64 64, !190, i64 72, !190, i64 80}
!421 = !{!"double", !191, i64 0}
!422 = !DILocation(line: 37, column: 3, scope: !372)
!423 = !DILocation(line: 38, column: 24, scope: !372)
!424 = !DILocation(line: 38, column: 35, scope: !372)
!425 = !{!420, !190, i64 32}
!426 = !DILocation(line: 38, column: 3, scope: !372)
!427 = !DILocation(line: 39, column: 24, scope: !372)
!428 = !DILocation(line: 39, column: 35, scope: !372)
!429 = !{!420, !190, i64 40}
!430 = !DILocation(line: 39, column: 3, scope: !372)
!431 = !DILocation(line: 40, column: 21, scope: !372)
!432 = !DILocation(line: 40, column: 32, scope: !372)
!433 = !{!420, !190, i64 48}
!434 = !DILocation(line: 40, column: 3, scope: !372)
!435 = !DILocation(line: 41, column: 21, scope: !372)
!436 = !DILocation(line: 41, column: 32, scope: !372)
!437 = !{!420, !190, i64 56}
!438 = !DILocation(line: 41, column: 3, scope: !372)
!439 = !DILocation(line: 42, column: 21, scope: !372)
!440 = !DILocation(line: 42, column: 32, scope: !372)
!441 = !{!420, !190, i64 64}
!442 = !DILocation(line: 42, column: 3, scope: !372)
!443 = !DILocation(line: 43, column: 21, scope: !372)
!444 = !DILocation(line: 43, column: 32, scope: !372)
!445 = !{!420, !190, i64 72}
!446 = !DILocation(line: 43, column: 3, scope: !372)
!447 = !DILocation(line: 44, column: 3, scope: !372)
!448 = !DILocation(line: 45, column: 1, scope: !372)
!449 = distinct !DISubprogram(name: "gt_chain2dim_option_parser_new", scope: !2, file: !2, line: 47, type: !348, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !450)
!450 = !{!451, !452, !453, !454, !455, !456}
!451 = !DILocalVariable(name: "tool_arguments", arg: 1, scope: !449, file: !2, line: 47, type: !165)
!452 = !DILocalVariable(name: "arguments", scope: !449, file: !2, line: 49, type: !376)
!453 = !DILocalVariable(name: "op", scope: !449, file: !2, line: 50, type: !350)
!454 = !DILocalVariable(name: "option", scope: !449, file: !2, line: 51, type: !398)
!455 = !DILocalVariable(name: "optionglobal", scope: !449, file: !2, line: 51, type: !398)
!456 = !DILocalVariable(name: "optionlocal", scope: !449, file: !2, line: 51, type: !398)
!457 = !DILocation(line: 47, column: 62, scope: !449)
!458 = !DILocation(line: 49, column: 3, scope: !449)
!459 = !DILocation(line: 49, column: 23, scope: !449)
!460 = !DILocation(line: 49, column: 35, scope: !449)
!461 = !DILocation(line: 50, column: 3, scope: !449)
!462 = !DILocation(line: 50, column: 19, scope: !449)
!463 = !DILocation(line: 51, column: 3, scope: !449)
!464 = !DILocation(line: 51, column: 13, scope: !449)
!465 = !DILocation(line: 51, column: 22, scope: !449)
!466 = !DILocation(line: 51, column: 37, scope: !449)
!467 = !DILocation(line: 53, column: 3, scope: !449)
!468 = !DILocation(line: 53, column: 3, scope: !469)
!469 = distinct !DILexicalBlock(scope: !470, file: !2, line: 53, column: 3)
!470 = distinct !DILexicalBlock(scope: !449, file: !2, line: 53, column: 3)
!471 = !DILocation(line: 53, column: 3, scope: !470)
!472 = !DILocation(line: 53, column: 3, scope: !473)
!473 = distinct !DILexicalBlock(scope: !469, file: !2, line: 53, column: 3)
!474 = !DILocation(line: 54, column: 26, scope: !449)
!475 = !DILocation(line: 54, column: 3, scope: !449)
!476 = !DILocation(line: 54, column: 14, scope: !449)
!477 = !DILocation(line: 54, column: 24, scope: !449)
!478 = !DILocation(line: 55, column: 27, scope: !449)
!479 = !DILocation(line: 55, column: 3, scope: !449)
!480 = !DILocation(line: 55, column: 14, scope: !449)
!481 = !DILocation(line: 55, column: 25, scope: !449)
!482 = !DILocation(line: 56, column: 26, scope: !449)
!483 = !DILocation(line: 56, column: 3, scope: !449)
!484 = !DILocation(line: 56, column: 14, scope: !449)
!485 = !DILocation(line: 56, column: 24, scope: !449)
!486 = !DILocation(line: 58, column: 8, scope: !449)
!487 = !DILocation(line: 58, column: 6, scope: !449)
!488 = !DILocation(line: 61, column: 37, scope: !449)
!489 = !DILocation(line: 61, column: 3, scope: !449)
!490 = !DILocation(line: 64, column: 35, scope: !449)
!491 = !DILocation(line: 64, column: 46, scope: !449)
!492 = !DILocation(line: 62, column: 12, scope: !449)
!493 = !DILocation(line: 62, column: 10, scope: !449)
!494 = !DILocation(line: 65, column: 31, scope: !449)
!495 = !DILocation(line: 65, column: 35, scope: !449)
!496 = !DILocation(line: 65, column: 3, scope: !449)
!497 = !DILocation(line: 66, column: 26, scope: !449)
!498 = !DILocation(line: 66, column: 3, scope: !449)
!499 = !DILocation(line: 76, column: 20, scope: !449)
!500 = !DILocation(line: 76, column: 31, scope: !449)
!501 = !DILocation(line: 68, column: 18, scope: !449)
!502 = !DILocation(line: 68, column: 16, scope: !449)
!503 = !DILocation(line: 77, column: 34, scope: !449)
!504 = !DILocation(line: 77, column: 3, scope: !449)
!505 = !DILocation(line: 78, column: 47, scope: !449)
!506 = !DILocation(line: 78, column: 32, scope: !449)
!507 = !DILocation(line: 78, column: 3, scope: !449)
!508 = !DILocation(line: 78, column: 14, scope: !449)
!509 = !DILocation(line: 78, column: 30, scope: !449)
!510 = !DILocation(line: 79, column: 31, scope: !449)
!511 = !DILocation(line: 79, column: 35, scope: !449)
!512 = !DILocation(line: 79, column: 3, scope: !449)
!513 = !DILocation(line: 96, column: 20, scope: !449)
!514 = !DILocation(line: 96, column: 31, scope: !449)
!515 = !DILocation(line: 81, column: 17, scope: !449)
!516 = !DILocation(line: 81, column: 15, scope: !449)
!517 = !DILocation(line: 97, column: 34, scope: !449)
!518 = !DILocation(line: 97, column: 3, scope: !449)
!519 = !DILocation(line: 98, column: 31, scope: !449)
!520 = !DILocation(line: 98, column: 35, scope: !449)
!521 = !DILocation(line: 98, column: 3, scope: !449)
!522 = !DILocation(line: 99, column: 45, scope: !449)
!523 = !DILocation(line: 99, column: 31, scope: !449)
!524 = !DILocation(line: 99, column: 3, scope: !449)
!525 = !DILocation(line: 99, column: 14, scope: !449)
!526 = !DILocation(line: 99, column: 29, scope: !449)
!527 = !DILocation(line: 100, column: 21, scope: !449)
!528 = !DILocation(line: 100, column: 33, scope: !449)
!529 = !DILocation(line: 100, column: 3, scope: !449)
!530 = !DILocation(line: 105, column: 39, scope: !449)
!531 = !DILocation(line: 105, column: 50, scope: !449)
!532 = !DILocation(line: 101, column: 12, scope: !449)
!533 = !DILocation(line: 101, column: 10, scope: !449)
!534 = !DILocation(line: 106, column: 53, scope: !449)
!535 = !DILocation(line: 106, column: 38, scope: !449)
!536 = !DILocation(line: 106, column: 3, scope: !449)
!537 = !DILocation(line: 106, column: 14, scope: !449)
!538 = !DILocation(line: 106, column: 36, scope: !449)
!539 = !DILocation(line: 107, column: 31, scope: !449)
!540 = !DILocation(line: 107, column: 35, scope: !449)
!541 = !DILocation(line: 107, column: 3, scope: !449)
!542 = !DILocation(line: 109, column: 43, scope: !449)
!543 = !DILocation(line: 109, column: 54, scope: !449)
!544 = !DILocation(line: 108, column: 12, scope: !449)
!545 = !DILocation(line: 108, column: 10, scope: !449)
!546 = !DILocation(line: 110, column: 46, scope: !449)
!547 = !DILocation(line: 110, column: 32, scope: !449)
!548 = !DILocation(line: 110, column: 3, scope: !449)
!549 = !DILocation(line: 110, column: 14, scope: !449)
!550 = !DILocation(line: 110, column: 30, scope: !449)
!551 = !DILocation(line: 111, column: 31, scope: !449)
!552 = !DILocation(line: 111, column: 35, scope: !449)
!553 = !DILocation(line: 111, column: 3, scope: !449)
!554 = !DILocation(line: 114, column: 41, scope: !449)
!555 = !DILocation(line: 114, column: 52, scope: !449)
!556 = !DILocation(line: 112, column: 12, scope: !449)
!557 = !DILocation(line: 112, column: 10, scope: !449)
!558 = !DILocation(line: 115, column: 31, scope: !449)
!559 = !DILocation(line: 115, column: 35, scope: !449)
!560 = !DILocation(line: 115, column: 3, scope: !449)
!561 = !DILocation(line: 116, column: 35, scope: !449)
!562 = !DILocation(line: 116, column: 46, scope: !449)
!563 = !DILocation(line: 116, column: 12, scope: !449)
!564 = !DILocation(line: 116, column: 10, scope: !449)
!565 = !DILocation(line: 117, column: 31, scope: !449)
!566 = !DILocation(line: 117, column: 35, scope: !449)
!567 = !DILocation(line: 117, column: 3, scope: !449)
!568 = !DILocation(line: 118, column: 10, scope: !449)
!569 = !DILocation(line: 119, column: 1, scope: !449)
!570 = !DILocation(line: 118, column: 3, scope: !449)
!571 = distinct !DISubprogram(name: "gt_chain2dim_arguments_check", scope: !2, file: !2, line: 121, type: !356, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !572)
!572 = !{!573, !574, !575, !576, !577, !578, !579, !582}
!573 = !DILocalVariable(name: "rest_argc", arg: 1, scope: !571, file: !2, line: 121, type: !358)
!574 = !DILocalVariable(name: "tool_arguments", arg: 2, scope: !571, file: !2, line: 122, type: !165)
!575 = !DILocalVariable(name: "err", arg: 3, scope: !571, file: !2, line: 123, type: !359)
!576 = !DILocalVariable(name: "arguments", scope: !571, file: !2, line: 125, type: !376)
!577 = !DILocalVariable(name: "globalargs", scope: !571, file: !2, line: 126, type: !368)
!578 = !DILocalVariable(name: "localargs", scope: !571, file: !2, line: 126, type: !368)
!579 = !DILocalVariable(name: "globalargsnum", scope: !580, file: !2, line: 148, type: !162)
!580 = distinct !DILexicalBlock(scope: !581, file: !2, line: 147, column: 3)
!581 = distinct !DILexicalBlock(scope: !571, file: !2, line: 146, column: 7)
!582 = !DILocalVariable(name: "localargsnum", scope: !583, file: !2, line: 161, type: !162)
!583 = distinct !DILexicalBlock(scope: !584, file: !2, line: 160, column: 3)
!584 = distinct !DILexicalBlock(scope: !571, file: !2, line: 159, column: 7)
!585 = !{!586, !586, i64 0}
!586 = !{!"int", !191, i64 0}
!587 = !DILocation(line: 121, column: 56, scope: !571)
!588 = !DILocation(line: 122, column: 48, scope: !571)
!589 = !DILocation(line: 123, column: 52, scope: !571)
!590 = !DILocation(line: 125, column: 3, scope: !571)
!591 = !DILocation(line: 125, column: 23, scope: !571)
!592 = !DILocation(line: 125, column: 35, scope: !571)
!593 = !DILocation(line: 126, column: 3, scope: !571)
!594 = !DILocation(line: 126, column: 15, scope: !571)
!595 = !DILocation(line: 126, column: 35, scope: !571)
!596 = !DILocation(line: 128, column: 25, scope: !597)
!597 = distinct !DILexicalBlock(scope: !571, file: !2, line: 128, column: 7)
!598 = !DILocation(line: 128, column: 36, scope: !597)
!599 = !DILocation(line: 128, column: 7, scope: !597)
!600 = !DILocation(line: 128, column: 7, scope: !571)
!601 = !DILocation(line: 130, column: 9, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !2, line: 130, column: 9)
!603 = distinct !DILexicalBlock(scope: !597, file: !2, line: 129, column: 3)
!604 = !DILocation(line: 130, column: 20, scope: !602)
!605 = !{!420, !243, i64 16}
!606 = !DILocation(line: 130, column: 27, scope: !602)
!607 = !DILocation(line: 130, column: 9, scope: !603)
!608 = !DILocation(line: 132, column: 20, scope: !609)
!609 = distinct !DILexicalBlock(scope: !602, file: !2, line: 131, column: 5)
!610 = !DILocation(line: 132, column: 7, scope: !609)
!611 = !DILocation(line: 133, column: 7, scope: !609)
!612 = !DILocation(line: 135, column: 3, scope: !603)
!613 = !DILocation(line: 136, column: 25, scope: !614)
!614 = distinct !DILexicalBlock(scope: !571, file: !2, line: 136, column: 7)
!615 = !DILocation(line: 136, column: 36, scope: !614)
!616 = !DILocation(line: 136, column: 7, scope: !614)
!617 = !DILocation(line: 136, column: 7, scope: !571)
!618 = !DILocation(line: 138, column: 9, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !2, line: 138, column: 9)
!620 = distinct !DILexicalBlock(scope: !614, file: !2, line: 137, column: 3)
!621 = !DILocation(line: 138, column: 20, scope: !619)
!622 = !{!420, !421, i64 8}
!623 = !DILocation(line: 138, column: 33, scope: !619)
!624 = !DILocation(line: 138, column: 9, scope: !620)
!625 = !DILocation(line: 140, column: 20, scope: !626)
!626 = distinct !DILexicalBlock(scope: !619, file: !2, line: 139, column: 5)
!627 = !DILocation(line: 140, column: 7, scope: !626)
!628 = !DILocation(line: 141, column: 7, scope: !626)
!629 = !DILocation(line: 143, column: 3, scope: !620)
!630 = !DILocation(line: 144, column: 3, scope: !571)
!631 = !DILocation(line: 144, column: 3, scope: !632)
!632 = distinct !DILexicalBlock(scope: !633, file: !2, line: 144, column: 3)
!633 = distinct !DILexicalBlock(scope: !571, file: !2, line: 144, column: 3)
!634 = !DILocation(line: 144, column: 3, scope: !633)
!635 = !DILocation(line: 144, column: 3, scope: !636)
!636 = distinct !DILexicalBlock(scope: !632, file: !2, line: 144, column: 3)
!637 = !DILocation(line: 145, column: 3, scope: !571)
!638 = !DILocation(line: 145, column: 3, scope: !639)
!639 = distinct !DILexicalBlock(scope: !640, file: !2, line: 145, column: 3)
!640 = distinct !DILexicalBlock(scope: !571, file: !2, line: 145, column: 3)
!641 = !DILocation(line: 145, column: 3, scope: !640)
!642 = !DILocation(line: 145, column: 3, scope: !643)
!643 = distinct !DILexicalBlock(scope: !639, file: !2, line: 145, column: 3)
!644 = !DILocation(line: 146, column: 24, scope: !581)
!645 = !DILocation(line: 146, column: 35, scope: !581)
!646 = !DILocation(line: 146, column: 7, scope: !581)
!647 = !DILocation(line: 146, column: 7, scope: !571)
!648 = !DILocation(line: 148, column: 5, scope: !580)
!649 = !DILocation(line: 148, column: 13, scope: !580)
!650 = !DILocation(line: 148, column: 47, scope: !580)
!651 = !DILocation(line: 148, column: 58, scope: !580)
!652 = !DILocation(line: 148, column: 29, scope: !580)
!653 = !DILocation(line: 149, column: 9, scope: !654)
!654 = distinct !DILexicalBlock(scope: !580, file: !2, line: 149, column: 9)
!655 = !DILocation(line: 149, column: 23, scope: !654)
!656 = !DILocation(line: 149, column: 9, scope: !580)
!657 = !DILocation(line: 151, column: 20, scope: !658)
!658 = distinct !DILexicalBlock(scope: !654, file: !2, line: 150, column: 5)
!659 = !DILocation(line: 151, column: 7, scope: !658)
!660 = !DILocation(line: 152, column: 7, scope: !658)
!661 = !DILocation(line: 154, column: 9, scope: !662)
!662 = distinct !DILexicalBlock(scope: !580, file: !2, line: 154, column: 9)
!663 = !DILocation(line: 154, column: 23, scope: !662)
!664 = !DILocation(line: 154, column: 9, scope: !580)
!665 = !DILocation(line: 156, column: 37, scope: !666)
!666 = distinct !DILexicalBlock(scope: !662, file: !2, line: 155, column: 5)
!667 = !DILocation(line: 156, column: 48, scope: !666)
!668 = !DILocation(line: 156, column: 20, scope: !666)
!669 = !DILocation(line: 156, column: 18, scope: !666)
!670 = !DILocation(line: 157, column: 5, scope: !666)
!671 = !DILocation(line: 158, column: 3, scope: !581)
!672 = !DILocation(line: 158, column: 3, scope: !580)
!673 = !DILocation(line: 159, column: 24, scope: !584)
!674 = !DILocation(line: 159, column: 35, scope: !584)
!675 = !DILocation(line: 159, column: 7, scope: !584)
!676 = !DILocation(line: 159, column: 7, scope: !571)
!677 = !DILocation(line: 161, column: 5, scope: !583)
!678 = !DILocation(line: 161, column: 13, scope: !583)
!679 = !DILocation(line: 161, column: 46, scope: !583)
!680 = !DILocation(line: 161, column: 57, scope: !583)
!681 = !DILocation(line: 161, column: 28, scope: !583)
!682 = !DILocation(line: 162, column: 9, scope: !683)
!683 = distinct !DILexicalBlock(scope: !583, file: !2, line: 162, column: 9)
!684 = !DILocation(line: 162, column: 22, scope: !683)
!685 = !DILocation(line: 162, column: 9, scope: !583)
!686 = !DILocation(line: 164, column: 20, scope: !687)
!687 = distinct !DILexicalBlock(scope: !683, file: !2, line: 163, column: 5)
!688 = !DILocation(line: 164, column: 7, scope: !687)
!689 = !DILocation(line: 165, column: 7, scope: !687)
!690 = !DILocation(line: 167, column: 9, scope: !691)
!691 = distinct !DILexicalBlock(scope: !583, file: !2, line: 167, column: 9)
!692 = !DILocation(line: 167, column: 22, scope: !691)
!693 = !DILocation(line: 167, column: 9, scope: !583)
!694 = !DILocation(line: 169, column: 36, scope: !695)
!695 = distinct !DILexicalBlock(scope: !691, file: !2, line: 168, column: 5)
!696 = !DILocation(line: 169, column: 47, scope: !695)
!697 = !DILocation(line: 169, column: 19, scope: !695)
!698 = !DILocation(line: 169, column: 17, scope: !695)
!699 = !DILocation(line: 170, column: 5, scope: !695)
!700 = !DILocation(line: 171, column: 3, scope: !584)
!701 = !DILocation(line: 171, column: 3, scope: !583)
!702 = !DILocation(line: 172, column: 24, scope: !703)
!703 = distinct !DILexicalBlock(scope: !571, file: !2, line: 172, column: 7)
!704 = !DILocation(line: 172, column: 35, scope: !703)
!705 = !DILocation(line: 172, column: 7, scope: !703)
!706 = !DILocation(line: 172, column: 58, scope: !703)
!707 = !DILocation(line: 173, column: 25, scope: !703)
!708 = !DILocation(line: 173, column: 36, scope: !703)
!709 = !DILocation(line: 173, column: 8, scope: !703)
!710 = !DILocation(line: 173, column: 52, scope: !703)
!711 = !DILocation(line: 174, column: 7, scope: !703)
!712 = !DILocation(line: 174, column: 18, scope: !703)
!713 = !DILocation(line: 172, column: 7, scope: !571)
!714 = !DILocation(line: 176, column: 18, scope: !715)
!715 = distinct !DILexicalBlock(scope: !703, file: !2, line: 175, column: 3)
!716 = !DILocation(line: 176, column: 5, scope: !715)
!717 = !DILocation(line: 182, column: 5, scope: !715)
!718 = !DILocation(line: 185, column: 30, scope: !571)
!719 = !DILocation(line: 185, column: 41, scope: !571)
!720 = !DILocation(line: 186, column: 47, scope: !571)
!721 = !DILocation(line: 186, column: 58, scope: !571)
!722 = !DILocation(line: 186, column: 30, scope: !571)
!723 = !DILocation(line: 187, column: 30, scope: !571)
!724 = !DILocation(line: 188, column: 47, scope: !571)
!725 = !DILocation(line: 188, column: 58, scope: !571)
!726 = !DILocation(line: 188, column: 30, scope: !571)
!727 = !DILocation(line: 189, column: 30, scope: !571)
!728 = !DILocation(line: 190, column: 30, scope: !571)
!729 = !DILocation(line: 185, column: 7, scope: !571)
!730 = !DILocation(line: 184, column: 3, scope: !571)
!731 = !DILocation(line: 184, column: 14, scope: !571)
!732 = !DILocation(line: 185, column: 5, scope: !571)
!733 = !{!420, !190, i64 80}
!734 = !DILocation(line: 191, column: 11, scope: !571)
!735 = !DILocation(line: 191, column: 22, scope: !571)
!736 = !DILocation(line: 191, column: 34, scope: !571)
!737 = !DILocation(line: 191, column: 10, scope: !571)
!738 = !DILocation(line: 191, column: 3, scope: !571)
!739 = !DILocation(line: 192, column: 1, scope: !571)
!740 = distinct !DISubprogram(name: "gt_chain2dim_runner", scope: !2, file: !2, line: 248, type: !365, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !750, !751, !756, !760, !762}
!742 = !DILocalVariable(name: "argc", arg: 1, scope: !740, file: !2, line: 248, type: !358)
!743 = !DILocalVariable(name: "argv", arg: 2, scope: !740, file: !2, line: 249, type: !367)
!744 = !DILocalVariable(name: "parsed_args", arg: 3, scope: !740, file: !2, line: 250, type: !358)
!745 = !DILocalVariable(name: "tool_arguments", arg: 4, scope: !740, file: !2, line: 251, type: !165)
!746 = !DILocalVariable(name: "err", arg: 5, scope: !740, file: !2, line: 252, type: !359)
!747 = !DILocalVariable(name: "arguments", scope: !740, file: !2, line: 254, type: !376)
!748 = !DILocalVariable(name: "matchtable", scope: !740, file: !2, line: 255, type: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!750 = !DILocalVariable(name: "haserr", scope: !740, file: !2, line: 256, type: !204)
!751 = !DILocalVariable(name: "logger", scope: !740, file: !2, line: 257, type: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtLogger", file: !754, line: 26, baseType: !755)
!754 = !DIFile(filename: "src/core/logger_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "076ebb09feb7de7a97ee09fc11eb7134")
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtLogger", file: !754, line: 26, flags: DIFlagFwdDecl)
!756 = !DILocalVariable(name: "presortdim", scope: !757, file: !2, line: 273, type: !759)
!757 = distinct !DILexicalBlock(scope: !758, file: !2, line: 272, column: 3)
!758 = distinct !DILexicalBlock(scope: !740, file: !2, line: 271, column: 7)
!759 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!760 = !DILocalVariable(name: "chain", scope: !757, file: !2, line: 274, type: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!762 = !DILocalVariable(name: "counter", scope: !757, file: !2, line: 275, type: !158)
!763 = !DILocation(line: 248, column: 47, scope: !740)
!764 = !DILocation(line: 249, column: 56, scope: !740)
!765 = !DILocation(line: 250, column: 47, scope: !740)
!766 = !DILocation(line: 251, column: 39, scope: !740)
!767 = !DILocation(line: 252, column: 43, scope: !740)
!768 = !DILocation(line: 254, column: 3, scope: !740)
!769 = !DILocation(line: 254, column: 23, scope: !740)
!770 = !DILocation(line: 254, column: 35, scope: !740)
!771 = !DILocation(line: 255, column: 3, scope: !740)
!772 = !DILocation(line: 255, column: 26, scope: !740)
!773 = !DILocation(line: 256, column: 3, scope: !740)
!774 = !DILocation(line: 256, column: 8, scope: !740)
!775 = !DILocation(line: 257, column: 3, scope: !740)
!776 = !DILocation(line: 257, column: 13, scope: !740)
!777 = !DILocation(line: 259, column: 3, scope: !740)
!778 = !DILocation(line: 259, column: 3, scope: !779)
!779 = distinct !DILexicalBlock(scope: !780, file: !2, line: 259, column: 3)
!780 = distinct !DILexicalBlock(scope: !740, file: !2, line: 259, column: 3)
!781 = !DILocation(line: 259, column: 3, scope: !780)
!782 = !DILocation(line: 259, column: 3, scope: !783)
!783 = distinct !DILexicalBlock(scope: !779, file: !2, line: 259, column: 3)
!784 = !DILocation(line: 260, column: 3, scope: !740)
!785 = !DILocation(line: 260, column: 3, scope: !786)
!786 = distinct !DILexicalBlock(scope: !787, file: !2, line: 260, column: 3)
!787 = distinct !DILexicalBlock(scope: !740, file: !2, line: 260, column: 3)
!788 = !DILocation(line: 260, column: 3, scope: !787)
!789 = !DILocation(line: 260, column: 3, scope: !790)
!790 = distinct !DILexicalBlock(scope: !786, file: !2, line: 260, column: 3)
!791 = !DILocation(line: 261, column: 3, scope: !740)
!792 = !DILocation(line: 261, column: 3, scope: !793)
!793 = distinct !DILexicalBlock(scope: !794, file: !2, line: 261, column: 3)
!794 = distinct !DILexicalBlock(scope: !740, file: !2, line: 261, column: 3)
!795 = !DILocation(line: 261, column: 3, scope: !794)
!796 = !DILocation(line: 261, column: 3, scope: !797)
!797 = distinct !DILexicalBlock(scope: !793, file: !2, line: 261, column: 3)
!798 = !DILocation(line: 263, column: 47, scope: !740)
!799 = !DILocation(line: 263, column: 58, scope: !740)
!800 = !DILocation(line: 264, column: 58, scope: !740)
!801 = !DILocation(line: 265, column: 58, scope: !740)
!802 = !DILocation(line: 264, column: 47, scope: !740)
!803 = !DILocation(line: 266, column: 47, scope: !740)
!804 = !DILocation(line: 263, column: 16, scope: !740)
!805 = !DILocation(line: 263, column: 14, scope: !740)
!806 = !DILocation(line: 267, column: 7, scope: !807)
!807 = distinct !DILexicalBlock(scope: !740, file: !2, line: 267, column: 7)
!808 = !DILocation(line: 267, column: 18, scope: !807)
!809 = !DILocation(line: 267, column: 7, scope: !740)
!810 = !DILocation(line: 269, column: 12, scope: !811)
!811 = distinct !DILexicalBlock(scope: !807, file: !2, line: 268, column: 3)
!812 = !DILocation(line: 270, column: 3, scope: !811)
!813 = !DILocation(line: 271, column: 8, scope: !758)
!814 = !DILocation(line: 271, column: 7, scope: !740)
!815 = !DILocation(line: 273, column: 5, scope: !757)
!816 = !DILocation(line: 273, column: 18, scope: !757)
!817 = !DILocation(line: 274, column: 5, scope: !757)
!818 = !DILocation(line: 274, column: 18, scope: !757)
!819 = !DILocation(line: 275, column: 5, scope: !757)
!820 = !DILocation(line: 275, column: 13, scope: !757)
!821 = !DILocation(line: 277, column: 28, scope: !757)
!822 = !DILocation(line: 277, column: 39, scope: !757)
!823 = !{!420, !228, i64 1}
!824 = !DILocation(line: 277, column: 72, scope: !757)
!825 = !DILocation(line: 277, column: 14, scope: !757)
!826 = !DILocation(line: 277, column: 12, scope: !757)
!827 = !DILocation(line: 278, column: 34, scope: !757)
!828 = !DILocation(line: 278, column: 42, scope: !757)
!829 = !DILocation(line: 278, column: 54, scope: !757)
!830 = !DILocation(line: 278, column: 5, scope: !757)
!831 = !DILocation(line: 279, column: 13, scope: !757)
!832 = !DILocation(line: 279, column: 11, scope: !757)
!833 = !DILocation(line: 280, column: 13, scope: !757)
!834 = !DILocation(line: 280, column: 26, scope: !757)
!835 = !DILocation(line: 281, column: 27, scope: !757)
!836 = !DILocation(line: 281, column: 38, scope: !757)
!837 = !DILocation(line: 282, column: 27, scope: !757)
!838 = !DILocation(line: 283, column: 27, scope: !757)
!839 = !DILocation(line: 285, column: 27, scope: !757)
!840 = !DILocation(line: 287, column: 27, scope: !757)
!841 = !DILocation(line: 287, column: 38, scope: !757)
!842 = !{!420, !228, i64 0}
!843 = !DILocation(line: 290, column: 27, scope: !757)
!844 = !DILocation(line: 281, column: 5, scope: !757)
!845 = !DILocation(line: 291, column: 27, scope: !757)
!846 = !DILocation(line: 291, column: 5, scope: !757)
!847 = !DILocation(line: 292, column: 3, scope: !758)
!848 = !DILocation(line: 292, column: 3, scope: !757)
!849 = !DILocation(line: 293, column: 29, scope: !740)
!850 = !DILocation(line: 293, column: 40, scope: !740)
!851 = !DILocation(line: 293, column: 3, scope: !740)
!852 = !DILocation(line: 294, column: 30, scope: !740)
!853 = !DILocation(line: 294, column: 3, scope: !740)
!854 = !DILocation(line: 295, column: 7, scope: !855)
!855 = distinct !DILexicalBlock(scope: !740, file: !2, line: 295, column: 7)
!856 = !DILocation(line: 295, column: 14, scope: !855)
!857 = !DILocation(line: 295, column: 7, scope: !740)
!858 = !DILocation(line: 297, column: 22, scope: !859)
!859 = distinct !DILexicalBlock(scope: !855, file: !2, line: 296, column: 3)
!860 = !DILocation(line: 297, column: 5, scope: !859)
!861 = !DILocation(line: 298, column: 3, scope: !859)
!862 = !DILocation(line: 299, column: 10, scope: !740)
!863 = !DILocation(line: 300, column: 1, scope: !740)
!864 = !DILocation(line: 299, column: 3, scope: !740)
!865 = !DISubprogram(name: "gt_chain_chainlength", scope: !179, file: !179, line: 160, type: !866, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!866 = !DISubroutineType(types: !867)
!867 = !{!162, !181}
!868 = !DISubprogram(name: "printf", scope: !869, file: !869, line: 356, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!869 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!870 = !DISubroutineType(types: !871)
!871 = !{!358, !872, null}
!872 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !368)
!873 = !DISubprogram(name: "gt_chain_chainscore", scope: !179, file: !179, line: 156, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!874 = !DISubroutineType(types: !875)
!875 = !{!224, !181}
!876 = !DISubprogram(name: "gt_chain_storedinreverseorder", scope: !179, file: !179, line: 164, type: !877, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!877 = !DISubroutineType(types: !878)
!878 = !{!204, !181}
!879 = !DISubprogram(name: "gt_chain_extractchainelem", scope: !179, file: !179, line: 168, type: !880, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !882, !176, !181, !162}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!883 = !DISubprogram(name: "gt_chain_printchainelem", scope: !179, file: !179, line: 175, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !886, !941}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !888, line: 7, baseType: !889)
!888 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !890, line: 49, size: 1728, elements: !891)
!890 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!891 = !{!892, !893, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !908, !910, !911, !912, !915, !917, !919, !923, !926, !928, !931, !934, !935, !936, !939, !940}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !889, file: !890, line: 51, baseType: !358, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !889, file: !890, line: 54, baseType: !894, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !889, file: !890, line: 55, baseType: !894, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !889, file: !890, line: 56, baseType: !894, size: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !889, file: !890, line: 57, baseType: !894, size: 64, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !889, file: !890, line: 58, baseType: !894, size: 64, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !889, file: !890, line: 59, baseType: !894, size: 64, offset: 384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !889, file: !890, line: 60, baseType: !894, size: 64, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !889, file: !890, line: 61, baseType: !894, size: 64, offset: 512)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !889, file: !890, line: 64, baseType: !894, size: 64, offset: 576)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !889, file: !890, line: 65, baseType: !894, size: 64, offset: 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !889, file: !890, line: 66, baseType: !894, size: 64, offset: 704)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !889, file: !890, line: 68, baseType: !906, size: 64, offset: 768)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !890, line: 36, flags: DIFlagFwdDecl)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !889, file: !890, line: 70, baseType: !909, size: 64, offset: 832)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !889, file: !890, line: 72, baseType: !358, size: 32, offset: 896)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !889, file: !890, line: 73, baseType: !358, size: 32, offset: 928)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !889, file: !890, line: 74, baseType: !913, size: 64, offset: 960)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !914, line: 152, baseType: !226)
!914 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !889, file: !890, line: 77, baseType: !916, size: 16, offset: 1024)
!916 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !889, file: !890, line: 78, baseType: !918, size: 8, offset: 1040)
!918 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !889, file: !890, line: 79, baseType: !920, size: 8, offset: 1048)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 1)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !889, file: !890, line: 81, baseType: !924, size: 64, offset: 1088)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !890, line: 43, baseType: null)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !889, file: !890, line: 89, baseType: !927, size: 64, offset: 1152)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !914, line: 153, baseType: !226)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !889, file: !890, line: 91, baseType: !929, size: 64, offset: 1216)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !890, line: 37, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !889, file: !890, line: 92, baseType: !932, size: 64, offset: 1280)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !890, line: 38, flags: DIFlagFwdDecl)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !889, file: !890, line: 93, baseType: !909, size: 64, offset: 1344)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !889, file: !890, line: 94, baseType: !165, size: 64, offset: 1408)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !889, file: !890, line: 95, baseType: !937, size: 64, offset: 1472)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !938, line: 70, baseType: !164)
!938 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !889, file: !890, line: 96, baseType: !358, size: 32, offset: 1536)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !889, file: !890, line: 98, baseType: !152, size: 160, offset: 1568)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!943 = !DISubprogram(name: "gt_malloc_mem", scope: !944, file: !944, line: 56, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!944 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!945 = !DISubroutineType(types: !946)
!946 = !{!165, !937, !368, !358}
!947 = !DISubprogram(name: "gt_str_delete", scope: !389, file: !389, line: 90, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !387}
!950 = !DISubprogram(name: "gt_str_array_delete", scope: !394, file: !394, line: 56, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !392}
!953 = !DISubprogram(name: "gt_option_delete", scope: !352, file: !352, line: 371, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !398}
!956 = !DISubprogram(name: "gt_free_mem", scope: !944, file: !944, line: 75, type: !957, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !165, !368, !358}
!959 = !DISubprogram(name: "fprintf", scope: !869, file: !869, line: 350, type: !960, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!960 = !DISubroutineType(types: !961)
!961 = !{!358, !962, !872, null}
!962 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !886)
!963 = !DISubprogram(name: "abort", scope: !964, file: !964, line: 598, type: !965, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!964 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!965 = !DISubroutineType(types: !966)
!966 = !{null}
!967 = !DISubprogram(name: "gt_str_new", scope: !389, file: !389, line: 30, type: !968, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!968 = !DISubroutineType(types: !969)
!969 = !{!387}
!970 = !DISubprogram(name: "gt_str_array_new", scope: !394, file: !394, line: 27, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!971 = !DISubroutineType(types: !972)
!972 = !{!392}
!973 = !DISubprogram(name: "gt_option_parser_new", scope: !352, file: !352, line: 63, type: !974, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!974 = !DISubroutineType(types: !975)
!975 = !{!350, !368, !368}
!976 = !DISubprogram(name: "gt_option_parser_set_mail_address", scope: !352, file: !352, line: 88, type: !977, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !350, !368}
!979 = !DISubprogram(name: "gt_option_new_filename", scope: !352, file: !352, line: 309, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!980 = !DISubroutineType(types: !981)
!981 = !{!398, !368, !368, !387}
!982 = !DISubprogram(name: "gt_option_parser_add_option", scope: !352, file: !352, line: 66, type: !983, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !350, !398}
!985 = !DISubprogram(name: "gt_option_is_mandatory", scope: !352, file: !352, line: 332, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!986 = !DISubprogram(name: "gt_option_new_string_array", scope: !352, file: !352, line: 296, type: !987, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!987 = !DISubroutineType(types: !988)
!988 = !{!398, !368, !368, !392}
