; ModuleID = 'samples/533.bc'
source_filename = "/local-ssd/pflask-sngep3v5y5lhffkqvvz3xxguxq6xajiv-build/aidengro/spack-stage-pflask-0.2-sngep3v5y5lhffkqvvz3xxguxq6xajiv/spack-src/src/dev.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [12 x i8] c"%s/dev/ptmx\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c"OOM\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [14 x i8] c"/dev/pts/ptmx\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [10 x i8] c"symlink()\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [8 x i8] c"chmod()\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [8 x i8] c"chown()\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [7 x i8] c"stat()\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [15 x i8] c"%s/dev/console\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [8 x i8] c"mknod()\00", align 1, !dbg !39
@.str.9 = private unnamed_addr constant [8 x i8] c"mount()\00", align 1, !dbg !41
@.str.10 = private unnamed_addr constant [12 x i8] c"/proc/kcore\00", align 1, !dbg !43

!149 = !DILocalVariable(name: "target", scope: !142, file: !2, line: 44, type: !145)
!150 = !{!151, !151, i64 0}
!151 = !{!"any pointer", !152, i64 0}
!152 = !{!"omnipotent char", !153, i64 0}
!153 = !{!"Simple C/C++ TBAA"}
!154 = !DILocation(line: 41, column: 22, scope: !142)
!155 = !DILocation(line: 42, column: 2, scope: !142)
!156 = !DILocation(line: 42, column: 6, scope: !142)
!157 = !DILocation(line: 44, column: 2, scope: !142)
!158 = !DILocation(line: 44, column: 15, scope: !142)
!159 = !DILocation(line: 46, column: 40, scope: !142)
!160 = !DILocation(line: 46, column: 7, scope: !142)
!161 = !DILocation(line: 46, column: 5, scope: !142)
!162 = !{!163, !163, i64 0}
!163 = !{!"int", !152, i64 0}
!164 = !DILocation(line: 47, column: 6, scope: !165)
!165 = distinct !DILexicalBlock(scope: !142, file: !2, line: 47, column: 6)
!166 = !DILocation(line: 47, column: 9, scope: !165)
!167 = !DILocation(line: 47, column: 6, scope: !142)
!168 = !DILocation(line: 47, column: 14, scope: !165)
!169 = !DILocation(line: 49, column: 32, scope: !142)
!170 = !DILocation(line: 49, column: 7, scope: !142)
!171 = !DILocation(line: 49, column: 5, scope: !142)
!172 = !DILocation(line: 50, column: 6, scope: !173)
!173 = distinct !DILexicalBlock(scope: !142, file: !2, line: 50, column: 6)
!174 = !DILocation(line: 50, column: 9, scope: !173)
!175 = !DILocation(line: 50, column: 6, scope: !142)
!176 = !DILocation(line: 50, column: 14, scope: !173)
!177 = !DILocation(line: 51, column: 1, scope: !142)
!178 = distinct !DISubprogram(name: "freep", scope: !179, file: !179, line: 37, type: !180, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !97, retainedNodes: !182)
!179 = !DIFile(filename: "spack-src/src/util.h", directory: "/local-ssd/pflask-sngep3v5y5lhffkqvvz3xxguxq6xajiv-build/aidengro/spack-stage-pflask-0.2-sngep3v5y5lhffkqvvz3xxguxq6xajiv", checksumkind: CSK_MD5, checksum: "082e393ece9f1958a2b3eb0d89933bd4")
!180 = !DISubroutineType(types: !181)
!181 = !{null, !132}
!182 = !{!183}
!183 = !DILocalVariable(name: "p", arg: 1, scope: !178, file: !179, line: 37, type: !132)
!184 = !DILocation(line: 37, column: 32, scope: !178)
!185 = !DILocation(line: 38, column: 6, scope: !186)
!186 = distinct !DILexicalBlock(scope: !178, file: !179, line: 38, column: 6)
!187 = !DILocation(line: 38, column: 8, scope: !186)
!188 = !DILocation(line: 38, column: 6, scope: !178)
!189 = !DILocation(line: 39, column: 3, scope: !186)
!190 = !DILocation(line: 41, column: 18, scope: !178)
!191 = !DILocation(line: 41, column: 7, scope: !178)
!192 = !DILocation(line: 41, column: 2, scope: !178)
!193 = !DILocation(line: 43, column: 12, scope: !178)
!194 = !DILocation(line: 43, column: 14, scope: !178)
!195 = !DILocation(line: 44, column: 1, scope: !178)
!196 = !DISubprogram(name: "asprintf", scope: !197, file: !197, line: 396, type: !198, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!197 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!198 = !DISubroutineType(types: !199)
!199 = !{!102, !200, !202, null}
!200 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!205 = !DISubprogram(name: "fail_printf", scope: !206, file: !206, line: 42, type: !207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!206 = !DIFile(filename: "spack-src/src/printf.h", directory: "/local-ssd/pflask-sngep3v5y5lhffkqvvz3xxguxq6xajiv-build/aidengro/spack-stage-pflask-0.2-sngep3v5y5lhffkqvvz3xxguxq6xajiv", checksumkind: CSK_MD5, checksum: "643369c196f5f87f2891f02b48b58e51")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !203, null}
!209 = !DISubprogram(name: "symlink", scope: !210, file: !210, line: 832, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!210 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!211 = !DISubroutineType(types: !212)
!212 = !{!102, !203, !203}
!213 = !DISubprogram(name: "sysf_printf", scope: !206, file: !206, line: 43, type: !207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!214 = distinct !DISubprogram(name: "make_console", scope: !2, file: !2, line: 53, type: !215, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !97, retainedNodes: !217)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !145, !145}
!217 = !{!218, !219, !220, !221, !263}
!218 = !DILocalVariable(name: "dest", arg: 1, scope: !214, file: !2, line: 53, type: !145)
!219 = !DILocalVariable(name: "console", arg: 2, scope: !214, file: !2, line: 53, type: !145)
!220 = !DILocalVariable(name: "rc", scope: !214, file: !2, line: 54, type: !102)
!221 = !DILocalVariable(name: "sb", scope: !214, file: !2, line: 56, type: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !223, line: 26, size: 1152, elements: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!224 = !{!225, !229, !231, !233, !236, !238, !240, !241, !242, !245, !247, !249, !257, !258, !259}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !222, file: !223, line: 31, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !227, line: 145, baseType: !228)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!228 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !222, file: !223, line: 36, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !227, line: 148, baseType: !228)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !222, file: !223, line: 44, baseType: !232, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !227, line: 151, baseType: !228)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !222, file: !223, line: 45, baseType: !234, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !227, line: 150, baseType: !235)
!235 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !222, file: !223, line: 47, baseType: !237, size: 32, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !227, line: 146, baseType: !235)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !222, file: !223, line: 48, baseType: !239, size: 32, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !227, line: 147, baseType: !235)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !222, file: !223, line: 50, baseType: !102, size: 32, offset: 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !222, file: !223, line: 52, baseType: !226, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !222, file: !223, line: 57, baseType: !243, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !227, line: 152, baseType: !244)
!244 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !222, file: !223, line: 61, baseType: !246, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !227, line: 175, baseType: !244)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !222, file: !223, line: 63, baseType: !248, size: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !227, line: 180, baseType: !244)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !222, file: !223, line: 74, baseType: !250, size: 128, offset: 576)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !251, line: 11, size: 128, elements: !252)
!251 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!252 = !{!253, !255}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !250, file: !251, line: 16, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !227, line: 160, baseType: !244)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !250, file: !251, line: 21, baseType: !256, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !227, line: 197, baseType: !244)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !222, file: !223, line: 75, baseType: !250, size: 128, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !222, file: !223, line: 76, baseType: !250, size: 128, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !222, file: !223, line: 89, baseType: !260, size: 192, offset: 960)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 192, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 3)
!263 = !DILocalVariable(name: "target", scope: !214, file: !2, line: 57, type: !145)
!264 = !DILocation(line: 53, column: 25, scope: !214)
!265 = !DILocation(line: 53, column: 37, scope: !214)
!266 = !DILocation(line: 54, column: 2, scope: !214)
!267 = !DILocation(line: 54, column: 6, scope: !214)
!268 = !DILocation(line: 56, column: 2, scope: !214)
!269 = !DILocation(line: 56, column: 14, scope: !214)
!270 = !DILocation(line: 57, column: 2, scope: !214)
!271 = !DILocation(line: 57, column: 15, scope: !214)
!272 = !DILocation(line: 59, column: 13, scope: !214)
!273 = !DILocation(line: 59, column: 7, scope: !214)
!274 = !DILocation(line: 59, column: 5, scope: !214)
!275 = !DILocation(line: 60, column: 6, scope: !276)
!276 = distinct !DILexicalBlock(scope: !214, file: !2, line: 60, column: 6)
!277 = !DILocation(line: 60, column: 9, scope: !276)
!278 = !DILocation(line: 60, column: 6, scope: !214)
!279 = !DILocation(line: 60, column: 14, scope: !276)
!280 = !DILocation(line: 62, column: 13, scope: !214)
!281 = !DILocation(line: 62, column: 7, scope: !214)
!282 = !DILocation(line: 62, column: 5, scope: !214)
!283 = !DILocation(line: 63, column: 6, scope: !284)
!284 = distinct !DILexicalBlock(scope: !214, file: !2, line: 63, column: 6)
!285 = !DILocation(line: 63, column: 9, scope: !284)
!286 = !DILocation(line: 63, column: 6, scope: !214)
!287 = !DILocation(line: 63, column: 14, scope: !284)
!288 = !DILocation(line: 65, column: 12, scope: !214)
!289 = !DILocation(line: 65, column: 7, scope: !214)
!290 = !DILocation(line: 65, column: 5, scope: !214)
!291 = !DILocation(line: 66, column: 6, scope: !292)
!292 = distinct !DILexicalBlock(scope: !214, file: !2, line: 66, column: 6)
!293 = !DILocation(line: 66, column: 9, scope: !292)
!294 = !DILocation(line: 66, column: 6, scope: !214)
!295 = !DILocation(line: 66, column: 14, scope: !292)
!296 = !DILocation(line: 68, column: 43, scope: !214)
!297 = !DILocation(line: 68, column: 7, scope: !214)
!298 = !DILocation(line: 68, column: 5, scope: !214)
!299 = !DILocation(line: 69, column: 6, scope: !300)
!300 = distinct !DILexicalBlock(scope: !214, file: !2, line: 69, column: 6)
!301 = !DILocation(line: 69, column: 9, scope: !300)
!302 = !DILocation(line: 69, column: 6, scope: !214)
!303 = !DILocation(line: 69, column: 14, scope: !300)
!304 = !DILocation(line: 71, column: 13, scope: !214)
!305 = !DILocation(line: 71, column: 24, scope: !214)
!306 = !{!307, !163, i64 24}
!307 = !{!"stat", !308, i64 0, !308, i64 8, !308, i64 16, !163, i64 24, !163, i64 28, !163, i64 32, !163, i64 36, !308, i64 40, !308, i64 48, !308, i64 56, !308, i64 64, !309, i64 72, !309, i64 88, !309, i64 104, !152, i64 120}
!308 = !{!"long", !152, i64 0}
!309 = !{!"timespec", !308, i64 0, !308, i64 8}
!310 = !DILocation(line: 71, column: 36, scope: !214)
!311 = !{!307, !308, i64 40}
!312 = !DILocation(line: 71, column: 7, scope: !214)
!313 = !DILocation(line: 71, column: 5, scope: !214)
!314 = !DILocation(line: 72, column: 6, scope: !315)
!315 = distinct !DILexicalBlock(scope: !214, file: !2, line: 72, column: 6)
!316 = !DILocation(line: 72, column: 9, scope: !315)
!317 = !DILocation(line: 72, column: 6, scope: !214)
!318 = !DILocation(line: 72, column: 14, scope: !315)
!319 = !DILocation(line: 74, column: 13, scope: !214)
!320 = !DILocation(line: 74, column: 22, scope: !214)
!321 = !DILocation(line: 74, column: 7, scope: !214)
!322 = !DILocation(line: 74, column: 5, scope: !214)
!323 = !DILocation(line: 75, column: 6, scope: !324)
!324 = distinct !DILexicalBlock(scope: !214, file: !2, line: 75, column: 6)
!325 = !DILocation(line: 75, column: 9, scope: !324)
!326 = !DILocation(line: 75, column: 6, scope: !214)
!327 = !DILocation(line: 75, column: 14, scope: !324)
