; ModuleID = 'samples/543.bc'
source_filename = "beam/copy.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ErtsAllocatorFunctions_t = type { ptr, ptr, ptr, ptr }
%struct.process = type { %struct.ErtsPTabElementCommon, ptr, ptr, ptr, i64, i64, i64, ptr, ptr, ptr, i64, i64, i64, i64, i64, ptr, i32, [6 x i64], ptr, i64, i32, i32, i64, i32, i64, i64, ptr, i64, %struct.ErtsSignalPrivQueues, ptr, ptr, i64, i64, i64, %union.anon.1, ptr, i64, i32, ptr, ptr, ptr, ptr, i16, i16, %struct.erl_off_heap, ptr, ptr, ptr, ptr, i64, %struct.ethr_native_atomic64_t, i64, i64, i64, ptr, ptr, %struct.ethr_native_atomic32_t, %struct.ethr_native_atomic32_t, i64, %struct.ErtsSignalInQueue, %struct.ethr_native_atomic64_t, ptr, %struct.erts_proc_lock_t_, ptr, %struct.ethr_native_atomic64_t }
%struct.ErtsPTabElementCommon = type { i64, %union.anon, i64, i64, %struct.ethr_native_atomic64_t, %union.anon.0 }
%union.anon = type { %struct.ethr_native_atomic64_t }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { i64, ptr, ptr, ptr, ptr }
%struct.ErtsSignalPrivQueues = type { ptr, ptr, ptr, ptr, ptr, %struct.ErtsMsgQNMSigs, ptr, i64, i32 }
%struct.ErtsMsgQNMSigs = type { ptr, ptr }
%union.anon.1 = type { %struct.ErtsCodeMFA_ }
%struct.ErtsCodeMFA_ = type { i64, i64, i64 }
%struct.erl_off_heap = type { ptr, i64 }
%struct.ethr_native_atomic32_t = type { i32 }

!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 53)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1354, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 44)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1389, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 39)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1666, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 42)
!57 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, retainedTypes: !91, globals: !1669, splitDebugInlining: false, nameTableKind: None)
!58 = !{!59, !68, !74, !79, !86}
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 402, baseType: !61, size: 32, elements: !62)
!60 = !DIFile(filename: "beam/erl_process.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "195a4f5708a2e5b1a4e6427c140de0d6")
!61 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !{!63, !64, !65, !66, !67}
!63 = !DIEnumerator(name: "ERTS_SCHED_NORMAL", value: 0)
!64 = !DIEnumerator(name: "ERTS_SCHED_DIRTY_CPU", value: 1)
!65 = !DIEnumerator(name: "ERTS_SCHED_DIRTY_IO", value: 2)
!66 = !DIEnumerator(name: "ERTS_SCHED_TYPE_FIRST", value: 0)
!67 = !DIEnumerator(name: "ERTS_SCHED_TYPE_LAST", value: 2)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 278, baseType: !61, size: 32, elements: !70)
!69 = !DIFile(filename: "../include/internal/ethr_mutex.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "61566c36e65c37acda5584360ac51ac5")
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "ETHR_RWMUTEX_TYPE_NORMAL", value: 0)
!72 = !DIEnumerator(name: "ETHR_RWMUTEX_TYPE_FREQUENT_READ", value: 1)
!73 = !DIEnumerator(name: "ETHR_RWMUTEX_TYPE_EXTREMELY_FREQUENT_READ", value: 2)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 284, baseType: !61, size: 32, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIEnumerator(name: "ETHR_RWMUTEX_LONG_LIVED", value: 0)
!77 = !DIEnumerator(name: "ETHR_RWMUTEX_SHORT_LIVED", value: 1)
!78 = !DIEnumerator(name: "ETHR_RWMUTEX_UNKNOWN_LIVED", value: 2)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dist_entry_state", file: !80, line: 71, baseType: !61, size: 32, elements: !81)
!80 = !DIFile(filename: "beam/erl_node_tables.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "38c36124386684069df711c6ef9fd97f")
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "ERTS_DE_STATE_IDLE", value: 0)
!83 = !DIEnumerator(name: "ERTS_DE_STATE_PENDING", value: 1)
!84 = !DIEnumerator(name: "ERTS_DE_STATE_CONNECTED", value: 2)
!85 = !DIEnumerator(name: "ERTS_DE_STATE_EXITING", value: 3)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 66, baseType: !61, size: 32, elements: !88)
!87 = !DIFile(filename: "beam/erl_vm.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "bff97e155e61ef716617d350cfdcd4a3")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "ERTS_FRAME_LAYOUT_RA", value: 0)
!90 = !DIEnumerator(name: "ERTS_FRAME_LAYOUT_FP_RA", value: 1)
!91 = !{!92, !96, !98, !242, !250, !61, !251, !128, !93, !263, !195, !264, !228, !290, !288, !298, !1618, !1666, !395, !1667, !1668, !149}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "Eterm", file: !94, line: 387, baseType: !95, align: 64)
!94 = !DIFile(filename: "beam/sys.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "af6a912e6d7fefa1a07e40fb2ca7b705")
!95 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sint", file: !94, line: 389, baseType: !97, align: 64)
!97 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlFunThing", file: !100, line: 78, baseType: !101)
!100 = !DIFile(filename: "beam/erl_fun.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "1765fa41ef6f03d12665f11e2ed8ab02")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_fun_thing", file: !100, line: 53, size: 320, elements: !102)
!102 = !{!103, !104, !227, !235, !236, !237, !238}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "thing_word", scope: !101, file: !100, line: 54, baseType: !93, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !101, file: !100, line: 67, baseType: !105, size: 64, offset: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !101, file: !100, line: 56, size: 64, elements: !106)
!106 = !{!107, !120, !152}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !105, file: !100, line: 60, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsDispatchable", file: !110, line: 83, baseType: !111)
!110 = !DIFile(filename: "beam/code_ix.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "db5040da5f221f8691a869dd0df32c8a")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErtsDispatchable_", file: !110, line: 81, size: 256, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "addresses", scope: !111, file: !110, line: 82, baseType: !114, size: 256)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 256, elements: !118)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsCodePtr", file: !94, line: 431, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!118 = !{!119}
!119 = !DISubrange(count: 4)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !105, file: !100, line: 63, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlFunEntry", file: !100, line: 47, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_fun_entry", file: !100, line: 29, size: 768, elements: !124)
!124 = !{!125, !126, !127, !129, !131, !137, !138, !139, !151}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !123, file: !100, line: 33, baseType: !109, size: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !123, file: !100, line: 37, baseType: !93, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !123, file: !100, line: 38, baseType: !128, size: 64, align: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uint", file: !94, line: 388, baseType: !95, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !123, file: !100, line: 39, baseType: !130, size: 32, offset: 384)
!130 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !123, file: !100, line: 40, baseType: !132, size: 128, offset: 416)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, elements: !135)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !94, line: 501, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !{!136}
!136 = !DISubrange(count: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "old_uniq", scope: !123, file: !100, line: 41, baseType: !130, size: 32, offset: 544)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "old_index", scope: !123, file: !100, line: 42, baseType: !130, size: 32, offset: 576)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "refc", scope: !123, file: !100, line: 44, baseType: !140, size: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "erts_refc_t", file: !94, line: 913, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_atomic_t", file: !142, line: 251, baseType: !143)
!142 = !DIFile(filename: "../include/internal/ethr_atomics.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "0868276c2cf7e434a2bb3ae2ba0c3c1f")
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_native_atomic64_t", file: !144, line: 70, baseType: !145)
!144 = !DIFile(filename: "../include/internal/x86_64/../i386/atomic.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "780edaa731e559eba3484eec8fe37eac")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 68, size: 64, elements: !146)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !145, file: !144, line: 69, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_sint64_t", file: !150, line: 233, baseType: !97)
!150 = !DIFile(filename: "../include/internal/ethread.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "3a8627a9dde9984376f63b0c0d9f0300")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pend_purge_address", scope: !123, file: !100, line: 46, baseType: !115, size: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !105, file: !100, line: 66, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "Export", file: !155, line: 110, baseType: !156)
!155 = !DIFile(filename: "beam/export.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "74b4befcc7400473c678c6f09edc8d49")
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "export_", file: !155, line: 40, size: 832, elements: !157)
!157 = !{!158, !159, !160, !161, !186}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !156, file: !155, line: 53, baseType: !109, size: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "bif_number", scope: !156, file: !155, line: 56, baseType: !130, size: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "is_bif_traced", scope: !156, file: !155, line: 58, baseType: !130, size: 32, offset: 288)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !156, file: !155, line: 65, baseType: !162, size: 320, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsCodeInfo", file: !110, line: 119, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErtsCodeInfo_", file: !110, line: 100, size: 320, elements: !164)
!164 = !{!165, !176, !179}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !163, file: !110, line: 114, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !163, file: !110, line: 105, size: 64, elements: !167)
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !166, file: !110, line: 112, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !110, line: 109, size: 64, elements: !170)
!170 = !{!171, !175}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "raise_function_clause", scope: !169, file: !110, line: 110, baseType: !172, size: 56)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 7)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_flag", scope: !169, file: !110, line: 111, baseType: !4, size: 8, offset: 56)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "gen_bp", scope: !163, file: !110, line: 117, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "generic_bp", file: !110, line: 117, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mfa", scope: !163, file: !110, line: 118, baseType: !180, size: 192, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsCodeMFA", file: !110, line: 91, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErtsCodeMFA_", file: !110, line: 87, size: 192, elements: !182)
!182 = !{!183, !184, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !181, file: !110, line: 88, baseType: !93, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !181, file: !110, line: 89, baseType: !93, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !181, file: !110, line: 90, baseType: !128, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "trampoline", scope: !156, file: !155, line: 109, baseType: !187, size: 192, offset: 640)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !156, file: !155, line: 66, size: 192, elements: !188)
!188 = !{!189, !199, !205, !211, !217, !223}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !187, file: !155, line: 70, baseType: !190, size: 128)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !187, file: !155, line: 67, size: 128, elements: !191)
!191 = !{!192, !198}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !190, file: !155, line: 68, baseType: !193, size: 64, align: 64)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 64, align: 64, elements: !196)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "BeamInstr", file: !94, line: 432, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "UWord", file: !94, line: 427, baseType: !128)
!196 = !{!197}
!197 = !DISubrange(count: 1)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !190, file: !155, line: 69, baseType: !194, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bif", scope: !187, file: !155, line: 76, baseType: !200, size: 192)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !187, file: !155, line: 72, size: 192, elements: !201)
!201 = !{!202, !203, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !200, file: !155, line: 73, baseType: !193, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !200, file: !155, line: 74, baseType: !194, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !200, file: !155, line: 75, baseType: !194, size: 64, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !187, file: !155, line: 82, baseType: !206, size: 192)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !187, file: !155, line: 78, size: 192, elements: !207)
!207 = !{!208, !209, !210}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !206, file: !155, line: 79, baseType: !193, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !206, file: !155, line: 80, baseType: !194, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !206, file: !155, line: 81, baseType: !194, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "not_loaded", scope: !187, file: !155, line: 100, baseType: !212, size: 192)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !187, file: !155, line: 94, size: 192, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !212, file: !155, line: 95, baseType: !193, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !212, file: !155, line: 96, baseType: !194, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "deferred", scope: !212, file: !155, line: 99, baseType: !194, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "trace", scope: !187, file: !155, line: 106, baseType: !218, size: 192)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !187, file: !155, line: 102, size: 192, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !218, file: !155, line: 103, baseType: !193, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !218, file: !155, line: 104, baseType: !194, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !218, file: !155, line: 105, baseType: !194, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !187, file: !155, line: 107, baseType: !224, size: 192, align: 64)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 192, align: 64, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 3)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !100, line: 70, baseType: !228, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_off_heap_header", file: !230, line: 68, size: 192, elements: !231)
!230 = !DIFile(filename: "beam/erl_message.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "242435a6f93ffcb553e1bc85abeaf975")
!231 = !{!232, !233, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "thing_word", scope: !229, file: !230, line: 69, baseType: !93, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !230, line: 70, baseType: !128, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !230, line: 71, baseType: !228, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !101, file: !100, line: 72, baseType: !133, size: 8, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_free", scope: !101, file: !100, line: 73, baseType: !133, size: 8, offset: 200)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "creator", scope: !101, file: !100, line: 76, baseType: !93, size: 64, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !101, file: !100, line: 77, baseType: !239, offset: 320)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, align: 64, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: -1)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "flatmap_t", file: !244, line: 42, baseType: !245)
!244 = !DIFile(filename: "beam/erl_map.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "15a35fe641144e94449af4e3ea6afdcc")
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flatmap_s", file: !244, line: 38, size: 192, elements: !246)
!246 = !{!247, !248, !249}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "thing_word", scope: !245, file: !244, line: 39, baseType: !93, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !245, file: !244, line: 40, baseType: !128, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !245, file: !244, line: 41, baseType: !93, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uint32", file: !94, line: 464, baseType: !61)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlSubBin", file: !253, line: 39, baseType: !254)
!253 = !DIFile(filename: "beam/erl_bits.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "40036026cb49446a403cc74a305c7898")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_sub_bin", file: !253, line: 31, size: 320, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "thing_word", scope: !254, file: !253, line: 32, baseType: !93, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !254, file: !253, line: 33, baseType: !128, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !254, file: !253, line: 34, baseType: !128, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bitsize", scope: !254, file: !253, line: 35, baseType: !133, size: 8, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bitoffs", scope: !254, file: !253, line: 36, baseType: !133, size: 8, offset: 200)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_writable", scope: !254, file: !253, line: 37, baseType: !133, size: 8, offset: 208)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !254, file: !253, line: 38, baseType: !93, size: 64, align: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcBin", file: !266, line: 284, baseType: !267)
!266 = !DIFile(filename: "beam/global.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "97d63098f45f42d23e68038cf4585503")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proc_bin", file: !266, line: 277, size: 384, elements: !268)
!268 = !{!269, !270, !271, !272, !287, !289}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "thing_word", scope: !267, file: !266, line: 278, baseType: !93, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !267, file: !266, line: 279, baseType: !128, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !266, line: 280, baseType: !228, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !267, file: !266, line: 281, baseType: !273, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "Binary", file: !275, line: 57, baseType: !276)
!275 = !DIFile(filename: "beam/erl_binary.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "367f042ba8d838c1ea1fb25eeeaf8034")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "binary", file: !275, line: 53, size: 256, elements: !277)
!277 = !{!278, !283, !285}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "intern", scope: !276, file: !275, line: 54, baseType: !279, size: 128)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "binary_internals", file: !275, line: 46, size: 128, elements: !280)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !279, file: !275, line: 47, baseType: !195, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "refc", scope: !279, file: !275, line: 48, baseType: !140, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "orig_size", scope: !276, file: !275, line: 55, baseType: !284, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "SWord", file: !94, line: 428, baseType: !96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "orig_bytes", scope: !276, file: !275, line: 56, baseType: !286, size: 8, offset: 192)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !196)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !267, file: !266, line: 282, baseType: !288, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !267, file: !266, line: 283, baseType: !128, size: 64, align: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlHeapBin", file: !275, line: 178, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_heap_bin", file: !275, line: 174, size: 192, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "thing_word", scope: !292, file: !275, line: 175, baseType: !93, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !292, file: !275, line: 176, baseType: !128, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !275, line: 177, baseType: !297, size: 64, align: 64, offset: 128)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 64, align: 64, elements: !196)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExternalThing", file: !300, line: 1102, baseType: !301)
!300 = !DIFile(filename: "beam/erl_term.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "2a5c94601a3cf0988984ef3ff4818003")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_thing_", file: !300, line: 1080, size: 256, elements: !302)
!302 = !{!303, !304, !1601, !1602}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !301, file: !300, line: 1082, baseType: !93, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !301, file: !300, line: 1083, baseType: !305, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_node_", file: !80, line: 215, size: 384, elements: !307)
!307 = !{!308, !317, !318, !319, !320}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bucket", scope: !306, file: !80, line: 216, baseType: !309, size: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashBucket", file: !310, line: 52, baseType: !311)
!310 = !DIFile(filename: "beam/hash.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "17db9d603a44594f9dff34ccb25282f2")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_bucket", file: !310, line: 48, size: 128, elements: !312)
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !310, line: 50, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "hvalue", scope: !311, file: !310, line: 51, baseType: !316, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashValue", file: !310, line: 30, baseType: !195)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "refc", scope: !306, file: !80, line: 217, baseType: !140, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !306, file: !80, line: 218, baseType: !93, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "creation", scope: !306, file: !80, line: 219, baseType: !250, size: 32, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "dist_entry", scope: !306, file: !80, line: 220, baseType: !321, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "DistEntry", file: !80, line: 24, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dist_entry_", file: !80, line: 128, size: 3200, elements: !324)
!324 = !{!325, !326, !328, !329, !425, !426, !427, !428, !429, !430, !431, !432, !1542, !1543, !1544, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1580, !1582, !1583, !1584, !1585, !1586, !1590, !1597, !1598}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bucket", scope: !323, file: !80, line: 129, baseType: !309, size: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !80, line: 130, baseType: !327, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !323, file: !80, line: 131, baseType: !327, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rwmtx", scope: !323, file: !80, line: 133, baseType: !330, size: 640, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "erts_rwmtx_t", file: !331, line: 341, baseType: !332)
!331 = !DIFile(filename: "beam/erl_threads.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "82bfa44c29e44f8f381502768fffa95f")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 327, size: 640, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rwmtx", scope: !332, file: !331, line: 328, baseType: !335, size: 640)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_rwmutex", file: !69, line: 312, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethr_rwmutex_", file: !69, line: 313, size: 640, elements: !337)
!337 = !{!338, !401, !403, !404}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mtxb", scope: !336, file: !69, line: 314, baseType: !339, size: 448)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethr_mutex_base_", file: !69, line: 141, size: 448, elements: !340)
!340 = !{!341, !349, !351, !352, !381}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flgs", scope: !339, file: !69, line: 145, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_atomic32_t", file: !142, line: 192, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_native_atomic32_t", file: !144, line: 70, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 68, size: 32, elements: !345)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !344, file: !144, line: 69, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_sint32_t", file: !150, line: 217, baseType: !130)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "aux_scnt", scope: !339, file: !69, line: 146, baseType: !350, size: 16, offset: 32)
!350 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "main_scnt", scope: !339, file: !69, line: 147, baseType: !350, size: 16, offset: 48)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "qlck", scope: !339, file: !69, line: 148, baseType: !353, size: 320, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !354, line: 72, baseType: !355)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!355 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !354, line: 67, size: 320, elements: !356)
!356 = !{!357, !376, !380}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !355, file: !354, line: 69, baseType: !358, size: 320)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !359, line: 22, size: 320, elements: !360)
!359 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !358, file: !359, line: 24, baseType: !130, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !358, file: !359, line: 25, baseType: !61, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !358, file: !359, line: 26, baseType: !130, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !358, file: !359, line: 28, baseType: !61, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !358, file: !359, line: 32, baseType: !130, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !358, file: !359, line: 34, baseType: !350, size: 16, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !358, file: !359, line: 35, baseType: !350, size: 16, offset: 176)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !358, file: !359, line: 36, baseType: !369, size: 128, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !370, line: 55, baseType: !371)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !370, line: 51, size: 128, elements: !372)
!372 = !{!373, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !371, file: !370, line: 53, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !371, file: !370, line: 54, baseType: !374, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !355, file: !354, line: 70, baseType: !377, size: 320)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 40)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !355, file: !354, line: 71, baseType: !97, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !339, file: !69, line: 149, baseType: !382, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_ts_event", file: !150, line: 619, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethr_ts_event_", file: !150, line: 630, size: 384, elements: !385)
!385 = !{!386, !387, !388, !394, !396, !397, !398, !399, !400}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !150, line: 631, baseType: !382, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !384, file: !150, line: 632, baseType: !382, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !384, file: !150, line: 633, baseType: !389, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_event", file: !390, line: 48, baseType: !391)
!390 = !DIFile(filename: "../include/internal/pthread/ethr_event.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "dcd7a60f971e3ca69b3c77705784413b")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 46, size: 32, elements: !392)
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !391, file: !390, line: 47, baseType: !342, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !384, file: !150, line: 634, baseType: !395, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "uaflgs", scope: !384, file: !150, line: 635, baseType: !342, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "uflgs", scope: !384, file: !150, line: 636, baseType: !61, size: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "iflgs", scope: !384, file: !150, line: 637, baseType: !61, size: 32, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rgix", scope: !384, file: !150, line: 638, baseType: !350, size: 16, offset: 352)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mtix", scope: !384, file: !150, line: 639, baseType: !350, size: 16, offset: 368)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !336, file: !69, line: 315, baseType: !402, size: 32, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_rwmutex_type", file: !69, line: 282, baseType: !68)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rq_end", scope: !336, file: !69, line: 316, baseType: !382, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tdata", scope: !336, file: !69, line: 320, baseType: !405, size: 64, offset: 576)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !336, file: !69, line: 317, size: 64, elements: !406)
!406 = !{!407, !424}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !405, file: !69, line: 318, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_rwmtx_readers_array__", file: !69, line: 310, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !69, line: 302, size: 512, elements: !411)
!411 = !{!412, !420}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !69, line: 308, baseType: !413, size: 128)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !69, line: 303, size: 128, elements: !414)
!414 = !{!415, !416, !417, !418}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "readers", scope: !413, file: !69, line: 304, baseType: !342, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "waiting_readers", scope: !413, file: !69, line: 305, baseType: !130, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "byte_offset", scope: !413, file: !69, line: 306, baseType: !130, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lived", scope: !413, file: !69, line: 307, baseType: !419, size: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_rwmutex_lived", file: !69, line: 288, baseType: !74)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "align__", scope: !410, file: !69, line: 309, baseType: !421, size: 512)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !405, file: !69, line: 319, baseType: !130, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !323, file: !80, line: 134, baseType: !93, size: 64, align: 64, offset: 896)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "creation", scope: !323, file: !80, line: 135, baseType: !250, size: 32, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "input_handler", scope: !323, file: !80, line: 136, baseType: !141, size: 64, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cid", scope: !323, file: !80, line: 137, baseType: !93, size: 64, align: 64, offset: 1088)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "connection_id", scope: !323, file: !80, line: 139, baseType: !250, size: 32, offset: 1152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !323, file: !80, line: 140, baseType: !79, size: 32, offset: 1184)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pending_nodedown", scope: !323, file: !80, line: 141, baseType: !130, size: 32, offset: 1216)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "suspended_nodeup", scope: !323, file: !80, line: 142, baseType: !433, size: 64, offset: 1280)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "Process", file: !60, line: 40, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "process", file: !60, line: 1007, size: 6208, elements: !436)
!436 = !{!437, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !948, !1010, !1015, !1027, !1028, !1029, !1030, !1037, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1062, !1066, !1067, !1068, !1069, !1077, !1078, !1089, !1099, !1541}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !435, file: !60, line: 1008, baseType: !438, size: 640)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsPTabElementCommon", file: !439, line: 81, baseType: !440)
!439 = !DIFile(filename: "beam/erl_ptab.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "224b2c36bdd1b9f23159564b3830979f")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 56, size: 640, elements: !441)
!441 = !{!442, !443, !448, !450, !451, !452}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !440, file: !439, line: 57, baseType: !93, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "refc", scope: !440, file: !439, line: 61, baseType: !444, size: 64, offset: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !439, line: 58, size: 64, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "atmc", scope: !444, file: !439, line: 59, baseType: !141, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sint", scope: !444, file: !439, line: 60, baseType: !96, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tracer", scope: !440, file: !439, line: 62, baseType: !449, size: 64, align: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsTracer", file: !94, line: 709, baseType: !93)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "trace_flags", scope: !440, file: !439, line: 63, baseType: !128, size: 64, align: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !440, file: !439, line: 64, baseType: !141, size: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !440, file: !439, line: 80, baseType: !453, size: 320, offset: 320)
!453 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !439, line: 65, size: 320, elements: !454)
!454 = !{!455, !903}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !453, file: !439, line: 76, baseType: !456, size: 320)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !439, line: 67, size: 320, elements: !457)
!457 = !{!458, !460, !824, !899, !902}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "started_interval", scope: !456, file: !439, line: 68, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uint64", file: !94, line: 437, baseType: !95)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !456, file: !439, line: 69, baseType: !461, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_proc", file: !463, line: 35, size: 320, elements: !464)
!463 = !DIFile(filename: "beam/register.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "d24619ff68daafe23d6893a43069132a")
!464 = !{!465, !466, !467, !823}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !462, file: !463, line: 37, baseType: !309, size: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !462, file: !463, line: 38, baseType: !433, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !462, file: !463, line: 40, baseType: !468, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "Port", file: !470, line: 23, baseType: !471)
!470 = !DIFile(filename: "beam/erl_port.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "70700c05b382a33a024c1bc36728dfa6")
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_erl_drv_port", file: !470, line: 144, size: 4480, elements: !472)
!472 = !{!473, !474, !530, !532, !534, !538, !539, !540, !541, !542, !543, !544, !592, !593, !780, !781, !782, !795, !804, !805, !806, !814, !815, !816}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !471, file: !470, line: 145, baseType: !438, size: 640)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !471, file: !470, line: 147, baseType: !475, size: 960, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsPortTaskSched", file: !476, line: 125, baseType: !477)
!476 = !DIFile(filename: "beam/erl_port_task.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "159403a7994f3385b33829b6fe242a1e")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 105, size: 960, elements: !478)
!478 = !{!479, !480, !520, !521}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !476, line: 106, baseType: !468, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "taskq", scope: !477, file: !476, line: 122, baseType: !481, size: 512, offset: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !477, file: !476, line: 107, size: 512, elements: !482)
!482 = !{!483, !503, !508}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !481, file: !476, line: 116, baseType: !484, size: 320)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !481, file: !476, line: 108, size: 320, elements: !485)
!485 = !{!486, !502}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !484, file: !476, line: 114, baseType: !487, size: 256)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !484, file: !476, line: 109, size: 256, elements: !488)
!488 = !{!489, !493, !494, !498}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !487, file: !476, line: 110, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsPortTask", file: !476, line: 101, baseType: !492)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErtsPortTask_", file: !476, line: 101, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !487, file: !476, line: 111, baseType: !490, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !487, file: !476, line: 112, baseType: !495, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsPortTaskBusyCallerTable", file: !476, line: 102, baseType: !497)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErtsPortTaskBusyCallerTable_", file: !476, line: 102, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nosuspend", scope: !487, file: !476, line: 113, baseType: !499, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsPortTaskHandleList", file: !476, line: 103, baseType: !501)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErtsPortTaskHandleList_", file: !476, line: 103, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !484, file: !476, line: 115, baseType: !490, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !481, file: !476, line: 120, baseType: !504, size: 128, offset: 320)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !481, file: !476, line: 117, size: 128, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !504, file: !476, line: 118, baseType: !490, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !504, file: !476, line: 119, baseType: !490, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bpq", scope: !481, file: !476, line: 121, baseType: !509, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsPortTaskBusyPortQ", file: !476, line: 99, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 95, size: 192, elements: !512)
!512 = !{!513, !518, !519}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !511, file: !476, line: 96, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvSizeT", file: !515, line: 125, baseType: !516)
!515 = !DIFile(filename: "beam/erl_driver.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "ca447108d3a14e37050ee901ef61de05")
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !517, line: 70, baseType: !95)
!517 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!518 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !511, file: !476, line: 97, baseType: !141, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !476, line: 98, baseType: !141, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !477, file: !476, line: 123, baseType: !342, size: 32, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !477, file: !476, line: 124, baseType: !522, size: 320, offset: 640)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "erts_mtx_t", file: !331, line: 323, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 309, size: 320, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !523, file: !331, line: 310, baseType: !526, size: 320)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "ethr_mutex", file: !69, line: 216, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethr_mutex_", file: !69, line: 217, size: 320, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pt_mtx", scope: !527, file: !69, line: 218, baseType: !353, size: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_task", scope: !471, file: !470, line: 148, baseType: !531, size: 64, offset: 1600)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsPortTaskHandle", file: !476, line: 34, baseType: !141)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !471, file: !470, line: 149, baseType: !533, size: 64, offset: 1664)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "xports", scope: !471, file: !470, line: 150, baseType: !535, size: 64, offset: 1728)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsXPortsList", file: !470, line: 124, baseType: !537)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErtsXPortsList_", file: !470, line: 124, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "run_queue", scope: !471, file: !470, line: 151, baseType: !141, size: 64, offset: 1792)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !471, file: !470, line: 152, baseType: !141, size: 64, offset: 1856)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !471, file: !470, line: 153, baseType: !93, size: 64, align: 64, offset: 1920)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !471, file: !470, line: 154, baseType: !141, size: 64, offset: 1984)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in", scope: !471, file: !470, line: 155, baseType: !128, size: 64, align: 64, offset: 2048)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_out", scope: !471, file: !470, line: 156, baseType: !128, size: 64, align: 64, offset: 2112)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ioq", scope: !471, file: !470, line: 158, baseType: !545, size: 1600, offset: 2176)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlPortIOQueue", file: !470, line: 81, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsIOQueue", file: !547, line: 84, baseType: !548)
!547 = !DIFile(filename: "beam/erl_io_queue.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "53c1d3b7088ebd06bd4252e862b08e86")
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erts_io_queue", file: !547, line: 67, size: 1600, elements: !549)
!549 = !{!550, !553, !554, !555, !564, !565, !566, !567, !571, !587, !588, !589, !590}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "alct", scope: !548, file: !547, line: 68, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsAlcType_t", file: !552, line: 149, baseType: !250)
!552 = !DIFile(filename: "x86_64-pc-linux-gnu/opt/jit/erl_alloc_types.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "8c11eb1ba1ec3e485654fd54c7ca0ccf")
!553 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !548, file: !547, line: 69, baseType: !130, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !548, file: !547, line: 70, baseType: !128, size: 64, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "v_start", scope: !548, file: !547, line: 72, baseType: !556, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysIOVec", file: !558, line: 162, baseType: !559)
!558 = !DIFile(filename: "beam/erl_drv_nif.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "e8cb1cfda7850b58d04aafbc0a06a779")
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !560, line: 26, size: 128, elements: !561)
!560 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !559, file: !560, line: 28, baseType: !395, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !559, file: !560, line: 29, baseType: !516, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "v_end", scope: !548, file: !547, line: 73, baseType: !556, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "v_head", scope: !548, file: !547, line: 74, baseType: !556, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "v_tail", scope: !548, file: !547, line: 75, baseType: !556, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "v_small", scope: !548, file: !547, line: 76, baseType: !568, size: 640, offset: 384)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 640, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 5)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "b_start", scope: !548, file: !547, line: 78, baseType: !572, size: 64, offset: 1024)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsIOQBinary", file: !547, line: 48, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !547, line: 45, size: 256, elements: !576)
!576 = !{!577, !586}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !575, file: !547, line: 46, baseType: !578, size: 128)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvBinary", file: !515, line: 137, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_drv_binary", file: !515, line: 134, size: 128, elements: !580)
!580 = !{!581, !585}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "orig_size", scope: !579, file: !515, line: 135, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvSInt", file: !515, line: 118, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNapiSInt", file: !558, line: 128, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNapiSInt64", file: !558, line: 114, baseType: !97)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "orig_bytes", scope: !579, file: !515, line: 136, baseType: !286, size: 8, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nif", scope: !575, file: !547, line: 47, baseType: !274, size: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "b_end", scope: !548, file: !547, line: 79, baseType: !572, size: 64, offset: 1088)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b_head", scope: !548, file: !547, line: 80, baseType: !572, size: 64, offset: 1152)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "b_tail", scope: !548, file: !547, line: 81, baseType: !572, size: 64, offset: 1216)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b_small", scope: !548, file: !547, line: 82, baseType: !591, size: 320, offset: 1280)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 320, elements: !569)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !471, file: !470, line: 159, baseType: !263, size: 64, offset: 3776)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "drv_ptr", scope: !471, file: !470, line: 160, baseType: !594, size: 64, offset: 3840)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "erts_driver_t", file: !470, line: 56, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erts_driver_t_", file: !266, line: 213, size: 1536, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !607, !608, !634, !635, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !596, file: !266, line: 214, baseType: !594, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !596, file: !266, line: 215, baseType: !594, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "name_atom", scope: !596, file: !266, line: 216, baseType: !93, size: 64, align: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !266, line: 217, baseType: !263, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !596, file: !266, line: 221, baseType: !603, size: 64, offset: 256)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !596, file: !266, line: 218, size: 64, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !603, file: !266, line: 219, baseType: !130, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !603, file: !266, line: 220, baseType: !130, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !596, file: !266, line: 222, baseType: !130, size: 32, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !596, file: !266, line: 223, baseType: !609, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "DE_Handle", file: !266, line: 207, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 193, size: 640, elements: !612)
!612 = !{!613, !614, !626, !627, !628, !629, !630, !631, !632, !633}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !611, file: !266, line: 194, baseType: !395, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !611, file: !266, line: 195, baseType: !615, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "DE_ProcEntry", file: !266, line: 191, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "de_proc_entry", file: !266, line: 181, size: 448, elements: !618)
!618 = !{!619, !620, !621, !622, !624}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !617, file: !266, line: 182, baseType: !433, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "awaiting_status", scope: !617, file: !266, line: 183, baseType: !128, size: 64, align: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !617, file: !266, line: 188, baseType: !128, size: 64, align: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !617, file: !266, line: 189, baseType: !623, size: 192, align: 64, offset: 192)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 192, align: 64, elements: !225)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !617, file: !266, line: 190, baseType: !625, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "refc", scope: !611, file: !266, line: 197, baseType: !140, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "port_count", scope: !611, file: !266, line: 199, baseType: !342, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !611, file: !266, line: 200, baseType: !128, size: 64, align: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !611, file: !266, line: 201, baseType: !130, size: 32, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "full_path", scope: !611, file: !266, line: 202, baseType: !263, size: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reload_full_path", scope: !611, file: !266, line: 203, baseType: !263, size: 64, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reload_driver_name", scope: !611, file: !266, line: 205, baseType: !263, size: 64, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "reload_flags", scope: !611, file: !266, line: 206, baseType: !128, size: 64, align: 64, offset: 576)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !596, file: !266, line: 224, baseType: !533, size: 64, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !596, file: !266, line: 225, baseType: !636, size: 64, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvEntry", file: !515, line: 281, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_drv_entry", file: !515, line: 215, size: 1408, elements: !639)
!639 = !{!640, !644, !687, !691, !695, !700, !701, !702, !706, !707, !716, !717, !731, !736, !737, !742, !743, !744, !745, !746, !747, !748, !760, !764}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !638, file: !515, line: 216, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!130}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !638, file: !515, line: 225, baseType: !645, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!648, !651, !263, !653}
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvData", file: !515, line: 144, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "_erl_drv_data", file: !515, line: 144, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvPort", file: !515, line: 148, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysDriverOpts", file: !655, line: 36, baseType: !656)
!655 = !DIFile(filename: "beam/erl_sys_driver.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "4d9b344228e3cf7993d24c406dc28226")
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SysDriverOpts", file: !655, line: 45, size: 1024, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !676, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ifd", scope: !656, file: !655, line: 46, baseType: !128, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ofd", scope: !656, file: !655, line: 47, baseType: !128, size: 64, align: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "packet_bytes", scope: !656, file: !655, line: 48, baseType: !130, size: 32, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "read_write", scope: !656, file: !655, line: 49, baseType: !130, size: 32, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "use_stdio", scope: !656, file: !655, line: 50, baseType: !130, size: 32, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "redir_stderr", scope: !656, file: !655, line: 51, baseType: !130, size: 32, offset: 224)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "hide_window", scope: !656, file: !655, line: 52, baseType: !130, size: 32, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "exit_status", scope: !656, file: !655, line: 53, baseType: !130, size: 32, offset: 288)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "overlapped_io", scope: !656, file: !655, line: 54, baseType: !130, size: 32, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "envir", scope: !656, file: !655, line: 55, baseType: !668, size: 128, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "erts_osenv_t", file: !94, line: 720, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__erts_osenv_t", file: !94, line: 716, size: 128, elements: !670)
!670 = !{!671, !674, !675}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !669, file: !94, line: 717, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "__env_rbtnode_t", file: !94, line: 717, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "variable_count", scope: !669, file: !94, line: 718, baseType: !130, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "content_size", scope: !669, file: !94, line: 719, baseType: !130, size: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !656, file: !655, line: 56, baseType: !677, size: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !656, file: !655, line: 57, baseType: !263, size: 64, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "spawn_type", scope: !656, file: !655, line: 58, baseType: !61, size: 32, offset: 640)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "parallelism", scope: !656, file: !655, line: 60, baseType: !130, size: 32, offset: 672)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "high_watermark", scope: !656, file: !655, line: 61, baseType: !514, size: 64, offset: 704)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "low_watermark", scope: !656, file: !655, line: 62, baseType: !514, size: 64, offset: 768)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "high_msgq_watermark", scope: !656, file: !655, line: 63, baseType: !514, size: 64, offset: 832)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "low_msgq_watermark", scope: !656, file: !655, line: 64, baseType: !514, size: 64, offset: 896)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "port_watermarks_set", scope: !656, file: !655, line: 65, baseType: !4, size: 8, offset: 960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "msgq_watermarks_set", scope: !656, file: !655, line: 66, baseType: !4, size: 8, offset: 968)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !638, file: !515, line: 228, baseType: !688, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !648}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !638, file: !515, line: 231, baseType: !692, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !648, !263, !514}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ready_input", scope: !638, file: !515, line: 234, baseType: !696, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !648, !699}
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvEvent", file: !655, line: 34, baseType: !284)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ready_output", scope: !638, file: !515, line: 237, baseType: !696, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "driver_name", scope: !638, file: !515, line: 240, baseType: !263, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !638, file: !515, line: 242, baseType: !703, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{null}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !638, file: !515, line: 244, baseType: !395, size: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !638, file: !515, line: 245, baseType: !708, size: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!711, !648, !61, !263, !514, !677, !514}
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvSSizeT", file: !515, line: 126, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !713, line: 77, baseType: !714)
!713 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !715, line: 194, baseType: !97)
!715 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!716 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !638, file: !515, line: 249, baseType: !688, size: 64, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "outputv", scope: !638, file: !515, line: 250, baseType: !718, size: 64, offset: 704)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !648, !721}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlIOVec", file: !515, line: 194, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_io_vec", file: !515, line: 189, size: 256, elements: !724)
!724 = !{!725, !726, !727, !728}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "vsize", scope: !723, file: !515, line: 190, baseType: !130, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !723, file: !515, line: 191, baseType: !514, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !723, file: !515, line: 192, baseType: !556, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "binv", scope: !723, file: !515, line: 193, baseType: !729, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ready_async", scope: !638, file: !515, line: 253, baseType: !732, size: 64, offset: 768)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !648, !735}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvThreadData", file: !515, line: 149, baseType: !652)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !638, file: !515, line: 254, baseType: !688, size: 64, offset: 832)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !638, file: !515, line: 259, baseType: !738, size: 64, offset: 896)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!711, !648, !61, !263, !514, !677, !514, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "unused_event_callback", scope: !638, file: !515, line: 265, baseType: !703, size: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "extended_marker", scope: !638, file: !515, line: 266, baseType: !130, size: 32, offset: 1024)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "major_version", scope: !638, file: !515, line: 267, baseType: !130, size: 32, offset: 1056)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "minor_version", scope: !638, file: !515, line: 268, baseType: !130, size: 32, offset: 1088)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "driver_flags", scope: !638, file: !515, line: 269, baseType: !130, size: 32, offset: 1120)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "handle2", scope: !638, file: !515, line: 270, baseType: !395, size: 64, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "process_exit", scope: !638, file: !515, line: 271, baseType: !749, size: 64, offset: 1216)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !648, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvMonitor", file: !558, line: 67, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !558, line: 65, size: 256, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !754, file: !558, line: 66, baseType: !757, size: 256)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 256, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "stop_select", scope: !638, file: !515, line: 273, baseType: !761, size: 64, offset: 1280)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !699, !395}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "emergency_close", scope: !638, file: !515, line: 277, baseType: !688, size: 64, offset: 1344)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !596, file: !266, line: 226, baseType: !645, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !596, file: !266, line: 227, baseType: !688, size: 64, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !596, file: !266, line: 228, baseType: !703, size: 64, offset: 704)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !596, file: !266, line: 229, baseType: !688, size: 64, offset: 768)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !596, file: !266, line: 230, baseType: !692, size: 64, offset: 832)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "outputv", scope: !596, file: !266, line: 231, baseType: !718, size: 64, offset: 896)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !596, file: !266, line: 232, baseType: !708, size: 64, offset: 960)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !596, file: !266, line: 235, baseType: !738, size: 64, offset: 1024)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ready_input", scope: !596, file: !266, line: 239, baseType: !696, size: 64, offset: 1088)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ready_output", scope: !596, file: !266, line: 240, baseType: !696, size: 64, offset: 1152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !596, file: !266, line: 241, baseType: !688, size: 64, offset: 1216)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ready_async", scope: !596, file: !266, line: 242, baseType: !732, size: 64, offset: 1280)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "process_exit", scope: !596, file: !266, line: 243, baseType: !749, size: 64, offset: 1344)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "stop_select", scope: !596, file: !266, line: 244, baseType: !761, size: 64, offset: 1408)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "emergency_close", scope: !596, file: !266, line: 245, baseType: !688, size: 64, offset: 1472)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "drv_data", scope: !471, file: !470, line: 161, baseType: !195, size: 64, align: 64, offset: 3904)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "os_pid", scope: !471, file: !470, line: 162, baseType: !284, size: 64, align: 64, offset: 3968)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "suspended", scope: !471, file: !470, line: 163, baseType: !783, size: 64, offset: 4032)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsProcList", file: !60, line: 379, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErtsProcList_", file: !60, line: 380, size: 256, elements: !786)
!786 = !{!787, !792, !793, !794}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !785, file: !60, line: 384, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !785, file: !60, line: 381, size: 64, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !788, file: !60, line: 382, baseType: !93, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !788, file: !60, line: 383, baseType: !433, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "started_interval", scope: !785, file: !60, line: 385, baseType: !459, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !785, file: !60, line: 386, baseType: !783, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !785, file: !60, line: 387, baseType: !783, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "linebuf", scope: !471, file: !470, line: 164, baseType: !796, size: 64, offset: 4096)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineBuf", file: !470, line: 91, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_buf", file: !470, line: 84, size: 256, elements: !799)
!799 = !{!800, !801, !802, !803}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bufsiz", scope: !798, file: !470, line: 85, baseType: !514, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ovlen", scope: !798, file: !470, line: 86, baseType: !514, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ovsiz", scope: !798, file: !470, line: 87, baseType: !514, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !798, file: !470, line: 88, baseType: !286, size: 8, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !471, file: !470, line: 166, baseType: !342, size: 32, offset: 4160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "control_flags", scope: !471, file: !470, line: 167, baseType: !130, size: 32, offset: 4192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "port_data_lock", scope: !471, file: !470, line: 168, baseType: !807, size: 64, offset: 4224)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlDrvPDL", file: !515, line: 209, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_drv_port_data_lock", file: !470, line: 194, size: 448, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !809, file: !470, line: 195, baseType: !522, size: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "refc", scope: !809, file: !470, line: 196, baseType: !141, size: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "prt", scope: !809, file: !470, line: 197, baseType: !468, size: 64, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "psd", scope: !471, file: !470, line: 170, baseType: !141, size: 64, offset: 4288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "reds", scope: !471, file: !470, line: 171, baseType: !130, size: 32, offset: 4352)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "async_open_port", scope: !471, file: !470, line: 176, baseType: !817, size: 64, offset: 4416)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !471, file: !470, line: 173, size: 192, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !818, file: !470, line: 174, baseType: !93, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !818, file: !470, line: 175, baseType: !822, size: 96, offset: 64)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 96, elements: !225)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !462, file: !463, line: 41, baseType: !93, size: 64, align: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !456, file: !439, line: 70, baseType: !825, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsLink", file: !827, line: 1610, baseType: !828)
!827 = !DIFile(filename: "beam/erl_monitor_link.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "16d98f143cd2175beeecae09149f8251")
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErtsMonLnkNode__", file: !827, line: 518, size: 320, elements: !829)
!829 = !{!830, !888, !893, !896, !897, !898}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !828, file: !827, line: 523, baseType: !831, size: 192)
!831 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !828, file: !827, line: 519, size: 192, elements: !832)
!832 = !{!833, !873, !882}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !831, file: !827, line: 520, baseType: !834, size: 192)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsSignalCommon", file: !835, line: 108, baseType: !836)
!835 = !DIFile(filename: "beam/erl_proc_sig_queue.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "53a3480d3100f5995e8e54ed281ca383")
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !835, line: 101, size: 192, elements: !837)
!837 = !{!838, !866, !872}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !836, file: !835, line: 102, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_mesg", file: !230, line: 230, size: 704, elements: !841)
!841 = !{!842, !845, !864, !865}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !840, file: !230, line: 231, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsMessage", file: !230, line: 61, baseType: !840)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !840, file: !230, line: 231, baseType: !846, size: 64, offset: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !840, file: !230, line: 231, size: 64, elements: !847)
!847 = !{!848, !863}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "heap_frag", scope: !846, file: !230, line: 231, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlHeapFragment", file: !230, line: 187, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_heap_fragment", file: !230, line: 188, size: 384, elements: !852)
!852 = !{!853, !854, !860, !861, !862}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !851, file: !230, line: 189, baseType: !849, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "off_heap", scope: !851, file: !230, line: 190, baseType: !855, size: 128, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlOffHeap", file: !230, line: 81, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erl_off_heap", file: !230, line: 78, size: 128, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !856, file: !230, line: 79, baseType: !228, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "overhead", scope: !856, file: !230, line: 80, baseType: !459, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !851, file: !230, line: 191, baseType: !128, size: 64, align: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !851, file: !230, line: 192, baseType: !128, size: 64, align: 64, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !851, file: !230, line: 193, baseType: !297, size: 64, align: 64, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "attached", scope: !846, file: !230, line: 231, baseType: !395, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !840, file: !230, line: 231, baseType: !623, size: 192, align: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "hfrag", scope: !840, file: !230, line: 233, baseType: !850, size: 384, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "specific", scope: !836, file: !835, line: 106, baseType: !867, size: 64, offset: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !836, file: !835, line: 103, size: 64, elements: !868)
!868 = !{!869, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !867, file: !835, line: 104, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "attachment", scope: !867, file: !835, line: 105, baseType: !395, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !836, file: !835, line: 107, baseType: !93, size: 64, align: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !831, file: !827, line: 521, baseType: !874, size: 192)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsMonLnkTreeNode", file: !827, line: 511, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !827, line: 507, size: 192, elements: !876)
!876 = !{!877, !878, !881}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !875, file: !827, line: 508, baseType: !195, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !875, file: !827, line: 509, baseType: !879, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsMonLnkNode", file: !827, line: 504, baseType: !828)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !875, file: !827, line: 510, baseType: !879, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !831, file: !827, line: 522, baseType: !883, size: 128)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsMonLnkListNode", file: !827, line: 516, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !827, line: 513, size: 128, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !884, file: !827, line: 514, baseType: !879, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !884, file: !827, line: 515, baseType: !879, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !828, file: !827, line: 527, baseType: !889, size: 64, offset: 192)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !828, file: !827, line: 524, size: 64, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !889, file: !827, line: 525, baseType: !93, size: 64, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !889, file: !827, line: 526, baseType: !395, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !828, file: !827, line: 528, baseType: !894, size: 16, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uint16", file: !94, line: 484, baseType: !895)
!895 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "key_offset", scope: !828, file: !827, line: 529, baseType: !894, size: 16, offset: 272)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !828, file: !827, line: 530, baseType: !894, size: 16, offset: 288)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !828, file: !827, line: 531, baseType: !894, size: 16, offset: 304)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lt_monitors", scope: !456, file: !439, line: 73, baseType: !900, size: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsMonitor", file: !827, line: 690, baseType: !828)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !456, file: !439, line: 75, baseType: !900, size: 64, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !453, file: !439, line: 79, baseType: !904, size: 256)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsThrPrgrLaterOp", file: !905, line: 80, baseType: !906)
!905 = !DIFile(filename: "beam/erl_thr_progress.h", directory: "/local-ssd/erlang-l3nfmgerufjbmo77jxcy2mabarfbupek-build/aidengro/spack-stage-erlang-26.0-l3nfmgerufjbmo77jxcy2mabarfbupek/spack-src/erts/emulator", checksumkind: CSK_MD5, checksum: "3b4040aa37c977a929df714c9ce27034")
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErtsThrPrgrLaterOp_", file: !905, line: 81, size: 256, elements: !907)
!907 = !{!908, !910, !914, !915}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "later", scope: !906, file: !905, line: 82, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErtsThrPrgrVal", file: !905, line: 40, baseType: !459)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !906, file: !905, line: 83, baseType: !911, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{null, !395}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !906, file: !905, line: 84, baseType: !395, size: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !906, file: !905, line: 85, baseType: !916, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "htop", scope: !435, file: !60, line: 1015, baseType: !92, size: 64, offset: 640)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !435, file: !60, line: 1016, baseType: !92, size: 64, offset: 704)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pointer", scope: !435, file: !60, line: 1019, baseType: !92, size: 64, offset: 768)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fcalls", scope: !435, file: !60, line: 1022, baseType: !96, size: 64, align: 64, offset: 832)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "freason", scope: !435, file: !60, line: 1025, baseType: !128, size: 64, align: 64, offset: 896)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue", scope: !435, file: !60, line: 1026, baseType: !93, size: 64, align: 64, offset: 960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !435, file: !60, line: 1030, baseType: !92, size: 64, offset: 1024)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "hend", scope: !435, file: !60, line: 1031, baseType: !92, size: 64, offset: 1088)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "abandoned_heap", scope: !435, file: !60, line: 1032, baseType: !92, size: 64, offset: 1152)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "heap_sz", scope: !435, file: !60, line: 1033, baseType: !128, size: 64, align: 64, offset: 1216)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_size", scope: !435, file: !60, line: 1034, baseType: !128, size: 64, align: 64, offset: 1280)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "min_vheap_size", scope: !435, file: !60, line: 1035, baseType: !128, size: 64, align: 64, offset: 1344)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "max_heap_size", scope: !435, file: !60, line: 1036, baseType: !128, size: 64, align: 64, offset: 1408)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !435, file: !60, line: 1041, baseType: !128, size: 64, align: 64, offset: 1472)
