; ModuleID = 'samples/546.bc'
source_filename = "src/jemalloc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.atomic_zu_t = type { i64 }
%struct.hpa_shard_opts_s = type { i64, i64, i32, i8, i64, i64 }
%struct.sec_opts_s = type { i64, i64, i64, i64, i64 }
%struct.atomic_p_t = type { ptr }
%struct.atomic_u_t = type { i32 }
%struct.malloc_mutex_s = type { %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { %struct.mutex_prof_data_t, %union.pthread_mutex_t, %struct.atomic_b_t }
%struct.mutex_prof_data_t = type { %struct.nstime_t, %struct.nstime_t, i64, i64, i32, %struct.atomic_u32_t, i64, ptr, i64 }
%struct.nstime_t = type { i64 }
%struct.atomic_u32_t = type { i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.atomic_b_t = type { i8 }
%struct.arena_config_s = type { ptr, i8 }
%struct.log_var_s = type { %struct.atomic_u_t, ptr }
%struct.emap_s = type { %struct.rtree_s }
%struct.rtree_s = type { ptr, %struct.malloc_mutex_s, [262144 x %struct.rtree_node_elm_s] }
%struct.rtree_node_elm_s = type { %struct.atomic_p_t }
%struct.bin_info_s = type { i64, i64, i32, i32, %struct.bitmap_info_s }
%struct.bitmap_info_s = type { i64, i64 }

!323 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!324 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!325 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!326 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!327 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!328 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!329 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!330 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!331 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!332 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!333 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!334 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!335 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!336 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!337 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!338 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!339 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!340 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!341 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!342 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!343 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!344 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!345 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!346 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!347 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!348 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!349 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!350 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!351 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!352 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!353 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!354 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!355 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!356 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!357 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!358 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!359 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!360 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!361 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!362 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!363 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!364 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!365 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!366 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!367 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!368 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!369 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!370 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!371 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!372 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!373 = !DIEnumerator(name: "_SC_MINSIGSTKSZ", value: 249)
!374 = !DIEnumerator(name: "_SC_SIGSTKSZ", value: 250)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 189, baseType: !7, size: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381}
!377 = !DIEnumerator(name: "flag_opt_junk_alloc", value: 1)
!378 = !DIEnumerator(name: "flag_opt_junk_free", value: 2)
!379 = !DIEnumerator(name: "flag_opt_zero", value: 4)
!380 = !DIEnumerator(name: "flag_opt_utrace", value: 8)
!381 = !DIEnumerator(name: "flag_opt_xmalloc", value: 16)
!382 = !{!383, !384, !7, !387, !389, !390, !391, !386, !1410, !1412, !1414, !1132, !408, !1273, !1416, !719, !594, !493, !1421, !712, !1422, !1423, !740, !1061, !763, !1424, !455, !1427}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !385, line: 90, baseType: !386)
!385 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!386 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !388, line: 70, baseType: !386)
!388 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!389 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!390 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsdn_t", file: !393, line: 7, baseType: !394)
!393 = !DIFile(filename: "include/jemalloc/internal/tsd_types.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "cbf25f26419957a9e3f438c41fcdab12")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsdn_s", file: !145, line: 277, size: 21056, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tsd", scope: !394, file: !145, line: 278, baseType: !397, size: 21056)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_t", file: !393, line: 6, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsd_s", file: !145, line: 240, size: 21056, elements: !399)
!399 = !{!400, !401, !407, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !590, !591, !592, !593, !1325, !1326, !1335, !1336, !1342, !1349, !1350, !1357, !1368, !1369, !1390, !1395, !1396, !1397, !1398, !1399, !1400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache_enabled", scope: !398, file: !145, line: 250, baseType: !389, size: 8)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_reentrancy_level", scope: !398, file: !145, line: 250, baseType: !402, size: 8, offset: 8)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !403, line: 24, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !405, line: 37, baseType: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!406 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_allocated_last_event", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !409, line: 27, baseType: !410)
!409 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !405, line: 45, baseType: !386)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_allocated_next_event", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_deallocated_last_event", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_deallocated_next_event", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache_gc_event_wait", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache_gc_dalloc_event_wait", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prof_sample_event_wait", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prof_sample_last_event", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_stats_interval_event_wait", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_stats_interval_last_event", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_peak_alloc_event_wait", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_peak_dalloc_event_wait", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prof_tdata", scope: !398, file: !145, line: 250, baseType: !423, size: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_tdata_t", file: !425, line: 9, baseType: !426)
!425 = !DIFile(filename: "include/jemalloc/internal/prof_types.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "5609d474728c2c85be6d4c5780ac3fd5")
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_tdata_s", file: !427, line: 147, size: 9664, elements: !428)
!427 = !DIFile(filename: "include/jemalloc/internal/prof_structs.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "64094bed4a0e2fead984334a22440ce3")
!428 = !{!429, !528, !529, !530, !532, !533, !534, !539, !540, !569, !570, !571, !572, !573, !574, !586}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !426, file: !427, line: 148, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_t", file: !65, line: 21, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "malloc_mutex_s", file: !65, line: 22, size: 896, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, scope: !432, file: !65, line: 23, baseType: !435, size: 896)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !432, file: !65, line: 23, size: 896, elements: !436)
!436 = !{!437, !503, !526}
!437 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !65, line: 24, baseType: !438, size: 896)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !65, line: 24, size: 896, elements: !439)
!439 = !{!440, !466, !498}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prof_data", scope: !438, file: !65, line: 33, baseType: !441, size: 512)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_prof_data_t", file: !442, line: 115, baseType: !443)
!442 = !DIFile(filename: "include/jemalloc/internal/mutex_prof.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "49c8e72069e699cf6374eaad10c70adc")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 85, size: 512, elements: !444)
!444 = !{!445, !451, !452, !453, !454, !457, !463, !464, !465}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tot_wait_time", scope: !443, file: !442, line: 91, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "nstime_t", file: !447, line: 19, baseType: !448)
!447 = !DIFile(filename: "include/jemalloc/internal/nstime.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "701f458fd2e964b721f378de413dbf72")
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 14, size: 64, elements: !449)
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !448, file: !447, line: 15, baseType: !408, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "max_wait_time", scope: !443, file: !442, line: 93, baseType: !446, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "n_wait_times", scope: !443, file: !442, line: 95, baseType: !408, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "n_spin_acquired", scope: !443, file: !442, line: 97, baseType: !408, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "max_n_thds", scope: !443, file: !442, line: 99, baseType: !455, size: 32, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !409, line: 26, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !405, line: 42, baseType: !7)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "n_waiting_thds", scope: !443, file: !442, line: 101, baseType: !458, size: 32, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u32_t", file: !459, line: 99, baseType: !460)
!459 = !DIFile(filename: "include/jemalloc/internal/atomic.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "6938e37e0ea24e4ceb6a513894764870")
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 99, size: 32, elements: !461)
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !460, file: !459, line: 99, baseType: !455, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "n_owner_switches", scope: !443, file: !442, line: 110, baseType: !408, size: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "prev_owner", scope: !443, file: !442, line: 112, baseType: !391, size: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "n_lock_ops", scope: !443, file: !442, line: 114, baseType: !408, size: 64, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !438, file: !65, line: 46, baseType: !467, size: 320, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !468, line: 72, baseType: !469)
!468 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !468, line: 67, size: 320, elements: !470)
!470 = !{!471, !491, !496}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !469, file: !468, line: 69, baseType: !472, size: 320)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !473, line: 22, size: 320, elements: !474)
!473 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!474 = !{!475, !476, !477, !478, !479, !480, !482, !483}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !472, file: !473, line: 24, baseType: !390, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !472, file: !473, line: 25, baseType: !7, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !472, file: !473, line: 26, baseType: !390, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !472, file: !473, line: 28, baseType: !7, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !472, file: !473, line: 32, baseType: !390, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !472, file: !473, line: 34, baseType: !481, size: 16, offset: 160)
!481 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !472, file: !473, line: 35, baseType: !481, size: 16, offset: 176)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !472, file: !473, line: 36, baseType: !484, size: 128, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !485, line: 55, baseType: !486)
!485 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !485, line: 51, size: 128, elements: !487)
!487 = !{!488, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !486, file: !485, line: 53, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !486, file: !485, line: 54, baseType: !489, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !469, file: !468, line: 70, baseType: !492, size: 320)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 320, elements: !494)
!493 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!494 = !{!495}
!495 = !DISubrange(count: 40)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !469, file: !468, line: 71, baseType: !497, size: 64)
!497 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !438, file: !65, line: 52, baseType: !499, size: 8, offset: 832)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_b_t", file: !459, line: 89, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 89, size: 8, elements: !501)
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !500, file: !459, line: 89, baseType: !389, size: 8)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "witness", scope: !435, file: !65, line: 61, baseType: !504, size: 384)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_t", file: !19, line: 90, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_s", file: !19, line: 95, size: 384, elements: !506)
!506 = !{!507, !510, !512, !519, !520}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !505, file: !19, line: 97, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !505, file: !19, line: 103, baseType: !511, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_rank_t", file: !19, line: 79, baseType: !18)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !505, file: !19, line: 110, baseType: !513, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_comp_t", file: !19, line: 92, baseType: !515)
!515 = !DISubroutineType(types: !516)
!516 = !{!390, !517, !383, !517, !383}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !505, file: !19, line: 113, baseType: !383, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !505, file: !19, line: 116, baseType: !521, size: 128, offset: 256)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !505, file: !19, line: 116, size: 128, elements: !522)
!522 = !{!523, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !521, file: !19, line: 116, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !521, file: !19, line: 116, baseType: !524, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lock_order", scope: !435, file: !65, line: 62, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_lock_order_t", file: !65, line: 19, baseType: !64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "thr_uid", scope: !426, file: !427, line: 151, baseType: !408, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "thr_discrim", scope: !426, file: !427, line: 157, baseType: !408, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "thread_name", scope: !426, file: !427, line: 160, baseType: !531, size: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "attached", scope: !426, file: !427, line: 162, baseType: !389, size: 8, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "expired", scope: !426, file: !427, line: 163, baseType: !389, size: 8, offset: 264)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "tdata_link", scope: !426, file: !427, line: 165, baseType: !535, size: 128, offset: 320)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !426, file: !427, line: 165, size: 128, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rbn_left", scope: !535, file: !427, line: 165, baseType: !423, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rbn_right_red", scope: !535, file: !427, line: 165, baseType: !423, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "tctx_uid_next", scope: !426, file: !427, line: 172, baseType: !408, size: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bt2tctx", scope: !426, file: !427, line: 180, baseType: !541, size: 384, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_t", file: !542, line: 63, baseType: !543)
!542 = !DIFile(filename: "include/jemalloc/internal/ckh.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "764fcd222e751d77d1875da9f00741d3")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 34, size: 384, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !557, !562}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prng_state", scope: !543, file: !542, line: 45, baseType: !408, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !543, file: !542, line: 48, baseType: !387, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lg_minbuckets", scope: !543, file: !542, line: 54, baseType: !7, size: 32, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lg_curbuckets", scope: !543, file: !542, line: 55, baseType: !7, size: 32, offset: 160)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !543, file: !542, line: 58, baseType: !550, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_hash_t", file: !542, line: 24, baseType: !552)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !554, !556}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "keycomp", scope: !543, file: !542, line: 59, baseType: !558, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_keycomp_t", file: !542, line: 25, baseType: !560)
!560 = !DISubroutineType(types: !561)
!561 = !{!389, !554, !554}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !543, file: !542, line: 62, baseType: !563, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckhc_t", file: !542, line: 31, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 28, size: 128, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !565, file: !542, line: 29, baseType: !554, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !565, file: !542, line: 30, baseType: !554, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "enq", scope: !426, file: !427, line: 183, baseType: !389, size: 8, offset: 896)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "enq_idump", scope: !426, file: !427, line: 184, baseType: !389, size: 8, offset: 904)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "enq_gdump", scope: !426, file: !427, line: 185, baseType: !389, size: 8, offset: 912)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dumping", scope: !426, file: !427, line: 193, baseType: !389, size: 8, offset: 920)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !426, file: !427, line: 199, baseType: !389, size: 8, offset: 928)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cnt_summed", scope: !426, file: !427, line: 202, baseType: !575, size: 512, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_cnt_t", file: !425, line: 5, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_cnt_s", file: !427, line: 25, size: 512, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "curobjs", scope: !576, file: !427, line: 27, baseType: !408, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "curobjs_shifted_unbiased", scope: !576, file: !427, line: 28, baseType: !408, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "curbytes", scope: !576, file: !427, line: 29, baseType: !408, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "curbytes_unbiased", scope: !576, file: !427, line: 30, baseType: !408, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "accumobjs", scope: !576, file: !427, line: 31, baseType: !408, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "accumobjs_shifted_unbiased", scope: !576, file: !427, line: 32, baseType: !408, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "accumbytes", scope: !576, file: !427, line: 33, baseType: !408, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "accumbytes_unbiased", scope: !576, file: !427, line: 34, baseType: !408, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !426, file: !427, line: 205, baseType: !587, size: 8192, offset: 1472)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 8192, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prng_state", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 896)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_san_extents_until_guard_small", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 960)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_san_extents_until_guard_large", scope: !398, file: !145, line: 250, baseType: !408, size: 64, offset: 1024)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_iarena", scope: !398, file: !145, line: 250, baseType: !594, size: 64, offset: 1088)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_t", file: !88, line: 13, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_s", file: !597, line: 20, size: 631616, elements: !598)
!597 = !DIFile(filename: "include/jemalloc/internal/arena_structs.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "dc0232497de09cf78e6bf4500191b508")
!598 = !{!599, !607, !608, !609, !680, !749, !753, !754, !755, !884, !885, !1295, !1296, !1297, !1298}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !596, file: !597, line: 34, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 64, elements: !605)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u_t", file: !459, line: 91, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 91, size: 32, elements: !603)
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !602, file: !459, line: 91, baseType: !7, size: 32)
!605 = !{!606}
!606 = !DISubrange(count: 2)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "binshard_next", scope: !596, file: !597, line: 37, baseType: !601, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "last_thd", scope: !596, file: !597, line: 44, baseType: !391, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !596, file: !597, line: 47, baseType: !610, size: 82944, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_t", file: !611, line: 45, baseType: !612)
!611 = !DIFile(filename: "include/jemalloc/internal/arena_stats.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "99cda11c8482c984e6b5456c8fe70a6c")
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_s", file: !611, line: 46, size: 82944, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !623, !624, !625, !626, !627, !628, !629, !660, !661, !662, !666, !679}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !612, file: !611, line: 53, baseType: !387, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !612, file: !611, line: 54, baseType: !387, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_thp", scope: !612, file: !611, line: 55, baseType: !387, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !612, file: !611, line: 56, baseType: !387, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !612, file: !611, line: 58, baseType: !619, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zu_t", file: !459, line: 93, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 93, size: 64, elements: !621)
!621 = !{!622}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !620, file: !459, line: 93, baseType: !387, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_large", scope: !612, file: !611, line: 60, baseType: !387, size: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc_large", scope: !612, file: !611, line: 61, baseType: !408, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc_large", scope: !612, file: !611, line: 62, baseType: !408, size: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nfills_large", scope: !612, file: !611, line: 63, baseType: !408, size: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes_large", scope: !612, file: !611, line: 64, baseType: !408, size: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests_large", scope: !612, file: !611, line: 65, baseType: !408, size: 64, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pa_shard_stats", scope: !612, file: !611, line: 72, baseType: !630, size: 640, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "pa_shard_stats_t", file: !631, line: 39, baseType: !632)
!631 = !DIFile(filename: "include/jemalloc/internal/pa.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "55be87c3139e48b12a220c7b4dc8c2b0")
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pa_shard_stats_s", file: !631, line: 40, size: 640, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "edata_avail", scope: !632, file: !631, line: 42, baseType: !387, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pac_stats", scope: !632, file: !631, line: 49, baseType: !636, size: 576, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "pac_stats_t", file: !637, line: 52, baseType: !638)
!637 = !DIFile(filename: "include/jemalloc/internal/pac.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "877669e56bce0e5aaa98ec99cb11f799")
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pac_stats_s", file: !637, line: 53, size: 576, elements: !639)
!639 = !{!640, !656, !657, !658, !659}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "decay_dirty", scope: !638, file: !637, line: 54, baseType: !641, size: 192)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "pac_decay_stats_t", file: !637, line: 25, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pac_decay_stats_s", file: !637, line: 26, size: 192, elements: !643)
!643 = !{!644, !654, !655}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "npurge", scope: !642, file: !637, line: 28, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "locked_u64_t", file: !646, line: 10, baseType: !647)
!646 = !DIFile(filename: "include/jemalloc/internal/lockedint.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "fd9906bc13a7d545799faac7a9a4b49b")
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "locked_u64_s", file: !646, line: 12, size: 64, elements: !648)
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !647, file: !646, line: 13, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u64_t", file: !459, line: 102, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 102, size: 64, elements: !652)
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !651, file: !459, line: 102, baseType: !408, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "nmadvise", scope: !642, file: !637, line: 30, baseType: !645, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !642, file: !637, line: 32, baseType: !645, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "decay_muzzy", scope: !638, file: !637, line: 55, baseType: !641, size: 192, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "retained", scope: !638, file: !637, line: 62, baseType: !387, size: 64, offset: 384)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pac_mapped", scope: !638, file: !637, line: 71, baseType: !619, size: 64, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "abandoned_vm", scope: !638, file: !637, line: 74, baseType: !619, size: 64, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_bytes", scope: !612, file: !611, line: 75, baseType: !387, size: 64, offset: 1344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_stashed_bytes", scope: !612, file: !611, line: 76, baseType: !387, size: 64, offset: 1408)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_prof_data", scope: !612, file: !611, line: 78, baseType: !663, size: 6144, offset: 1472)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 6144, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 12)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lstats", scope: !612, file: !611, line: 81, baseType: !667, size: 75264, offset: 7616)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 75264, elements: !677)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_large_t", file: !611, line: 13, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_large_s", file: !611, line: 14, size: 384, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc", scope: !669, file: !611, line: 19, baseType: !645, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc", scope: !669, file: !611, line: 20, baseType: !645, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !669, file: !611, line: 27, baseType: !645, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "nfills", scope: !669, file: !611, line: 33, baseType: !645, size: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes", scope: !669, file: !611, line: 34, baseType: !645, size: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "curlextents", scope: !669, file: !611, line: 37, baseType: !387, size: 64, offset: 320)
!677 = !{!678}
!678 = !DISubrange(count: 196)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "uptime", scope: !612, file: !611, line: 84, baseType: !446, size: 64, offset: 82880)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_ql", scope: !596, file: !597, line: 56, baseType: !681, size: 64, offset: 83136)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !596, file: !597, line: 56, size: 64, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !681, file: !597, line: 56, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcache_slow_t", file: !686, line: 6, baseType: !687)
!686 = !DIFile(filename: "include/jemalloc/internal/tcache_types.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "fcc0bdea671703d1a9ea9b3c0ad5a2cc")
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcache_slow_s", file: !688, line: 20, size: 1408, elements: !689)
!688 = !DIFile(filename: "include/jemalloc/internal/tcache_structs.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "4677e5af02cb08492d3f27ae4899356f")
!689 = !{!690, !695, !724, !725, !728, !735, !737, !738, !739}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !687, file: !688, line: 22, baseType: !691, size: 128)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !687, file: !688, line: 22, size: 128, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !691, file: !688, line: 22, baseType: !684, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !691, file: !688, line: 22, baseType: !684, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor", scope: !687, file: !688, line: 29, baseType: !696, size: 192, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_array_descriptor_t", file: !697, line: 133, baseType: !698)
!697 = !DIFile(filename: "include/jemalloc/internal/cache_bin.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "346bac98cae298112dab87b1fb1cd3dc")
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_array_descriptor_s", file: !697, line: 134, size: 192, elements: !699)
!699 = !{!700, !706}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !698, file: !697, line: 139, baseType: !701, size: 128)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !698, file: !697, line: 139, size: 128, elements: !702)
!702 = !{!703, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !701, file: !697, line: 139, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !701, file: !697, line: 139, baseType: !704, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !698, file: !697, line: 141, baseType: !707, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_t", file: !697, line: 81, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_s", file: !697, line: 82, size: 192, elements: !710)
!710 = !{!711, !713, !718, !722, !723}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "stack_head", scope: !709, file: !697, line: 88, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "tstats", scope: !709, file: !697, line: 94, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_stats_t", file: !697, line: 49, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_stats_s", file: !697, line: 50, size: 64, elements: !716)
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !715, file: !697, line: 55, baseType: !408, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "low_bits_low_water", scope: !709, file: !697, line: 104, baseType: !719, size: 16, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !409, line: 25, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !405, line: 40, baseType: !721)
!721 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "low_bits_full", scope: !709, file: !697, line: 115, baseType: !719, size: 16, offset: 144)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "low_bits_empty", scope: !709, file: !697, line: 124, baseType: !719, size: 16, offset: 160)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !687, file: !688, line: 32, baseType: !594, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "next_gc_bin", scope: !687, file: !688, line: 34, baseType: !726, size: 32, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "szind_t", file: !727, line: 29, baseType: !7)
!727 = !DIFile(filename: "include/jemalloc/internal/sz.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "b9ea65fced4fed60be8d476b16546a70")
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lg_fill_div", scope: !687, file: !688, line: 36, baseType: !729, size: 288, offset: 416)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 288, elements: !733)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !409, line: 24, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !405, line: 38, baseType: !732)
!732 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!733 = !{!734}
!734 = !DISubrange(count: 36)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bin_refilled", scope: !687, file: !688, line: 38, baseType: !736, size: 288, offset: 704)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 288, elements: !733)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "bin_flush_delay_items", scope: !687, file: !688, line: 43, baseType: !729, size: 288, offset: 992)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_alloc", scope: !687, file: !688, line: 49, baseType: !383, size: 64, offset: 1280)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tcache", scope: !687, file: !688, line: 52, baseType: !740, size: 64, offset: 1344)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcache_t", file: !686, line: 7, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcache_s", file: !688, line: 55, size: 14080, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_slow", scope: !742, file: !688, line: 56, baseType: !684, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !742, file: !688, line: 57, baseType: !746, size: 14016, offset: 64)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 14016, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 73)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor_ql", scope: !596, file: !597, line: 57, baseType: !750, size: 64, offset: 83200)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !596, file: !597, line: 57, size: 64, elements: !751)
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !750, file: !597, line: 57, baseType: !704, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_ql_mtx", scope: !596, file: !597, line: 58, baseType: !431, size: 896, offset: 83264)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "dss_prec", scope: !596, file: !597, line: 65, baseType: !601, size: 32, offset: 84160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !596, file: !597, line: 72, baseType: !756, size: 64, offset: 84224)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_list_active_t", file: !70, line: 253, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 253, size: 64, elements: !758)
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !757, file: !70, line: 253, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !757, file: !70, line: 253, size: 64, elements: !761)
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !760, file: !70, line: 253, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_t", file: !70, line: 89, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edata_s", file: !70, line: 92, size: 1024, elements: !766)
!766 = !{!767, !768, !769, !774, !833, !834, !855}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "e_bits", scope: !765, file: !70, line: 142, baseType: !408, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "e_addr", scope: !765, file: !70, line: 190, baseType: !383, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, scope: !765, file: !70, line: 192, baseType: !770, size: 64, offset: 128)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !765, file: !70, line: 192, size: 64, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "e_size_esn", scope: !770, file: !70, line: 200, baseType: !387, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "e_bsize", scope: !770, file: !70, line: 204, baseType: !387, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "e_ps", scope: !765, file: !70, line: 212, baseType: !775, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpdata_t", file: !777, line: 20, baseType: !778)
!777 = !DIFile(filename: "include/jemalloc/internal/hpdata.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "227d9acce318e355ef8af46ae9961791")
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hpdata_s", file: !777, line: 22, size: 1984, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !813, !818, !823, !824, !825, !831, !832}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "h_address", scope: !778, file: !777, line: 33, baseType: !383, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "h_age", scope: !778, file: !777, line: 35, baseType: !408, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "h_huge", scope: !778, file: !777, line: 37, baseType: !389, size: 8, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "h_alloc_allowed", scope: !778, file: !777, line: 52, baseType: !389, size: 8, offset: 136)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "h_in_psset_alloc_container", scope: !778, file: !777, line: 53, baseType: !389, size: 8, offset: 144)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "h_purge_allowed", scope: !778, file: !777, line: 61, baseType: !389, size: 8, offset: 152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "h_hugify_allowed", scope: !778, file: !777, line: 64, baseType: !389, size: 8, offset: 160)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "h_time_hugify_allowed", scope: !778, file: !777, line: 66, baseType: !446, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "h_in_psset_hugify_container", scope: !778, file: !777, line: 67, baseType: !389, size: 8, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "h_mid_purge", scope: !778, file: !777, line: 70, baseType: !389, size: 8, offset: 264)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "h_mid_hugify", scope: !778, file: !777, line: 71, baseType: !389, size: 8, offset: 272)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "h_updating", scope: !778, file: !777, line: 79, baseType: !389, size: 8, offset: 280)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "h_in_psset", scope: !778, file: !777, line: 82, baseType: !389, size: 8, offset: 288)
!793 = !DIDerivedType(tag: DW_TAG_member, scope: !778, file: !777, line: 84, baseType: !794, size: 192, offset: 320)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !778, file: !777, line: 84, size: 192, elements: !795)
!795 = !{!796, !808}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "age_link", scope: !794, file: !777, line: 86, baseType: !797, size: 192)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpdata_age_heap_link_t", file: !777, line: 21, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !777, line: 21, size: 192, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !798, file: !777, line: 21, baseType: !801, size: 192)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "phn_link_t", file: !802, line: 55, baseType: !803)
!802 = !DIFile(filename: "include/jemalloc/internal/ph.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "ceeb9a10f054380a38a1ec33a7da11ad")
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phn_link_s", file: !802, line: 56, size: 192, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !803, file: !802, line: 57, baseType: !383, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !802, line: 58, baseType: !383, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lchild", scope: !803, file: !802, line: 59, baseType: !383, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link_empty", scope: !794, file: !777, line: 91, baseType: !809, size: 128)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !794, file: !777, line: 91, size: 128, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !809, file: !777, line: 91, baseType: !775, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !809, file: !777, line: 91, baseType: !775, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link_purge", scope: !778, file: !777, line: 97, baseType: !814, size: 128, offset: 512)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !778, file: !777, line: 97, size: 128, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !814, file: !777, line: 97, baseType: !775, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !814, file: !777, line: 97, baseType: !775, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link_hugify", scope: !778, file: !777, line: 98, baseType: !819, size: 128, offset: 640)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !778, file: !777, line: 98, size: 128, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !819, file: !777, line: 98, baseType: !775, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !819, file: !777, line: 98, baseType: !775, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "h_longest_free_range", scope: !778, file: !777, line: 101, baseType: !387, size: 64, offset: 768)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "h_nactive", scope: !778, file: !777, line: 104, baseType: !387, size: 64, offset: 832)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "active_pages", scope: !778, file: !777, line: 107, baseType: !826, size: 512, offset: 896)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 512, elements: !829)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "fb_group_t", file: !828, line: 12, baseType: !386)
!828 = !DIFile(filename: "include/jemalloc/internal/fb.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "617442e449dfdc2ed891a67ec59d7ccf")
!829 = !{!830}
!830 = !DISubrange(count: 8)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "h_ntouched", scope: !778, file: !777, line: 114, baseType: !387, size: 64, offset: 1408)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "touched_pages", scope: !778, file: !777, line: 117, baseType: !826, size: 512, offset: 1472)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "e_sn", scope: !765, file: !70, line: 218, baseType: !408, size: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, scope: !765, file: !70, line: 220, baseType: !835, size: 192, offset: 320)
!835 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !765, file: !70, line: 220, size: 192, elements: !836)
!836 = !{!837, !842}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link_active", scope: !835, file: !70, line: 225, baseType: !838, size: 128)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !835, file: !70, line: 225, size: 128, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !838, file: !70, line: 225, baseType: !763, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !838, file: !70, line: 225, baseType: !763, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, scope: !835, file: !70, line: 232, baseType: !843, size: 192)
!843 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !835, file: !70, line: 232, size: 192, elements: !844)
!844 = !{!845, !850}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "heap_link", scope: !843, file: !70, line: 233, baseType: !846, size: 192)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_heap_link_t", file: !70, line: 91, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 91, size: 192, elements: !848)
!848 = !{!849}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !847, file: !70, line: 91, baseType: !801, size: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "avail_link", scope: !843, file: !70, line: 234, baseType: !851, size: 192)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_avail_link_t", file: !70, line: 90, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 90, size: 192, elements: !853)
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !852, file: !70, line: 90, baseType: !801, size: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, scope: !765, file: !70, line: 238, baseType: !856, size: 512, offset: 512)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !765, file: !70, line: 238, size: 512, elements: !857)
!857 = !{!858, !863, !872}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link_inactive", scope: !856, file: !70, line: 244, baseType: !859, size: 128)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !856, file: !70, line: 244, size: 128, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !859, file: !70, line: 244, baseType: !763, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !859, file: !70, line: 244, baseType: !763, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "e_slab_data", scope: !856, file: !70, line: 246, baseType: !864, size: 512)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "slab_data_t", file: !865, line: 6, baseType: !866)
!865 = !DIFile(filename: "include/jemalloc/internal/slab_data.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "3957c6c0ea3d34f7841f7b97dcad1035")
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slab_data_s", file: !865, line: 7, size: 512, elements: !867)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !866, file: !865, line: 9, baseType: !869, size: 512)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 512, elements: !829)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_t", file: !871, line: 7, baseType: !386)
!871 = !DIFile(filename: "include/jemalloc/internal/bitmap.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "97e6c829f154125215bd6d0de76c5988")
!872 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_info", scope: !856, file: !70, line: 249, baseType: !873, size: 256)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "e_prof_info_t", file: !70, line: 63, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "e_prof_info_s", file: !70, line: 49, size: 256, elements: !875)
!875 = !{!876, !877, !878, !883}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_alloc_time", scope: !874, file: !70, line: 51, baseType: !446, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_alloc_size", scope: !874, file: !70, line: 53, baseType: !387, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_tctx", scope: !874, file: !70, line: 55, baseType: !879, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_p_t", file: !459, line: 83, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 83, size: 64, elements: !881)
!881 = !{!882}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !880, file: !459, line: 83, baseType: !383, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_recent_alloc", scope: !874, file: !70, line: 61, baseType: !879, size: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "large_mtx", scope: !596, file: !597, line: 74, baseType: !431, size: 896, offset: 84288)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pa_shard", scope: !596, file: !597, line: 77, baseType: !886, size: 546240, offset: 85184)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "pa_shard_t", file: !631, line: 67, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pa_shard_s", file: !631, line: 68, size: 546240, elements: !888)
!888 = !{!889, !972, !973, !974, !975, !1149, !1184, !1288, !1289, !1290, !1291, !1293, !1294}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "central", scope: !887, file: !631, line: 70, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "pa_central_t", file: !631, line: 23, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pa_central_s", file: !631, line: 24, size: 2496, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "hpa", scope: !892, file: !631, line: 25, baseType: !895, size: 2496)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpa_central_t", file: !896, line: 10, baseType: !897)
!896 = !DIFile(filename: "include/jemalloc/internal/hpa.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "b167af9349348ab02109568222c99503")
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hpa_central_s", file: !896, line: 11, size: 2496, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !946, !947}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !897, file: !896, line: 16, baseType: !431, size: 896)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "grow_mtx", scope: !897, file: !896, line: 22, baseType: !431, size: 896, offset: 896)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "eden", scope: !897, file: !896, line: 30, baseType: !383, size: 64, offset: 1792)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "eden_len", scope: !897, file: !896, line: 31, baseType: !387, size: 64, offset: 1856)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !897, file: !896, line: 33, baseType: !904, size: 64, offset: 1920)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "base_t", file: !123, line: 42, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_s", file: !123, line: 43, size: 31296, elements: !907)
!907 = !{!908, !915, !916, !917, !918, !920, !921, !929, !942, !943, !944, !945}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ehooks", scope: !906, file: !123, line: 47, baseType: !909, size: 128)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "ehooks_t", file: !910, line: 21, baseType: !911)
!910 = !DIFile(filename: "include/jemalloc/internal/ehooks.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "6c296cf246258b3220ac1cb2e396e4b5")
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ehooks_s", file: !910, line: 22, size: 128, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !911, file: !910, line: 28, baseType: !7, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !911, file: !910, line: 30, baseType: !879, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ehooks_base", scope: !906, file: !123, line: 52, baseType: !909, size: 128, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !906, file: !123, line: 55, baseType: !431, size: 896, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "auto_thp_switched", scope: !906, file: !123, line: 58, baseType: !389, size: 8, offset: 1152)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pind_last", scope: !906, file: !123, line: 64, baseType: !919, size: 32, offset: 1184)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "pszind_t", file: !727, line: 26, baseType: !7)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "extent_sn_next", scope: !906, file: !123, line: 67, baseType: !387, size: 64, offset: 1216)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !906, file: !123, line: 70, baseType: !922, size: 64, offset: 1280)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "base_block_t", file: !123, line: 30, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_block_s", file: !123, line: 31, size: 1152, elements: !925)
!925 = !{!926, !927, !928}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !924, file: !123, line: 33, baseType: !387, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !123, line: 36, baseType: !922, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !924, file: !123, line: 39, baseType: !764, size: 1024, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !906, file: !123, line: 73, baseType: !930, size: 29696, offset: 1344)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 29696, elements: !940)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_heap_t", file: !70, line: 91, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 91, size: 128, elements: !933)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ph", scope: !932, file: !70, line: 91, baseType: !935, size: 128)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "ph_t", file: !802, line: 62, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ph_s", file: !802, line: 63, size: 128, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !936, file: !802, line: 64, baseType: !383, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "auxcount", scope: !936, file: !802, line: 71, baseType: !387, size: 64, offset: 64)
!940 = !{!941}
!941 = !DISubrange(count: 232)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !906, file: !123, line: 76, baseType: !387, size: 64, offset: 31040)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !906, file: !123, line: 77, baseType: !387, size: 64, offset: 31104)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !906, file: !123, line: 78, baseType: !387, size: 64, offset: 31168)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "n_thp", scope: !906, file: !123, line: 80, baseType: !387, size: 64, offset: 31232)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "age_counter", scope: !897, file: !896, line: 35, baseType: !408, size: 64, offset: 1984)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !897, file: !896, line: 38, baseType: !948, size: 448, offset: 2048)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpa_hooks_t", file: !949, line: 4, baseType: !950)
!949 = !DIFile(filename: "include/jemalloc/internal/hpa_hooks.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "0980fb000517829e6b7477bbc3494118")
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hpa_hooks_s", file: !949, line: 5, size: 448, elements: !951)
!951 = !{!952, !956, !960, !961, !962, !963, !968}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !950, file: !949, line: 6, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!383, !387}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "unmap", scope: !950, file: !949, line: 7, baseType: !957, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !383, !387}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "purge", scope: !950, file: !949, line: 8, baseType: !957, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "hugify", scope: !950, file: !949, line: 9, baseType: !957, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "dehugify", scope: !950, file: !949, line: 10, baseType: !957, size: 64, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "curtime", scope: !950, file: !949, line: 11, baseType: !964, size: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !967, !389}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ms_since", scope: !950, file: !949, line: 12, baseType: !969, size: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!408, !967}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !887, file: !631, line: 77, baseType: !619, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "use_hpa", scope: !887, file: !631, line: 86, baseType: !499, size: 8, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ever_used_hpa", scope: !887, file: !631, line: 93, baseType: !389, size: 8, offset: 136)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "pac", scope: !887, file: !631, line: 96, baseType: !976, size: 497920, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "pac_t", file: !637, line: 77, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pac_s", file: !637, line: 78, size: 497920, elements: !978)
!978 = !{!979, !1015, !1066, !1067, !1068, !1069, !1090, !1104, !1111, !1112, !1119, !1120, !1144, !1145, !1146, !1148}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "pai", scope: !977, file: !637, line: 83, baseType: !980, size: 448)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "pai_t", file: !981, line: 6, baseType: !982)
!981 = !DIFile(filename: "include/jemalloc/internal/pai.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "6205721010343a74af256b178d9d9dbd")
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pai_s", file: !981, line: 7, size: 448, elements: !983)
!983 = !{!984, !990, !995, !999, !1003, !1007, !1011}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !982, file: !981, line: 9, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!763, !391, !988, !387, !387, !389, !389, !389, !989}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_batch", scope: !982, file: !981, line: 18, baseType: !991, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!387, !391, !988, !387, !387, !994, !989}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "expand", scope: !982, file: !981, line: 21, baseType: !996, size: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!389, !391, !988, !763, !387, !387, !389, !989}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "shrink", scope: !982, file: !981, line: 24, baseType: !1000, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!389, !391, !988, !763, !387, !387, !989}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "dalloc", scope: !982, file: !981, line: 26, baseType: !1004, size: 64, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !391, !988, !763, !989}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "dalloc_batch", scope: !982, file: !981, line: 29, baseType: !1008, size: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !391, !988, !994, !989}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "time_until_deferred_work", scope: !982, file: !981, line: 31, baseType: !1012, size: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!408, !391, !988}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ecache_dirty", scope: !977, file: !637, line: 90, baseType: !1016, size: 155520, offset: 448)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "ecache_t", file: !1017, line: 8, baseType: !1018)
!1017 = !DIFile(filename: "include/jemalloc/internal/ecache.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "78d215f47eec710b9137eacb5e234a5e")
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ecache_s", file: !1017, line: 9, size: 155520, elements: !1019)
!1019 = !{!1020, !1021, !1062, !1063, !1064, !1065}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !1018, file: !1017, line: 10, baseType: !431, size: 896)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "eset", scope: !1018, file: !1017, line: 11, baseType: !1022, size: 77248, offset: 896)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "eset_t", file: !1023, line: 37, baseType: !1024)
!1023 = !DIFile(filename: "include/jemalloc/internal/eset.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "8831525b8469e6d512e893965968cd22")
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eset_s", file: !1023, line: 38, size: 77248, elements: !1025)
!1025 = !{!1026, !1030, !1044, !1051, !1059, !1060}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !1024, file: !1023, line: 40, baseType: !1027, size: 256)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 256, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 4)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !1024, file: !1023, line: 43, baseType: !1031, size: 51200, offset: 256)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 51200, elements: !1042)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "eset_bin_t", file: !1023, line: 18, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eset_bin_s", file: !1023, line: 19, size: 256, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !1033, file: !1023, line: 20, baseType: !931, size: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "heap_min", scope: !1033, file: !1023, line: 28, baseType: !1037, size: 128, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_cmp_summary_t", file: !70, line: 82, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edata_cmp_summary_s", file: !70, line: 83, size: 128, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !1038, file: !70, line: 84, baseType: !408, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !1038, file: !70, line: 85, baseType: !384, size: 64, offset: 64)
!1042 = !{!1043}
!1043 = !DISubrange(count: 200)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "bin_stats", scope: !1024, file: !1023, line: 45, baseType: !1045, size: 25600, offset: 51456)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1046, size: 25600, elements: !1042)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "eset_bin_stats_t", file: !1023, line: 31, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eset_bin_stats_s", file: !1023, line: 32, size: 128, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "nextents", scope: !1047, file: !1023, line: 33, baseType: !619, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !1047, file: !1023, line: 34, baseType: !619, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1024, file: !1023, line: 48, baseType: !1052, size: 64, offset: 77056)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_list_inactive_t", file: !70, line: 254, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 254, size: 64, elements: !1054)
!1054 = !{!1055}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1053, file: !70, line: 254, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1053, file: !70, line: 254, size: 64, elements: !1057)
!1057 = !{!1058}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !1056, file: !70, line: 254, baseType: !763, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "npages", scope: !1024, file: !1023, line: 51, baseType: !619, size: 64, offset: 77120)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1024, file: !1023, line: 57, baseType: !1061, size: 32, offset: 77184)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_state_t", file: !70, line: 31, baseType: !69)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "guarded_eset", scope: !1018, file: !1017, line: 12, baseType: !1022, size: 77248, offset: 78144)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1018, file: !1017, line: 14, baseType: !1061, size: 32, offset: 155392)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !1018, file: !1017, line: 16, baseType: !7, size: 32, offset: 155424)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "delay_coalesce", scope: !1018, file: !1017, line: 21, baseType: !389, size: 8, offset: 155456)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ecache_muzzy", scope: !977, file: !637, line: 91, baseType: !1016, size: 155520, offset: 155968)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ecache_retained", scope: !977, file: !637, line: 92, baseType: !1016, size: 155520, offset: 311488)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !977, file: !637, line: 94, baseType: !904, size: 64, offset: 467008)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "emap", scope: !977, file: !637, line: 95, baseType: !1070, size: 64, offset: 467072)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "emap_t", file: !1072, line: 16, baseType: !1073)
!1072 = !DIFile(filename: "include/jemalloc/internal/emap.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "4886c34b97d6ef6486963c4e0200b09f")
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "emap_s", file: !1072, line: 17, size: 16778176, elements: !1074)
!1074 = !{!1075}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "rtree", scope: !1073, file: !1072, line: 18, baseType: !1076, size: 16778176)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_t", file: !1077, line: 98, baseType: !1078)
!1077 = !DIFile(filename: "include/jemalloc/internal/rtree.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "103cd0a954fb1863bb498eb7b2d89316")
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_s", file: !1077, line: 99, size: 16778176, elements: !1079)
!1079 = !{!1080, !1081, !1082}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1078, file: !1077, line: 100, baseType: !904, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "init_lock", scope: !1078, file: !1077, line: 101, baseType: !431, size: 896, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1078, file: !1077, line: 104, baseType: !1083, size: 16777216, offset: 960)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 16777216, elements: !1088)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_node_elm_t", file: !1077, line: 38, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_node_elm_s", file: !1077, line: 39, size: 64, elements: !1086)
!1086 = !{!1087}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !1085, file: !1077, line: 40, baseType: !879, size: 64)
!1088 = !{!1089}
!1089 = !DISubrange(count: 262144)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "edata_cache", scope: !977, file: !637, line: 96, baseType: !1091, size: 64, offset: 467136)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_cache_t", file: !1093, line: 15, baseType: !1094)
!1093 = !DIFile(filename: "include/jemalloc/internal/edata_cache.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "3d63723d254bad4e2554b9f9134fce37")
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edata_cache_s", file: !1093, line: 16, size: 1152, elements: !1095)
!1095 = !{!1096, !1101, !1102, !1103}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !1094, file: !1093, line: 17, baseType: !1097, size: 128)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_avail_t", file: !70, line: 90, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 90, size: 128, elements: !1099)
!1099 = !{!1100}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ph", scope: !1098, file: !70, line: 90, baseType: !935, size: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1094, file: !1093, line: 18, baseType: !619, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !1094, file: !1093, line: 19, baseType: !431, size: 896, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1094, file: !1093, line: 20, baseType: !904, size: 64, offset: 1088)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "exp_grow", scope: !977, file: !637, line: 99, baseType: !1105, size: 64, offset: 467200)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "exp_grow_t", file: !1106, line: 4, baseType: !1107)
!1106 = !DIFile(filename: "include/jemalloc/internal/exp_grow.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "bf6848675fbb3c1f8c6ab15998625e74")
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exp_grow_s", file: !1106, line: 5, size: 64, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1107, file: !1106, line: 17, baseType: !919, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1107, file: !1106, line: 18, baseType: !919, size: 32, offset: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "grow_mtx", scope: !977, file: !637, line: 100, baseType: !431, size: 896, offset: 467264)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "sba", scope: !977, file: !637, line: 103, baseType: !1113, size: 960, offset: 468160)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "san_bump_alloc_t", file: !1114, line: 15, baseType: !1115)
!1114 = !DIFile(filename: "include/jemalloc/internal/san_bump.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "1c2aa883cd4eaa1bdaec306a4e50c081")
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "san_bump_alloc_s", file: !1114, line: 16, size: 960, elements: !1116)
!1116 = !{!1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !1115, file: !1114, line: 17, baseType: !431, size: 896)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "curr_reg", scope: !1115, file: !1114, line: 19, baseType: !763, size: 64, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "oversize_threshold", scope: !977, file: !637, line: 106, baseType: !619, size: 64, offset: 469120)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "decay_dirty", scope: !977, file: !637, line: 114, baseType: !1121, size: 14272, offset: 469184)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "decay_t", file: !1122, line: 23, baseType: !1123)
!1122 = !DIFile(filename: "include/jemalloc/internal/decay.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "0d27b26766983c10c5dfe1de80068510")
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decay_s", file: !1122, line: 24, size: 14272, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1143}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !1123, file: !1122, line: 26, baseType: !431, size: 896)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "purging", scope: !1123, file: !1122, line: 31, baseType: !389, size: 8, offset: 896)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "time_ms", scope: !1123, file: !1122, line: 37, baseType: !1128, size: 64, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zd_t", file: !459, line: 95, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 95, size: 64, elements: !1130)
!1130 = !{!1131}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !1129, file: !459, line: 95, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !1133, line: 108, baseType: !1134)
!1133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !405, line: 194, baseType: !497)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !1123, file: !1122, line: 39, baseType: !446, size: 64, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !1123, file: !1122, line: 47, baseType: !446, size: 64, offset: 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "jitter_state", scope: !1123, file: !1122, line: 49, baseType: !408, size: 64, offset: 1152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !1123, file: !1122, line: 57, baseType: !446, size: 64, offset: 1216)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "npages_limit", scope: !1123, file: !1122, line: 63, baseType: !387, size: 64, offset: 1280)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nunpurged", scope: !1123, file: !1122, line: 70, baseType: !387, size: 64, offset: 1344)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !1123, file: !1122, line: 80, baseType: !1142, size: 12800, offset: 1408)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 12800, elements: !1042)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ceil_npages", scope: !1123, file: !1122, line: 83, baseType: !408, size: 64, offset: 14208)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "decay_muzzy", scope: !977, file: !637, line: 115, baseType: !1121, size: 14272, offset: 483456)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "stats_mtx", scope: !977, file: !637, line: 117, baseType: !430, size: 64, offset: 497728)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !977, file: !637, line: 118, baseType: !1147, size: 64, offset: 497792)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "extent_sn_next", scope: !977, file: !637, line: 121, baseType: !619, size: 64, offset: 497856)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "hpa_sec", scope: !887, file: !631, line: 103, baseType: !1150, size: 960, offset: 498112)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "sec_t", file: !1151, line: 87, baseType: !1152)
!1151 = !DIFile(filename: "include/jemalloc/internal/sec.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "ddbad2fd3266825bf2985ec75d9b308d")
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sec_s", file: !1151, line: 88, size: 960, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1166, !1183}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pai", scope: !1152, file: !1151, line: 89, baseType: !980, size: 448)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "fallback", scope: !1152, file: !1151, line: 90, baseType: !988, size: 64, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !1152, file: !1151, line: 92, baseType: !1157, size: 320, offset: 512)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "sec_opts_t", file: !1158, line: 9, baseType: !1159)
!1158 = !DIFile(filename: "include/jemalloc/internal/sec_opts.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "8e74e2e488441438e14e59d407f14329")
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sec_opts_s", file: !1158, line: 10, size: 320, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "nshards", scope: !1159, file: !1158, line: 15, baseType: !387, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "max_alloc", scope: !1159, file: !1158, line: 21, baseType: !387, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes", scope: !1159, file: !1158, line: 26, baseType: !387, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_after_flush", scope: !1159, file: !1158, line: 35, baseType: !387, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "batch_fill_extra", scope: !1159, file: !1158, line: 42, baseType: !387, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "shards", scope: !1152, file: !1151, line: 93, baseType: !1167, size: 64, offset: 832)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "sec_shard_t", file: !1151, line: 62, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sec_shard_s", file: !1151, line: 63, size: 1152, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1181, !1182}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !1169, file: !1151, line: 69, baseType: !431, size: 896)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !1169, file: !1151, line: 79, baseType: !389, size: 8, offset: 896)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !1169, file: !1151, line: 80, baseType: !1174, size: 64, offset: 960)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "sec_bin_t", file: !1151, line: 32, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sec_bin_s", file: !1151, line: 33, size: 192, elements: !1177)
!1177 = !{!1178, !1179, !1180}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "being_batch_filled", scope: !1176, file: !1151, line: 50, baseType: !389, size: 8)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_cur", scope: !1176, file: !1151, line: 58, baseType: !387, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !1176, file: !1151, line: 59, baseType: !756, size: 64, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_cur", scope: !1169, file: !1151, line: 82, baseType: !387, size: 64, offset: 1024)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "to_flush_next", scope: !1169, file: !1151, line: 84, baseType: !919, size: 32, offset: 1088)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "npsizes", scope: !1152, file: !1151, line: 94, baseType: !919, size: 32, offset: 896)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "hpa_shard", scope: !887, file: !631, line: 104, baseType: !1185, size: 45696, offset: 499072)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpa_shard_t", file: !896, line: 79, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hpa_shard_s", file: !896, line: 80, size: 45696, elements: !1187)
!1187 = !{!1188, !1189, !1191, !1192, !1193, !1194, !1201, !1262, !1263, !1264, !1265, !1278, !1279, !1287}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pai", scope: !1186, file: !896, line: 85, baseType: !980, size: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "central", scope: !1186, file: !896, line: 88, baseType: !1190, size: 64, offset: 448)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !1186, file: !896, line: 90, baseType: !431, size: 896, offset: 512)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "grow_mtx", scope: !1186, file: !896, line: 96, baseType: !431, size: 896, offset: 1408)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1186, file: !896, line: 98, baseType: !904, size: 64, offset: 2304)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "ecf", scope: !1186, file: !896, line: 105, baseType: !1195, size: 192, offset: 2368)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_cache_fast_t", file: !1093, line: 36, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edata_cache_fast_s", file: !1093, line: 37, size: 192, elements: !1197)
!1197 = !{!1198, !1199, !1200}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1196, file: !1093, line: 38, baseType: !1052, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "fallback", scope: !1196, file: !1093, line: 39, baseType: !1091, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !1196, file: !1093, line: 40, baseType: !389, size: 8, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "psset", scope: !1186, file: !896, line: 107, baseType: !1202, size: 42240, offset: 2560)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "psset_t", file: !1203, line: 63, baseType: !1204)
!1203 = !DIFile(filename: "include/jemalloc/internal/psset.h", directory: "/local-ssd/jemalloc-4sjtsltnpdxt65wruxrwgm5oxetre7vn-build/aidengro/spack-stage-jemalloc-5.3.0-4sjtsltnpdxt65wruxrwgm5oxetre7vn/spack-src", checksumkind: CSK_MD5, checksum: "ac7317bc4820a45856300accafbe13ce")
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "psset_s", file: !1203, line: 64, size: 42240, elements: !1205)
!1205 = !{!1206, !1214, !1218, !1225, !1235, !1243, !1252, !1254}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pageslabs", scope: !1204, file: !1203, line: 69, baseType: !1207, size: 8192)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1208, size: 8192, elements: !1212)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpdata_age_heap_t", file: !777, line: 21, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !777, line: 21, size: 128, elements: !1210)
!1210 = !{!1211}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ph", scope: !1209, file: !777, line: 21, baseType: !935, size: 128)
!1212 = !{!1213}
!1213 = !DISubrange(count: 64)
