; ModuleID = 'samples/549.bc'
source_filename = "mod_session_dbd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.command_struct = type { ptr, %union.cmd_func, ptr, i32, i32, ptr }
%union.cmd_func = type { ptr }
%struct.module_struct = type { i32, i32, i32, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct.session_dbd_dir_conf = type { ptr, i32, ptr, ptr, i32, ptr, i32, i32, i32, i32, ptr, ptr, ptr, ptr }
%struct.cmd_parms_struct = type { ptr, i32, i32, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ap_directive_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr }
%struct.request_rec = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i32, ptr, ptr, i64, ptr, i32, i32, ptr, i64, ptr, ptr, i64, i64, i64, ptr, i64, i32, i32, i32, i32, ptr, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, %struct.apr_uri_t, %struct.apr_finfo_t, ptr, ptr, ptr, ptr, ptr, i32, i64 }
%struct.apr_uri_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i16, i8 }
%struct.apr_finfo_t = type { ptr, i32, i32, i32, i32, i32, i64, i64, i32, i64, i64, i64, i64, i64, ptr, ptr, ptr }
%struct.session_rec = type { ptr, ptr, ptr, ptr, ptr, i64, i64, i32, i32, i32 }
%struct.ap_dbd_t = type { ptr, ptr, ptr, ptr }


!2 = !DIFile(filename: "mod_session_dbd.c", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/session", checksumkind: CSK_MD5, checksum: "e119f87b8bf915b1f4d9941d4a68008e")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 18)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "session_dbd_cmds", scope: !9, file: !2, line: 598, type: !920, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !159, globals: !629, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !28, !43, !55, !60, !65, !123, !147}
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cmd_how", file: !12, line: 49, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "include/http_config.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "478a5811bd142d8034ca8ebc320f852f")
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!15 = !DIEnumerator(name: "RAW_ARGS", value: 0)
!16 = !DIEnumerator(name: "TAKE1", value: 1)
!17 = !DIEnumerator(name: "TAKE2", value: 2)
!18 = !DIEnumerator(name: "ITERATE", value: 3)
!19 = !DIEnumerator(name: "ITERATE2", value: 4)
!20 = !DIEnumerator(name: "FLAG", value: 5)
!21 = !DIEnumerator(name: "NO_ARGS", value: 6)
!22 = !DIEnumerator(name: "TAKE12", value: 7)
!23 = !DIEnumerator(name: "TAKE3", value: 8)
!24 = !DIEnumerator(name: "TAKE23", value: 9)
!25 = !DIEnumerator(name: "TAKE123", value: 10)
!26 = !DIEnumerator(name: "TAKE13", value: 11)
!27 = !DIEnumerator(name: "TAKE_ARGV", value: 12)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 46, baseType: !13, size: 32, elements: !30)
!29 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!31 = !DIEnumerator(name: "_ISupper", value: 256)
!32 = !DIEnumerator(name: "_ISlower", value: 512)
!33 = !DIEnumerator(name: "_ISalpha", value: 1024)
!34 = !DIEnumerator(name: "_ISdigit", value: 2048)
!35 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!36 = !DIEnumerator(name: "_ISspace", value: 8192)
!37 = !DIEnumerator(name: "_ISprint", value: 16384)
!38 = !DIEnumerator(name: "_ISgraph", value: 32768)
!39 = !DIEnumerator(name: "_ISblank", value: 1)
!40 = !DIEnumerator(name: "_IScntrl", value: 2)
!41 = !DIEnumerator(name: "_ISpunct", value: 4)
!42 = !DIEnumerator(name: "_ISalnum", value: 8)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 1251, baseType: !13, size: 32, elements: !45)
!44 = !DIFile(filename: "include/httpd.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "13796706810e88ffd526cf3216ebbaab")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54}
!46 = !DIEnumerator(name: "CONN_STATE_CHECK_REQUEST_LINE_READABLE", value: 0)
!47 = !DIEnumerator(name: "CONN_STATE_READ_REQUEST_LINE", value: 1)
!48 = !DIEnumerator(name: "CONN_STATE_HANDLER", value: 2)
!49 = !DIEnumerator(name: "CONN_STATE_WRITE_COMPLETION", value: 3)
!50 = !DIEnumerator(name: "CONN_STATE_SUSPENDED", value: 4)
!51 = !DIEnumerator(name: "CONN_STATE_LINGER", value: 5)
!52 = !DIEnumerator(name: "CONN_STATE_LINGER_NORMAL", value: 6)
!53 = !DIEnumerator(name: "CONN_STATE_LINGER_SHORT", value: 7)
!54 = !DIEnumerator(name: "CONN_STATE_NUM", value: 8)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 1264, baseType: !13, size: 32, elements: !56)
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "CONN_SENSE_DEFAULT", value: 0)
!58 = !DIEnumerator(name: "CONN_SENSE_WANT_READ", value: 1)
!59 = !DIEnumerator(name: "CONN_SENSE_WANT_WRITE", value: 2)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 1136, baseType: !13, size: 32, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "AP_CONN_UNKNOWN", value: 0)
!63 = !DIEnumerator(name: "AP_CONN_CLOSE", value: 1)
!64 = !DIEnumerator(name: "AP_CONN_KEEPALIVE", value: 2)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !67, file: !66, line: 151, baseType: !13, size: 32, elements: !144)
!66 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_buckets.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "afcd28b2e200d46cb3a438f3ad8fc6de")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_type_t", file: !66, line: 131, size: 448, elements: !68)
!68 = !{!69, !72, !74, !75, !80, !127, !135, !139}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !66, line: 135, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "num_func", scope: !67, file: !66, line: 140, baseType: !73, size: 32, offset: 64)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "is_metadata", scope: !67, file: !66, line: 156, baseType: !65, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !67, file: !66, line: 164, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !79}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !67, file: !66, line: 176, baseType: !81, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !86, !120, !121, !122}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !85, line: 44, baseType: !73)
!85 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_errno.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "571a7b9d4a9f11f6d27db63c8ba4bc85")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket", file: !66, line: 121, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket", file: !66, line: 224, size: 512, elements: !89)
!89 = !{!90, !97, !101, !107, !114, !115, !116}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !88, file: !66, line: 226, baseType: !91, size: 128)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !66, line: 226, size: 128, elements: !92)
!92 = !{!93, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !66, line: 226, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !91, file: !66, line: 226, baseType: !94, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !66, line: 228, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_type_t", file: !66, line: 126, baseType: !67)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !88, file: !66, line: 234, baseType: !102, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !103, line: 379, baseType: !104)
!103 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "73077acfd8398d55139f48047843856b")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !105, line: 70, baseType: !106)
!105 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!106 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !88, file: !66, line: 242, baseType: !108, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !103, line: 381, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !110, line: 85, baseType: !111)
!110 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !112, line: 152, baseType: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!113 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !66, line: 244, baseType: !79, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !88, file: !66, line: 252, baseType: !76, size: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !88, file: !66, line: 254, baseType: !117, size: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_alloc_t", file: !66, line: 123, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_alloc_t", file: !66, line: 123, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_read_type_e", file: !66, line: 60, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 57, baseType: !13, size: 32, elements: !124)
!124 = !{!125, !126}
!125 = !DIEnumerator(name: "APR_BLOCK_READ", value: 0)
!126 = !DIEnumerator(name: "APR_NONBLOCK_READ", value: 1)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "setaside", scope: !67, file: !66, line: 192, baseType: !128, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!84, !86, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !133, line: 60, baseType: !134)
!133 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_pools.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "ca846d53df1698194c1a577ccf147813")
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !133, line: 60, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !67, file: !66, line: 203, baseType: !136, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!84, !86, !102}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !67, file: !66, line: 211, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!84, !86, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!144 = !{!145, !146}
!145 = !DIEnumerator(name: "APR_BUCKET_DATA", value: 0)
!146 = !DIEnumerator(name: "APR_BUCKET_METADATA", value: 1)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 62, baseType: !13, size: 32, elements: !149)
!148 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_info.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "58895203e42ced4eaee1557b60315f00")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158}
!150 = !DIEnumerator(name: "APR_NOFILE", value: 0)
!151 = !DIEnumerator(name: "APR_REG", value: 1)
!152 = !DIEnumerator(name: "APR_DIR", value: 2)
!153 = !DIEnumerator(name: "APR_CHR", value: 3)
!154 = !DIEnumerator(name: "APR_BLK", value: 4)
!155 = !DIEnumerator(name: "APR_PIPE", value: 5)
!156 = !DIEnumerator(name: "APR_LNK", value: 6)
!157 = !DIEnumerator(name: "APR_SOCK", value: 7)
!158 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
!159 = !{!79, !160, !73, !178, !179, !180, !181, !215, !207, !216, !383}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "session_dbd_dir_conf", file: !2, line: 48, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 33, size: 768, elements: !163)
!163 = !{!164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !2, line: 34, baseType: !70, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name_set", scope: !162, file: !2, line: 35, baseType: !73, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name_attrs", scope: !162, file: !2, line: 36, baseType: !70, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name2", scope: !162, file: !2, line: 37, baseType: !70, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name2_set", scope: !162, file: !2, line: 38, baseType: !73, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name2_attrs", scope: !162, file: !2, line: 39, baseType: !70, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "peruser", scope: !162, file: !2, line: 40, baseType: !73, size: 32, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "peruser_set", scope: !162, file: !2, line: 41, baseType: !73, size: 32, offset: 416)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !162, file: !2, line: 42, baseType: !73, size: 32, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "remove_set", scope: !162, file: !2, line: 43, baseType: !73, size: 32, offset: 480)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "selectlabel", scope: !162, file: !2, line: 44, baseType: !70, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "insertlabel", scope: !162, file: !2, line: 45, baseType: !70, size: 64, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "updatelabel", scope: !162, file: !2, line: 46, baseType: !70, size: 64, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "deletelabel", scope: !162, file: !2, line: 47, baseType: !70, size: 64, offset: 704)
!178 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!179 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "session_rec", file: !183, line: 98, baseType: !184)
!183 = !DIFile(filename: "./mod_session.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/session", checksumkind: CSK_MD5, checksum: "2f96d0badaf5cfa127e9fd7fcb409f35")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 84, size: 576, elements: !185)
!185 = !{!186, !187, !197, !198, !203, !204, !211, !212, !213, !214}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !184, file: !183, line: 85, baseType: !131, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !184, file: !183, line: 86, baseType: !188, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uuid_t", file: !190, line: 43, baseType: !191)
!190 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_uuid.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "02e66ef2200a85dd769e8f697000309e")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !190, line: 41, size: 128, elements: !192)
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !190, line: 42, baseType: !194, size: 128)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 128, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "remote_user", scope: !184, file: !183, line: 87, baseType: !70, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !184, file: !183, line: 88, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_table_t", file: !201, line: 56, baseType: !202)
!201 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_tables.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "82dd315cfdbab9381cd05a1d2abe34a2")
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_table_t", file: !201, line: 56, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "encoded", scope: !184, file: !183, line: 89, baseType: !70, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "expiry", scope: !184, file: !183, line: 90, baseType: !205, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !206, line: 45, baseType: !207)
!206 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_time.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "1a8b9732d4ee010f71e3eb03e6e3a16e")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !103, line: 371, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !209, line: 27, baseType: !210)
!209 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !112, line: 44, baseType: !113)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "maxage", scope: !184, file: !183, line: 91, baseType: !113, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !184, file: !183, line: 93, baseType: !73, size: 32, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !184, file: !183, line: 94, baseType: !73, size: 32, offset: 480)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !184, file: !183, line: 96, baseType: !73, size: 32, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_OFN_ap_dbd_prepare_t", file: !218, line: 116, baseType: !219)
!218 = !DIFile(filename: "database/mod_dbd.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules", checksumkind: CSK_MD5, checksum: "09cf755ea018fe3ee484fb4f061fd873")
!219 = !DISubroutineType(types: !220)
!220 = !{null, !221, !70, !70}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_rec", file: !44, line: 807, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_rec", file: !44, line: 1315, size: 1536, elements: !224)
!224 = !{!225, !237, !238, !239, !244, !251, !254, !255, !256, !257, !258, !262, !263, !264, !265, !360, !362, !363, !364, !365, !375, !376, !377, !378, !379, !380, !381, !382}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !223, file: !44, line: 1317, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "process_rec", file: !44, line: 805, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "process_rec", file: !44, line: 822, size: 320, elements: !229)
!229 = !{!230, !231, !232, !233, !236}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !228, file: !44, line: 824, baseType: !131, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pconf", scope: !228, file: !44, line: 826, baseType: !131, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !228, file: !44, line: 828, baseType: !70, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !228, file: !44, line: 830, baseType: !234, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !228, file: !44, line: 832, baseType: !73, size: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !44, line: 1319, baseType: !221, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "error_fname", scope: !223, file: !44, line: 1324, baseType: !215, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "error_log", scope: !223, file: !44, line: 1326, baseType: !240, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !242, line: 188, baseType: !243)
!242 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9f1a845f7255d07e28e3a10d24320b5d")
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !148, line: 212, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !223, file: !44, line: 1328, baseType: !245, size: 128, offset: 256)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_logconf", file: !44, line: 1305, size: 128, elements: !246)
!246 = !{!247, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "module_levels", scope: !245, file: !44, line: 1307, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !245, file: !44, line: 1310, baseType: !73, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "module_config", scope: !223, file: !44, line: 1334, baseType: !252, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_conf_vector_t", file: !44, line: 791, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_defaults", scope: !223, file: !44, line: 1336, baseType: !252, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "defn_name", scope: !223, file: !44, line: 1339, baseType: !70, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "defn_line_number", scope: !223, file: !44, line: 1341, baseType: !13, size: 32, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "is_virtual", scope: !223, file: !44, line: 1343, baseType: !4, size: 8, offset: 608)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !223, file: !44, line: 1349, baseType: !259, size: 16, offset: 624)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_port_t", file: !260, line: 230, baseType: !261)
!260 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_network_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "d28b53dbcb33f6acce926c2efb3f7365")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint16_t", file: !103, line: 331, baseType: !179)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "server_scheme", scope: !223, file: !44, line: 1351, baseType: !70, size: 64, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "server_admin", scope: !223, file: !44, line: 1356, baseType: !215, size: 64, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "server_hostname", scope: !223, file: !44, line: 1358, baseType: !215, size: 64, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !223, file: !44, line: 1363, baseType: !266, size: 64, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_addr_rec", file: !44, line: 1293, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_addr_rec", file: !44, line: 1294, size: 256, elements: !269)
!269 = !{!270, !271, !272, !359}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !44, line: 1296, baseType: !266, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "virthost", scope: !268, file: !44, line: 1298, baseType: !215, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !268, file: !44, line: 1300, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_sockaddr_t", file: !260, line: 235, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_sockaddr_t", file: !260, line: 239, size: 1536, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !283, !288, !289, !290, !291, !292}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !275, file: !260, line: 241, baseType: !131, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !275, file: !260, line: 243, baseType: !215, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "servname", scope: !275, file: !260, line: 245, baseType: !215, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !275, file: !260, line: 247, baseType: !259, size: 16, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !275, file: !260, line: 249, baseType: !282, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !103, line: 333, baseType: !73)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !275, file: !260, line: 251, baseType: !284, size: 32, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_socklen_t", file: !103, line: 382, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !286, line: 33, baseType: !287)
!286 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !112, line: 210, baseType: !13)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_len", scope: !275, file: !260, line: 253, baseType: !73, size: 32, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "addr_str_len", scope: !275, file: !260, line: 256, baseType: !73, size: 32, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_ptr", scope: !275, file: !260, line: 259, baseType: !79, size: 64, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !260, line: 262, baseType: !273, size: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !275, file: !260, line: 280, baseType: !293, size: 1024, offset: 512)
!293 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !275, file: !260, line: 264, size: 1024, elements: !294)
!294 = !{!295, !318, !341, !350}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !293, file: !260, line: 266, baseType: !296, size: 128)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !297, line: 245, size: 128, elements: !298)
!297 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!298 = !{!299, !302, !307, !314}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !296, file: !297, line: 247, baseType: !300, size: 16)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !301, line: 28, baseType: !179)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !296, file: !297, line: 248, baseType: !303, size: 16, offset: 16)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !297, line: 123, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !305, line: 25, baseType: !306)
!305 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !112, line: 40, baseType: !179)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !296, file: !297, line: 249, baseType: !308, size: 32, offset: 32)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !297, line: 31, size: 32, elements: !309)
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !308, file: !297, line: 33, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !297, line: 30, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !305, line: 26, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !112, line: 42, baseType: !13)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !296, file: !297, line: 252, baseType: !315, size: 64, offset: 64)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 64, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 8)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !293, file: !260, line: 269, baseType: !319, size: 224)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !297, line: 260, size: 224, elements: !320)
!320 = !{!321, !322, !323, !324, !340}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !319, file: !297, line: 262, baseType: !300, size: 16)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !319, file: !297, line: 263, baseType: !303, size: 16, offset: 16)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !319, file: !297, line: 264, baseType: !312, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !319, file: !297, line: 265, baseType: !325, size: 128, offset: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !297, line: 219, size: 128, elements: !326)
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !325, file: !297, line: 226, baseType: !328, size: 128)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !325, file: !297, line: 221, size: 128, elements: !329)
!329 = !{!330, !334, !336}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !328, file: !297, line: 223, baseType: !331, size: 128)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 128, elements: !195)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !305, line: 24, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !112, line: 38, baseType: !178)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !328, file: !297, line: 224, baseType: !335, size: 128)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 128, elements: !316)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !328, file: !297, line: 225, baseType: !337, size: 128)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 128, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 4)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !319, file: !297, line: 266, baseType: !312, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sas", scope: !293, file: !260, line: 274, baseType: !342, size: 1024)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !286, line: 193, size: 1024, elements: !343)
!343 = !{!344, !345, !349}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !342, file: !286, line: 195, baseType: !300, size: 16)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !342, file: !286, line: 196, baseType: !346, size: 944, offset: 16)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 944, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 118)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !342, file: !286, line: 197, baseType: !106, size: 64, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "unx", scope: !293, file: !260, line: 278, baseType: !351, size: 880)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !352, line: 29, size: 880, elements: !353)
!352 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !351, file: !352, line: 31, baseType: !300, size: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !351, file: !352, line: 32, baseType: !356, size: 864, offset: 16)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 864, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 108)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "host_port", scope: !268, file: !44, line: 1302, baseType: !259, size: 16, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !223, file: !44, line: 1365, baseType: !361, size: 64, offset: 896)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !206, line: 55, baseType: !207)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !223, file: !44, line: 1367, baseType: !361, size: 64, offset: 960)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !223, file: !44, line: 1369, baseType: !73, size: 32, offset: 1024)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !223, file: !44, line: 1371, baseType: !73, size: 32, offset: 1056)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !223, file: !44, line: 1374, baseType: !366, size: 64, offset: 1088)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_array_header_t", file: !201, line: 59, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_array_header_t", file: !201, line: 62, size: 256, elements: !369)
!369 = !{!370, !371, !372, !373, !374}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !368, file: !201, line: 64, baseType: !131, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !368, file: !201, line: 66, baseType: !73, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !368, file: !201, line: 68, baseType: !73, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !368, file: !201, line: 70, baseType: !73, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !368, file: !201, line: 72, baseType: !215, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "wild_names", scope: !223, file: !44, line: 1376, baseType: !366, size: 64, offset: 1152)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !223, file: !44, line: 1379, baseType: !70, size: 64, offset: 1216)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pathlen", scope: !223, file: !44, line: 1381, baseType: !73, size: 32, offset: 1280)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_line", scope: !223, file: !44, line: 1384, baseType: !73, size: 32, offset: 1312)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fieldsize", scope: !223, file: !44, line: 1386, baseType: !73, size: 32, offset: 1344)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fields", scope: !223, file: !44, line: 1388, baseType: !73, size: 32, offset: 1376)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !223, file: !44, line: 1391, baseType: !79, size: 64, offset: 1408)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout_set", scope: !223, file: !44, line: 1396, baseType: !13, size: 1, offset: 1472, flags: DIFlagBitField, extraData: i64 1472)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_OFN_ap_dbd_acquire_t", file: !218, line: 114, baseType: !385)
!385 = !DISubroutineType(types: !386)
!386 = !{!387, !407}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_dbd_t", file: !218, line: 81, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 76, size: 256, elements: !390)
!390 = !{!391, !396, !401, !406}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !389, file: !218, line: 77, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dbd_t", file: !394, line: 83, baseType: !395)
!394 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_dbd.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "7b373cd8c49a6d7a9dfdb789b761eade")
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_dbd_t", file: !394, line: 83, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !389, file: !218, line: 78, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dbd_driver_t", file: !394, line: 82, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_dbd_driver_t", file: !394, line: 82, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "prepared", scope: !389, file: !218, line: 79, baseType: !402, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_hash_t", file: !404, line: 52, baseType: !405)
!404 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_hash.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "200f319f929840eb1031e0c6813d7a15")
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_hash_t", file: !404, line: 52, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !389, file: !218, line: 80, baseType: !131, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_rec", file: !44, line: 811, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request_rec", file: !44, line: 838, size: 5888, elements: !410)
!410 = !{!411, !412, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !549, !550, !551, !552, !553, !554, !555, !560, !581, !618, !619, !620, !621, !622, !623, !624}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !409, file: !44, line: 840, baseType: !131, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !409, file: !44, line: 842, baseType: !413, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_rec", file: !44, line: 809, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_rec", file: !44, line: 1145, size: 1664, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !433, !434, !435, !437, !446, !447, !448, !449, !450, !451, !453, !454, !457, !458, !463, !464}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !415, file: !44, line: 1147, baseType: !131, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "base_server", scope: !415, file: !44, line: 1149, baseType: !221, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vhost_lookup_data", scope: !415, file: !44, line: 1151, baseType: !79, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !415, file: !44, line: 1155, baseType: !273, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "client_addr", scope: !415, file: !44, line: 1159, baseType: !273, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "client_ip", scope: !415, file: !44, line: 1164, baseType: !215, size: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "remote_host", scope: !415, file: !44, line: 1168, baseType: !215, size: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "remote_logname", scope: !415, file: !44, line: 1171, baseType: !215, size: 64, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !415, file: !44, line: 1174, baseType: !215, size: 64, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "local_host", scope: !415, file: !44, line: 1177, baseType: !215, size: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !415, file: !44, line: 1180, baseType: !113, size: 64, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "conn_config", scope: !415, file: !44, line: 1183, baseType: !252, size: 64, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !415, file: !44, line: 1186, baseType: !199, size: 64, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "input_filters", scope: !415, file: !44, line: 1188, baseType: !431, size: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_t", file: !44, line: 1063, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "output_filters", scope: !415, file: !44, line: 1190, baseType: !431, size: 64, offset: 896)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sbh", scope: !415, file: !44, line: 1192, baseType: !79, size: 64, offset: 960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_alloc", scope: !415, file: !44, line: 1194, baseType: !436, size: 64, offset: 1024)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !415, file: !44, line: 1196, baseType: !438, size: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_state_t", file: !44, line: 813, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_state_t", file: !44, line: 1273, size: 64, elements: !441)
!441 = !{!442, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !440, file: !44, line: 1275, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_state_e", file: !44, line: 1262, baseType: !43)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sense", scope: !440, file: !44, line: 1277, baseType: !445, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_sense_e", file: !44, line: 1268, baseType: !55)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "data_in_input_filters", scope: !415, file: !44, line: 1198, baseType: !73, size: 32, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "data_in_output_filters", scope: !415, file: !44, line: 1200, baseType: !73, size: 32, offset: 1184)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "clogging_input_filters", scope: !415, file: !44, line: 1205, baseType: !13, size: 1, offset: 1216, flags: DIFlagBitField, extraData: i64 1216)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "double_reverse", scope: !415, file: !44, line: 1209, baseType: !73, size: 2, offset: 1217, flags: DIFlagBitField, extraData: i64 1216)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", scope: !415, file: !44, line: 1212, baseType: !13, size: 32, offset: 1248)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !415, file: !44, line: 1216, baseType: !452, size: 32, offset: 1280)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_conn_keepalive_e", file: !44, line: 1140, baseType: !60)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "keepalives", scope: !415, file: !44, line: 1219, baseType: !73, size: 32, offset: 1312)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !415, file: !44, line: 1223, baseType: !455, size: 64, offset: 1344)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !415, file: !44, line: 1228, baseType: !70, size: 64, offset: 1408)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "current_thread", scope: !415, file: !44, line: 1237, baseType: !459, size: 64, offset: 1472)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_thread_t", file: !461, line: 178, baseType: !462)
!461 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_thread_proc.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "86521d0dbb7f1fbad577c4bb2abede6c")
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_t", file: !461, line: 178, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !415, file: !44, line: 1241, baseType: !413, size: 64, offset: 1536)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !415, file: !44, line: 1243, baseType: !73, size: 32, offset: 1600)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !409, file: !44, line: 844, baseType: !221, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !409, file: !44, line: 847, baseType: !407, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !409, file: !44, line: 849, baseType: !407, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !409, file: !44, line: 853, baseType: !407, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "the_request", scope: !409, file: !44, line: 859, baseType: !215, size: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "assbackwards", scope: !409, file: !44, line: 861, baseType: !73, size: 32, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "proxyreq", scope: !409, file: !44, line: 866, baseType: !73, size: 32, offset: 480)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "header_only", scope: !409, file: !44, line: 868, baseType: !73, size: 32, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "proto_num", scope: !409, file: !44, line: 870, baseType: !73, size: 32, offset: 544)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !409, file: !44, line: 872, baseType: !215, size: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !409, file: !44, line: 876, baseType: !70, size: 64, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "request_time", scope: !409, file: !44, line: 879, baseType: !205, size: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "status_line", scope: !409, file: !44, line: 882, baseType: !70, size: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !409, file: !44, line: 884, baseType: !73, size: 32, offset: 832)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "method_number", scope: !409, file: !44, line: 891, baseType: !73, size: 32, offset: 864)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !409, file: !44, line: 893, baseType: !70, size: 64, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !409, file: !44, line: 915, baseType: !207, size: 64, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_xmethods", scope: !409, file: !44, line: 917, baseType: !366, size: 64, offset: 1024)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_methods", scope: !409, file: !44, line: 919, baseType: !484, size: 64, offset: 1088)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_method_list_t", file: !44, line: 634, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_method_list_t", file: !44, line: 643, size: 128, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "method_mask", scope: !486, file: !44, line: 645, baseType: !207, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "method_list", scope: !486, file: !44, line: 647, baseType: !366, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bodyct", scope: !409, file: !44, line: 922, baseType: !108, size: 64, offset: 1152)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_sent", scope: !409, file: !44, line: 924, baseType: !108, size: 64, offset: 1216)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !409, file: !44, line: 926, baseType: !205, size: 64, offset: 1280)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !409, file: !44, line: 931, baseType: !70, size: 64, offset: 1344)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "clength", scope: !409, file: !44, line: 933, baseType: !108, size: 64, offset: 1408)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "chunked", scope: !409, file: !44, line: 935, baseType: !73, size: 32, offset: 1472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "read_body", scope: !409, file: !44, line: 940, baseType: !73, size: 32, offset: 1504)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "read_chunked", scope: !409, file: !44, line: 942, baseType: !73, size: 32, offset: 1536)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "expecting_100", scope: !409, file: !44, line: 944, baseType: !13, size: 32, offset: 1568)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "kept_body", scope: !409, file: !44, line: 946, baseType: !500, size: 64, offset: 1600)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_brigade", file: !66, line: 119, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_brigade", file: !66, line: 258, size: 256, elements: !503)
!503 = !{!504, !505, !510}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !502, file: !66, line: 264, baseType: !131, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !502, file: !66, line: 273, baseType: !506, size: 128, offset: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_list", file: !66, line: 273, size: 128, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !66, line: 273, baseType: !94, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !506, file: !66, line: 273, baseType: !94, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_alloc", scope: !502, file: !66, line: 275, baseType: !117, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "body_table", scope: !409, file: !44, line: 950, baseType: !199, size: 64, offset: 1664)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !409, file: !44, line: 952, baseType: !108, size: 64, offset: 1728)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !409, file: !44, line: 954, baseType: !108, size: 64, offset: 1792)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "headers_in", scope: !409, file: !44, line: 969, baseType: !199, size: 64, offset: 1856)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "headers_out", scope: !409, file: !44, line: 971, baseType: !199, size: 64, offset: 1920)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "err_headers_out", scope: !409, file: !44, line: 974, baseType: !199, size: 64, offset: 1984)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "subprocess_env", scope: !409, file: !44, line: 976, baseType: !199, size: 64, offset: 2048)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !409, file: !44, line: 978, baseType: !199, size: 64, offset: 2112)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !409, file: !44, line: 985, baseType: !70, size: 64, offset: 2176)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !409, file: !44, line: 987, baseType: !70, size: 64, offset: 2240)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "content_encoding", scope: !409, file: !44, line: 990, baseType: !70, size: 64, offset: 2304)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "content_languages", scope: !409, file: !44, line: 992, baseType: !366, size: 64, offset: 2368)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "vlist_validator", scope: !409, file: !44, line: 995, baseType: !215, size: 64, offset: 2432)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !409, file: !44, line: 998, baseType: !215, size: 64, offset: 2496)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ap_auth_type", scope: !409, file: !44, line: 1000, baseType: !215, size: 64, offset: 2560)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "unparsed_uri", scope: !409, file: !44, line: 1007, baseType: !215, size: 64, offset: 2624)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !409, file: !44, line: 1009, baseType: !215, size: 64, offset: 2688)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !409, file: !44, line: 1011, baseType: !215, size: 64, offset: 2752)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_filename", scope: !409, file: !44, line: 1015, baseType: !215, size: 64, offset: 2816)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "path_info", scope: !409, file: !44, line: 1017, baseType: !215, size: 64, offset: 2880)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !409, file: !44, line: 1019, baseType: !215, size: 64, offset: 2944)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "used_path_info", scope: !409, file: !44, line: 1029, baseType: !73, size: 32, offset: 3008)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "eos_sent", scope: !409, file: !44, line: 1032, baseType: !73, size: 32, offset: 3040)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "per_dir_config", scope: !409, file: !44, line: 1040, baseType: !252, size: 64, offset: 3072)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "request_config", scope: !409, file: !44, line: 1042, baseType: !252, size: 64, offset: 3136)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !409, file: !44, line: 1047, baseType: !455, size: 64, offset: 3200)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !409, file: !44, line: 1052, baseType: !70, size: 64, offset: 3264)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "htaccess", scope: !409, file: !44, line: 1060, baseType: !539, size: 64, offset: 3328)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htaccess_result", file: !44, line: 781, size: 320, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !541, file: !44, line: 783, baseType: !70, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !541, file: !44, line: 785, baseType: !73, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "override_opts", scope: !541, file: !44, line: 787, baseType: !73, size: 32, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "override_list", scope: !541, file: !44, line: 789, baseType: !199, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "htaccess", scope: !541, file: !44, line: 791, baseType: !252, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !44, line: 793, baseType: !539, size: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "output_filters", scope: !409, file: !44, line: 1063, baseType: !431, size: 64, offset: 3392)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "input_filters", scope: !409, file: !44, line: 1065, baseType: !431, size: 64, offset: 3456)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "proto_output_filters", scope: !409, file: !44, line: 1069, baseType: !431, size: 64, offset: 3520)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "proto_input_filters", scope: !409, file: !44, line: 1072, baseType: !431, size: 64, offset: 3584)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "no_cache", scope: !409, file: !44, line: 1075, baseType: !73, size: 32, offset: 3648)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "no_local_copy", scope: !409, file: !44, line: 1077, baseType: !73, size: 32, offset: 3680)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "invoke_mtx", scope: !409, file: !44, line: 1082, baseType: !556, size: 64, offset: 3712)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_thread_mutex_t", file: !558, line: 41, baseType: !559)
!558 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_thread_mutex.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "333d6b386ebd5ebf2a57c53b3ab4b684")
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !558, line: 41, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "parsed_uri", scope: !409, file: !44, line: 1085, baseType: !561, size: 704, offset: 3776)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uri_t", file: !562, line: 80, baseType: !563)
!562 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_uri.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9269047179f727bd075392a12871b578")
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_uri_t", file: !562, line: 85, size: 704, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !577, !578, !579, !580}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !563, file: !562, line: 87, baseType: !215, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hostinfo", scope: !563, file: !562, line: 89, baseType: !215, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !563, file: !562, line: 91, baseType: !215, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !563, file: !562, line: 93, baseType: !215, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !563, file: !562, line: 95, baseType: !215, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "port_str", scope: !563, file: !562, line: 97, baseType: !215, size: 64, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !563, file: !562, line: 99, baseType: !215, size: 64, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !563, file: !562, line: 101, baseType: !215, size: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !563, file: !562, line: 103, baseType: !215, size: 64, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "hostent", scope: !563, file: !562, line: 106, baseType: !575, size: 64, offset: 576)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", file: !562, line: 106, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !563, file: !562, line: 109, baseType: !259, size: 16, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !563, file: !562, line: 112, baseType: !13, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 656)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dns_looked_up", scope: !563, file: !562, line: 115, baseType: !13, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 656)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dns_resolved", scope: !563, file: !562, line: 117, baseType: !13, size: 1, offset: 658, flags: DIFlagBitField, extraData: i64 656)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "finfo", scope: !409, file: !44, line: 1087, baseType: !582, size: 960, offset: 4480)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_finfo_t", file: !148, line: 143, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !148, line: 174, size: 960, elements: !584)
!584 = !{!585, !586, !587, !589, !591, !596, !600, !604, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !583, file: !148, line: 176, baseType: !131, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !583, file: !148, line: 179, baseType: !282, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !583, file: !148, line: 181, baseType: !588, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !148, line: 125, baseType: !282)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !583, file: !148, line: 186, baseType: !590, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !148, line: 72, baseType: !147)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !583, file: !148, line: 188, baseType: !592, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !593, line: 45, baseType: !594)
!593 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_user.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "724f26fd838740b0ca4b55f59030741b")
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !110, line: 79, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !112, line: 146, baseType: !13)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !583, file: !148, line: 190, baseType: !597, size: 32, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !593, line: 54, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !110, line: 64, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !112, line: 147, baseType: !13)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !583, file: !148, line: 192, baseType: !601, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !103, line: 383, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !110, line: 47, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !112, line: 148, baseType: !106)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !583, file: !148, line: 194, baseType: !605, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !148, line: 135, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !110, line: 59, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !112, line: 145, baseType: !106)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !583, file: !148, line: 196, baseType: !282, size: 32, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !583, file: !148, line: 198, baseType: !108, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !583, file: !148, line: 200, baseType: !108, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !583, file: !148, line: 202, baseType: !205, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !583, file: !148, line: 204, baseType: !205, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !583, file: !148, line: 206, baseType: !205, size: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !583, file: !148, line: 208, baseType: !70, size: 64, offset: 768)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !583, file: !148, line: 210, baseType: !70, size: 64, offset: 832)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !583, file: !148, line: 212, baseType: !617, size: 64, offset: 896)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_addr", scope: !409, file: !44, line: 1093, baseType: !273, size: 64, offset: 5440)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_ip", scope: !409, file: !44, line: 1094, baseType: !215, size: 64, offset: 5504)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "trailers_in", scope: !409, file: !44, line: 1097, baseType: !199, size: 64, offset: 5568)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "trailers_out", scope: !409, file: !44, line: 1099, baseType: !199, size: 64, offset: 5632)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_host", scope: !409, file: !44, line: 1104, baseType: !215, size: 64, offset: 5696)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "double_reverse", scope: !409, file: !44, line: 1108, baseType: !73, size: 32, offset: 5760)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bnotes", scope: !409, file: !44, line: 1113, baseType: !625, size: 64, offset: 5824)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_request_bnotes_t", file: !44, line: 662, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint64_t", file: !103, line: 372, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !305, line: 27, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !112, line: 45, baseType: !106)
!629 = !{!0, !630, !763, !768, !770, !772, !774, !779, !784, !786, !788, !790, !795, !797, !799, !801, !806, !811, !816, !821, !826, !828, !7, !830, !835, !840, !843, !845, !847, !852, !857, !862, !867, !872, !874, !879, !881, !883, !886, !889, !894, !896, !901, !903, !908, !913, !915}
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "session_dbd_module", scope: !9, file: !2, line: 630, type: !632, isLocal: false, isDefinition: true)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "module", file: !12, line: 344, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_struct", file: !12, line: 345, size: 896, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !642, !643, !647, !651, !655, !659, !660, !758, !762}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !633, file: !12, line: 349, baseType: !73, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "minor_version", scope: !633, file: !12, line: 352, baseType: !73, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "module_index", scope: !633, file: !12, line: 354, baseType: !73, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !633, file: !12, line: 357, baseType: !70, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_load_handle", scope: !633, file: !12, line: 359, baseType: !79, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !633, file: !12, line: 364, baseType: !641, size: 64, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !633, file: !12, line: 368, baseType: !106, size: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rewrite_args", scope: !633, file: !12, line: 374, baseType: !644, size: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !226}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "create_dir_config", scope: !633, file: !12, line: 381, baseType: !648, size: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!79, !131, !215}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "merge_dir_config", scope: !633, file: !12, line: 389, baseType: !652, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!79, !131, !79, !79}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_config", scope: !633, file: !12, line: 396, baseType: !656, size: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!79, !131, !221}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "merge_server_config", scope: !633, file: !12, line: 404, baseType: !652, size: 64, offset: 640)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "cmds", scope: !633, file: !12, line: 409, baseType: !661, size: 64, offset: 704)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "command_rec", file: !12, line: 203, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "command_struct", file: !12, line: 204, size: 320, elements: !665)
!665 = !{!666, !667, !754, !755, !756, !757}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !664, file: !12, line: 206, baseType: !70, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !664, file: !12, line: 208, baseType: !668, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmd_func", file: !12, line: 101, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 82, size: 64, elements: !670)
!670 = !{!671, !731, !735, !741, !742, !746, !750}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "no_args", scope: !669, file: !12, line: 84, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!70, !675, !79}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmd_parms", file: !12, line: 74, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmd_parms_struct", file: !12, line: 288, size: 960, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !706, !722, !723, !724, !725, !726, !727, !728}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !677, file: !12, line: 290, baseType: !79, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !677, file: !12, line: 292, baseType: !73, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "override_opts", scope: !677, file: !12, line: 294, baseType: !73, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "override_list", scope: !677, file: !12, line: 296, baseType: !199, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "limited", scope: !677, file: !12, line: 298, baseType: !207, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "limited_xmethods", scope: !677, file: !12, line: 300, baseType: !366, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "xlimited", scope: !677, file: !12, line: 302, baseType: !484, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "config_file", scope: !677, file: !12, line: 305, baseType: !687, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_configfile_t", file: !12, line: 267, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_configfile_t", file: !12, line: 268, size: 384, elements: !690)
!690 = !{!691, !695, !699, !703, !704, !705}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "getch", scope: !689, file: !12, line: 270, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!84, !215, !79}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getstr", scope: !689, file: !12, line: 272, baseType: !696, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!84, !79, !102, !79}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !689, file: !12, line: 274, baseType: !700, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!84, !79}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !689, file: !12, line: 276, baseType: !79, size: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !689, file: !12, line: 278, baseType: !70, size: 64, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !689, file: !12, line: 280, baseType: !13, size: 32, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !677, file: !12, line: 307, baseType: !707, size: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_directive_t", file: !709, line: 35, baseType: !710)
!709 = !DIFile(filename: "include/util_cfgtree.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "c91452b9a51fb2ed560e306e1998c613")
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_directive_t", file: !709, line: 46, size: 576, elements: !711)
!711 = !{!712, !713, !714, !716, !717, !718, !719, !720, !721}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !710, file: !709, line: 48, baseType: !70, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !710, file: !709, line: 51, baseType: !70, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !710, file: !709, line: 53, baseType: !715, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "first_child", scope: !710, file: !709, line: 55, baseType: !715, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !710, file: !709, line: 57, baseType: !715, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !710, file: !709, line: 60, baseType: !79, size: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !710, file: !709, line: 64, baseType: !70, size: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "line_num", scope: !710, file: !709, line: 66, baseType: !73, size: 32, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !710, file: !709, line: 73, baseType: !715, size: 64, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !677, file: !12, line: 310, baseType: !131, size: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !677, file: !12, line: 313, baseType: !131, size: 64, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !677, file: !12, line: 315, baseType: !221, size: 64, offset: 640)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !677, file: !12, line: 322, baseType: !215, size: 64, offset: 704)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !677, file: !12, line: 324, baseType: !661, size: 64, offset: 768)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !677, file: !12, line: 327, baseType: !252, size: 64, offset: 832)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "err_directive", scope: !677, file: !12, line: 329, baseType: !729, size: 64, offset: 896)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "raw_args", scope: !669, file: !12, line: 86, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!70, !675, !79, !70}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "take_argv", scope: !669, file: !12, line: 89, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!70, !675, !79, !73, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "take1", scope: !669, file: !12, line: 92, baseType: !732, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "take2", scope: !669, file: !12, line: 94, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!70, !675, !79, !70, !70}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "take3", scope: !669, file: !12, line: 97, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!70, !675, !79, !70, !70, !70}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !669, file: !12, line: 100, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!70, !675, !79, !73}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_data", scope: !664, file: !12, line: 210, baseType: !79, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "req_override", scope: !664, file: !12, line: 212, baseType: !73, size: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "args_how", scope: !664, file: !12, line: 214, baseType: !11, size: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "errmsg", scope: !664, file: !12, line: 217, baseType: !70, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "register_hooks", scope: !633, file: !12, line: 417, baseType: !759, size: 64, offset: 768)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !131}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !633, file: !12, line: 420, baseType: !73, size: 32, offset: 832)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !2, line: 500, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 14)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !2, line: 501, type: !765, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !2, line: 502, type: !765, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !2, line: 503, type: !765, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 600, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 22)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 600, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 41)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !2, line: 603, type: !776, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !2, line: 603, type: !781, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !2, line: 606, type: !776, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !2, line: 606, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 47)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !2, line: 609, type: !776, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !2, line: 609, type: !792, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !2, line: 612, type: !3, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !2, line: 612, type: !803, isLocal: true, isDefinition: true)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 26)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !2, line: 614, type: !808, isLocal: true, isDefinition: true)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 23)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !2, line: 614, type: !813, isLocal: true, isDefinition: true)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 61)
