; ModuleID = 'samples/566.bc'
source_filename = "src/tsd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.atomic_u8_t = type { i8 }
%struct.rtree_ctx_s = type { [16 x %struct.rtree_ctx_cache_elm_s], [8 x %struct.rtree_ctx_cache_elm_s] }
%struct.rtree_ctx_cache_elm_s = type { i64, ptr }
%struct.tcache_s = type { i64, %struct.ticker_t, [36 x %struct.cache_bin_s], %struct.anon, %struct.anon.0, i8, %struct.cache_bin_array_descriptor_s, ptr, i32, [36 x i8], [196 x %struct.cache_bin_s] }
%struct.ticker_t = type { i32, i32 }
%struct.cache_bin_s = type { i32, i32, %struct.cache_bin_stats_s, ptr }
%struct.cache_bin_stats_s = type { i64 }
%struct.anon = type { ptr, ptr }
%struct.anon.0 = type { ptr, ptr }
%struct.cache_bin_array_descriptor_s = type { %struct.anon.1, ptr, ptr }
%struct.anon.1 = type { ptr, ptr }
%struct.witness_tsd_s = type { %struct.witness_list_t, i8 }
%struct.witness_list_t = type { ptr }
%struct.atomic_u32_t = type { i32 }
%struct.malloc_mutex_s = type { %union.anon }
%union.anon = type { %struct.anon.2 }
%struct.anon.2 = type { %struct.mutex_prof_data_t, %union.pthread_mutex_t, %struct.atomic_b_t }
%struct.mutex_prof_data_t = type { %struct.nstime_t, %struct.nstime_t, i64, i64, i32, %struct.atomic_u32_t, i64, ptr, i64 }
%struct.nstime_t = type { i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "je_tsd_tls", scope: !2, file: !3, line: 24, type: !40, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !37, globals: !633, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/tsd.c", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "76b8286fc3bcdce8e2bd23aac0176345")
!4 = !{!5, !11, !18, !26}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 9, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/jemalloc/internal/mutex.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "65e15f9ff43bcaad02e9b4e0fcbf7631")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "malloc_mutex_rank_exclusive", value: 0)
!10 = !DIEnumerator(name: "malloc_mutex_address_ordered", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 12, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "include/jemalloc/internal/extent_structs.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "0d97df4eb670615e0551e631af75b655")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "extent_state_active", value: 0)
!15 = !DIEnumerator(name: "extent_state_dirty", value: 1)
!16 = !DIEnumerator(name: "extent_state_muzzy", value: 2)
!17 = !DIEnumerator(name: "extent_state_retained", value: 3)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 8, baseType: !7, size: 32, elements: !20)
!19 = !DIFile(filename: "include/jemalloc/internal/atomic_gcc_atomic.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "08b4de137309508f556f5697e2840f8f")
!20 = !{!21, !22, !23, !24, !25}
!21 = !DIEnumerator(name: "atomic_memory_order_relaxed", value: 0)
!22 = !DIEnumerator(name: "atomic_memory_order_acquire", value: 1)
!23 = !DIEnumerator(name: "atomic_memory_order_release", value: 2)
!24 = !DIEnumerator(name: "atomic_memory_order_acq_rel", value: 3)
!25 = !DIEnumerator(name: "atomic_memory_order_seq_cst", value: 4)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 125, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "include/jemalloc/internal/tsd.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "9f081fe8da1112924f8bffbbaecc948d")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36}
!29 = !DIEnumerator(name: "tsd_state_nominal", value: 0)
!30 = !DIEnumerator(name: "tsd_state_nominal_slow", value: 1)
!31 = !DIEnumerator(name: "tsd_state_nominal_recompute", value: 2)
!32 = !DIEnumerator(name: "tsd_state_nominal_max", value: 2)
!33 = !DIEnumerator(name: "tsd_state_minimal_initialized", value: 3)
!34 = !DIEnumerator(name: "tsd_state_purgatory", value: 4)
!35 = !DIEnumerator(name: "tsd_state_reincarnated", value: 5)
!36 = !DIEnumerator(name: "tsd_state_uninitialized", value: 6)
!37 = !{!38, !39, !627, !632, !67, !257, !116}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_t", file: !41, line: 6, baseType: !42)
!41 = !DIFile(filename: "include/jemalloc/internal/tsd_types.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "d541d97bbf6e4823e1bac63f2add6f7d")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsd_s", file: !27, line: 185, size: 49728, elements: !43)
!43 = !{!44, !55, !57, !58, !63, !66, !70, !71, !72, !76, !246, !276, !603, !604, !610, !616, !617}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !42, file: !27, line: 196, baseType: !45, size: 8)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u8_t", file: !46, line: 76, baseType: !47)
!46 = !DIFile(filename: "include/jemalloc/internal/atomic.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "f4ec326d3284c13a241314e27e68ccae")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 76, size: 8, elements: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !47, file: !46, line: 76, baseType: !50, size: 8)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !51, line: 24, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !53, line: 38, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache_enabled", scope: !42, file: !27, line: 199, baseType: !56, size: 8, offset: 8)
!56 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arenas_tdata_bypass", scope: !42, file: !27, line: 199, baseType: !56, size: 8, offset: 16)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_reentrancy_level", scope: !42, file: !27, line: 199, baseType: !59, size: 8, offset: 24)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !60, line: 24, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !53, line: 37, baseType: !62)
!62 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_narenas_tdata", scope: !42, file: !27, line: 199, baseType: !64, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !51, line: 26, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !53, line: 42, baseType: !7)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_offset_state", scope: !42, file: !27, line: 199, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !51, line: 27, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !53, line: 45, baseType: !69)
!69 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_allocated", scope: !42, file: !27, line: 199, baseType: !67, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_deallocated", scope: !42, file: !27, line: 199, baseType: !67, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_bytes_until_sample", scope: !42, file: !27, line: 199, baseType: !73, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !60, line: 27, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 44, baseType: !75)
!75 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prof_tdata", scope: !42, file: !27, line: 199, baseType: !77, size: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_tdata_t", file: !79, line: 9, baseType: !80)
!79 = !DIFile(filename: "include/jemalloc/internal/prof_types.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "893bb7e5be32d3ed1d6a52ee080689bf")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_tdata_s", file: !81, line: 135, size: 9472, elements: !82)
!81 = !DIFile(filename: "include/jemalloc/internal/prof_structs.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "d36bd8a0b03505e79f5871fe1b41e8be")
!82 = !{!83, !185, !186, !187, !189, !190, !191, !196, !197, !228, !229, !230, !231, !232, !233, !234, !242}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !80, file: !81, line: 136, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_t", file: !6, line: 19, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "malloc_mutex_s", file: !6, line: 20, size: 896, elements: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, scope: !86, file: !6, line: 21, baseType: !89, size: 896)
!89 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !86, file: !6, line: 21, size: 896, elements: !90)
!90 = !{!91, !159, !183}
!91 = !DIDerivedType(tag: DW_TAG_member, scope: !89, file: !6, line: 22, baseType: !92, size: 896)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !89, file: !6, line: 22, size: 896, elements: !93)
!93 = !{!94, !122, !154}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prof_data", scope: !92, file: !6, line: 31, baseType: !95, size: 512)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_prof_data_t", file: !96, line: 106, baseType: !97)
!96 = !DIFile(filename: "include/jemalloc/internal/mutex_prof.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "4a1798f9510ae9d91f888a30d80fb7cc")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 76, size: 512, elements: !98)
!98 = !{!99, !105, !106, !107, !108, !109, !114, !115, !121}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tot_wait_time", scope: !97, file: !96, line: 82, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "nstime_t", file: !101, line: 10, baseType: !102)
!101 = !DIFile(filename: "include/jemalloc/internal/nstime.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "3b54840f5e61842f175755b038667aab")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 8, size: 64, elements: !103)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !102, file: !101, line: 9, baseType: !67, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "max_wait_time", scope: !97, file: !96, line: 84, baseType: !100, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "n_wait_times", scope: !97, file: !96, line: 86, baseType: !67, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "n_spin_acquired", scope: !97, file: !96, line: 88, baseType: !67, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "max_n_thds", scope: !97, file: !96, line: 90, baseType: !64, size: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "n_waiting_thds", scope: !97, file: !96, line: 92, baseType: !110, size: 32, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u32_t", file: !46, line: 78, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 78, size: 32, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !111, file: !46, line: 78, baseType: !64, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "n_owner_switches", scope: !97, file: !96, line: 101, baseType: !67, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prev_owner", scope: !97, file: !96, line: 103, baseType: !116, size: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsdn_t", file: !41, line: 7, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsdn_s", file: !27, line: 219, size: 49728, elements: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tsd", scope: !118, file: !27, line: 220, baseType: !40, size: 49728)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "n_lock_ops", scope: !97, file: !96, line: 105, baseType: !67, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !92, file: !6, line: 44, baseType: !123, size: 320, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !124, line: 72, baseType: !125)
!124 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!125 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !124, line: 67, size: 320, elements: !126)
!126 = !{!127, !148, !153}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !125, file: !124, line: 69, baseType: !128, size: 320)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !129, line: 22, size: 320, elements: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!130 = !{!131, !133, !134, !135, !136, !137, !139, !140}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !128, file: !129, line: 24, baseType: !132, size: 32)
!132 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !128, file: !129, line: 25, baseType: !7, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !128, file: !129, line: 26, baseType: !132, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !128, file: !129, line: 28, baseType: !7, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !128, file: !129, line: 32, baseType: !132, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !128, file: !129, line: 34, baseType: !138, size: 16, offset: 160)
!138 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !128, file: !129, line: 35, baseType: !138, size: 16, offset: 176)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !128, file: !129, line: 36, baseType: !141, size: 128, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !142, line: 55, baseType: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !142, line: 51, size: 128, elements: !144)
!144 = !{!145, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !143, file: !142, line: 53, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !143, file: !142, line: 54, baseType: !146, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !125, file: !124, line: 70, baseType: !149, size: 320)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 320, elements: !151)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!151 = !{!152}
!152 = !DISubrange(count: 40)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !125, file: !124, line: 71, baseType: !75, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !92, file: !6, line: 50, baseType: !155, size: 8, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_b_t", file: !46, line: 68, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 68, size: 8, elements: !157)
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !156, file: !46, line: 68, baseType: !56, size: 8)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "witness", scope: !89, file: !6, line: 59, baseType: !160, size: 384)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_t", file: !161, line: 74, baseType: !162)
!161 = !DIFile(filename: "include/jemalloc/internal/witness.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "fb8675f0725894e4a6abb6181efc1d0a")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_s", file: !161, line: 80, size: 384, elements: !163)
!163 = !{!164, !167, !169, !176, !177}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !161, line: 82, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !162, file: !161, line: 88, baseType: !168, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_rank_t", file: !161, line: 75, baseType: !7)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !162, file: !161, line: 95, baseType: !170, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_comp_t", file: !161, line: 77, baseType: !172)
!172 = !DISubroutineType(types: !173)
!173 = !{!132, !174, !38, !174, !38}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !162, file: !161, line: 98, baseType: !38, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !162, file: !161, line: 101, baseType: !178, size: 128, offset: 256)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !161, line: 101, size: 128, elements: !179)
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !178, file: !161, line: 101, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !178, file: !161, line: 101, baseType: !181, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lock_order", scope: !89, file: !6, line: 60, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_lock_order_t", file: !6, line: 17, baseType: !5)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "thr_uid", scope: !80, file: !81, line: 139, baseType: !67, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "thr_discrim", scope: !80, file: !81, line: 145, baseType: !67, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "thread_name", scope: !80, file: !81, line: 148, baseType: !188, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "attached", scope: !80, file: !81, line: 150, baseType: !56, size: 8, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "expired", scope: !80, file: !81, line: 151, baseType: !56, size: 8, offset: 264)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tdata_link", scope: !80, file: !81, line: 153, baseType: !192, size: 128, offset: 320)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !81, line: 153, size: 128, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "rbn_left", scope: !192, file: !81, line: 153, baseType: !77, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "rbn_right_red", scope: !192, file: !81, line: 153, baseType: !77, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tctx_uid_next", scope: !80, file: !81, line: 160, baseType: !67, size: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "bt2tctx", scope: !80, file: !81, line: 168, baseType: !198, size: 384, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_t", file: !199, line: 63, baseType: !200)
!199 = !DIFile(filename: "include/jemalloc/internal/ckh.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "764fcd222e751d77d1875da9f00741d3")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 34, size: 384, elements: !201)
!201 = !{!202, !203, !206, !207, !208, !216, !221}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prng_state", scope: !200, file: !199, line: 45, baseType: !67, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !200, file: !199, line: 48, baseType: !204, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !205, line: 70, baseType: !69)
!205 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lg_minbuckets", scope: !200, file: !199, line: 54, baseType: !7, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "lg_curbuckets", scope: !200, file: !199, line: 55, baseType: !7, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !200, file: !199, line: 58, baseType: !209, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_hash_t", file: !199, line: 24, baseType: !211)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !213, !215}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "keycomp", scope: !200, file: !199, line: 59, baseType: !217, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_keycomp_t", file: !199, line: 25, baseType: !219)
!219 = !DISubroutineType(types: !220)
!220 = !{!56, !213, !213}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !200, file: !199, line: 62, baseType: !222, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckhc_t", file: !199, line: 31, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 28, size: 128, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !224, file: !199, line: 29, baseType: !213, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !224, file: !199, line: 30, baseType: !213, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prng_state", scope: !80, file: !81, line: 171, baseType: !67, size: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "enq", scope: !80, file: !81, line: 174, baseType: !56, size: 8, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "enq_idump", scope: !80, file: !81, line: 175, baseType: !56, size: 8, offset: 968)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "enq_gdump", scope: !80, file: !81, line: 176, baseType: !56, size: 8, offset: 976)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "dumping", scope: !80, file: !81, line: 184, baseType: !56, size: 8, offset: 984)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !80, file: !81, line: 190, baseType: !56, size: 8, offset: 992)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "cnt_summed", scope: !80, file: !81, line: 193, baseType: !235, size: 256, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_cnt_t", file: !79, line: 6, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_cnt_s", file: !81, line: 32, size: 256, elements: !237)
!237 = !{!238, !239, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "curobjs", scope: !236, file: !81, line: 34, baseType: !67, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "curbytes", scope: !236, file: !81, line: 35, baseType: !67, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "accumobjs", scope: !236, file: !81, line: 36, baseType: !67, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "accumbytes", scope: !236, file: !81, line: 37, baseType: !67, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !80, file: !81, line: 196, baseType: !243, size: 8192, offset: 1280)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8192, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_rtree_ctx", scope: !42, file: !27, line: 199, baseType: !247, size: 3072, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_ctx_t", file: !248, line: 40, baseType: !249)
!248 = !DIFile(filename: "include/jemalloc/internal/rtree_tsd.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "e327e8ed7b8fd5299eed4833d6c507b8")
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_ctx_s", file: !248, line: 41, size: 3072, elements: !250)
!250 = !{!251, !272}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !249, file: !248, line: 43, baseType: !252, size: 2048)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 2048, elements: !270)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_ctx_cache_elm_t", file: !248, line: 34, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_ctx_cache_elm_s", file: !248, line: 35, size: 128, elements: !255)
!255 = !{!256, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "leafkey", scope: !254, file: !248, line: 36, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !258, line: 90, baseType: !69)
!258 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!259 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !254, file: !248, line: 37, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_leaf_elm_t", file: !248, line: 32, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_leaf_elm_s", file: !263, line: 46, size: 64, elements: !264)
!263 = !DIFile(filename: "include/jemalloc/internal/rtree.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "82bfd1f58142b0639c309a4aeac9c506")
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "le_bits", scope: !262, file: !263, line: 60, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_p_t", file: !46, line: 62, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 62, size: 64, elements: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !267, file: !46, line: 62, baseType: !38, size: 64)
!270 = !{!271}
!271 = !DISubrange(count: 16)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "l2_cache", scope: !249, file: !248, line: 45, baseType: !273, size: 1024, offset: 2048)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 1024, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_iarena", scope: !42, file: !27, line: 199, baseType: !277, size: 64, offset: 3456)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_t", file: !279, line: 18, baseType: !280)
!279 = !DIFile(filename: "include/jemalloc/internal/arena_types.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "018de9af3ebfea99a17e9e8d011c0262")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_s", file: !281, line: 77, size: 235968, elements: !282)
!281 = !DIFile(filename: "include/jemalloc/internal/arena_structs_b.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "3e62069c856b92d645a4c13996ca2396")
!282 = !{!283, !291, !292, !293, !348, !418, !422, !423, !428, !429, !430, !431, !432, !477, !478, !503, !504, !505, !529, !530, !532, !533, !534, !539, !540, !541, !572, !602}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !280, file: !281, line: 91, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 64, elements: !289)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u_t", file: !46, line: 70, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 70, size: 32, elements: !287)
!287 = !{!288}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !286, file: !46, line: 70, baseType: !7, size: 32)
!289 = !{!290}
!290 = !DISubrange(count: 2)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "binshard_next", scope: !280, file: !281, line: 94, baseType: !285, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "last_thd", scope: !280, file: !281, line: 101, baseType: !116, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !280, file: !281, line: 104, baseType: !294, size: 81280, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_t", file: !295, line: 81, baseType: !296)
!295 = !DIFile(filename: "include/jemalloc/internal/arena_stats.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "797d71161d3430446f16b1c8dd4487de")
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_s", file: !295, line: 82, size: 81280, elements: !297)
!297 = !{!298, !303, !304, !305, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !334, !347}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !296, file: !295, line: 88, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zu_t", file: !46, line: 72, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 72, size: 64, elements: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !300, file: !46, line: 72, baseType: !204, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "retained", scope: !296, file: !295, line: 95, baseType: !299, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail", scope: !296, file: !295, line: 98, baseType: !299, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "decay_dirty", scope: !296, file: !295, line: 100, baseType: !306, size: 192, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_decay_t", file: !295, line: 50, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_decay_s", file: !295, line: 51, size: 192, elements: !308)
!308 = !{!309, !315, !316}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "npurge", scope: !307, file: !295, line: 53, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_u64_t", file: !295, line: 17, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u64_t", file: !46, line: 81, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 81, size: 64, elements: !313)
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !312, file: !46, line: 81, baseType: !67, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "nmadvise", scope: !307, file: !295, line: 55, baseType: !310, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !307, file: !295, line: 57, baseType: !310, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "decay_muzzy", scope: !296, file: !295, line: 101, baseType: !306, size: 192, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !296, file: !295, line: 103, baseType: !299, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !296, file: !295, line: 104, baseType: !299, size: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !296, file: !295, line: 105, baseType: !299, size: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_thp", scope: !296, file: !295, line: 106, baseType: !299, size: 64, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_large", scope: !296, file: !295, line: 108, baseType: !299, size: 64, offset: 832)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc_large", scope: !296, file: !295, line: 109, baseType: !310, size: 64, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc_large", scope: !296, file: !295, line: 110, baseType: !310, size: 64, offset: 960)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "nfills_large", scope: !296, file: !295, line: 111, baseType: !310, size: 64, offset: 1024)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes_large", scope: !296, file: !295, line: 112, baseType: !310, size: 64, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests_large", scope: !296, file: !295, line: 113, baseType: !310, size: 64, offset: 1152)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "abandoned_vm", scope: !296, file: !295, line: 116, baseType: !299, size: 64, offset: 1216)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_bytes", scope: !296, file: !295, line: 119, baseType: !299, size: 64, offset: 1280)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_prof_data", scope: !296, file: !295, line: 121, baseType: !331, size: 4608, offset: 1344)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 4608, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 9)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "lstats", scope: !296, file: !295, line: 124, baseType: !335, size: 75264, offset: 5952)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 75264, elements: !345)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_large_t", file: !295, line: 23, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_large_s", file: !295, line: 24, size: 384, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc", scope: !337, file: !295, line: 29, baseType: !310, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc", scope: !337, file: !295, line: 30, baseType: !310, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !337, file: !295, line: 37, baseType: !310, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "nfills", scope: !337, file: !295, line: 43, baseType: !310, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes", scope: !337, file: !295, line: 44, baseType: !310, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "curlextents", scope: !337, file: !295, line: 47, baseType: !204, size: 64, offset: 320)
!345 = !{!346}
!346 = !DISubrange(count: 196)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "uptime", scope: !296, file: !295, line: 127, baseType: !100, size: 64, offset: 81216)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_ql", scope: !280, file: !281, line: 113, baseType: !349, size: 64, offset: 81472)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !280, file: !281, line: 113, size: 64, elements: !350)
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !349, file: !281, line: 113, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcache_t", file: !354, line: 6, baseType: !355)
!354 = !DIFile(filename: "include/jemalloc/internal/tcache_types.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "9b2852fa8ffe77d9fa097e3d9e569fb0")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcache_s", file: !356, line: 13, size: 45632, elements: !357)
!356 = !DIFile(filename: "include/jemalloc/internal/tcache_structs.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "639b312cb1f4b9dc92d248ca33e2878d")
!357 = !{!358, !359, !368, !386, !391, !396, !397, !410, !411, !414, !416}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prof_accumbytes", scope: !355, file: !356, line: 20, baseType: !67, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gc_ticker", scope: !355, file: !356, line: 22, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ticker_t", file: !361, line: 17, baseType: !362)
!361 = !DIFile(filename: "include/jemalloc/internal/ticker.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "09d45aef42bd3e97af1455c4c839bc49")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 14, size: 64, elements: !363)
!363 = !{!364, !367}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tick", scope: !362, file: !361, line: 15, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !60, line: 26, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !53, line: 41, baseType: !132)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "nticks", scope: !362, file: !361, line: 16, baseType: !365, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bins_small", scope: !355, file: !356, line: 28, baseType: !369, size: 6912, offset: 128)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 6912, elements: !384)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_t", file: !371, line: 43, baseType: !372)
!371 = !DIFile(filename: "include/jemalloc/internal/cache_bin.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "9d448b7baf024f90644dd6d3180d79e7")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_s", file: !371, line: 44, size: 192, elements: !373)
!373 = !{!374, !376, !377, !382}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "low_water", scope: !372, file: !371, line: 46, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_sz_t", file: !371, line: 22, baseType: !365)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ncached", scope: !372, file: !371, line: 48, baseType: !375, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tstats", scope: !372, file: !371, line: 54, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_stats_t", file: !371, line: 24, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_stats_s", file: !371, line: 25, size: 64, elements: !380)
!380 = !{!381}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !379, file: !371, line: 30, baseType: !67, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !372, file: !371, line: 64, baseType: !383, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!384 = !{!385}
!385 = !DISubrange(count: 36)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !355, file: !356, line: 35, baseType: !387, size: 128, offset: 7040)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !356, line: 35, size: 128, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !387, file: !356, line: 35, baseType: !352, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !387, file: !356, line: 35, baseType: !352, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tsd_link", scope: !355, file: !356, line: 38, baseType: !392, size: 128, offset: 7168)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !356, line: 38, size: 128, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !392, file: !356, line: 38, baseType: !39, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !392, file: !356, line: 38, baseType: !39, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "in_hook", scope: !355, file: !356, line: 39, baseType: !56, size: 8, offset: 7296)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor", scope: !355, file: !356, line: 46, baseType: !398, size: 256, offset: 7360)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_array_descriptor_t", file: !371, line: 67, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_array_descriptor_s", file: !371, line: 68, size: 256, elements: !400)
!400 = !{!401, !407, !409}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !399, file: !371, line: 73, baseType: !402, size: 128)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !399, file: !371, line: 73, size: 128, elements: !403)
!403 = !{!404, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !402, file: !371, line: 73, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !402, file: !371, line: 73, baseType: !405, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "bins_small", scope: !399, file: !371, line: 75, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "bins_large", scope: !399, file: !371, line: 76, baseType: !408, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !355, file: !356, line: 49, baseType: !277, size: 64, offset: 7616)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "next_gc_bin", scope: !355, file: !356, line: 51, baseType: !412, size: 32, offset: 7680)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "szind_t", file: !413, line: 10, baseType: !7)
!413 = !DIFile(filename: "include/jemalloc/internal/jemalloc_internal_types.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "9fabb1c7fca697e7a645839e73a4d9d5")
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lg_fill_div", scope: !355, file: !356, line: 53, baseType: !415, size: 288, offset: 7712)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 288, elements: !384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bins_large", scope: !355, file: !356, line: 59, baseType: !417, size: 37632, offset: 8000)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 37632, elements: !345)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor_ql", scope: !280, file: !281, line: 114, baseType: !419, size: 64, offset: 81536)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !280, file: !281, line: 114, size: 64, elements: !420)
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !419, file: !281, line: 114, baseType: !405, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_ql_mtx", scope: !280, file: !281, line: 115, baseType: !85, size: 896, offset: 81600)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prof_accum", scope: !280, file: !281, line: 118, baseType: !424, size: 64, offset: 82496)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_accum_t", file: !79, line: 5, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_accum_s", file: !81, line: 23, size: 64, elements: !426)
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "accumbytes", scope: !425, file: !81, line: 28, baseType: !311, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "offset_state", scope: !280, file: !281, line: 126, baseType: !299, size: 64, offset: 82560)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "extent_sn_next", scope: !280, file: !281, line: 133, baseType: !299, size: 64, offset: 82624)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dss_prec", scope: !280, file: !281, line: 140, baseType: !285, size: 32, offset: 82688)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !280, file: !281, line: 147, baseType: !299, size: 64, offset: 82752)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !280, file: !281, line: 154, baseType: !433, size: 64, offset: 82816)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_list_t", file: !12, line: 184, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 184, size: 64, elements: !435)
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !434, file: !12, line: 184, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_t", file: !439, line: 4, baseType: !440)
!439 = !DIFile(filename: "include/jemalloc/internal/extent_types.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "feed1f2f8b22932a2312223b59645f74")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_s", file: !12, line: 20, size: 1024, elements: !441)
!441 = !{!442, !443, !444, !449, !454, !460}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "e_bits", scope: !440, file: !12, line: 92, baseType: !67, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "e_addr", scope: !440, file: !12, line: 139, baseType: !38, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, scope: !440, file: !12, line: 141, baseType: !445, size: 64, offset: 128)
!445 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !12, line: 141, size: 64, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "e_size_esn", scope: !445, file: !12, line: 149, baseType: !204, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "e_bsize", scope: !445, file: !12, line: 153, baseType: !204, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link", scope: !440, file: !12, line: 163, baseType: !450, size: 128, offset: 192)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !12, line: 163, size: 128, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !450, file: !12, line: 163, baseType: !437, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !450, file: !12, line: 163, baseType: !437, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ph_link", scope: !440, file: !12, line: 169, baseType: !455, size: 192, offset: 320)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !12, line: 169, size: 192, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "phn_prev", scope: !455, file: !12, line: 169, baseType: !437, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "phn_next", scope: !455, file: !12, line: 169, baseType: !437, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "phn_lchild", scope: !455, file: !12, line: 169, baseType: !437, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, scope: !440, file: !12, line: 171, baseType: !461, size: 512, offset: 512)
!461 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !12, line: 171, size: 512, elements: !462)
!462 = !{!463, !472}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "e_slab_data", scope: !461, file: !12, line: 173, baseType: !464, size: 512)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_slab_data_t", file: !279, line: 16, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_slab_data_s", file: !466, line: 6, size: 512, elements: !467)
!466 = !DIFile(filename: "include/jemalloc/internal/arena_structs_a.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "7b5b961b3d2ed5fcaf6c26f10c066bf6")
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !465, file: !466, line: 8, baseType: !469, size: 512)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 512, elements: !274)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_t", file: !471, line: 8, baseType: !69)
!471 = !DIFile(filename: "include/jemalloc/internal/bitmap.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "58e1c4ef6d1ba9c779b287089e4d138b")
!472 = !DIDerivedType(tag: DW_TAG_member, scope: !461, file: !12, line: 176, baseType: !473, size: 128)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !461, file: !12, line: 176, size: 128, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "e_alloc_time", scope: !473, file: !12, line: 178, baseType: !100, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_tctx", scope: !473, file: !12, line: 180, baseType: !266, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "large_mtx", scope: !280, file: !281, line: 156, baseType: !85, size: 896, offset: 82880)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "extents_dirty", scope: !280, file: !281, line: 164, baseType: !479, size: 39744, offset: 83776)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "extents_t", file: !439, line: 5, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extents_s", file: !12, line: 189, size: 39744, elements: !481)
!481 = !{!482, !483, !491, !493, !494, !498, !499, !500, !502}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !480, file: !12, line: 190, baseType: !85, size: 896)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "heaps", scope: !480, file: !12, line: 197, baseType: !484, size: 12800, offset: 896)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 12800, elements: !489)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_heap_t", file: !12, line: 186, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 186, size: 64, elements: !487)
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ph_root", scope: !486, file: !12, line: 186, baseType: !437, size: 64)
!489 = !{!490}
!490 = !DISubrange(count: 200)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nextents", scope: !480, file: !12, line: 198, baseType: !492, size: 12800, offset: 13696)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 12800, elements: !489)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !480, file: !12, line: 199, baseType: !492, size: 12800, offset: 26496)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !480, file: !12, line: 206, baseType: !495, size: 256, offset: 39296)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 256, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 4)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !480, file: !12, line: 213, baseType: !433, size: 64, offset: 39552)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "npages", scope: !480, file: !12, line: 223, baseType: !299, size: 64, offset: 39616)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !480, file: !12, line: 226, baseType: !501, size: 32, offset: 39680)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_state_t", file: !12, line: 17, baseType: !11)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "delay_coalesce", scope: !480, file: !12, line: 232, baseType: !56, size: 8, offset: 39712)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "extents_muzzy", scope: !280, file: !281, line: 165, baseType: !479, size: 39744, offset: 123520)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "extents_retained", scope: !280, file: !281, line: 166, baseType: !479, size: 39744, offset: 163264)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "decay_dirty", scope: !280, file: !281, line: 174, baseType: !506, size: 14272, offset: 203008)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_decay_t", file: !279, line: 17, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_decay_s", file: !281, line: 17, size: 14272, elements: !508)
!508 = !{!509, !510, !511, !519, !520, !521, !522, !523, !524, !526, !528}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !507, file: !281, line: 19, baseType: !85, size: 896)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "purging", scope: !507, file: !281, line: 24, baseType: !56, size: 8, offset: 896)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "time_ms", scope: !507, file: !281, line: 30, baseType: !512, size: 64, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zd_t", file: !46, line: 74, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 74, size: 64, elements: !514)
!514 = !{!515}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !513, file: !46, line: 74, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !517, line: 108, baseType: !518)
!517 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !53, line: 194, baseType: !75)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !507, file: !281, line: 32, baseType: !100, size: 64, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !507, file: !281, line: 40, baseType: !100, size: 64, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "jitter_state", scope: !507, file: !281, line: 42, baseType: !67, size: 64, offset: 1152)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !507, file: !281, line: 50, baseType: !100, size: 64, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nunpurged", scope: !507, file: !281, line: 57, baseType: !204, size: 64, offset: 1280)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !507, file: !281, line: 64, baseType: !525, size: 12800, offset: 1344)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 12800, elements: !489)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !507, file: !281, line: 72, baseType: !527, size: 64, offset: 14144)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ceil_npages", scope: !507, file: !281, line: 74, baseType: !67, size: 64, offset: 14208)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "decay_muzzy", scope: !280, file: !281, line: 175, baseType: !506, size: 14272, offset: 217280)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "extent_grow_next", scope: !280, file: !281, line: 190, baseType: !531, size: 32, offset: 231552)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "pszind_t", file: !413, line: 7, baseType: !7)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "retain_grow_limit", scope: !280, file: !281, line: 191, baseType: !531, size: 32, offset: 231584)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "extent_grow_mtx", scope: !280, file: !281, line: 192, baseType: !85, size: 896, offset: 231616)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail", scope: !280, file: !281, line: 200, baseType: !535, size: 64, offset: 232512)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_tree_t", file: !12, line: 185, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 185, size: 64, elements: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ph_root", scope: !536, file: !12, line: 185, baseType: !437, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail_cnt", scope: !280, file: !281, line: 201, baseType: !299, size: 64, offset: 232576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail_mtx", scope: !280, file: !281, line: 202, baseType: !85, size: 896, offset: 232640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !280, file: !281, line: 209, baseType: !542, size: 2304, offset: 233536)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 2304, elements: !384)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "bins_t", file: !544, line: 86, baseType: !545)
!544 = !DIFile(filename: "include/jemalloc/internal/bin.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "498400e4bc130e370fcaa245db662b71")
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bins_s", file: !544, line: 87, size: 64, elements: !546)
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bin_shards", scope: !545, file: !544, line: 89, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_t", file: !544, line: 58, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_s", file: !544, line: 59, size: 2240, elements: !551)
!551 = !{!552, !553, !554, !555, !556}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !550, file: !544, line: 61, baseType: !85, size: 896)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "slabcur", scope: !550, file: !544, line: 69, baseType: !437, size: 64, offset: 896)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_nonfull", scope: !550, file: !544, line: 76, baseType: !485, size: 64, offset: 960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_full", scope: !550, file: !544, line: 79, baseType: !433, size: 64, offset: 1024)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !550, file: !544, line: 82, baseType: !557, size: 1152, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_stats_t", file: !558, line: 6, baseType: !559)
!558 = !DIFile(filename: "include/jemalloc/internal/bin_stats.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "4968efeedc9165ec9a1d6102ebef1b3c")
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_stats_s", file: !558, line: 7, size: 1152, elements: !560)
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc", scope: !559, file: !558, line: 14, baseType: !67, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc", scope: !559, file: !558, line: 15, baseType: !67, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !559, file: !558, line: 22, baseType: !67, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "curregs", scope: !559, file: !558, line: 28, baseType: !204, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nfills", scope: !559, file: !558, line: 31, baseType: !67, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes", scope: !559, file: !558, line: 34, baseType: !67, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "nslabs", scope: !559, file: !558, line: 37, baseType: !67, size: 64, offset: 384)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "reslabs", scope: !559, file: !558, line: 43, baseType: !67, size: 64, offset: 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "curslabs", scope: !559, file: !558, line: 46, baseType: !204, size: 64, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nonfull_slabs", scope: !559, file: !558, line: 49, baseType: !204, size: 64, offset: 576)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_data", scope: !559, file: !558, line: 51, baseType: !95, size: 512, offset: 640)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !280, file: !281, line: 216, baseType: !573, size: 64, offset: 235840)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "base_t", file: !575, line: 5, baseType: !576)
!575 = !DIFile(filename: "include/jemalloc/internal/base_types.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "7f7034d6fa75fa649e18edc6668e90f4")
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_s", file: !577, line: 20, size: 16384, elements: !578)
!577 = !DIFile(filename: "include/jemalloc/internal/base_structs.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "09a1b28a52381e40c3b31ef32e09760d")
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !594, !598, !599, !600, !601}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !576, file: !577, line: 22, baseType: !7, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "extent_hooks", scope: !576, file: !577, line: 28, baseType: !266, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_use_hooks", scope: !576, file: !577, line: 33, baseType: !56, size: 8, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !576, file: !577, line: 36, baseType: !85, size: 896, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "auto_thp_switched", scope: !576, file: !577, line: 39, baseType: !56, size: 8, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pind_last", scope: !576, file: !577, line: 45, baseType: !531, size: 32, offset: 1120)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "extent_sn_next", scope: !576, file: !577, line: 48, baseType: !204, size: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !576, file: !577, line: 51, baseType: !587, size: 64, offset: 1216)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "base_block_t", file: !575, line: 4, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_block_s", file: !577, line: 9, size: 1152, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !589, file: !577, line: 11, baseType: !204, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !589, file: !577, line: 14, baseType: !587, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !589, file: !577, line: 17, baseType: !438, size: 1024, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !576, file: !577, line: 54, baseType: !595, size: 14848, offset: 1280)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 14848, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 232)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !576, file: !577, line: 57, baseType: !204, size: 64, offset: 16128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !576, file: !577, line: 58, baseType: !204, size: 64, offset: 16192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !576, file: !577, line: 59, baseType: !204, size: 64, offset: 16256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "n_thp", scope: !576, file: !577, line: 61, baseType: !204, size: 64, offset: 16320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "create_time", scope: !280, file: !281, line: 218, baseType: !100, size: 64, offset: 235904)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arena", scope: !42, file: !27, line: 199, baseType: !277, size: 64, offset: 3520)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arenas_tdata", scope: !42, file: !27, line: 199, baseType: !605, size: 64, offset: 3584)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_tdata_t", file: !279, line: 19, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_tdata_s", file: !281, line: 222, size: 64, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "decay_ticker", scope: !607, file: !281, line: 223, baseType: !360, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_binshards", scope: !42, file: !27, line: 199, baseType: !611, size: 288, offset: 3648)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_binshards_t", file: !612, line: 12, baseType: !613)
!612 = !DIFile(filename: "include/jemalloc/internal/bin_types.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "900f45601acc6d8c9838905f3ff9fe5c")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsd_binshards_s", file: !612, line: 13, size: 288, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "binshard", scope: !613, file: !612, line: 14, baseType: !415, size: 288)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache", scope: !42, file: !27, line: 199, baseType: !353, size: 45632, offset: 3968)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_witness_tsd", scope: !42, file: !27, line: 199, baseType: !618, size: 128, offset: 49600)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_tsd_t", file: !161, line: 107, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_tsd_s", file: !161, line: 108, size: 128, elements: !620)
!620 = !{!621, !626}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "witnesses", scope: !619, file: !161, line: 109, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_list_t", file: !161, line: 76, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 76, size: 64, elements: !624)
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !623, file: !161, line: 76, baseType: !181, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "forking", scope: !619, file: !161, line: 110, baseType: !56, size: 8, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_tsdn_t", file: !161, line: 119, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_tsdn_s", file: !161, line: 120, size: 128, elements: !630)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "witness_tsd", scope: !629, file: !161, line: 121, baseType: !618, size: 128)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!633 = !{!0, !634, !636, !641, !643, !650, !653, !655, !657, !663}
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "je_tsd_booted", scope: !2, file: !3, line: 26, type: !56, isLocal: false, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !3, line: 422, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 176, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 22)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "ncleanups", scope: !2, file: !3, line: 12, type: !7, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "cleanups", scope: !2, file: !3, line: 13, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 128, elements: !289)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_tsd_cleanup_t", file: !41, line: 8, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!56}
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "je_tsd_tsd", scope: !2, file: !3, line: 25, type: !652, isLocal: false, isDefinition: true)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !124, line: 49, baseType: !7)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "tsd_nominal_tsds_lock", scope: !2, file: !3, line: 63, type: !85, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "tsd_global_slow_count", scope: !2, file: !3, line: 66, type: !110, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !659, line: 55, type: !660, isLocal: true, isDefinition: true)
!659 = !DIFile(filename: "include/jemalloc/internal/tsd_tls.h", directory: "/local-ssd/memkind-fjqz6bdcywckzienbodqhysscvwe3njh-build/aidengro/spack-stage-memkind-1.13.0-fjqz6bdcywckzienbodqhysscvwe3njh/spack-src/jemalloc", checksumkind: CSK_MD5, checksum: "7b94df309a69d75a52041880bc8b71c7")
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 32)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "tsd_nominal_tsds", scope: !2, file: !3, line: 62, type: !665, isLocal: true, isDefinition: true)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_list_t", file: !3, line: 61, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 61, size: 64, elements: !667)
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !666, file: !3, line: 61, baseType: !39, size: 64)
!669 = !{i32 7, !"Dwarf Version", i32 5}
!670 = !{i32 2, !"Debug Info Version", i32 3}
!671 = !{i32 1, !"wchar_size", i32 4}
!672 = !{i32 8, !"PIC Level", i32 2}
