; ModuleID = 'samples/577.bc'
source_filename = "bdev_aio_rpc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.spdk_json_object_decoder = type { ptr, i64, ptr, i8 }
%struct.rpc_construct_aio_ctx = type { %struct.rpc_construct_aio, ptr }
%struct.rpc_construct_aio = type { ptr, ptr, i32, i8 }
%struct.rpc_rescan_aio = type { ptr }
%struct.rpc_delete_aio = type { ptr }

@.str = private unnamed_addr constant [16 x i8] c"bdev_aio_create\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [16 x i8] c"bdev_aio_rescan\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [16 x i8] c"bdev_aio_delete\00", align 1, !dbg !9
@rpc_construct_aio_decoders = internal constant [4 x %struct.spdk_json_object_decoder] [%struct.spdk_json_object_decoder { ptr @.str.6, i64 0, ptr @spdk_json_decode_string, i8 0 }, %struct.spdk_json_object_decoder { ptr @.str.7, i64 8, ptr @spdk_json_decode_string, i8 0 }, %struct.spdk_json_object_decoder { ptr @.str.8, i64 16, ptr @spdk_json_decode_uint32, i8 1 }, %struct.spdk_json_object_decoder { ptr @.str.9, i64 20, ptr @spdk_json_decode_bool, i8 1 }], align 16, !dbg !11
@.str.3 = private unnamed_addr constant [15 x i8] c"bdev_aio_rpc.c\00", align 1, !dbg !43
@__func__.rpc_bdev_aio_create = private unnamed_addr constant [20 x i8] c"rpc_bdev_aio_create\00", align 1, !dbg !48

!10 = distinct !DIGlobalVariable(scope: null, file: !2, line: 168, type: !3, isLocal: true, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "rpc_construct_aio_decoders", scope: !13, file: !2, line: 32, type: !115, isLocal: true, isDefinition: true)
!13 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !14, retainedTypes: !40, globals: !42, splitDebugInlining: false, nameTableKind: None)
!14 = !{!15, !30}
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "spdk_json_val_type", file: !16, line: 20, baseType: !17, size: 32, elements: !18)
!16 = !DIFile(filename: "include/spdk/json.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "2503f979e3d49afab298cb349bb94ec6")
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!19 = !DIEnumerator(name: "SPDK_JSON_VAL_INVALID", value: 0)
!20 = !DIEnumerator(name: "SPDK_JSON_VAL_NULL", value: 2)
!21 = !DIEnumerator(name: "SPDK_JSON_VAL_TRUE", value: 4)
!22 = !DIEnumerator(name: "SPDK_JSON_VAL_FALSE", value: 8)
!23 = !DIEnumerator(name: "SPDK_JSON_VAL_NUMBER", value: 16)
!24 = !DIEnumerator(name: "SPDK_JSON_VAL_STRING", value: 32)
!25 = !DIEnumerator(name: "SPDK_JSON_VAL_ARRAY_BEGIN", value: 64)
!26 = !DIEnumerator(name: "SPDK_JSON_VAL_ARRAY_END", value: 128)
!27 = !DIEnumerator(name: "SPDK_JSON_VAL_OBJECT_BEGIN", value: 256)
!28 = !DIEnumerator(name: "SPDK_JSON_VAL_OBJECT_END", value: 512)
!29 = !DIEnumerator(name: "SPDK_JSON_VAL_NAME", value: 1024)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "spdk_log_level", file: !31, line: 52, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "include/spdk/log.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "dc79cb206a5da324f77777fd137cb5d7")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39}
!34 = !DIEnumerator(name: "SPDK_LOG_DISABLED", value: -1)
!35 = !DIEnumerator(name: "SPDK_LOG_ERROR", value: 0)
!36 = !DIEnumerator(name: "SPDK_LOG_WARN", value: 1)
!37 = !DIEnumerator(name: "SPDK_LOG_NOTICE", value: 2)
!38 = !DIEnumerator(name: "SPDK_LOG_INFO", value: 3)
!39 = !DIEnumerator(name: "SPDK_LOG_DEBUG", value: 4)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !{!0, !7, !9, !43, !48, !54, !59, !64, !69, !74, !79, !11, !81, !113}
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !45, isLocal: true, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 15)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 160, elements: !52)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!52 = !{!53}
!53 = !DISubrange(count: 20)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 32)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 31)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !2, line: 33, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 5)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !2, line: 34, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 9)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(scope: null, file: !2, line: 35, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 11)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(scope: null, file: !2, line: 36, type: !71, isLocal: true, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "rpc_rescan_aio_decoders", scope: !13, file: !2, line: 91, type: !83, isLocal: true, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !111)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_json_object_decoder", file: !16, line: 113, size: 256, elements: !86)
!86 = !{!87, !89, !93, !109}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !16, line: 114, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !85, file: !16, line: 115, baseType: !90, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 29, baseType: !92)
!91 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!92 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "decode_func", scope: !85, file: !16, line: 116, baseType: !94, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "spdk_json_decode_fn", file: !16, line: 111, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!32, !98, !41}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_json_val", file: !16, line: 35, size: 128, elements: !101)
!101 = !{!102, !103, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !100, file: !16, line: 48, baseType: !41, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !100, file: !16, line: 61, baseType: !104, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !105, line: 26, baseType: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !107, line: 42, baseType: !17)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !16, line: 66, baseType: !15, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "optional", scope: !85, file: !16, line: 117, baseType: !110, size: 8, offset: 192)
!110 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "rpc_delete_aio_decoders", scope: !13, file: !2, line: 133, type: !83, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1024, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 4)
!118 = !{i32 7, !"Dwarf Version", i32 5}
!119 = !{i32 2, !"Debug Info Version", i32 3}
!120 = !{i32 1, !"wchar_size", i32 4}
!121 = !{i32 8, !"PIC Level", i32 2}
!122 = !{i32 7, !"uwtable", i32 2}
!123 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!124 = distinct !DISubprogram(name: "rpc_register_rpc_bdev_aio_create", scope: !2, file: !2, line: 85, type: !125, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !13)
!125 = !DISubroutineType(types: !126)
!126 = !{null}
!127 = !DILocation(line: 85, column: 1, scope: !124)
!128 = !DISubprogram(name: "spdk_rpc_register_method", scope: !129, file: !129, line: 66, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!129 = !DIFile(filename: "include/spdk/rpc.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "996ad9f563b11a2de47affd15df9627e")
!130 = !DISubroutineType(types: !131)
!131 = !{null, !88, !132, !104}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "spdk_rpc_method_handler", file: !129, line: 55, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !136, !98}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_jsonrpc_request", file: !138, line: 37, flags: DIFlagFwdDecl)
!138 = !DIFile(filename: "include/spdk/jsonrpc.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "5a54d4a87114baf9099c14c49e743e36")
!139 = distinct !DISubprogram(name: "rpc_bdev_aio_create", scope: !2, file: !2, line: 53, type: !134, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !13, retainedNodes: !140)
!140 = !{!141, !142, !143, !156}
!141 = !DILocalVariable(name: "request", arg: 1, scope: !139, file: !2, line: 53, type: !136)
!142 = !DILocalVariable(name: "params", arg: 2, scope: !139, file: !2, line: 54, type: !98)
!143 = !DILocalVariable(name: "ctx", scope: !139, file: !2, line: 56, type: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpc_construct_aio_ctx", file: !2, line: 19, size: 256, elements: !146)
!146 = !{!147, !155}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !145, file: !2, line: 20, baseType: !148, size: 192)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpc_construct_aio", file: !2, line: 12, size: 192, elements: !149)
!149 = !{!150, !152, !153, !154}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !2, line: 13, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !148, file: !2, line: 14, baseType: !151, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !148, file: !2, line: 15, baseType: !104, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !148, file: !2, line: 16, baseType: !110, size: 8, offset: 160)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !145, file: !2, line: 21, baseType: !136, size: 64, offset: 192)
!156 = !DILocalVariable(name: "rc", scope: !139, file: !2, line: 57, type: !32)
!157 = !DILocation(line: 53, column: 50, scope: !139)
!158 = !DILocation(line: 54, column: 35, scope: !139)
!159 = !DILocation(line: 56, column: 2, scope: !139)
!160 = !DILocation(line: 56, column: 32, scope: !139)
!161 = !DILocation(line: 57, column: 2, scope: !139)
!162 = !DILocation(line: 57, column: 6, scope: !139)
!163 = !DILocation(line: 59, column: 8, scope: !139)
!164 = !DILocation(line: 59, column: 6, scope: !139)
!165 = !DILocation(line: 60, column: 7, scope: !166)
!166 = distinct !DILexicalBlock(scope: !139, file: !2, line: 60, column: 6)
!167 = !DILocation(line: 60, column: 6, scope: !139)
!168 = !DILocation(line: 61, column: 36, scope: !169)
!169 = distinct !DILexicalBlock(scope: !166, file: !2, line: 60, column: 12)
!170 = !DILocation(line: 61, column: 54, scope: !169)
!171 = !DILocation(line: 61, column: 3, scope: !169)
!172 = !DILocation(line: 62, column: 3, scope: !169)
!173 = !DILocation(line: 65, column: 30, scope: !174)
!174 = distinct !DILexicalBlock(scope: !139, file: !2, line: 65, column: 6)
!175 = !DILocation(line: 67, column: 10, scope: !174)
!176 = !DILocation(line: 67, column: 15, scope: !174)
!177 = !DILocation(line: 65, column: 6, scope: !174)
!178 = !DILocation(line: 65, column: 6, scope: !139)
!179 = !DILocation(line: 68, column: 3, scope: !180)
!180 = distinct !DILexicalBlock(scope: !174, file: !2, line: 67, column: 21)
!181 = !DILocation(line: 69, column: 36, scope: !180)
!182 = !DILocation(line: 69, column: 3, scope: !180)
!183 = !DILocation(line: 71, column: 26, scope: !180)
!184 = !DILocation(line: 71, column: 3, scope: !180)
!185 = !DILocation(line: 72, column: 3, scope: !180)
!186 = !DILocation(line: 75, column: 17, scope: !139)
!187 = !DILocation(line: 75, column: 2, scope: !139)
!188 = !DILocation(line: 75, column: 7, scope: !139)
!189 = !DILocation(line: 75, column: 15, scope: !139)
!190 = !DILocation(line: 76, column: 23, scope: !139)
!191 = !DILocation(line: 76, column: 28, scope: !139)
!192 = !DILocation(line: 76, column: 32, scope: !139)
!193 = !DILocation(line: 76, column: 38, scope: !139)
!194 = !DILocation(line: 76, column: 43, scope: !139)
!195 = !DILocation(line: 76, column: 47, scope: !139)
!196 = !DILocation(line: 76, column: 57, scope: !139)
!197 = !DILocation(line: 76, column: 62, scope: !139)
!198 = !DILocation(line: 76, column: 66, scope: !139)
!199 = !DILocation(line: 76, column: 78, scope: !139)
!200 = !DILocation(line: 76, column: 83, scope: !139)
!201 = !DILocation(line: 76, column: 87, scope: !139)
!202 = !{i8 0, i8 2}
!203 = !{}
!204 = !DILocation(line: 76, column: 7, scope: !139)
!205 = !DILocation(line: 76, column: 5, scope: !139)
!206 = !DILocation(line: 77, column: 6, scope: !207)
!207 = distinct !DILexicalBlock(scope: !139, file: !2, line: 77, column: 6)
!208 = !DILocation(line: 77, column: 6, scope: !139)
!209 = !DILocation(line: 78, column: 36, scope: !210)
!210 = distinct !DILexicalBlock(scope: !207, file: !2, line: 77, column: 10)
!211 = !DILocation(line: 78, column: 45, scope: !210)
!212 = !DILocation(line: 78, column: 64, scope: !210)
!213 = !DILocation(line: 78, column: 63, scope: !210)
!214 = !DILocation(line: 78, column: 49, scope: !210)
!215 = !DILocation(line: 78, column: 3, scope: !210)
!216 = !DILocation(line: 79, column: 26, scope: !210)
!217 = !DILocation(line: 79, column: 3, scope: !210)
!218 = !DILocation(line: 80, column: 3, scope: !210)
!219 = !DILocation(line: 83, column: 53, scope: !139)
!220 = !DILocation(line: 83, column: 2, scope: !139)
!221 = !DILocation(line: 84, column: 1, scope: !139)
!222 = distinct !DISubprogram(name: "rpc_register_rpc_bdev_aio_rescan", scope: !2, file: !2, line: 121, type: !125, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !13)
