; ModuleID = 'samples/581.bc'
source_filename = "src/ZC_DataProperty_double.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.ecldouble = type { double }
%struct.ZC_ELEMENT = type { double, i32 }
%struct.hashtable_t = type { i32, i32, ptr }
%struct.entry_t = type { ptr, ptr, ptr }
%struct.ZC_DataProperty = type { ptr, ptr, i32, i64, i64, i64, i64, i64, ptr, ptr, ptr, i64, double, double, double, double, double, double, double, ptr, ptr, ptr, ptr, ptr, double, double, double }

@.str = private unnamed_addr constant [4 x i8] c"%lu\00", align 1, !dbg !0
@minValueFlag = external global i32, align 4
@maxValueFlag = external global i32, align 4
@avgValueFlag = external global i32, align 4
@valueRangeFlag = external global i32, align 4
@entropyFlag = external global i32, align 4
@entropyFloatpointFlag = external global i32, align 4
@autocorrFlag = external global i32, align 4
@fftFlag = external global i32, align 4
@lapFlag = external global i32, align 4
@gradLenFlag = external global i32, align 4
@sobolevNorm_s0_p2Flag = external global i32, align 4
@sobolevNorm_s1_p2Flag = external global i32, align 4
@sobolevNorm_s2_p2Flag = external global i32, align 4
@plotImageFlag = external global i32, align 4

; Function Attrs: nounwind uwtable
define ptr @ZC_compute_autocorrelation1D_double(ptr noundef %data, i64 noundef %numOfElem, double noundef %avg) #0 !dbg !75 {
entry:

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/ZC_DataProperty_double.c", directory: "/local-ssd/z-checker-cobazntoakzojrutbyd2vxgdbjkeqp4a-build/aidengro/spack-stage-z-checker-0.9.0-cobazntoakzojrutbyd2vxgdbjkeqp4a/spack-src/zc", checksumkind: CSK_MD5, checksum: "b71e99653347ee2702fdff71a0cf3df8")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 4)
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !8, globals: !68, splitDebugInlining: false, nameTableKind: None)
!8 = !{!9, !11, !12, !10, !20, !25, !65, !66, !28}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZC_ELEMENT", file: !14, line: 32, baseType: !15)
!14 = !DIFile(filename: "./include/ZC_DataProperty.h", directory: "/local-ssd/z-checker-cobazntoakzojrutbyd2vxgdbjkeqp4a-build/aidengro/spack-stage-z-checker-0.9.0-cobazntoakzojrutbyd2vxgdbjkeqp4a/spack-src/zc", checksumkind: CSK_MD5, checksum: "825b2b2a90ea27e586af4ecc6fed1bad")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ZC_ELEMENT", file: !14, line: 28, size: 128, elements: !16)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !15, file: !14, line: 30, baseType: !10, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !15, file: !14, line: 31, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZC_DataProperty", file: !14, line: 68, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ZC_DataProperty", file: !14, line: 34, size: 1728, elements: !23)
!23 = !{!24, !26, !27, !29, !33, !34, !35, !36, !37, !38, !39, !40, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !60, !61, !62, !63, !64}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "varName", scope: !22, file: !14, line: 36, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "filePath", scope: !22, file: !14, line: 37, baseType: !25, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "dataType", scope: !22, file: !14, line: 38, baseType: !28, size: 32, offset: 128)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "r5", scope: !22, file: !14, line: 39, baseType: !30, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 70, baseType: !32)
!31 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!32 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "r4", scope: !22, file: !14, line: 40, baseType: !30, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "r3", scope: !22, file: !14, line: 41, baseType: !30, size: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !22, file: !14, line: 42, baseType: !30, size: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !22, file: !14, line: 43, baseType: !30, size: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !22, file: !14, line: 45, baseType: !11, size: 64, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sliceImage_ori", scope: !22, file: !14, line: 46, baseType: !11, size: 64, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sliceImage_log", scope: !22, file: !14, line: 47, baseType: !11, size: 64, offset: 640)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "numOfElem", scope: !22, file: !14, line: 49, baseType: !41, size: 64, offset: 704)
!41 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "minValue", scope: !22, file: !14, line: 50, baseType: !10, size: 64, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "maxValue", scope: !22, file: !14, line: 51, baseType: !10, size: 64, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "valueRange", scope: !22, file: !14, line: 52, baseType: !10, size: 64, offset: 896)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "avgValue", scope: !22, file: !14, line: 53, baseType: !10, size: 64, offset: 960)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !22, file: !14, line: 54, baseType: !10, size: 64, offset: 1024)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "entropyFloatpoint", scope: !22, file: !14, line: 55, baseType: !10, size: 64, offset: 1088)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "zeromean_variance", scope: !22, file: !14, line: 56, baseType: !10, size: 64, offset: 1152)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "autocorr", scope: !22, file: !14, line: 57, baseType: !9, size: 64, offset: 1216)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "autocorr3D", scope: !22, file: !14, line: 58, baseType: !11, size: 64, offset: 1280)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "fftCoeff", scope: !22, file: !14, line: 59, baseType: !52, size: 64, offset: 1344)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZC_Complex", file: !14, line: 26, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 26, size: 192, elements: !55)
!55 = !{!56, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Re", scope: !54, file: !14, line: 26, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !14, line: 25, baseType: !10)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Im", scope: !54, file: !14, line: 26, baseType: !57, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Amp", scope: !54, file: !14, line: 26, baseType: !57, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "lap", scope: !22, file: !14, line: 61, baseType: !9, size: 64, offset: 1408)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "gradLen", scope: !22, file: !14, line: 63, baseType: !11, size: 64, offset: 1472)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sobolevNorm_s0_p2", scope: !22, file: !14, line: 65, baseType: !10, size: 64, offset: 1536)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sobolevNorm_s1_p2", scope: !22, file: !14, line: 66, baseType: !10, size: 64, offset: 1600)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sobolevNorm_s2_p2", scope: !22, file: !14, line: 67, baseType: !10, size: 64, offset: 1664)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !{!0}
!69 = !{i32 7, !"Dwarf Version", i32 5}
!70 = !{i32 2, !"Debug Info Version", i32 3}
!71 = !{i32 1, !"wchar_size", i32 4}
!72 = !{i32 8, !"PIC Level", i32 2}
!73 = !{i32 7, !"uwtable", i32 2}
!74 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!75 = distinct !DISubprogram(name: "ZC_compute_autocorrelation1D_double", scope: !2, file: !2, line: 10, type: !76, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !78)
!76 = !DISubroutineType(types: !77)
!77 = !{!9, !9, !30, !10}
!78 = !{!79, !80, !81, !82, !83, !84, !85, !88, !94, !99, !100, !101, !102}
!79 = !DILocalVariable(name: "data", arg: 1, scope: !75, file: !2, line: 10, type: !9)
!80 = !DILocalVariable(name: "numOfElem", arg: 2, scope: !75, file: !2, line: 10, type: !30)
!81 = !DILocalVariable(name: "avg", arg: 3, scope: !75, file: !2, line: 10, type: !10)
!82 = !DILocalVariable(name: "autocorr", scope: !75, file: !2, line: 12, type: !9)
!83 = !DILocalVariable(name: "i", scope: !75, file: !2, line: 14, type: !30)
!84 = !DILocalVariable(name: "delta", scope: !75, file: !2, line: 15, type: !28)
!85 = !DILocalVariable(name: "cov", scope: !86, file: !2, line: 19, type: !10)
!86 = distinct !DILexicalBlock(scope: !87, file: !2, line: 18, column: 2)
!87 = distinct !DILexicalBlock(scope: !75, file: !2, line: 17, column: 6)
!88 = !DILocalVariable(name: "sum", scope: !89, file: !2, line: 34, type: !10)
!89 = distinct !DILexicalBlock(scope: !90, file: !2, line: 33, column: 4)
!90 = distinct !DILexicalBlock(scope: !91, file: !2, line: 32, column: 4)
!91 = distinct !DILexicalBlock(scope: !92, file: !2, line: 32, column: 4)
!92 = distinct !DILexicalBlock(scope: !93, file: !2, line: 31, column: 3)
!93 = distinct !DILexicalBlock(scope: !86, file: !2, line: 25, column: 7)
!94 = !DILocalVariable(name: "avg_0", scope: !95, file: !2, line: 47, type: !10)
!95 = distinct !DILexicalBlock(scope: !96, file: !2, line: 46, column: 3)
!96 = distinct !DILexicalBlock(scope: !97, file: !2, line: 45, column: 3)
!97 = distinct !DILexicalBlock(scope: !98, file: !2, line: 45, column: 3)
!98 = distinct !DILexicalBlock(scope: !87, file: !2, line: 44, column: 2)
!99 = !DILocalVariable(name: "avg_1", scope: !95, file: !2, line: 48, type: !10)
!100 = !DILocalVariable(name: "cov_0", scope: !95, file: !2, line: 59, type: !10)
!101 = !DILocalVariable(name: "cov_1", scope: !95, file: !2, line: 60, type: !10)
!102 = !DILocalVariable(name: "sum", scope: !103, file: !2, line: 81, type: !10)
!103 = distinct !DILexicalBlock(scope: !104, file: !2, line: 80, column: 4)
!104 = distinct !DILexicalBlock(scope: !95, file: !2, line: 74, column: 8)
!105 = !{!106, !106, i64 0}
!106 = !{!"any pointer", !107, i64 0}
!107 = !{!"omnipotent char", !108, i64 0}
!108 = !{!"Simple C/C++ TBAA"}
!109 = !DILocation(line: 10, column: 53, scope: !75)
!110 = !{!111, !111, i64 0}
!111 = !{!"long", !107, i64 0}
!112 = !DILocation(line: 10, column: 66, scope: !75)
!113 = !{!114, !114, i64 0}
!114 = !{!"double", !107, i64 0}
!115 = !DILocation(line: 10, column: 84, scope: !75)
!116 = !DILocation(line: 12, column: 2, scope: !75)
!117 = !DILocation(line: 12, column: 10, scope: !75)
!118 = !DILocation(line: 12, column: 30, scope: !75)
!119 = !DILocation(line: 14, column: 2, scope: !75)
!120 = !DILocation(line: 14, column: 9, scope: !75)
!121 = !DILocation(line: 15, column: 2, scope: !75)
!122 = !DILocation(line: 15, column: 6, scope: !75)
!123 = !{!124, !124, i64 0}
!124 = !{!"int", !107, i64 0}
!125 = !DILocation(line: 17, column: 6, scope: !87)
!126 = !DILocation(line: 17, column: 16, scope: !87)
!127 = !DILocation(line: 17, column: 6, scope: !75)
!128 = !DILocation(line: 19, column: 3, scope: !86)
!129 = !DILocation(line: 19, column: 10, scope: !86)
!130 = !DILocation(line: 20, column: 10, scope: !131)
!131 = distinct !DILexicalBlock(scope: !86, file: !2, line: 20, column: 3)
!132 = !DILocation(line: 20, column: 8, scope: !131)
!133 = !DILocation(line: 20, column: 15, scope: !134)
!134 = distinct !DILexicalBlock(scope: !131, file: !2, line: 20, column: 3)
!135 = !DILocation(line: 20, column: 19, scope: !134)
!136 = !DILocation(line: 20, column: 17, scope: !134)
!137 = !DILocation(line: 20, column: 3, scope: !131)
!138 = !DILocation(line: 21, column: 12, scope: !134)
!139 = !DILocation(line: 21, column: 17, scope: !134)
!140 = !DILocation(line: 21, column: 22, scope: !134)
!141 = !DILocation(line: 21, column: 20, scope: !134)
!142 = !DILocation(line: 21, column: 28, scope: !134)
!143 = !DILocation(line: 21, column: 33, scope: !134)
!144 = !DILocation(line: 21, column: 38, scope: !134)
!145 = !DILocation(line: 21, column: 36, scope: !134)
!146 = !DILocation(line: 21, column: 8, scope: !134)
!147 = !DILocation(line: 21, column: 4, scope: !134)
!148 = !DILocation(line: 20, column: 31, scope: !134)
!149 = !DILocation(line: 20, column: 3, scope: !134)
!150 = distinct !{!150, !137, !151, !152}
!151 = !DILocation(line: 21, column: 41, scope: !131)
!152 = !{!"llvm.loop.mustprogress"}
!153 = !DILocation(line: 23, column: 9, scope: !86)
!154 = !DILocation(line: 23, column: 13, scope: !86)
!155 = !DILocation(line: 23, column: 12, scope: !86)
!156 = !DILocation(line: 23, column: 7, scope: !86)
!157 = !DILocation(line: 25, column: 7, scope: !93)
!158 = !DILocation(line: 25, column: 11, scope: !93)
!159 = !DILocation(line: 25, column: 7, scope: !86)
!160 = !DILocation(line: 27, column: 15, scope: !161)
!161 = distinct !DILexicalBlock(scope: !162, file: !2, line: 27, column: 4)
!162 = distinct !DILexicalBlock(scope: !93, file: !2, line: 26, column: 3)
!163 = !DILocation(line: 27, column: 9, scope: !161)
!164 = !DILocation(line: 27, column: 20, scope: !165)
!165 = distinct !DILexicalBlock(scope: !161, file: !2, line: 27, column: 4)
!166 = !DILocation(line: 27, column: 26, scope: !165)
!167 = !DILocation(line: 27, column: 4, scope: !161)
!168 = !DILocation(line: 28, column: 5, scope: !165)
!169 = !DILocation(line: 28, column: 14, scope: !165)
!170 = !DILocation(line: 28, column: 21, scope: !165)
!171 = !DILocation(line: 27, column: 49, scope: !165)
!172 = !DILocation(line: 27, column: 4, scope: !165)
!173 = distinct !{!173, !167, !174, !152}
!174 = !DILocation(line: 28, column: 23, scope: !161)
!175 = !DILocation(line: 29, column: 3, scope: !162)
!176 = !DILocation(line: 32, column: 14, scope: !91)
!177 = !DILocation(line: 32, column: 8, scope: !91)
!178 = !DILocation(line: 32, column: 19, scope: !90)
!179 = !DILocation(line: 32, column: 25, scope: !90)
!180 = !DILocation(line: 32, column: 4, scope: !91)
!181 = !DILocation(line: 34, column: 5, scope: !89)
!182 = !DILocation(line: 34, column: 12, scope: !89)
!183 = !DILocation(line: 36, column: 12, scope: !184)
!184 = distinct !DILexicalBlock(scope: !89, file: !2, line: 36, column: 5)
!185 = !DILocation(line: 36, column: 10, scope: !184)
!186 = !DILocation(line: 36, column: 17, scope: !187)
!187 = distinct !DILexicalBlock(scope: !184, file: !2, line: 36, column: 5)
!188 = !DILocation(line: 36, column: 21, scope: !187)
!189 = !DILocation(line: 36, column: 31, scope: !187)
!190 = !DILocation(line: 36, column: 30, scope: !187)
!191 = !DILocation(line: 36, column: 19, scope: !187)
!192 = !DILocation(line: 36, column: 5, scope: !184)
!193 = !DILocation(line: 37, column: 14, scope: !187)
!194 = !DILocation(line: 37, column: 19, scope: !187)
!195 = !DILocation(line: 37, column: 22, scope: !187)
!196 = !DILocation(line: 37, column: 21, scope: !187)
!197 = !DILocation(line: 37, column: 28, scope: !187)
!198 = !DILocation(line: 37, column: 33, scope: !187)
!199 = !DILocation(line: 37, column: 35, scope: !187)
!200 = !DILocation(line: 37, column: 34, scope: !187)
!201 = !DILocation(line: 37, column: 42, scope: !187)
!202 = !DILocation(line: 37, column: 41, scope: !187)
!203 = !DILocation(line: 37, column: 10, scope: !187)
!204 = !DILocation(line: 37, column: 6, scope: !187)
!205 = !DILocation(line: 36, column: 39, scope: !187)
!206 = !DILocation(line: 36, column: 5, scope: !187)
!207 = distinct !{!207, !192, !208, !152}
!208 = !DILocation(line: 37, column: 45, scope: !184)
!209 = !DILocation(line: 39, column: 23, scope: !89)
!210 = !DILocation(line: 39, column: 28, scope: !89)
!211 = !DILocation(line: 39, column: 38, scope: !89)
!212 = !DILocation(line: 39, column: 37, scope: !89)
!213 = !DILocation(line: 39, column: 27, scope: !89)
!214 = !DILocation(line: 39, column: 26, scope: !89)
!215 = !DILocation(line: 39, column: 45, scope: !89)
!216 = !DILocation(line: 39, column: 44, scope: !89)
!217 = !DILocation(line: 39, column: 5, scope: !89)
!218 = !DILocation(line: 39, column: 14, scope: !89)
!219 = !DILocation(line: 39, column: 21, scope: !89)
!220 = !DILocation(line: 40, column: 4, scope: !90)
!221 = !DILocation(line: 40, column: 4, scope: !89)
!222 = !DILocation(line: 32, column: 48, scope: !90)
!223 = !DILocation(line: 32, column: 4, scope: !90)
!224 = distinct !{!224, !180, !225, !152}
!225 = !DILocation(line: 40, column: 4, scope: !91)
!226 = !DILocation(line: 42, column: 2, scope: !87)
!227 = !DILocation(line: 42, column: 2, scope: !86)
!228 = !DILocation(line: 45, column: 14, scope: !97)
!229 = !DILocation(line: 45, column: 8, scope: !97)
!230 = !DILocation(line: 45, column: 19, scope: !96)
!231 = !DILocation(line: 45, column: 25, scope: !96)
!232 = !DILocation(line: 45, column: 3, scope: !97)
!233 = !DILocation(line: 47, column: 4, scope: !95)
!234 = !DILocation(line: 47, column: 11, scope: !95)
!235 = !DILocation(line: 48, column: 4, scope: !95)
!236 = !DILocation(line: 48, column: 11, scope: !95)
!237 = !DILocation(line: 50, column: 11, scope: !238)
!238 = distinct !DILexicalBlock(scope: !95, file: !2, line: 50, column: 4)
!239 = !DILocation(line: 50, column: 9, scope: !238)
!240 = !DILocation(line: 50, column: 16, scope: !241)
!241 = distinct !DILexicalBlock(scope: !238, file: !2, line: 50, column: 4)
!242 = !DILocation(line: 50, column: 20, scope: !241)
!243 = !DILocation(line: 50, column: 30, scope: !241)
!244 = !DILocation(line: 50, column: 29, scope: !241)
!245 = !DILocation(line: 50, column: 18, scope: !241)
!246 = !DILocation(line: 50, column: 4, scope: !238)
!247 = !DILocation(line: 52, column: 14, scope: !248)
!248 = distinct !DILexicalBlock(scope: !241, file: !2, line: 51, column: 4)
!249 = !DILocation(line: 52, column: 19, scope: !248)
!250 = !DILocation(line: 52, column: 11, scope: !248)
!251 = !DILocation(line: 53, column: 14, scope: !248)
!252 = !DILocation(line: 53, column: 19, scope: !248)
!253 = !DILocation(line: 53, column: 21, scope: !248)
!254 = !DILocation(line: 53, column: 20, scope: !248)
!255 = !DILocation(line: 53, column: 11, scope: !248)
!256 = !DILocation(line: 54, column: 4, scope: !248)
!257 = !DILocation(line: 50, column: 38, scope: !241)
!258 = !DILocation(line: 50, column: 4, scope: !241)
!259 = distinct !{!259, !246, !260, !152}
!260 = !DILocation(line: 54, column: 4, scope: !238)
!261 = !DILocation(line: 56, column: 12, scope: !95)
!262 = !DILocation(line: 56, column: 21, scope: !95)
!263 = !DILocation(line: 56, column: 31, scope: !95)
!264 = !DILocation(line: 56, column: 30, scope: !95)
!265 = !DILocation(line: 56, column: 20, scope: !95)
!266 = !DILocation(line: 56, column: 18, scope: !95)
!267 = !DILocation(line: 56, column: 10, scope: !95)
!268 = !DILocation(line: 57, column: 12, scope: !95)
!269 = !DILocation(line: 57, column: 21, scope: !95)
!270 = !DILocation(line: 57, column: 31, scope: !95)
!271 = !DILocation(line: 57, column: 30, scope: !95)
!272 = !DILocation(line: 57, column: 20, scope: !95)
!273 = !DILocation(line: 57, column: 18, scope: !95)
!274 = !DILocation(line: 57, column: 10, scope: !95)
!275 = !DILocation(line: 59, column: 4, scope: !95)
!276 = !DILocation(line: 59, column: 11, scope: !95)
!277 = !DILocation(line: 60, column: 4, scope: !95)
!278 = !DILocation(line: 60, column: 11, scope: !95)
!279 = !DILocation(line: 62, column: 11, scope: !280)
!280 = distinct !DILexicalBlock(scope: !95, file: !2, line: 62, column: 4)
!281 = !DILocation(line: 62, column: 9, scope: !280)
!282 = !DILocation(line: 62, column: 16, scope: !283)
!283 = distinct !DILexicalBlock(scope: !280, file: !2, line: 62, column: 4)
!284 = !DILocation(line: 62, column: 20, scope: !283)
!285 = !DILocation(line: 62, column: 30, scope: !283)
!286 = !DILocation(line: 62, column: 29, scope: !283)
!287 = !DILocation(line: 62, column: 18, scope: !283)
!288 = !DILocation(line: 62, column: 4, scope: !280)
!289 = !DILocation(line: 64, column: 15, scope: !290)
!290 = distinct !DILexicalBlock(scope: !283, file: !2, line: 63, column: 4)
!291 = !DILocation(line: 64, column: 20, scope: !290)
!292 = !DILocation(line: 64, column: 23, scope: !290)
!293 = !DILocation(line: 64, column: 22, scope: !290)
!294 = !DILocation(line: 64, column: 31, scope: !290)
!295 = !DILocation(line: 64, column: 36, scope: !290)
!296 = !DILocation(line: 64, column: 39, scope: !290)
!297 = !DILocation(line: 64, column: 38, scope: !290)
!298 = !DILocation(line: 64, column: 11, scope: !290)
!299 = !DILocation(line: 65, column: 15, scope: !290)
!300 = !DILocation(line: 65, column: 20, scope: !290)
!301 = !DILocation(line: 65, column: 22, scope: !290)
!302 = !DILocation(line: 65, column: 21, scope: !290)
!303 = !DILocation(line: 65, column: 29, scope: !290)
!304 = !DILocation(line: 65, column: 28, scope: !290)
!305 = !DILocation(line: 65, column: 37, scope: !290)
!306 = !DILocation(line: 65, column: 42, scope: !290)
!307 = !DILocation(line: 65, column: 44, scope: !290)
!308 = !DILocation(line: 65, column: 43, scope: !290)
!309 = !DILocation(line: 65, column: 51, scope: !290)
!310 = !DILocation(line: 65, column: 50, scope: !290)
!311 = !DILocation(line: 65, column: 11, scope: !290)
!312 = !DILocation(line: 66, column: 4, scope: !290)
!313 = !DILocation(line: 62, column: 38, scope: !283)
!314 = !DILocation(line: 62, column: 4, scope: !283)
!315 = distinct !{!315, !288, !316, !152}
!316 = !DILocation(line: 66, column: 4, scope: !280)
!317 = !DILocation(line: 68, column: 12, scope: !95)
!318 = !DILocation(line: 68, column: 19, scope: !95)
!319 = !DILocation(line: 68, column: 29, scope: !95)
!320 = !DILocation(line: 68, column: 28, scope: !95)
!321 = !DILocation(line: 68, column: 18, scope: !95)
!322 = !DILocation(line: 68, column: 17, scope: !95)
!323 = !DILocation(line: 68, column: 10, scope: !95)
!324 = !DILocation(line: 69, column: 12, scope: !95)
!325 = !DILocation(line: 69, column: 19, scope: !95)
!326 = !DILocation(line: 69, column: 29, scope: !95)
!327 = !DILocation(line: 69, column: 28, scope: !95)
!328 = !DILocation(line: 69, column: 18, scope: !95)
!329 = !DILocation(line: 69, column: 17, scope: !95)
!330 = !DILocation(line: 69, column: 10, scope: !95)
!331 = !DILocation(line: 71, column: 17, scope: !95)
!332 = !DILocation(line: 71, column: 12, scope: !95)
!333 = !DILocation(line: 71, column: 10, scope: !95)
!334 = !DILocation(line: 72, column: 17, scope: !95)
!335 = !DILocation(line: 72, column: 12, scope: !95)
!336 = !DILocation(line: 72, column: 10, scope: !95)
!337 = !DILocation(line: 74, column: 8, scope: !104)
!338 = !DILocation(line: 74, column: 14, scope: !104)
!339 = !DILocation(line: 74, column: 13, scope: !104)
!340 = !DILocation(line: 74, column: 20, scope: !104)
!341 = !DILocation(line: 74, column: 8, scope: !95)
!342 = !DILocation(line: 76, column: 16, scope: !343)
!343 = distinct !DILexicalBlock(scope: !344, file: !2, line: 76, column: 5)
!344 = distinct !DILexicalBlock(scope: !104, file: !2, line: 75, column: 4)
!345 = !DILocation(line: 76, column: 10, scope: !343)
!346 = !DILocation(line: 76, column: 21, scope: !347)
!347 = distinct !DILexicalBlock(scope: !343, file: !2, line: 76, column: 5)
!348 = !DILocation(line: 76, column: 27, scope: !347)
!349 = !DILocation(line: 76, column: 5, scope: !343)
!350 = !DILocation(line: 77, column: 6, scope: !347)
!351 = !DILocation(line: 77, column: 15, scope: !347)
!352 = !DILocation(line: 77, column: 22, scope: !347)
!353 = !DILocation(line: 76, column: 50, scope: !347)
!354 = !DILocation(line: 76, column: 5, scope: !347)
!355 = distinct !{!355, !349, !356, !152}
!356 = !DILocation(line: 77, column: 24, scope: !343)
!357 = !DILocation(line: 78, column: 4, scope: !344)
!358 = !DILocation(line: 81, column: 5, scope: !103)
!359 = !DILocation(line: 81, column: 12, scope: !103)
!360 = !DILocation(line: 83, column: 12, scope: !361)
!361 = distinct !DILexicalBlock(scope: !103, file: !2, line: 83, column: 5)
!362 = !DILocation(line: 83, column: 10, scope: !361)
!363 = !DILocation(line: 83, column: 17, scope: !364)
!364 = distinct !DILexicalBlock(scope: !361, file: !2, line: 83, column: 5)
!365 = !DILocation(line: 83, column: 21, scope: !364)
!366 = !DILocation(line: 83, column: 31, scope: !364)
!367 = !DILocation(line: 83, column: 30, scope: !364)
!368 = !DILocation(line: 83, column: 19, scope: !364)
!369 = !DILocation(line: 83, column: 5, scope: !361)
!370 = !DILocation(line: 84, column: 14, scope: !364)
!371 = !DILocation(line: 84, column: 19, scope: !364)
!372 = !DILocation(line: 84, column: 22, scope: !364)
!373 = !DILocation(line: 84, column: 21, scope: !364)
!374 = !DILocation(line: 84, column: 30, scope: !364)
!375 = !DILocation(line: 84, column: 35, scope: !364)
!376 = !DILocation(line: 84, column: 37, scope: !364)
!377 = !DILocation(line: 84, column: 36, scope: !364)
!378 = !DILocation(line: 84, column: 44, scope: !364)
!379 = !DILocation(line: 84, column: 43, scope: !364)
!380 = !DILocation(line: 84, column: 10, scope: !364)
!381 = !DILocation(line: 84, column: 6, scope: !364)
!382 = !DILocation(line: 83, column: 39, scope: !364)
!383 = !DILocation(line: 83, column: 5, scope: !364)
!384 = distinct !{!384, !369, !385, !152}
!385 = !DILocation(line: 84, column: 49, scope: !361)
!386 = !DILocation(line: 86, column: 23, scope: !103)
!387 = !DILocation(line: 86, column: 28, scope: !103)
!388 = !DILocation(line: 86, column: 38, scope: !103)
!389 = !DILocation(line: 86, column: 37, scope: !103)
!390 = !DILocation(line: 86, column: 27, scope: !103)
!391 = !DILocation(line: 86, column: 26, scope: !103)
!392 = !DILocation(line: 86, column: 46, scope: !103)
!393 = !DILocation(line: 86, column: 52, scope: !103)
!394 = !DILocation(line: 86, column: 51, scope: !103)
!395 = !DILocation(line: 86, column: 44, scope: !103)
!396 = !DILocation(line: 86, column: 5, scope: !103)
!397 = !DILocation(line: 86, column: 14, scope: !103)
!398 = !DILocation(line: 86, column: 21, scope: !103)
!399 = !DILocation(line: 87, column: 4, scope: !104)
!400 = !DILocation(line: 88, column: 3, scope: !96)
!401 = !DILocation(line: 88, column: 3, scope: !95)
!402 = !DILocation(line: 45, column: 48, scope: !96)
!403 = !DILocation(line: 45, column: 3, scope: !96)
!404 = distinct !{!404, !232, !405, !152}
!405 = !DILocation(line: 88, column: 3, scope: !97)
!406 = !DILocation(line: 91, column: 2, scope: !75)
!407 = !DILocation(line: 91, column: 14, scope: !75)
!408 = !DILocation(line: 92, column: 9, scope: !75)
!409 = !DILocation(line: 93, column: 1, scope: !75)
!410 = !DILocation(line: 92, column: 2, scope: !75)
!411 = !DISubprogram(name: "malloc", scope: !412, file: !412, line: 540, type: !413, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!412 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!413 = !DISubroutineType(types: !414)
!414 = !{!11, !30}
!415 = !DISubprogram(name: "sqrt", scope: !416, file: !416, line: 143, type: !417, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!416 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "", checksumkind: CSK_MD5, checksum: "8c6e2d0d2bda65bc5ba1ca02b65383b7")
!417 = !DISubroutineType(types: !418)
!418 = !{!10, !10}
!419 = distinct !DISubprogram(name: "computeLosslessEntropy_64bits", scope: !2, file: !2, line: 272, type: !420, scopeLine: 273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !422)
!420 = !DISubroutineType(types: !421)
!421 = !{!10, !11, !30}
!422 = !{!423, !424, !425, !429, !430, !446, !447, !461, !462, !463, !464, !465, !466, !472, !474}
!423 = !DILocalVariable(name: "data", arg: 1, scope: !419, file: !2, line: 272, type: !11)
!424 = !DILocalVariable(name: "nbEle", arg: 2, scope: !419, file: !2, line: 272, type: !30)
!425 = !DILocalVariable(name: "vs", scope: !419, file: !2, line: 274, type: !426)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 256)
!429 = !DILocalVariable(name: "i", scope: !419, file: !2, line: 275, type: !30)
!430 = !DILocalVariable(name: "entropy_table", scope: !419, file: !2, line: 276, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtable_t", file: !433, line: 27, baseType: !434)
!433 = !DIFile(filename: "./include/ZC_Hashtable.h", directory: "/local-ssd/z-checker-cobazntoakzojrutbyd2vxgdbjkeqp4a-build/aidengro/spack-stage-z-checker-0.9.0-cobazntoakzojrutbyd2vxgdbjkeqp4a/spack-src/zc", checksumkind: CSK_MD5, checksum: "0efaa47980efff33df22275568cddd20")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_t", file: !433, line: 23, size: 128, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !434, file: !433, line: 24, baseType: !28, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !434, file: !433, line: 25, baseType: !28, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !434, file: !433, line: 26, baseType: !439, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "entry_t", file: !433, line: 17, size: 192, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !441, file: !433, line: 18, baseType: !25, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !441, file: !433, line: 19, baseType: !11, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !441, file: !433, line: 20, baseType: !440, size: 64, offset: 128)
!446 = !DILocalVariable(name: "value", scope: !419, file: !2, line: 277, type: !9)
!447 = !DILocalVariable(name: "buf", scope: !448, file: !2, line: 280, type: !451)
!448 = distinct !DILexicalBlock(scope: !449, file: !2, line: 279, column: 2)
!449 = distinct !DILexicalBlock(scope: !450, file: !2, line: 278, column: 2)
!450 = distinct !DILexicalBlock(scope: !419, file: !2, line: 278, column: 2)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ecldouble", file: !452, line: 296, baseType: !453)
!452 = !DIFile(filename: "./include/zc.h", directory: "/local-ssd/z-checker-cobazntoakzojrutbyd2vxgdbjkeqp4a-build/aidengro/spack-stage-z-checker-0.9.0-cobazntoakzojrutbyd2vxgdbjkeqp4a/spack-src/zc", checksumkind: CSK_MD5, checksum: "2400c9f84defa57dc7cd6f0829ef20df")
!453 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ecldouble", file: !452, line: 291, size: 64, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !453, file: !452, line: 293, baseType: !10, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lvalue", scope: !453, file: !452, line: 294, baseType: !32, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "byte", scope: !453, file: !452, line: 295, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 8)
!461 = !DILocalVariable(name: "v", scope: !448, file: !2, line: 282, type: !32)
!462 = !DILocalVariable(name: "qe", scope: !448, file: !2, line: 285, type: !12)
!463 = !DILocalVariable(name: "sum", scope: !419, file: !2, line: 296, type: !30)
!464 = !DILocalVariable(name: "j", scope: !419, file: !2, line: 297, type: !30)
!465 = !DILocalVariable(name: "entVal", scope: !419, file: !2, line: 298, type: !10)
!466 = !DILocalVariable(name: "t", scope: !467, file: !2, line: 301, type: !470)
!467 = distinct !DILexicalBlock(scope: !468, file: !2, line: 300, column: 2)
!468 = distinct !DILexicalBlock(scope: !469, file: !2, line: 299, column: 2)
!469 = distinct !DILexicalBlock(scope: !419, file: !2, line: 299, column: 2)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_t", file: !433, line: 21, baseType: !441)
!472 = !DILocalVariable(name: "qe", scope: !473, file: !2, line: 304, type: !12)
!473 = distinct !DILexicalBlock(scope: !467, file: !2, line: 303, column: 3)
!474 = !DILocalVariable(name: "prob", scope: !473, file: !2, line: 305, type: !10)
!475 = !DILocation(line: 272, column: 44, scope: !419)
!476 = !DILocation(line: 272, column: 57, scope: !419)
!477 = !DILocation(line: 274, column: 2, scope: !419)
!478 = !DILocation(line: 274, column: 7, scope: !419)
!479 = !DILocation(line: 275, column: 2, scope: !419)
!480 = !DILocation(line: 275, column: 9, scope: !419)
!481 = !DILocation(line: 276, column: 2, scope: !419)
!482 = !DILocation(line: 276, column: 15, scope: !419)
!483 = !DILocation(line: 276, column: 41, scope: !419)
!484 = !DILocation(line: 276, column: 31, scope: !419)
!485 = !DILocation(line: 277, column: 2, scope: !419)
!486 = !DILocation(line: 277, column: 10, scope: !419)
!487 = !DILocation(line: 277, column: 27, scope: !419)
!488 = !DILocation(line: 278, column: 7, scope: !450)
!489 = !DILocation(line: 278, column: 6, scope: !450)
!490 = !DILocation(line: 278, column: 10, scope: !449)
!491 = !DILocation(line: 278, column: 12, scope: !449)
!492 = !DILocation(line: 278, column: 11, scope: !449)
!493 = !DILocation(line: 278, column: 2, scope: !450)
!494 = !DILocation(line: 280, column: 9, scope: !448)
!495 = !DILocation(line: 280, column: 19, scope: !448)
!496 = !DILocation(line: 281, column: 21, scope: !448)
!497 = !DILocation(line: 281, column: 27, scope: !448)
!498 = !DILocation(line: 281, column: 19, scope: !448)
!499 = !{!107, !107, i64 0}
