; ModuleID = 'samples/600.bc'
source_filename = "src/http/modules/ngx_http_gzip_filter_module.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_http_module_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_command_s = type { %struct.ngx_str_t, i64, ptr, i64, i64, ptr }
%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_conf_num_bounds_t = type { ptr, i64, i64 }
%struct.ngx_http_variable_s = type { %struct.ngx_str_t, ptr, ptr, i64, i64, i64 }
%struct.ngx_conf_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr }
%struct.ngx_http_gzip_conf_t = type { i64, i64, %struct.ngx_hash_t, %struct.ngx_bufs_t, i64, i64, i64, i64, i64, ptr }
%struct.ngx_hash_t = type { ptr, i64 }
%struct.ngx_bufs_t = type { i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 217, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/http/modules/ngx_http_gzip_filter_module.c", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2f427a9b07eb11e9c0c610c808cb0ba4")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 41)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "ngx_http_gzip_filter_module_ctx", scope: !9, file: !2, line: 201, type: !2085, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !10, globals: !40, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !16, !17, !23, !25, !26, !29, !38}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !12, line: 79, baseType: !13)
!12 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !14, line: 90, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!15 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !19, line: 33, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !21, line: 31, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !24, line: 16, baseType: !16)
!24 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6fc45f3cccbbf41b239dcfa9e2c5b7b1")
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !19, line: 87, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !21, line: 153, baseType: !28)
!28 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gztrailer", file: !2, line: 73, size: 64, elements: !31)
!31 = !{!32, !37}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !30, file: !2, line: 74, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !34, line: 26, baseType: !35)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !21, line: 42, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "zlen", scope: !30, file: !2, line: 75, baseType: !33, size: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 29, baseType: !15)
!39 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!40 = !{!0, !41, !7, !608, !613, !615, !620, !1910, !1915, !1920, !1922, !1928, !1933, !1938, !1943, !1948, !1953, !2030, !2035, !2037, !2040, !2045, !2047, !2052, !2057, !2059, !2062, !2074, !2076, !2078, !2080}
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "ngx_http_gzip_filter_module", scope: !9, file: !2, line: 216, type: !43, isLocal: false, isDefinition: true)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !44, line: 15, baseType: !45)
!44 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1c4d8383f329aa1de050d17038ecb169")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !46, line: 222, size: 1600, elements: !47)
!46 = !DIFile(filename: "src/core/ngx_module.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1b2032f87974a892f93f4098e8fc0619")
!47 = !{!48, !49, !50, !52, !53, !54, !55, !58, !59, !583, !584, !588, !592, !593, !594, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !45, file: !46, line: 223, baseType: !11, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !45, file: !46, line: 224, baseType: !11, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !45, file: !46, line: 226, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !45, file: !46, line: 228, baseType: !11, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !45, file: !46, line: 229, baseType: !11, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !45, file: !46, line: 231, baseType: !11, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !45, file: !46, line: 232, baseType: !56, size: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !45, file: !46, line: 234, baseType: !16, size: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !45, file: !46, line: 235, baseType: !60, size: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !44, line: 22, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !63, line: 77, size: 448, elements: !64)
!63 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6ae6b72e2fd6bbb6ecc9de2e6386072c")
!64 = !{!65, !72, !73, !580, !581, !582}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !62, file: !63, line: 78, baseType: !66, size: 128)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !67, line: 19, baseType: !68)
!67 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "aecf67ab89c624000ba2e2684dbcfdc8")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 16, size: 128, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !68, file: !67, line: 17, baseType: !38, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !68, file: !67, line: 18, baseType: !17, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !63, line: 79, baseType: !11, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !62, file: !63, line: 80, baseType: !74, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!51, !77, !60, !16}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !44, line: 16, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !63, line: 116, size: 768, elements: !80)
!80 = !{!81, !82, !251, !562, !563, !564, !573, !574, !575, !576, !577, !579}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !63, line: 117, baseType: !51, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !79, file: !63, line: 118, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !85, line: 22, baseType: !86)
!85 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 16, size: 320, elements: !87)
!87 = !{!88, !89, !90, !91, !92}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !86, file: !85, line: 17, baseType: !16, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !86, file: !85, line: 18, baseType: !11, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !86, file: !85, line: 19, baseType: !38, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !86, file: !85, line: 20, baseType: !11, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !86, file: !85, line: 21, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !44, line: 18, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !96, line: 57, size: 640, elements: !97)
!96 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!97 = !{!98, !106, !107, !108, !231, !238, !250}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !95, file: !96, line: 58, baseType: !99, size: 256)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !96, line: 54, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 49, size: 256, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !100, file: !96, line: 50, baseType: !17, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !100, file: !96, line: 51, baseType: !17, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !96, line: 52, baseType: !93, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !100, file: !96, line: 53, baseType: !11, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !95, file: !96, line: 59, baseType: !38, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !95, file: !96, line: 60, baseType: !93, size: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !95, file: !96, line: 61, baseType: !109, size: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !44, line: 19, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !24, line: 59, size: 128, elements: !112)
!112 = !{!113, !230}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !111, file: !24, line: 60, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !24, line: 18, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !24, line: 20, size: 640, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !116, file: !24, line: 21, baseType: !17, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !116, file: !24, line: 22, baseType: !17, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !116, file: !24, line: 23, baseType: !26, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !116, file: !24, line: 24, baseType: !26, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !116, file: !24, line: 26, baseType: !17, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !116, file: !24, line: 27, baseType: !17, size: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !116, file: !24, line: 28, baseType: !23, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !116, file: !24, line: 29, baseType: !126, size: 64, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !44, line: 23, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !129, line: 16, size: 1600, elements: !130)
!129 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!130 = !{!131, !134, !135, !174, !175, !176, !215, !216}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !128, file: !129, line: 17, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !133, line: 16, baseType: !25)
!133 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "7b9a751e8c1ad1afef5467d60ed94e69")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 18, baseType: !66, size: 128, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !128, file: !129, line: 19, baseType: !136, size: 1152, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !133, line: 17, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !138, line: 26, size: 1152, elements: !139)
!138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!139 = !{!140, !142, !144, !146, !148, !150, !152, !153, !154, !156, !158, !160, !168, !169, !170}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !137, file: !138, line: 31, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !21, line: 145, baseType: !15)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !137, file: !138, line: 36, baseType: !143, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !21, line: 148, baseType: !15)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !137, file: !138, line: 44, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !21, line: 151, baseType: !15)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !137, file: !138, line: 45, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !21, line: 150, baseType: !36)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !137, file: !138, line: 47, baseType: !149, size: 32, offset: 224)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !21, line: 146, baseType: !36)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !137, file: !138, line: 48, baseType: !151, size: 32, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !21, line: 147, baseType: !36)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !137, file: !138, line: 50, baseType: !25, size: 32, offset: 288)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !137, file: !138, line: 52, baseType: !141, size: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !137, file: !138, line: 57, baseType: !155, size: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !21, line: 152, baseType: !28)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !137, file: !138, line: 61, baseType: !157, size: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !21, line: 175, baseType: !28)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !137, file: !138, line: 63, baseType: !159, size: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !21, line: 180, baseType: !28)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !137, file: !138, line: 74, baseType: !161, size: 128, offset: 576)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !162, line: 11, size: 128, elements: !163)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !161, file: !162, line: 16, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !21, line: 160, baseType: !28)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !161, file: !162, line: 21, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !21, line: 197, baseType: !28)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !137, file: !138, line: 75, baseType: !161, size: 128, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !137, file: !138, line: 76, baseType: !161, size: 128, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !137, file: !138, line: 89, baseType: !171, size: 192, offset: 960)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 192, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 3)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !128, file: !129, line: 21, baseType: !26, size: 64, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !128, file: !129, line: 22, baseType: !26, size: 64, offset: 1408)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !128, file: !129, line: 24, baseType: !177, size: 64, offset: 1472)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !44, line: 20, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !180, line: 50, size: 640, elements: !181)
!180 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f35895306f847777914ce99ffeccfabd")
!181 = !{!182, !183, !195, !198, !201, !206, !207, !212, !213, !214}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !179, file: !180, line: 51, baseType: !11, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !179, file: !180, line: 52, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !44, line: 21, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !63, line: 89, size: 320, elements: !187)
!187 = !{!188, !189, !190, !194}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !186, file: !63, line: 90, baseType: !132, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !63, line: 91, baseType: !66, size: 128, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !186, file: !63, line: 93, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !184, !177}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !63, line: 94, baseType: !16, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !179, file: !180, line: 54, baseType: !196, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !197, line: 98, baseType: !15)
!197 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "eac8f0294f941da9268c3a72c9fca0e1")
!198 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !179, file: !180, line: 56, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !200, line: 10, baseType: !165)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!201 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !179, file: !180, line: 58, baseType: !202, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !180, line: 45, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!17, !177, !17, !38}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !180, line: 59, baseType: !16, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !179, file: !180, line: 61, baseType: !208, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !180, line: 46, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !177, !11, !17, !38}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !179, file: !180, line: 62, baseType: !16, size: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !179, file: !180, line: 70, baseType: !51, size: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !180, line: 72, baseType: !177, size: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !128, file: !129, line: 37, baseType: !36, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !128, file: !129, line: 38, baseType: !36, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !116, file: !24, line: 30, baseType: !114, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !116, file: !24, line: 34, baseType: !36, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !116, file: !24, line: 40, baseType: !36, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !116, file: !24, line: 43, baseType: !36, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !116, file: !24, line: 45, baseType: !36, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !116, file: !24, line: 46, baseType: !36, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !116, file: !24, line: 47, baseType: !36, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !116, file: !24, line: 48, baseType: !36, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !116, file: !24, line: 49, baseType: !36, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !116, file: !24, line: 50, baseType: !36, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !116, file: !24, line: 52, baseType: !36, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !116, file: !24, line: 53, baseType: !36, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !116, file: !24, line: 55, baseType: !25, size: 32, offset: 608)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !111, file: !24, line: 61, baseType: !109, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !95, file: !96, line: 62, baseType: !232, size: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !96, line: 41, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !96, line: 43, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !96, line: 44, baseType: !232, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !234, file: !96, line: 45, baseType: !16, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !95, file: !96, line: 63, baseType: !239, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !96, line: 32, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !96, line: 34, size: 192, elements: !242)
!242 = !{!243, !248, !249}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !241, file: !96, line: 35, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !96, line: 30, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !16}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !96, line: 36, baseType: !16, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !96, line: 37, baseType: !239, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !95, file: !96, line: 64, baseType: !177, size: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !79, file: !63, line: 120, baseType: !252, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !44, line: 17, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !255, line: 47, size: 5184, elements: !256)
!255 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "084646d0d3ecf791b89c14281fd46376")
!256 = !{!257, !261, !262, !263, !264, !265, !511, !512, !513, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !560, !561}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !254, file: !255, line: 48, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !254, file: !255, line: 49, baseType: !93, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !254, file: !255, line: 51, baseType: !177, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !254, file: !255, line: 52, baseType: !178, size: 640, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !254, file: !255, line: 54, baseType: !11, size: 64, offset: 832)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !254, file: !255, line: 56, baseType: !266, size: 64, offset: 896)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !44, line: 26, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !270, line: 124, size: 1920, elements: !271)
!270 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf513a87e959064e14502903e9282b0e")
!271 = !{!272, !273, !330, !331, !334, !342, !344, !349, !354, !433, !434, !435, !436, !437, !438, !439, !440, !441, !446, !487, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !270, line: 125, baseType: !16, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !269, file: !270, line: 126, baseType: !274, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !44, line: 24, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !277, line: 30, size: 768, elements: !278)
!277 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c79f651cc4aca504d9d912404beb8bf3")
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !307, !308, !309, !322}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !277, line: 31, baseType: !16, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !276, file: !277, line: 33, baseType: !36, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !276, file: !277, line: 35, baseType: !36, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !276, file: !277, line: 38, baseType: !36, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !276, file: !277, line: 44, baseType: !36, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !276, file: !277, line: 46, baseType: !36, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !276, file: !277, line: 49, baseType: !36, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !276, file: !277, line: 51, baseType: !36, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !276, file: !277, line: 54, baseType: !36, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !276, file: !277, line: 56, baseType: !36, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !276, file: !277, line: 57, baseType: !36, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !276, file: !277, line: 59, baseType: !36, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !276, file: !277, line: 60, baseType: !36, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !276, file: !277, line: 62, baseType: !36, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !276, file: !277, line: 64, baseType: !36, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !276, file: !277, line: 67, baseType: !36, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !276, file: !277, line: 69, baseType: !36, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !276, file: !277, line: 71, baseType: !36, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !276, file: !277, line: 74, baseType: !36, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !276, file: !277, line: 75, baseType: !36, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "skip_socket_leak_check", scope: !276, file: !277, line: 77, baseType: !36, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !276, file: !277, line: 80, baseType: !36, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !276, file: !277, line: 110, baseType: !36, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !276, file: !277, line: 113, baseType: !303, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !44, line: 32, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !274}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !276, file: !277, line: 120, baseType: !11, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !276, file: !277, line: 122, baseType: !177, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !276, file: !277, line: 124, baseType: !310, size: 320, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !311, line: 20, baseType: !312)
!311 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ee5b3151c1c48b156833d321f8e1946a")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !311, line: 22, size: 320, elements: !313)
!313 = !{!314, !316, !318, !319, !320, !321}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !312, file: !311, line: 23, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !311, line: 16, baseType: !11)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !312, file: !311, line: 24, baseType: !317, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !312, file: !311, line: 25, baseType: !317, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !312, file: !311, line: 26, baseType: !317, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !312, file: !311, line: 27, baseType: !18, size: 8, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !311, line: 28, baseType: !18, size: 8, offset: 264)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !276, file: !277, line: 127, baseType: !323, size: 128, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !324, line: 16, baseType: !325)
!324 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !324, line: 18, size: 128, elements: !326)
!326 = !{!327, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !325, file: !324, line: 19, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !324, line: 20, baseType: !328, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !269, file: !270, line: 127, baseType: !274, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !269, file: !270, line: 129, baseType: !332, size: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !333, line: 17, baseType: !25)
!333 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ad64fd7b9f2b4876e8c9dcdeeb2305ce")
!334 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !269, file: !270, line: 131, baseType: !335, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !336, line: 19, baseType: !337)
!336 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!340, !267, !17, !38}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !19, line: 108, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !21, line: 194, baseType: !28)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !269, file: !270, line: 132, baseType: !343, size: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !336, line: 22, baseType: !337)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !269, file: !270, line: 133, baseType: !345, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !336, line: 20, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!340, !267, !109, !26}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !269, file: !270, line: 134, baseType: !350, size: 64, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !336, line: 23, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!109, !267, !109, !26}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !269, file: !270, line: 136, baseType: !355, size: 64, offset: 512)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !270, line: 16, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !270, line: 18, size: 2432, elements: !358)
!358 = !{!359, !360, !373, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !391, !392, !393, !394, !395, !396, !399, !400, !401, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !357, file: !270, line: 19, baseType: !332, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !357, file: !270, line: 21, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !363, line: 180, size: 128, elements: !364)
!363 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!364 = !{!365, !369}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !362, file: !363, line: 182, baseType: !366, size: 16)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !367, line: 28, baseType: !368)
!367 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!368 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !362, file: !363, line: 183, baseType: !370, size: 112, offset: 16)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 14)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !357, file: !270, line: 22, baseType: !374, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !375, line: 274, baseType: !376)
!375 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !21, line: 210, baseType: !36)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !357, file: !270, line: 23, baseType: !38, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !357, file: !270, line: 24, baseType: !66, size: 128, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !357, file: !270, line: 26, baseType: !25, size: 32, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !357, file: !270, line: 28, baseType: !25, size: 32, offset: 416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !357, file: !270, line: 29, baseType: !25, size: 32, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !357, file: !270, line: 30, baseType: !25, size: 32, offset: 480)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !357, file: !270, line: 32, baseType: !25, size: 32, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !357, file: !270, line: 33, baseType: !25, size: 32, offset: 544)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !357, file: !270, line: 34, baseType: !25, size: 32, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !357, file: !270, line: 38, baseType: !387, size: 64, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !44, line: 33, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !267}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !357, file: !270, line: 40, baseType: !16, size: 64, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !357, file: !270, line: 42, baseType: !178, size: 640, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !357, file: !270, line: 43, baseType: !177, size: 64, offset: 1408)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !357, file: !270, line: 45, baseType: !38, size: 64, offset: 1472)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !357, file: !270, line: 47, baseType: !38, size: 64, offset: 1536)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !357, file: !270, line: 49, baseType: !397, size: 64, offset: 1600)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !398, line: 16, baseType: !315)
!398 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !357, file: !270, line: 51, baseType: !355, size: 64, offset: 1664)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !357, file: !270, line: 52, baseType: !267, size: 64, offset: 1728)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !357, file: !270, line: 54, baseType: !402, size: 192, offset: 1792)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !311, line: 32, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !311, line: 37, size: 192, elements: !404)
!404 = !{!405, !406, !407}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !403, file: !311, line: 38, baseType: !317, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !403, file: !311, line: 39, baseType: !317, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !403, file: !311, line: 40, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !311, line: 34, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !317, !317, !317}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !357, file: !270, line: 55, baseType: !310, size: 320, offset: 1984)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !357, file: !270, line: 57, baseType: !11, size: 64, offset: 2304)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !357, file: !270, line: 59, baseType: !36, size: 1, offset: 2368, flags: DIFlagBitField, extraData: i64 2368)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !357, file: !270, line: 60, baseType: !36, size: 1, offset: 2369, flags: DIFlagBitField, extraData: i64 2368)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !357, file: !270, line: 61, baseType: !36, size: 1, offset: 2370, flags: DIFlagBitField, extraData: i64 2368)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !357, file: !270, line: 63, baseType: !36, size: 1, offset: 2371, flags: DIFlagBitField, extraData: i64 2368)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !357, file: !270, line: 64, baseType: !36, size: 1, offset: 2372, flags: DIFlagBitField, extraData: i64 2368)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !357, file: !270, line: 65, baseType: !36, size: 1, offset: 2373, flags: DIFlagBitField, extraData: i64 2368)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !357, file: !270, line: 66, baseType: !36, size: 1, offset: 2374, flags: DIFlagBitField, extraData: i64 2368)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !357, file: !270, line: 67, baseType: !36, size: 1, offset: 2375, flags: DIFlagBitField, extraData: i64 2368)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !357, file: !270, line: 68, baseType: !36, size: 1, offset: 2376, flags: DIFlagBitField, extraData: i64 2368)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !357, file: !270, line: 69, baseType: !36, size: 1, offset: 2377, flags: DIFlagBitField, extraData: i64 2368)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !357, file: !270, line: 70, baseType: !36, size: 1, offset: 2378, flags: DIFlagBitField, extraData: i64 2368)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !357, file: !270, line: 73, baseType: !36, size: 1, offset: 2379, flags: DIFlagBitField, extraData: i64 2368)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !357, file: !270, line: 75, baseType: !36, size: 1, offset: 2380, flags: DIFlagBitField, extraData: i64 2368)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !357, file: !270, line: 76, baseType: !36, size: 1, offset: 2381, flags: DIFlagBitField, extraData: i64 2368)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !357, file: !270, line: 77, baseType: !36, size: 2, offset: 2382, flags: DIFlagBitField, extraData: i64 2368)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !357, file: !270, line: 79, baseType: !36, size: 1, offset: 2384, flags: DIFlagBitField, extraData: i64 2368)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !357, file: !270, line: 80, baseType: !36, size: 1, offset: 2385, flags: DIFlagBitField, extraData: i64 2368)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !357, file: !270, line: 81, baseType: !36, size: 1, offset: 2386, flags: DIFlagBitField, extraData: i64 2368)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !357, file: !270, line: 90, baseType: !25, size: 32, offset: 2400)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !269, file: !270, line: 138, baseType: !26, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !269, file: !270, line: 140, baseType: !177, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !269, file: !270, line: 142, baseType: !93, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !269, file: !270, line: 144, baseType: !25, size: 32, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !269, file: !270, line: 146, baseType: !361, size: 64, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !269, file: !270, line: 147, baseType: !374, size: 32, offset: 896)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !269, file: !270, line: 148, baseType: !66, size: 128, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !269, file: !270, line: 150, baseType: !66, size: 128, offset: 1088)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !269, file: !270, line: 151, baseType: !442, size: 16, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !443, line: 123, baseType: !444)
!443 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !34, line: 25, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !21, line: 40, baseType: !368)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !269, file: !270, line: 154, baseType: !447, size: 64, offset: 1280)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !44, line: 29, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !450, line: 74, size: 704, elements: !451)
!450 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "51639b814b1b55c5b35047c033281672")
!451 = !{!452, !457, !461, !465, !466, !467, !468, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !449, file: !450, line: 75, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !455, line: 184, baseType: !456)
!455 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !455, line: 184, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !449, file: !450, line: 76, baseType: !458, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !455, line: 185, baseType: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !455, line: 185, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !449, file: !450, line: 78, baseType: !462, size: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !12, line: 78, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !375, line: 267, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !21, line: 207, baseType: !28)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !449, file: !450, line: 79, baseType: !114, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !449, file: !450, line: 80, baseType: !38, size: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !449, file: !450, line: 82, baseType: !387, size: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !449, file: !450, line: 84, baseType: !469, size: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !471, line: 231, baseType: !472)
!471 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "848d42aedd0da44ffda19088217823c7")
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !471, line: 231, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !449, file: !450, line: 85, baseType: !387, size: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !449, file: !450, line: 87, baseType: !303, size: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !449, file: !450, line: 88, baseType: !303, size: 64, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !449, file: !450, line: 90, baseType: !18, size: 8, offset: 640)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !449, file: !450, line: 92, baseType: !36, size: 1, offset: 648, flags: DIFlagBitField, extraData: i64 648)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !449, file: !450, line: 93, baseType: !36, size: 1, offset: 649, flags: DIFlagBitField, extraData: i64 648)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !449, file: !450, line: 94, baseType: !36, size: 1, offset: 650, flags: DIFlagBitField, extraData: i64 648)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !449, file: !450, line: 95, baseType: !36, size: 1, offset: 651, flags: DIFlagBitField, extraData: i64 648)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !449, file: !450, line: 96, baseType: !36, size: 1, offset: 652, flags: DIFlagBitField, extraData: i64 648)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !449, file: !450, line: 97, baseType: !36, size: 1, offset: 653, flags: DIFlagBitField, extraData: i64 648)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !449, file: !450, line: 98, baseType: !36, size: 1, offset: 654, flags: DIFlagBitField, extraData: i64 648)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !449, file: !450, line: 99, baseType: !36, size: 1, offset: 655, flags: DIFlagBitField, extraData: i64 648)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !449, file: !450, line: 100, baseType: !36, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 648)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !449, file: !450, line: 101, baseType: !36, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 648)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !269, file: !270, line: 157, baseType: !488, size: 64, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !44, line: 30, baseType: !490)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !44, line: 30, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !269, file: !270, line: 159, baseType: !361, size: 64, offset: 1408)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !269, file: !270, line: 160, baseType: !374, size: 32, offset: 1472)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !269, file: !270, line: 162, baseType: !114, size: 64, offset: 1536)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !269, file: !270, line: 164, baseType: !323, size: 128, offset: 1600)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !269, file: !270, line: 166, baseType: !196, size: 64, offset: 1728)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !269, file: !270, line: 168, baseType: !11, size: 64, offset: 1792)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !269, file: !270, line: 170, baseType: !36, size: 8, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !269, file: !270, line: 172, baseType: !36, size: 3, offset: 1864, flags: DIFlagBitField, extraData: i64 1856)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !269, file: !270, line: 174, baseType: !36, size: 1, offset: 1867, flags: DIFlagBitField, extraData: i64 1856)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !269, file: !270, line: 175, baseType: !36, size: 1, offset: 1868, flags: DIFlagBitField, extraData: i64 1856)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !269, file: !270, line: 176, baseType: !36, size: 1, offset: 1869, flags: DIFlagBitField, extraData: i64 1856)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !269, file: !270, line: 178, baseType: !36, size: 1, offset: 1870, flags: DIFlagBitField, extraData: i64 1856)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !269, file: !270, line: 179, baseType: !36, size: 1, offset: 1871, flags: DIFlagBitField, extraData: i64 1856)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !269, file: !270, line: 180, baseType: !36, size: 1, offset: 1872, flags: DIFlagBitField, extraData: i64 1856)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !269, file: !270, line: 181, baseType: !36, size: 1, offset: 1873, flags: DIFlagBitField, extraData: i64 1856)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !269, file: !270, line: 183, baseType: !36, size: 1, offset: 1874, flags: DIFlagBitField, extraData: i64 1856)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !269, file: !270, line: 184, baseType: !36, size: 1, offset: 1875, flags: DIFlagBitField, extraData: i64 1856)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !269, file: !270, line: 185, baseType: !36, size: 2, offset: 1876, flags: DIFlagBitField, extraData: i64 1856)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !269, file: !270, line: 186, baseType: !36, size: 2, offset: 1878, flags: DIFlagBitField, extraData: i64 1856)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !269, file: !270, line: 188, baseType: !36, size: 1, offset: 1880, flags: DIFlagBitField, extraData: i64 1856)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !254, file: !255, line: 57, baseType: !267, size: 64, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !254, file: !255, line: 58, baseType: !11, size: 64, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !254, file: !255, line: 60, baseType: !514, size: 64, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !254, file: !255, line: 61, baseType: !11, size: 64, offset: 1152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !254, file: !255, line: 62, baseType: !11, size: 64, offset: 1216)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !254, file: !255, line: 64, baseType: !323, size: 128, offset: 1280)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !254, file: !255, line: 65, baseType: !11, size: 64, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !254, file: !255, line: 67, baseType: !84, size: 320, offset: 1472)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !254, file: !255, line: 68, baseType: !84, size: 320, offset: 1792)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !254, file: !255, line: 70, baseType: !84, size: 320, offset: 2112)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !254, file: !255, line: 71, baseType: !402, size: 192, offset: 2432)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !254, file: !255, line: 72, baseType: !310, size: 320, offset: 2624)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !254, file: !255, line: 74, baseType: !526, size: 448, offset: 2944)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !527, line: 31, baseType: !528)
!527 = !DIFile(filename: "src/core/ngx_list.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "580525d954b127a1c35170a83ca4d8b1")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !527, line: 25, size: 448, elements: !529)
!529 = !{!530, !538, !539, !540, !541}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !528, file: !527, line: 26, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !527, line: 16, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !527, line: 18, size: 192, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !533, file: !527, line: 19, baseType: !16, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !533, file: !527, line: 20, baseType: !11, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !533, file: !527, line: 21, baseType: !531, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !528, file: !527, line: 27, baseType: !532, size: 192, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !528, file: !527, line: 28, baseType: !38, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !528, file: !527, line: 29, baseType: !11, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !528, file: !527, line: 30, baseType: !93, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !254, file: !255, line: 75, baseType: !526, size: 448, offset: 3392)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !254, file: !255, line: 77, baseType: !11, size: 64, offset: 3840)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !254, file: !255, line: 78, baseType: !11, size: 64, offset: 3904)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !254, file: !255, line: 80, baseType: !267, size: 64, offset: 3968)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !254, file: !255, line: 81, baseType: !274, size: 64, offset: 4032)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !254, file: !255, line: 82, baseType: !274, size: 64, offset: 4096)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !254, file: !255, line: 84, baseType: !252, size: 64, offset: 4160)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !254, file: !255, line: 86, baseType: !66, size: 128, offset: 4224)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !254, file: !255, line: 87, baseType: !66, size: 128, offset: 4352)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !254, file: !255, line: 88, baseType: !66, size: 128, offset: 4480)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !254, file: !255, line: 89, baseType: !66, size: 128, offset: 4608)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !254, file: !255, line: 90, baseType: !66, size: 128, offset: 4736)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !254, file: !255, line: 91, baseType: !66, size: 128, offset: 4864)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_handler", scope: !254, file: !255, line: 93, baseType: !556, size: 64, offset: 4992)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_intercept_pt", file: !255, line: 34, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!462, !177, !11, !17, !38}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_data", scope: !254, file: !255, line: 94, baseType: !16, size: 64, offset: 5056)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "entered_logger", scope: !254, file: !255, line: 95, baseType: !36, size: 32, offset: 5120)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !79, file: !63, line: 121, baseType: !93, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !79, file: !63, line: 122, baseType: !93, size: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !79, file: !63, line: 123, baseType: !565, size: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !63, line: 103, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 98, size: 1792, elements: !568)
!568 = !{!569, !570, !571, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !567, file: !63, line: 99, baseType: !127, size: 1600)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !567, file: !63, line: 100, baseType: !114, size: 64, offset: 1600)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !567, file: !63, line: 101, baseType: !114, size: 64, offset: 1664)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !567, file: !63, line: 102, baseType: !11, size: 64, offset: 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !79, file: !63, line: 124, baseType: !177, size: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !79, file: !63, line: 126, baseType: !16, size: 64, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !79, file: !63, line: 127, baseType: !11, size: 64, offset: 512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !79, file: !63, line: 128, baseType: !11, size: 64, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !79, file: !63, line: 130, baseType: !578, size: 64, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !63, line: 112, baseType: !74)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !79, file: !63, line: 131, baseType: !16, size: 64, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !62, file: !63, line: 81, baseType: !11, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !62, file: !63, line: 82, baseType: !11, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !62, file: !63, line: 83, baseType: !16, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !45, file: !46, line: 236, baseType: !11, size: 64, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !45, file: !46, line: 238, baseType: !585, size: 64, offset: 640)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!462, !177}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !45, file: !46, line: 240, baseType: !589, size: 64, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!462, !252}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !45, file: !46, line: 242, baseType: !589, size: 64, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !45, file: !46, line: 243, baseType: !589, size: 64, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !45, file: !46, line: 244, baseType: !595, size: 64, offset: 896)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !252}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !45, file: !46, line: 245, baseType: !595, size: 64, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !45, file: !46, line: 247, baseType: !595, size: 64, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !45, file: !46, line: 249, baseType: !13, size: 64, offset: 1088)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !45, file: !46, line: 250, baseType: !13, size: 64, offset: 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !45, file: !46, line: 251, baseType: !13, size: 64, offset: 1216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !45, file: !46, line: 252, baseType: !13, size: 64, offset: 1280)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !45, file: !46, line: 253, baseType: !13, size: 64, offset: 1344)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !45, file: !46, line: 254, baseType: !13, size: 64, offset: 1408)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !45, file: !46, line: 255, baseType: !13, size: 64, offset: 1472)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !45, file: !46, line: 256, baseType: !13, size: 64, offset: 1536)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 11)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "ngx_http_gzip_ratio", scope: !9, file: !2, line: 232, type: !66, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1146, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 10)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "ngx_http_next_header_filter", scope: !9, file: !2, line: 234, type: !622, isLocal: true, isDefinition: true)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_output_header_filter_pt", file: !623, line: 512, baseType: !624)
!623 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "01bbc621c19214151ccc7d6928049534")
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!462, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !629, line: 16, baseType: !630)
!629 = !DIFile(filename: "src/http/ngx_http.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "936639e5730ac898b9486f4f53b5f2f5")
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !631, line: 371, size: 11456, elements: !632)
!631 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1757f93ddb5cd3c545713a957f23192d")
!632 = !{!633, !634, !635, !636, !637, !638, !639, !644, !645, !861, !1455, !1456, !1457, !1458, !1500, !1532, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1578, !1589, !1596, !1597, !1599, !1600, !1613, !1614, !1615, !1616, !1617, !1618, !1803, !1807, !1812, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !630, file: !631, line: 372, baseType: !33, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !630, file: !631, line: 374, baseType: !267, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !630, file: !631, line: 376, baseType: !260, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !630, file: !631, line: 377, baseType: !260, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !630, file: !631, line: 378, baseType: !260, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !630, file: !631, line: 379, baseType: !260, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !630, file: !631, line: 381, baseType: !640, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !631, line: 368, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !627}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !630, file: !631, line: 382, baseType: !640, size: 64, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !630, file: !631, line: 385, baseType: !646, size: 64, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !629, line: 18, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !649, line: 65, size: 4800, elements: !650)
!649 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "04ea2ebc84c597718a4782ab3cabf19d")
!650 = !{!651, !652, !653, !654, !658, !659, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !819, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !648, file: !649, line: 66, baseType: !127, size: 1600)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !648, file: !649, line: 67, baseType: !84, size: 320, offset: 1600)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !648, file: !649, line: 68, baseType: !33, size: 32, offset: 1920)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !648, file: !649, line: 69, baseType: !655, size: 128, offset: 1952)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 16)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !648, file: !649, line: 70, baseType: !655, size: 128, offset: 2080)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !648, file: !649, line: 72, baseType: !660, size: 64, offset: 2240)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !133, line: 18, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !19, line: 49, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !21, line: 149, baseType: !15)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !648, file: !649, line: 73, baseType: !199, size: 64, offset: 2304)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !648, file: !649, line: 74, baseType: !199, size: 64, offset: 2368)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !648, file: !649, line: 75, baseType: !199, size: 64, offset: 2432)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !648, file: !649, line: 76, baseType: !199, size: 64, offset: 2496)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !648, file: !649, line: 77, baseType: !199, size: 64, offset: 2560)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !648, file: !649, line: 79, baseType: !66, size: 128, offset: 2624)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !648, file: !649, line: 80, baseType: !66, size: 128, offset: 2752)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !648, file: !649, line: 81, baseType: !655, size: 128, offset: 2880)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !648, file: !649, line: 83, baseType: !38, size: 64, offset: 3008)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !648, file: !649, line: 84, baseType: !38, size: 64, offset: 3072)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !648, file: !649, line: 85, baseType: !26, size: 64, offset: 3136)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !648, file: !649, line: 86, baseType: !26, size: 64, offset: 3200)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !648, file: !649, line: 88, baseType: !11, size: 64, offset: 3264)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !648, file: !649, line: 89, baseType: !11, size: 64, offset: 3328)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !648, file: !649, line: 90, baseType: !11, size: 64, offset: 3392)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !648, file: !649, line: 91, baseType: !11, size: 64, offset: 3456)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !648, file: !649, line: 93, baseType: !114, size: 64, offset: 3520)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !648, file: !649, line: 95, baseType: !681, size: 64, offset: 3584)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !629, line: 19, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !649, line: 157, size: 1088, elements: !684)
!684 = !{!685, !700, !761, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !818}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !683, file: !649, line: 158, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !649, line: 154, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 145, size: 960, elements: !689)
!689 = !{!690, !691, !692, !693, !696, !697, !698, !699}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !688, file: !649, line: 146, baseType: !402, size: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !688, file: !649, line: 147, baseType: !310, size: 320, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !688, file: !649, line: 148, baseType: !323, size: 128, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !688, file: !649, line: 149, baseType: !694, size: 64, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !197, line: 106, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !196)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !688, file: !649, line: 150, baseType: !694, size: 64, offset: 704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !688, file: !649, line: 151, baseType: !26, size: 64, offset: 768)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !688, file: !649, line: 152, baseType: !11, size: 64, offset: 832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !688, file: !649, line: 153, baseType: !11, size: 64, offset: 896)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !683, file: !649, line: 159, baseType: !701, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !703, line: 59, baseType: !704)
!703 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6137611cd598fa2ecc498e6967a03177")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !703, line: 34, size: 1600, elements: !705)
!705 = !{!706, !713, !714, !715, !723, !724, !725, !734, !735, !736, !737, !756, !757, !758, !759, !760}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !704, file: !703, line: 35, baseType: !707, size: 128)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !708, line: 21, baseType: !709)
!708 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "56a332e5761f46e2bb83cbdaf8b18a9f")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !708, line: 16, size: 128, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !709, file: !708, line: 17, baseType: !694, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !709, file: !708, line: 19, baseType: !694, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !704, file: !703, line: 37, baseType: !38, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !704, file: !703, line: 38, baseType: !38, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !704, file: !703, line: 40, baseType: !716, size: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !703, line: 16, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !703, line: 18, size: 192, elements: !719)
!719 = !{!720, !721, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !718, file: !703, line: 19, baseType: !13, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !718, file: !703, line: 20, baseType: !716, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !718, file: !703, line: 21, baseType: !13, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !704, file: !703, line: 41, baseType: !716, size: 64, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !704, file: !703, line: 42, baseType: !717, size: 192, offset: 384)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !704, file: !703, line: 44, baseType: !726, size: 64, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !703, line: 31, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !703, line: 25, size: 256, elements: !729)
!729 = !{!730, !731, !732, !733}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !728, file: !703, line: 26, baseType: !11, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !728, file: !703, line: 27, baseType: !11, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !728, file: !703, line: 29, baseType: !11, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !728, file: !703, line: 30, baseType: !11, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !704, file: !703, line: 45, baseType: !11, size: 64, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !704, file: !703, line: 47, baseType: !17, size: 64, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !704, file: !703, line: 48, baseType: !17, size: 64, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !704, file: !703, line: 50, baseType: !738, size: 512, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !708, line: 37, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !708, line: 24, size: 512, elements: !740)
!740 = !{!741, !743, !744, !745, !755}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !739, file: !708, line: 26, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !739, file: !708, line: 28, baseType: !742, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !739, file: !708, line: 29, baseType: !11, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !739, file: !708, line: 30, baseType: !746, size: 256, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !747, line: 39, baseType: !748)
!747 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !747, line: 35, size: 256, elements: !749)
!749 = !{!750, !754}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !748, file: !747, line: 37, baseType: !751, size: 256)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !748, file: !747, line: 38, baseType: !28, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !739, file: !708, line: 36, baseType: !11, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !704, file: !703, line: 52, baseType: !17, size: 64, offset: 1344)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !704, file: !703, line: 53, baseType: !18, size: 8, offset: 1408)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !704, file: !703, line: 55, baseType: !36, size: 1, offset: 1416, flags: DIFlagBitField, extraData: i64 1416)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !704, file: !703, line: 57, baseType: !16, size: 64, offset: 1472)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !704, file: !703, line: 58, baseType: !16, size: 64, offset: 1536)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !683, file: !649, line: 161, baseType: !762, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !129, line: 62, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 50, size: 768, elements: !765)
!765 = !{!766, !767, !768, !770, !775, !777, !779, !780, !781}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !764, file: !129, line: 51, baseType: !66, size: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !764, file: !129, line: 52, baseType: !38, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !764, file: !129, line: 53, baseType: !769, size: 192, offset: 192)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 192, elements: !172)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !764, file: !129, line: 55, baseType: !771, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !129, line: 45, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!397, !16}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !764, file: !129, line: 56, baseType: !776, size: 64, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !129, line: 46, baseType: !772)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !764, file: !129, line: 57, baseType: !778, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !129, line: 47, baseType: !245)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !764, file: !129, line: 58, baseType: !16, size: 64, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !764, file: !129, line: 60, baseType: !17, size: 64, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !764, file: !129, line: 61, baseType: !11, size: 64, offset: 704)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !683, file: !649, line: 163, baseType: !26, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !683, file: !649, line: 164, baseType: !38, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !683, file: !649, line: 166, baseType: !199, size: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !683, file: !649, line: 168, baseType: !199, size: 64, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !683, file: !649, line: 170, baseType: !11, size: 64, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !683, file: !649, line: 171, baseType: !11, size: 64, offset: 512)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !683, file: !649, line: 172, baseType: !397, size: 64, offset: 576)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !683, file: !649, line: 173, baseType: !397, size: 64, offset: 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !683, file: !649, line: 174, baseType: !397, size: 64, offset: 704)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !683, file: !649, line: 176, baseType: !11, size: 64, offset: 768)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !683, file: !649, line: 177, baseType: !397, size: 64, offset: 832)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !683, file: !649, line: 178, baseType: !397, size: 64, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !683, file: !649, line: 180, baseType: !795, size: 64, offset: 960)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !255, line: 31, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !255, line: 37, size: 704, elements: !798)
!798 = !{!799, !800, !810, !815, !816, !817}
