; ModuleID = 'samples/602.bc'
source_filename = "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q/spack-src/src/mod_wstunnel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.config_plugin_keys_t = type { ptr, i8, i8, i8 }
%struct.plugin = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr }
%struct.plugin_data = type { i32, i32, ptr, ptr, i32, %struct.plugin_config, %struct.plugin_config }
%struct.plugin_config = type { %struct.gw_plugin_config, ptr, i32, i16 }
%struct.gw_plugin_config = type { ptr, ptr, ptr, ptr, i32, i32, i32 }
%struct.config_plugin_value = type { i32, i32, %union.v_u }
%union.v_u = type { ptr }
%struct.gw_exts = type { ptr, i32, i32 }
%struct.server = type { ptr, ptr, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, i64, [3 x double], ptr, %struct.server_config, ptr, %struct.server_socket_array, %struct.server_socket_array, %struct.anon, i64, i64, i32, i32, i32, i32, ptr, ptr, ptr }
%struct.server_config = type { i32, i8, i8, i8, i8, i8, i8, i8, i8, i16, i16, i16, i16, i16, i32, ptr, i8, i8, i8, i8, i8, i8, i8, i8, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct.array }
%struct.array = type { ptr, ptr, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 642, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "spack-src/src/mod_wstunnel.c", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "555fd87eec0e713d8c8fafcbc2859b02")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 9)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "cpk", scope: !9, file: !2, line: 241, type: !1371, isLocal: true, isDefinition: true)
!9 = distinct !DISubprogram(name: "mod_wstunnel_set_defaults", scope: !2, file: !2, line: 240, type: !10, scopeLine: 240, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !689, retainedNodes: !1334)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !22, !28}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "handler_t", file: !13, line: 38, baseType: !14)
!13 = !DIFile(filename: "spack-src/src/base_decls.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "8960b8ee22f07d697e266aa4c1b4b9fa")
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "handler_t", file: !13, line: 31, baseType: !15, size: 32, elements: !16)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "HANDLER_GO_ON", value: 0)
!18 = !DIEnumerator(name: "HANDLER_FINISHED", value: 1)
!19 = !DIEnumerator(name: "HANDLER_COMEBACK", value: 2)
!20 = !DIEnumerator(name: "HANDLER_WAIT_FOR_EVENT", value: 3)
!21 = !DIEnumerator(name: "HANDLER_ERROR", value: 4)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "server", file: !13, line: 7, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server", file: !25, line: 142, size: 3392, elements: !26)
!25 = !DIFile(filename: "spack-src/src/base.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "688d87806a27e3440599218f92fa31fd")
!26 = !{!27, !29, !86, !88, !92, !165, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !617, !618, !659, !660, !669, !670, !675, !676, !677, !680, !683, !684, !685, !686, !688}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_slots", scope: !24, file: !25, line: 143, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "config_context", scope: !24, file: !25, line: 144, baseType: !30, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "array", file: !32, line: 31, baseType: !33)
!32 = !DIFile(filename: "spack-src/src/array.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "1cf4a1ef37ac70f79ceaa3d29a995d97")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 25, size: 192, elements: !34)
!34 = !{!35, !83, !84, !85}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !33, file: !32, line: 26, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "data_unset", file: !32, line: 23, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "data_unset", file: !32, line: 21, size: 256, elements: !40)
!40 = !{!41, !54, !74}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !39, file: !32, line: 22, baseType: !42, size: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "buffer", file: !43, line: 29, baseType: !44)
!43 = !DIFile(filename: "spack-src/src/buffer.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "83c8b506d008193bd35bbe68f14e1c2a")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 22, size: 128, elements: !45)
!45 = !{!46, !48, !53}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !44, file: !43, line: 23, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !44, file: !43, line: 26, baseType: !49, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !50, line: 26, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !52, line: 42, baseType: !15)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !44, file: !43, line: 28, baseType: !49, size: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !39, file: !32, line: 22, baseType: !55, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "data_methods", file: !32, line: 9, size: 192, elements: !58)
!58 = !{!59, !66, !70}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !57, file: !32, line: 10, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !57, file: !32, line: 11, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !63}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "insert_dup", scope: !57, file: !32, line: 12, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !63, !63}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !32, line: 22, baseType: !75, size: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "data_type_t", file: !32, line: 15, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 15, baseType: !15, size: 32, elements: !77)
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIEnumerator(name: "TYPE_STRING", value: 0)
!79 = !DIEnumerator(name: "TYPE_ARRAY", value: 1)
!80 = !DIEnumerator(name: "TYPE_INTEGER", value: 2)
!81 = !DIEnumerator(name: "TYPE_CONFIG", value: 3)
!82 = !DIEnumerator(name: "TYPE_OTHER", value: 4)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !33, file: !32, line: 27, baseType: !36, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !33, file: !32, line: 29, baseType: !49, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !32, line: 30, baseType: !49, size: 32, offset: 160)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "config_captures", scope: !24, file: !25, line: 145, baseType: !87, size: 32, offset: 128)
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ev", scope: !24, file: !25, line: 147, baseType: !89, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "fdevents", file: !91, line: 294, flags: DIFlagFwdDecl)
!91 = !DIFile(filename: "spack-src/src/gw_backend.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "69c17243e65de239e9168b875f34faf4")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "network_backend_write", scope: !24, file: !25, line: 148, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!87, !87, !96, !116, !148}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunkqueue", file: !98, line: 55, baseType: !99)
!98 = !DIFile(filename: "spack-src/src/chunk.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "68721e47e09305b31f90225c328df0d0")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chunkqueue", file: !98, line: 46, size: 448, elements: !100)
!100 = !{!101, !140, !141, !142, !143, !146, !147}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !99, file: !98, line: 47, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk", file: !98, line: 44, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chunk", file: !98, line: 20, size: 576, elements: !105)
!105 = !{!106, !108, !113, !115, !120}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !98, line: 21, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !98, line: 22, baseType: !109, size: 32, offset: 64)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !104, file: !98, line: 22, baseType: !15, size: 32, elements: !110)
!110 = !{!111, !112}
!111 = !DIEnumerator(name: "MEM_CHUNK", value: 0)
!112 = !DIEnumerator(name: "FILE_CHUNK", value: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !104, file: !98, line: 24, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !104, file: !98, line: 30, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !117, line: 87, baseType: !118)
!117 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !52, line: 153, baseType: !119)
!119 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !104, file: !98, line: 43, baseType: !121, size: 320, offset: 256)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !104, file: !98, line: 32, size: 320, elements: !122)
!122 = !{!123, !124, !125, !126, !135, !136}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !121, file: !98, line: 34, baseType: !116, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !121, file: !98, line: 36, baseType: !87, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "is_temp", scope: !121, file: !98, line: 37, baseType: !87, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !121, file: !98, line: 39, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_file_view", file: !98, line: 18, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chunk_file_view", file: !98, line: 13, size: 256, elements: !130)
!130 = !{!131, !132, !133, !134}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mptr", scope: !129, file: !98, line: 14, baseType: !47, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mlen", scope: !129, file: !98, line: 15, baseType: !116, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "foff", scope: !129, file: !98, line: 16, baseType: !116, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !129, file: !98, line: 17, baseType: !87, size: 32, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !121, file: !98, line: 41, baseType: !28, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "refchg", scope: !121, file: !98, line: 42, baseType: !137, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !28, !87}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !99, file: !98, line: 48, baseType: !102, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in", scope: !99, file: !98, line: 50, baseType: !116, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_out", scope: !99, file: !98, line: 50, baseType: !116, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tempdirs", scope: !99, file: !98, line: 52, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "upload_temp_file_size", scope: !99, file: !98, line: 53, baseType: !116, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tempdir_idx", scope: !99, file: !98, line: 54, baseType: !15, size: 32, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_error_st", file: !13, line: 29, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fdlog_st", file: !151, line: 8, size: 256, elements: !152)
!151 = !DIFile(filename: "spack-src/src/fdlog.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "1dfced3d6e6326ccc981df3627f31bb1")
!152 = !{!153, !160, !161, !162}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !150, file: !151, line: 9, baseType: !154, size: 32)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !150, file: !151, line: 9, baseType: !15, size: 32, elements: !155)
!155 = !{!156, !157, !158, !159}
!156 = !DIEnumerator(name: "FDLOG_FILE", value: 0)
!157 = !DIEnumerator(name: "FDLOG_FD", value: 1)
!158 = !DIEnumerator(name: "FDLOG_SYSLOG", value: 2)
!159 = !DIEnumerator(name: "FDLOG_PIPE", value: 3)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !150, file: !151, line: 10, baseType: !87, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !150, file: !151, line: 11, baseType: !42, size: 128, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !150, file: !151, line: 12, baseType: !163, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "request_env", scope: !24, file: !25, line: 149, baseType: !166, size: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!12, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_st", file: !13, line: 19, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request_st", file: !172, line: 122, size: 6400, elements: !173)
!172 = !DIFile(filename: "spack-src/src/request.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "416cbf9145278ec22de51666187d6d5a")
!173 = !{!174, !189, !190, !191, !192, !196, !197, !201, !205, !251, !259, !458, !459, !460, !461, !470, !483, !484, !529, !530, !533, !534, !542, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !580, !581, !582, !590, !591, !592, !593, !594, !595, !599, !600}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !171, file: !172, line: 123, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_state_t", file: !172, line: 120, baseType: !176)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 108, baseType: !15, size: 32, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!178 = !DIEnumerator(name: "CON_STATE_CONNECT", value: 0)
!179 = !DIEnumerator(name: "CON_STATE_REQUEST_START", value: 1)
!180 = !DIEnumerator(name: "CON_STATE_READ", value: 2)
!181 = !DIEnumerator(name: "CON_STATE_REQUEST_END", value: 3)
!182 = !DIEnumerator(name: "CON_STATE_READ_POST", value: 4)
!183 = !DIEnumerator(name: "CON_STATE_HANDLE_REQUEST", value: 5)
!184 = !DIEnumerator(name: "CON_STATE_RESPONSE_START", value: 6)
!185 = !DIEnumerator(name: "CON_STATE_WRITE", value: 7)
!186 = !DIEnumerator(name: "CON_STATE_RESPONSE_END", value: 8)
!187 = !DIEnumerator(name: "CON_STATE_ERROR", value: 9)
!188 = !DIEnumerator(name: "CON_STATE_CLOSE", value: 10)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "http_status", scope: !171, file: !172, line: 124, baseType: !87, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "h2state", scope: !171, file: !172, line: 125, baseType: !49, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "h2id", scope: !171, file: !172, line: 126, baseType: !49, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "h2_rwin", scope: !171, file: !172, line: 127, baseType: !193, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !194, line: 26, baseType: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !52, line: 41, baseType: !87)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "h2_swin", scope: !171, file: !172, line: 128, baseType: !193, size: 32, offset: 160)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "h2_rwin_fudge", scope: !171, file: !172, line: 129, baseType: !198, size: 16, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !194, line: 25, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !52, line: 39, baseType: !200)
!200 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "h2_prio", scope: !171, file: !172, line: 130, baseType: !202, size: 8, offset: 208)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !50, line: 24, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !52, line: 38, baseType: !204)
!204 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "http_method", scope: !171, file: !172, line: 132, baseType: !206, size: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_method_t", file: !207, line: 59, baseType: !208)
!207 = !DIFile(filename: "spack-src/src/http_kv.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "839af8f5796c73517231eb7758755092")
!208 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !207, line: 17, baseType: !87, size: 32, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!210 = !DIEnumerator(name: "HTTP_METHOD_PRI", value: -2)
!211 = !DIEnumerator(name: "HTTP_METHOD_UNSET", value: -1)
!212 = !DIEnumerator(name: "HTTP_METHOD_GET", value: 0)
!213 = !DIEnumerator(name: "HTTP_METHOD_HEAD", value: 1)
!214 = !DIEnumerator(name: "HTTP_METHOD_QUERY", value: 2)
!215 = !DIEnumerator(name: "HTTP_METHOD_POST", value: 3)
!216 = !DIEnumerator(name: "HTTP_METHOD_PUT", value: 4)
!217 = !DIEnumerator(name: "HTTP_METHOD_DELETE", value: 5)
!218 = !DIEnumerator(name: "HTTP_METHOD_CONNECT", value: 6)
!219 = !DIEnumerator(name: "HTTP_METHOD_OPTIONS", value: 7)
!220 = !DIEnumerator(name: "HTTP_METHOD_TRACE", value: 8)
!221 = !DIEnumerator(name: "HTTP_METHOD_ACL", value: 9)
!222 = !DIEnumerator(name: "HTTP_METHOD_BASELINE_CONTROL", value: 10)
!223 = !DIEnumerator(name: "HTTP_METHOD_BIND", value: 11)
!224 = !DIEnumerator(name: "HTTP_METHOD_CHECKIN", value: 12)
!225 = !DIEnumerator(name: "HTTP_METHOD_CHECKOUT", value: 13)
!226 = !DIEnumerator(name: "HTTP_METHOD_COPY", value: 14)
!227 = !DIEnumerator(name: "HTTP_METHOD_LABEL", value: 15)
!228 = !DIEnumerator(name: "HTTP_METHOD_LINK", value: 16)
!229 = !DIEnumerator(name: "HTTP_METHOD_LOCK", value: 17)
!230 = !DIEnumerator(name: "HTTP_METHOD_MERGE", value: 18)
!231 = !DIEnumerator(name: "HTTP_METHOD_MKACTIVITY", value: 19)
!232 = !DIEnumerator(name: "HTTP_METHOD_MKCALENDAR", value: 20)
!233 = !DIEnumerator(name: "HTTP_METHOD_MKCOL", value: 21)
!234 = !DIEnumerator(name: "HTTP_METHOD_MKREDIRECTREF", value: 22)
!235 = !DIEnumerator(name: "HTTP_METHOD_MKWORKSPACE", value: 23)
!236 = !DIEnumerator(name: "HTTP_METHOD_MOVE", value: 24)
!237 = !DIEnumerator(name: "HTTP_METHOD_ORDERPATCH", value: 25)
!238 = !DIEnumerator(name: "HTTP_METHOD_PATCH", value: 26)
!239 = !DIEnumerator(name: "HTTP_METHOD_PROPFIND", value: 27)
!240 = !DIEnumerator(name: "HTTP_METHOD_PROPPATCH", value: 28)
!241 = !DIEnumerator(name: "HTTP_METHOD_REBIND", value: 29)
!242 = !DIEnumerator(name: "HTTP_METHOD_REPORT", value: 30)
!243 = !DIEnumerator(name: "HTTP_METHOD_SEARCH", value: 31)
!244 = !DIEnumerator(name: "HTTP_METHOD_UNBIND", value: 32)
!245 = !DIEnumerator(name: "HTTP_METHOD_UNCHECKOUT", value: 33)
!246 = !DIEnumerator(name: "HTTP_METHOD_UNLINK", value: 34)
!247 = !DIEnumerator(name: "HTTP_METHOD_UNLOCK", value: 35)
!248 = !DIEnumerator(name: "HTTP_METHOD_UPDATE", value: 36)
!249 = !DIEnumerator(name: "HTTP_METHOD_UPDATEREDIRECTREF", value: 37)
!250 = !DIEnumerator(name: "HTTP_METHOD_VERSION_CONTROL", value: 38)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "http_version", scope: !171, file: !172, line: 133, baseType: !252, size: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_version_t", file: !207, line: 61, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !207, line: 61, baseType: !87, size: 32, elements: !254)
!254 = !{!255, !256, !257, !258}
!255 = !DIEnumerator(name: "HTTP_VERSION_UNSET", value: -1)
!256 = !DIEnumerator(name: "HTTP_VERSION_1_0", value: 0)
!257 = !DIEnumerator(name: "HTTP_VERSION_1_1", value: 1)
!258 = !DIEnumerator(name: "HTTP_VERSION_2", value: 2)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "handler_module", scope: !171, file: !172, line: 135, baseType: !260, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "plugin", file: !13, line: 16, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin", file: !264, line: 44, size: 1600, elements: !265)
!264 = !DIFile(filename: "spack-src/src/plugin.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "192af98aba6a36b0ed1725683acdb1fd")
!265 = !{!266, !267, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !430, !431, !432, !434, !435, !441, !445, !446, !447, !448, !452, !453, !457}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !264, line: 45, baseType: !28, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "handle_uri_raw", scope: !263, file: !264, line: 47, baseType: !268, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!12, !169, !28}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "handle_uri_clean", scope: !263, file: !264, line: 48, baseType: !268, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "handle_docroot", scope: !263, file: !264, line: 49, baseType: !268, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "handle_physical", scope: !263, file: !264, line: 50, baseType: !268, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "handle_request_env", scope: !263, file: !264, line: 51, baseType: !268, size: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "handle_request_done", scope: !263, file: !264, line: 52, baseType: !268, size: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "handle_subrequest_start", scope: !263, file: !264, line: 53, baseType: !268, size: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "handle_subrequest", scope: !263, file: !264, line: 54, baseType: !268, size: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "handle_response_start", scope: !263, file: !264, line: 55, baseType: !268, size: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "handle_request_reset", scope: !263, file: !264, line: 56, baseType: !268, size: 64, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "handle_connection_accept", scope: !263, file: !264, line: 58, baseType: !281, size: 64, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!12, !284, !28}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "connection", file: !13, line: 10, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "connection", file: !25, line: 19, size: 8896, elements: !287)
!287 = !{!288, !289, !293, !294, !309, !310, !312, !313, !314, !315, !319, !320, !321, !322, !323, !328, !329, !334, !335, !336, !338, !339, !403, !404, !417, !423, !424, !425, !426, !427, !428, !429}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !286, file: !25, line: 21, baseType: !170, size: 6400)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !286, file: !25, line: 22, baseType: !290, size: 64, offset: 6400)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "h2con", file: !13, line: 13, baseType: !292)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "h2con", file: !13, line: 12, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !286, file: !25, line: 24, baseType: !87, size: 32, offset: 6464)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "fdn", scope: !286, file: !25, line: 25, baseType: !295, size: 64, offset: 6528)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "fdnode", file: !13, line: 25, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fdnode_st", file: !298, line: 12, size: 256, elements: !299)
!298 = !DIFile(filename: "spack-src/src/fdevent.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "36d3174096afc31592c961fe781a7313")
!299 = !{!300, !305, !306, !307, !308}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !297, file: !298, line: 13, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "fdevent_handler", file: !298, line: 10, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!12, !28, !87}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !297, file: !298, line: 14, baseType: !28, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !297, file: !298, line: 15, baseType: !87, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !297, file: !298, line: 16, baseType: !87, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fde_ndx", scope: !297, file: !298, line: 17, baseType: !87, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "jqnext", scope: !286, file: !25, line: 26, baseType: !284, size: 64, offset: 6592)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !286, file: !25, line: 29, baseType: !311, size: 8, offset: 6656)
!311 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "is_writable", scope: !286, file: !25, line: 30, baseType: !311, size: 8, offset: 6664)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "is_ssl_sock", scope: !286, file: !25, line: 31, baseType: !4, size: 8, offset: 6672)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "traffic_limit_reached", scope: !286, file: !25, line: 32, baseType: !4, size: 8, offset: 6680)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "revents_err", scope: !286, file: !25, line: 33, baseType: !316, size: 16, offset: 6688)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !50, line: 25, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !52, line: 40, baseType: !318)
!318 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "proto_default_port", scope: !286, file: !25, line: 34, baseType: !316, size: 16, offset: 6704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !286, file: !25, line: 36, baseType: !96, size: 64, offset: 6720)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "read_queue", scope: !286, file: !25, line: 37, baseType: !96, size: 64, offset: 6784)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written_cur_second", scope: !286, file: !25, line: 39, baseType: !116, size: 64, offset: 6848)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "network_write", scope: !286, file: !25, line: 41, baseType: !324, size: 64, offset: 6912)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!87, !327, !96, !116}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "network_read", scope: !286, file: !25, line: 42, baseType: !324, size: 64, offset: 6976)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reqbody_read", scope: !286, file: !25, line: 43, baseType: !330, size: 64, offset: 7040)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!12, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "srv", scope: !286, file: !25, line: 45, baseType: !22, size: 64, offset: 7104)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_slots", scope: !286, file: !25, line: 46, baseType: !28, size: 64, offset: 7168)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_ctx", scope: !286, file: !25, line: 47, baseType: !337, size: 64, offset: 7232)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "config_data_base", scope: !286, file: !25, line: 48, baseType: !28, size: 64, offset: 7296)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr", scope: !286, file: !25, line: 50, baseType: !340, size: 896, offset: 7360)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_addr", file: !13, line: 22, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sock_addr", file: !342, line: 12, size: 896, elements: !343)
!342 = !DIFile(filename: "spack-src/src/sock_addr.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "9e09db4f4a31239a49673d956e2f0808")
!343 = !{!344, !373, !385, !394}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6", scope: !341, file: !342, line: 14, baseType: !345, size: 224)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !346, line: 260, size: 224, elements: !347)
!346 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!347 = !{!348, !351, !353, !354, !372}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !345, file: !346, line: 262, baseType: !349, size: 16)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !350, line: 28, baseType: !318)
!350 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !345, file: !346, line: 263, baseType: !352, size: 16, offset: 16)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !346, line: 123, baseType: !316)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !345, file: !346, line: 264, baseType: !49, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !345, file: !346, line: 265, baseType: !355, size: 128, offset: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !346, line: 219, size: 128, elements: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !355, file: !346, line: 226, baseType: !358, size: 128)
!358 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !355, file: !346, line: 221, size: 128, elements: !359)
!359 = !{!360, !364, !368}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !358, file: !346, line: 223, baseType: !361, size: 128)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 128, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 16)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !358, file: !346, line: 224, baseType: !365, size: 128)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 128, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !358, file: !346, line: 225, baseType: !369, size: 128)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 128, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 4)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !345, file: !346, line: 266, baseType: !49, size: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4", scope: !341, file: !342, line: 16, baseType: !374, size: 128)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !346, line: 245, size: 128, elements: !375)
!375 = !{!376, !377, !378, !383}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !374, file: !346, line: 247, baseType: !349, size: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !374, file: !346, line: 248, baseType: !352, size: 16, offset: 16)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !374, file: !346, line: 249, baseType: !379, size: 32, offset: 32)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !346, line: 31, size: 32, elements: !380)
!380 = !{!381}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !379, file: !346, line: 33, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !346, line: 30, baseType: !49)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !374, file: !346, line: 252, baseType: !384, size: 64, offset: 64)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, elements: !366)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !341, file: !342, line: 18, baseType: !386, size: 880)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !387, line: 29, size: 880, elements: !388)
!387 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !386, file: !387, line: 31, baseType: !349, size: 16)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !386, file: !387, line: 32, baseType: !391, size: 864, offset: 16)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 864, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 108)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !341, file: !342, line: 20, baseType: !395, size: 128)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !396, line: 180, size: 128, elements: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !395, file: !396, line: 182, baseType: !349, size: 16)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !395, file: !396, line: 183, baseType: !400, size: 112, offset: 16)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 14)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr_buf", scope: !286, file: !25, line: 51, baseType: !42, size: 128, offset: 8256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "srv_socket", scope: !286, file: !25, line: 52, baseType: !405, size: 64, offset: 8384)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_socket", file: !25, line: 124, size: 1152, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !407, file: !25, line: 125, baseType: !340, size: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !407, file: !25, line: 126, baseType: !87, size: 32, offset: 896)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "is_ssl", scope: !407, file: !25, line: 128, baseType: !202, size: 8, offset: 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "srv_token_colon", scope: !407, file: !25, line: 129, baseType: !202, size: 8, offset: 936)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sidx", scope: !407, file: !25, line: 130, baseType: !318, size: 16, offset: 944)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fdn", scope: !407, file: !25, line: 132, baseType: !295, size: 64, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "srv", scope: !407, file: !25, line: 133, baseType: !22, size: 64, offset: 1024)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "srv_token", scope: !407, file: !25, line: 134, baseType: !114, size: 64, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "read_idle_ts", scope: !286, file: !25, line: 55, baseType: !418, size: 64, offset: 8448)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "unix_time64_t", file: !419, line: 134, baseType: !420)
!419 = !DIFile(filename: "spack-src/src/first.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "db942007b87b5a60f6bd859b991a2b7a")
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !421, line: 10, baseType: !422)
!421 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !52, line: 160, baseType: !119)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "close_timeout_ts", scope: !286, file: !25, line: 56, baseType: !418, size: 64, offset: 8512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "write_request_ts", scope: !286, file: !25, line: 57, baseType: !418, size: 64, offset: 8576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "connection_start", scope: !286, file: !25, line: 58, baseType: !418, size: 64, offset: 8640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "request_count", scope: !286, file: !25, line: 60, baseType: !49, size: 32, offset: 8704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_idle", scope: !286, file: !25, line: 61, baseType: !87, size: 32, offset: 8736)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !25, line: 63, baseType: !284, size: 64, offset: 8768)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !286, file: !25, line: 64, baseType: !284, size: 64, offset: 8832)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "handle_connection_shut_wr", scope: !263, file: !264, line: 59, baseType: !281, size: 64, offset: 768)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "handle_connection_close", scope: !263, file: !264, line: 60, baseType: !281, size: 64, offset: 832)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "handle_trigger", scope: !263, file: !264, line: 62, baseType: !433, size: 64, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "handle_sighup", scope: !263, file: !264, line: 63, baseType: !433, size: 64, offset: 960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "handle_waitpid", scope: !263, file: !264, line: 64, baseType: !436, size: 64, offset: 1024)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!12, !22, !28, !439, !87}
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !117, line: 97, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !52, line: 154, baseType: !87)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !263, file: !264, line: 66, baseType: !442, size: 64, offset: 1088)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!28}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "priv_defaults", scope: !263, file: !264, line: 67, baseType: !433, size: 64, offset: 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "set_defaults", scope: !263, file: !264, line: 68, baseType: !433, size: 64, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "worker_init", scope: !263, file: !264, line: 69, baseType: !433, size: 64, offset: 1280)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !263, file: !264, line: 70, baseType: !449, size: 64, offset: 1344)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !28}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !264, line: 72, baseType: !163, size: 64, offset: 1408)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !263, file: !264, line: 73, baseType: !454, size: 64, offset: 1472)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !455, line: 70, baseType: !456)
!455 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!456 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !263, file: !264, line: 74, baseType: !28, size: 64, offset: 1536)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_ctx", scope: !171, file: !172, line: 136, baseType: !337, size: 64, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "con", scope: !171, file: !172, line: 137, baseType: !284, size: 64, offset: 448)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "conditional_is_valid", scope: !171, file: !172, line: 140, baseType: !49, size: 32, offset: 512)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "cond_cache", scope: !171, file: !172, line: 141, baseType: !462, size: 64, offset: 576)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cond_cache_t", file: !464, line: 164, size: 16, elements: !465)
!464 = !DIFile(filename: "spack-src/src/plugin_config.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "b826c888c36ea41e9e12a5dcb73a23da")
!465 = !{!466, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !463, file: !464, line: 166, baseType: !467, size: 8)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !194, line: 24, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !52, line: 37, baseType: !311)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "local_result", scope: !463, file: !464, line: 168, baseType: !467, size: 8, offset: 8)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cond_match", scope: !171, file: !172, line: 142, baseType: !471, size: 64, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cond_match_t", file: !464, line: 175, size: 256, elements: !474)
!474 = !{!475, !478, !481, !482}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "comp_value", scope: !473, file: !464, line: 176, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "match_data", scope: !473, file: !464, line: 178, baseType: !479, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcre2_real_match_data_8", file: !464, line: 172, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "captures", scope: !473, file: !464, line: 180, baseType: !87, size: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !473, file: !464, line: 181, baseType: !28, size: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "cond_match_data", scope: !171, file: !172, line: 143, baseType: !472, size: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !171, file: !172, line: 145, baseType: !485, size: 960, offset: 768)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_config", file: !172, line: 78, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request_config", file: !172, line: 18, size: 960, elements: !487)
!487 = !{!488, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !525, !526, !527, !528}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "errh", scope: !486, file: !172, line: 19, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "fdlog_st", file: !13, line: 28, baseType: !150)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "http_parseopts", scope: !486, file: !172, line: 20, baseType: !15, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_field_size", scope: !486, file: !172, line: 21, baseType: !49, size: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mimetypes", scope: !486, file: !172, line: 22, baseType: !144, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "document_root", scope: !486, file: !172, line: 25, baseType: !476, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !486, file: !172, line: 26, baseType: !476, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !486, file: !172, line: 27, baseType: !476, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_size", scope: !486, file: !172, line: 29, baseType: !15, size: 32, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "max_keep_alive_requests", scope: !486, file: !172, line: 30, baseType: !318, size: 16, offset: 416)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "max_keep_alive_idle", scope: !486, file: !172, line: 31, baseType: !318, size: 16, offset: 432)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "max_read_idle", scope: !486, file: !172, line: 32, baseType: !318, size: 16, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "max_write_idle", scope: !486, file: !172, line: 33, baseType: !318, size: 16, offset: 464)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "stream_request_body", scope: !486, file: !172, line: 34, baseType: !318, size: 16, offset: 480)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "stream_response_body", scope: !486, file: !172, line: 35, baseType: !318, size: 16, offset: 496)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "high_precision_timestamps", scope: !486, file: !172, line: 36, baseType: !15, size: 1, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "allow_http11", scope: !486, file: !172, line: 37, baseType: !15, size: 1, offset: 513, flags: DIFlagBitField, extraData: i64 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "range_requests", scope: !486, file: !172, line: 38, baseType: !15, size: 1, offset: 514, flags: DIFlagBitField, extraData: i64 512)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "follow_symlink", scope: !486, file: !172, line: 39, baseType: !15, size: 1, offset: 515, flags: DIFlagBitField, extraData: i64 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "etag_flags", scope: !486, file: !172, line: 40, baseType: !15, size: 3, offset: 516, flags: DIFlagBitField, extraData: i64 512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "use_xattr", scope: !486, file: !172, line: 41, baseType: !15, size: 1, offset: 519, flags: DIFlagBitField, extraData: i64 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "force_lowercase_filenames", scope: !486, file: !172, line: 42, baseType: !15, size: 2, offset: 520, flags: DIFlagBitField, extraData: i64 512)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "error_intercept", scope: !486, file: !172, line: 43, baseType: !15, size: 1, offset: 522, flags: DIFlagBitField, extraData: i64 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "h2proto", scope: !486, file: !172, line: 45, baseType: !15, size: 2, offset: 523, flags: DIFlagBitField, extraData: i64 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "log_request_handling", scope: !486, file: !172, line: 48, baseType: !15, size: 1, offset: 525, flags: DIFlagBitField, extraData: i64 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "log_state_handling", scope: !486, file: !172, line: 49, baseType: !15, size: 1, offset: 526, flags: DIFlagBitField, extraData: i64 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "log_condition_handling", scope: !486, file: !172, line: 50, baseType: !15, size: 1, offset: 527, flags: DIFlagBitField, extraData: i64 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "log_response_header", scope: !486, file: !172, line: 51, baseType: !15, size: 1, offset: 528, flags: DIFlagBitField, extraData: i64 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "log_request_header", scope: !486, file: !172, line: 52, baseType: !15, size: 1, offset: 529, flags: DIFlagBitField, extraData: i64 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "log_request_header_on_error", scope: !486, file: !172, line: 53, baseType: !15, size: 1, offset: 530, flags: DIFlagBitField, extraData: i64 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "log_file_not_found", scope: !486, file: !172, line: 54, baseType: !15, size: 1, offset: 531, flags: DIFlagBitField, extraData: i64 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "log_timeouts", scope: !486, file: !172, line: 55, baseType: !15, size: 1, offset: 532, flags: DIFlagBitField, extraData: i64 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_second", scope: !486, file: !172, line: 57, baseType: !15, size: 32, offset: 544)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "global_bytes_per_second", scope: !486, file: !172, line: 58, baseType: !15, size: 32, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "global_bytes_per_second_cnt_ptr", scope: !486, file: !172, line: 72, baseType: !524, size: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "error_handler", scope: !486, file: !172, line: 74, baseType: !476, size: 64, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "error_handler_404", scope: !486, file: !172, line: 75, baseType: !476, size: 64, offset: 768)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "errorfile_prefix", scope: !486, file: !172, line: 76, baseType: !476, size: 64, offset: 832)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "serrh", scope: !486, file: !172, line: 77, baseType: !489, size: 64, offset: 896)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rqst_header_len", scope: !171, file: !172, line: 148, baseType: !49, size: 32, offset: 1728)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rqst_htags", scope: !171, file: !172, line: 149, baseType: !531, size: 64, offset: 1792)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !50, line: 27, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !52, line: 45, baseType: !456)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rqst_headers", scope: !171, file: !172, line: 150, baseType: !31, size: 192, offset: 1856)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !171, file: !172, line: 152, baseType: !535, size: 512, offset: 2048)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_uri", file: !172, line: 89, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 80, size: 512, elements: !537)
!537 = !{!538, !539, !540, !541}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !536, file: !172, line: 81, baseType: !42, size: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !536, file: !172, line: 84, baseType: !42, size: 128, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !536, file: !172, line: 87, baseType: !42, size: 128, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !536, file: !172, line: 88, baseType: !42, size: 128, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "physical", scope: !171, file: !172, line: 153, baseType: !543, size: 512, offset: 2560)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "physical", file: !172, line: 97, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 91, size: 512, elements: !545)
!545 = !{!546, !547, !548, !549}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !544, file: !172, line: 92, baseType: !42, size: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "basedir", scope: !544, file: !172, line: 93, baseType: !42, size: 128, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "doc_root", scope: !544, file: !172, line: 95, baseType: !42, size: 128, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rel_path", scope: !544, file: !172, line: 96, baseType: !42, size: 128, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !171, file: !172, line: 154, baseType: !31, size: 192, offset: 3072)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reqbody_length", scope: !171, file: !172, line: 156, baseType: !116, size: 64, offset: 3264)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "te_chunked", scope: !171, file: !172, line: 157, baseType: !116, size: 64, offset: 3328)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "resp_body_scratchpad", scope: !171, file: !172, line: 158, baseType: !116, size: 64, offset: 3392)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "http_host", scope: !171, file: !172, line: 160, baseType: !114, size: 64, offset: 3456)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !171, file: !172, line: 161, baseType: !476, size: 64, offset: 3520)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !171, file: !172, line: 163, baseType: !42, size: 128, offset: 3584)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "target_orig", scope: !171, file: !172, line: 164, baseType: !42, size: 128, offset: 3712)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pathinfo", scope: !171, file: !172, line: 166, baseType: !42, size: 128, offset: 3840)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "server_name_buf", scope: !171, file: !172, line: 167, baseType: !42, size: 128, offset: 3968)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "resp_header_len", scope: !171, file: !172, line: 170, baseType: !49, size: 32, offset: 4096)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "resp_htags", scope: !171, file: !172, line: 171, baseType: !531, size: 64, offset: 4160)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "resp_headers", scope: !171, file: !172, line: 172, baseType: !31, size: 192, offset: 4224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "resp_body_finished", scope: !171, file: !172, line: 173, baseType: !4, size: 8, offset: 4416)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "resp_body_started", scope: !171, file: !172, line: 174, baseType: !4, size: 8, offset: 4424)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "resp_send_chunked", scope: !171, file: !172, line: 175, baseType: !4, size: 8, offset: 4432)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "resp_decode_chunked", scope: !171, file: !172, line: 176, baseType: !4, size: 8, offset: 4440)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "resp_header_repeated", scope: !171, file: !172, line: 177, baseType: !4, size: 8, offset: 4448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "loops_per_request", scope: !171, file: !172, line: 179, baseType: !4, size: 8, offset: 4456)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !171, file: !172, line: 180, baseType: !467, size: 8, offset: 4464)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "async_callback", scope: !171, file: !172, line: 181, baseType: !4, size: 8, offset: 4472)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !171, file: !172, line: 183, baseType: !114, size: 64, offset: 4480)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gw_dechunk", scope: !171, file: !172, line: 184, baseType: !573, size: 64, offset: 4544)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "response_dechunk", file: !172, line: 103, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 99, size: 256, elements: !576)
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gw_chunked", scope: !575, file: !172, line: 100, baseType: !116, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !575, file: !172, line: 101, baseType: !42, size: 128, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !575, file: !172, line: 102, baseType: !87, size: 32, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written_ckpt", scope: !171, file: !172, line: 186, baseType: !116, size: 64, offset: 4608)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read_ckpt", scope: !171, file: !172, line: 187, baseType: !116, size: 64, offset: 4672)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "start_hp", scope: !171, file: !172, line: 188, baseType: !583, size: 128, offset: 4736)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "unix_timespec64_t", file: !419, line: 135, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !585, line: 11, size: 128, elements: !586)
!585 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !584, file: !585, line: 16, baseType: !422, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !584, file: !585, line: 21, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !52, line: 197, baseType: !119)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "error_handler_saved_status", scope: !171, file: !172, line: 190, baseType: !87, size: 32, offset: 4864)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "error_handler_saved_method", scope: !171, file: !172, line: 191, baseType: !206, size: 32, offset: 4896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !171, file: !172, line: 193, baseType: !99, size: 448, offset: 4928)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "read_queue", scope: !171, file: !172, line: 194, baseType: !99, size: 448, offset: 5376)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reqbody_queue", scope: !171, file: !172, line: 195, baseType: !99, size: 448, offset: 5824)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_sce", scope: !171, file: !172, line: 197, baseType: !596, size: 64, offset: 6272)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat_cache_entry", file: !598, line: 11, flags: DIFlagFwdDecl)
!598 = !DIFile(filename: "spack-src/src/response.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "ace3bc7588d2fb066701bb10c515f1ff")
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cond_captures", scope: !171, file: !172, line: 198, baseType: !87, size: 32, offset: 6336)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "h2_connect_ext", scope: !171, file: !172, line: 199, baseType: !87, size: 32, offset: 6368)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !24, file: !25, line: 152, baseType: !114, size: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "max_fds", scope: !24, file: !25, line: 154, baseType: !87, size: 32, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "max_fds_lowat", scope: !24, file: !25, line: 155, baseType: !87, size: 32, offset: 480)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "max_fds_hiwat", scope: !24, file: !25, line: 156, baseType: !87, size: 32, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cur_fds", scope: !24, file: !25, line: 157, baseType: !87, size: 32, offset: 544)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sockets_disabled", scope: !24, file: !25, line: 158, baseType: !87, size: 32, offset: 576)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lim_conns", scope: !24, file: !25, line: 160, baseType: !49, size: 32, offset: 608)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !24, file: !25, line: 161, baseType: !284, size: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "conns_pool", scope: !24, file: !25, line: 162, baseType: !284, size: 64, offset: 704)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "errh", scope: !24, file: !25, line: 164, baseType: !148, size: 64, offset: 768)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "loadts", scope: !24, file: !25, line: 166, baseType: !418, size: 64, offset: 832)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "loadavg", scope: !24, file: !25, line: 167, baseType: !613, size: 192, offset: 896)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 192, elements: !615)
!614 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!615 = !{!616}
!616 = !DISubrange(count: 3)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "plugins_request_reset", scope: !24, file: !25, line: 171, baseType: !166, size: 64, offset: 1088)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "srvconf", scope: !24, file: !25, line: 173, baseType: !619, size: 1344, offset: 1152)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_config", file: !25, line: 122, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 79, size: 1344, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_field_size", scope: !620, file: !25, line: 82, baseType: !49, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "log_request_header_on_error", scope: !620, file: !25, line: 83, baseType: !204, size: 8, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "http_header_strict", scope: !620, file: !25, line: 84, baseType: !204, size: 8, offset: 40)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "http_host_strict", scope: !620, file: !25, line: 85, baseType: !204, size: 8, offset: 48)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "http_host_normalize", scope: !620, file: !25, line: 86, baseType: !204, size: 8, offset: 56)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "http_method_get_body", scope: !620, file: !25, line: 87, baseType: !204, size: 8, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "high_precision_timestamps", scope: !620, file: !25, line: 88, baseType: !204, size: 8, offset: 72)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "h2proto", scope: !620, file: !25, line: 89, baseType: !204, size: 8, offset: 80)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_dir_redirect", scope: !620, file: !25, line: 90, baseType: !204, size: 8, offset: 88)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "http_url_normalize", scope: !620, file: !25, line: 91, baseType: !318, size: 16, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "max_worker", scope: !620, file: !25, line: 93, baseType: !318, size: 16, offset: 112)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "max_fds", scope: !620, file: !25, line: 94, baseType: !318, size: 16, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "max_conns", scope: !620, file: !25, line: 95, baseType: !318, size: 16, offset: 144)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !620, file: !25, line: 96, baseType: !318, size: 16, offset: 160)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "upload_temp_file_size", scope: !620, file: !25, line: 98, baseType: !15, size: 32, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "upload_tempdirs", scope: !620, file: !25, line: 99, baseType: !30, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dont_daemonize", scope: !620, file: !25, line: 101, baseType: !204, size: 8, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "preflight_check", scope: !620, file: !25, line: 102, baseType: !204, size: 8, offset: 328)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "enable_cores", scope: !620, file: !25, line: 103, baseType: !204, size: 8, offset: 336)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "compat_module_load", scope: !620, file: !25, line: 104, baseType: !204, size: 8, offset: 344)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "config_deprecated", scope: !620, file: !25, line: 105, baseType: !204, size: 8, offset: 352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "config_unsupported", scope: !620, file: !25, line: 106, baseType: !204, size: 8, offset: 360)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "systemd_socket_activation", scope: !620, file: !25, line: 107, baseType: !204, size: 8, offset: 368)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "errorlog_use_syslog", scope: !620, file: !25, line: 108, baseType: !204, size: 8, offset: 376)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "syslog_facility", scope: !620, file: !25, line: 109, baseType: !476, size: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !620, file: !25, line: 110, baseType: !476, size: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "changeroot", scope: !620, file: !25, line: 111, baseType: !476, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !620, file: !25, line: 112, baseType: !476, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "groupname", scope: !620, file: !25, line: 113, baseType: !476, size: 64, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "network_backend", scope: !620, file: !25, line: 114, baseType: !476, size: 64, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "feature_flags", scope: !620, file: !25, line: 115, baseType: !144, size: 64, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "event_handler", scope: !620, file: !25, line: 116, baseType: !163, size: 64, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "modules_dir", scope: !620, file: !25, line: 117, baseType: !163, size: 64, offset: 896)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pid_file", scope: !620, file: !25, line: 118, baseType: !114, size: 64, offset: 960)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !620, file: !25, line: 119, baseType: !30, size: 64, offset: 1024)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "config_touched", scope: !620, file: !25, line: 120, baseType: !30, size: 64, offset: 1088)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "empty_array", scope: !620, file: !25, line: 121, baseType: !31, size: 192, offset: 1152)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "config_data_base", scope: !24, file: !25, line: 174, baseType: !28, size: 64, offset: 2496)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "srv_sockets", scope: !24, file: !25, line: 176, baseType: !661, size: 128, offset: 2560)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_socket_array", file: !25, line: 140, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 137, size: 128, elements: !663)
!663 = !{!664, !668}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !662, file: !25, line: 138, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_socket", file: !25, line: 135, baseType: !407)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !662, file: !25, line: 139, baseType: !49, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "srv_sockets_inherited", scope: !24, file: !25, line: 177, baseType: !661, size: 128, offset: 2688)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "plugins", scope: !24, file: !25, line: 178, baseType: !671, size: 128, offset: 2816)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !24, file: !25, line: 178, size: 128, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !671, file: !25, line: 178, baseType: !28, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !671, file: !25, line: 178, baseType: !49, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "startup_ts", scope: !24, file: !25, line: 180, baseType: !418, size: 64, offset: 2944)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "graceful_expire_ts", scope: !24, file: !25, line: 181, baseType: !418, size: 64, offset: 3008)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !24, file: !25, line: 183, baseType: !678, size: 32, offset: 3072)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !117, line: 79, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !52, line: 146, baseType: !15)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !24, file: !25, line: 184, baseType: !681, size: 32, offset: 3104)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !117, line: 64, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !52, line: 147, baseType: !15)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !24, file: !25, line: 185, baseType: !439, size: 32, offset: 3136)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_fd", scope: !24, file: !25, line: 186, baseType: !87, size: 32, offset: 3168)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "default_server_tag", scope: !24, file: !25, line: 188, baseType: !476, size: 64, offset: 3200)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !24, file: !25, line: 189, baseType: !687, size: 64, offset: 3264)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "match_data", scope: !24, file: !25, line: 191, baseType: !28, size: 64, offset: 3328)
!689 = distinct !DICompileUnit(language: DW_LANG_C11, file: !690, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !691, retainedTypes: !833, globals: !1059, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q/spack-src/src/mod_wstunnel.c", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q/spack-build-rpmcfxe/build", checksumkind: CSK_MD5, checksum: "555fd87eec0e713d8c8fafcbc2859b02")
!691 = !{!14, !176, !208, !253, !109, !76, !154, !692, !707, !737, !744, !807, !814, !821, !828}
!692 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 89, baseType: !15, size: 32, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!694 = !DIEnumerator(name: "T_CONFIG_UNSET", value: 0)
!695 = !DIEnumerator(name: "T_CONFIG_STRING", value: 1)
!696 = !DIEnumerator(name: "T_CONFIG_SHORT", value: 2)
!697 = !DIEnumerator(name: "T_CONFIG_INT", value: 3)
!698 = !DIEnumerator(name: "T_CONFIG_BOOL", value: 4)
!699 = !DIEnumerator(name: "T_CONFIG_ARRAY", value: 5)
!700 = !DIEnumerator(name: "T_CONFIG_ARRAY_KVANY", value: 6)
!701 = !DIEnumerator(name: "T_CONFIG_ARRAY_KVARRAY", value: 7)
!702 = !DIEnumerator(name: "T_CONFIG_ARRAY_KVSTRING", value: 8)
!703 = !DIEnumerator(name: "T_CONFIG_ARRAY_VLIST", value: 9)
!704 = !DIEnumerator(name: "T_CONFIG_LOCAL", value: 10)
!705 = !DIEnumerator(name: "T_CONFIG_DEPRECATED", value: 11)
!706 = !DIEnumerator(name: "T_CONFIG_UNSUPPORTED", value: 12)
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !708, file: !91, line: 19, baseType: !15, size: 32, elements: !731)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gw_proc", file: !91, line: 17, size: 832, elements: !709)
!709 = !{!710, !712, !713, !714, !715, !717, !718, !719, !720, !721, !724, !726, !727, !728, !729, !730}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !708, file: !91, line: 18, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !708, file: !91, line: 25, baseType: !707, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !708, file: !91, line: 26, baseType: !49, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "last_used", scope: !708, file: !91, line: 27, baseType: !418, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "stats_load", scope: !708, file: !91, line: 28, baseType: !716, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "stats_connected", scope: !708, file: !91, line: 29, baseType: !716, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !708, file: !91, line: 30, baseType: !439, size: 32, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "is_local", scope: !708, file: !91, line: 31, baseType: !87, size: 32, offset: 352)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !708, file: !91, line: 32, baseType: !49, size: 32, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "saddrlen", scope: !708, file: !91, line: 33, baseType: !722, size: 32, offset: 416)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !396, line: 33, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !52, line: 210, baseType: !15)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !708, file: !91, line: 34, baseType: !725, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "disabled_until", scope: !708, file: !91, line: 36, baseType: !418, size: 64, offset: 512)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !708, file: !91, line: 37, baseType: !711, size: 64, offset: 576)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "connection_name", scope: !708, file: !91, line: 40, baseType: !114, size: 64, offset: 640)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "unixsocket", scope: !708, file: !91, line: 41, baseType: !114, size: 64, offset: 704)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !708, file: !91, line: 42, baseType: !318, size: 16, offset: 768)
!731 = !{!732, !733, !734, !735, !736}
!732 = !DIEnumerator(name: "PROC_STATE_RUNNING", value: 0)
!733 = !DIEnumerator(name: "PROC_STATE_OVERLOADED", value: 1)
!734 = !DIEnumerator(name: "PROC_STATE_DIED_WAIT_FOR_PID", value: 2)
!735 = !DIEnumerator(name: "PROC_STATE_DIED", value: 3)
!736 = !DIEnumerator(name: "PROC_STATE_KILLED", value: 4)
!737 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !91, line: 286, baseType: !15, size: 32, elements: !738)
!738 = !{!739, !740, !741, !742, !743}
!739 = !DIEnumerator(name: "GW_STATE_INIT", value: 0)
!740 = !DIEnumerator(name: "GW_STATE_CONNECT_DELAYED", value: 1)
!741 = !DIEnumerator(name: "GW_STATE_PREPARE_WRITE", value: 2)
!742 = !DIEnumerator(name: "GW_STATE_WRITE", value: 3)
!743 = !DIEnumerator(name: "GW_STATE_READ", value: 4)
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "http_header_e", file: !745, line: 39, baseType: !15, size: 32, elements: !746)
!745 = !DIFile(filename: "spack-src/src/http_header.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "ec0afffac211a7e212791b4a91317971")
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!747 = !DIEnumerator(name: "HTTP_HEADER_OTHER", value: 0)
!748 = !DIEnumerator(name: "HTTP_HEADER_ACCEPT", value: 1)
!749 = !DIEnumerator(name: "HTTP_HEADER_ACCEPT_ENCODING", value: 2)
!750 = !DIEnumerator(name: "HTTP_HEADER_ACCEPT_LANGUAGE", value: 3)
!751 = !DIEnumerator(name: "HTTP_HEADER_ACCEPT_RANGES", value: 4)
!752 = !DIEnumerator(name: "HTTP_HEADER_ACCESS_CONTROL_ALLOW_ORIGIN", value: 5)
!753 = !DIEnumerator(name: "HTTP_HEADER_AGE", value: 6)
!754 = !DIEnumerator(name: "HTTP_HEADER_ALLOW", value: 7)
!755 = !DIEnumerator(name: "HTTP_HEADER_ALT_SVC", value: 8)
!756 = !DIEnumerator(name: "HTTP_HEADER_ALT_USED", value: 9)
!757 = !DIEnumerator(name: "HTTP_HEADER_AUTHORIZATION", value: 10)
!758 = !DIEnumerator(name: "HTTP_HEADER_CACHE_CONTROL", value: 11)
!759 = !DIEnumerator(name: "HTTP_HEADER_CONNECTION", value: 12)
!760 = !DIEnumerator(name: "HTTP_HEADER_CONTENT_ENCODING", value: 13)
!761 = !DIEnumerator(name: "HTTP_HEADER_CONTENT_LENGTH", value: 14)
!762 = !DIEnumerator(name: "HTTP_HEADER_CONTENT_LOCATION", value: 15)
!763 = !DIEnumerator(name: "HTTP_HEADER_CONTENT_RANGE", value: 16)
!764 = !DIEnumerator(name: "HTTP_HEADER_CONTENT_SECURITY_POLICY", value: 17)
!765 = !DIEnumerator(name: "HTTP_HEADER_CONTENT_TYPE", value: 18)
!766 = !DIEnumerator(name: "HTTP_HEADER_COOKIE", value: 19)
!767 = !DIEnumerator(name: "HTTP_HEADER_DATE", value: 20)
!768 = !DIEnumerator(name: "HTTP_HEADER_DNT", value: 21)
!769 = !DIEnumerator(name: "HTTP_HEADER_ETAG", value: 22)
!770 = !DIEnumerator(name: "HTTP_HEADER_EXPECT", value: 23)
!771 = !DIEnumerator(name: "HTTP_HEADER_EXPECT_CT", value: 24)
!772 = !DIEnumerator(name: "HTTP_HEADER_EXPIRES", value: 25)
!773 = !DIEnumerator(name: "HTTP_HEADER_FORWARDED", value: 26)
!774 = !DIEnumerator(name: "HTTP_HEADER_HOST", value: 27)
!775 = !DIEnumerator(name: "HTTP_HEADER_HTTP2_SETTINGS", value: 28)
!776 = !DIEnumerator(name: "HTTP_HEADER_IF_MATCH", value: 29)
!777 = !DIEnumerator(name: "HTTP_HEADER_IF_MODIFIED_SINCE", value: 30)
!778 = !DIEnumerator(name: "HTTP_HEADER_IF_NONE_MATCH", value: 31)
!779 = !DIEnumerator(name: "HTTP_HEADER_IF_RANGE", value: 32)
!780 = !DIEnumerator(name: "HTTP_HEADER_IF_UNMODIFIED_SINCE", value: 33)
!781 = !DIEnumerator(name: "HTTP_HEADER_LAST_MODIFIED", value: 34)
!782 = !DIEnumerator(name: "HTTP_HEADER_LINK", value: 35)
!783 = !DIEnumerator(name: "HTTP_HEADER_LOCATION", value: 36)
!784 = !DIEnumerator(name: "HTTP_HEADER_ONION_LOCATION", value: 37)
!785 = !DIEnumerator(name: "HTTP_HEADER_P3P", value: 38)
!786 = !DIEnumerator(name: "HTTP_HEADER_PRAGMA", value: 39)
!787 = !DIEnumerator(name: "HTTP_HEADER_PRIORITY", value: 40)
!788 = !DIEnumerator(name: "HTTP_HEADER_RANGE", value: 41)
!789 = !DIEnumerator(name: "HTTP_HEADER_REFERER", value: 42)
!790 = !DIEnumerator(name: "HTTP_HEADER_REFERRER_POLICY", value: 43)
!791 = !DIEnumerator(name: "HTTP_HEADER_SERVER", value: 44)
!792 = !DIEnumerator(name: "HTTP_HEADER_SET_COOKIE", value: 45)
!793 = !DIEnumerator(name: "HTTP_HEADER_STATUS", value: 46)
!794 = !DIEnumerator(name: "HTTP_HEADER_STRICT_TRANSPORT_SECURITY", value: 47)
!795 = !DIEnumerator(name: "HTTP_HEADER_TE", value: 48)
!796 = !DIEnumerator(name: "HTTP_HEADER_TRANSFER_ENCODING", value: 49)
!797 = !DIEnumerator(name: "HTTP_HEADER_UPGRADE", value: 50)
!798 = !DIEnumerator(name: "HTTP_HEADER_UPGRADE_INSECURE_REQUESTS", value: 51)
!799 = !DIEnumerator(name: "HTTP_HEADER_USER_AGENT", value: 52)
!800 = !DIEnumerator(name: "HTTP_HEADER_VARY", value: 53)
!801 = !DIEnumerator(name: "HTTP_HEADER_WWW_AUTHENTICATE", value: 54)
!802 = !DIEnumerator(name: "HTTP_HEADER_X_CONTENT_TYPE_OPTIONS", value: 55)
!803 = !DIEnumerator(name: "HTTP_HEADER_X_FORWARDED_FOR", value: 56)
!804 = !DIEnumerator(name: "HTTP_HEADER_X_FORWARDED_PROTO", value: 57)
!805 = !DIEnumerator(name: "HTTP_HEADER_X_FRAME_OPTIONS", value: 58)
!806 = !DIEnumerator(name: "HTTP_HEADER_X_XSS_PROTECTION", value: 59)
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 126, baseType: !15, size: 32, elements: !808)
!808 = !{!809, !810, !811, !812, !813}
!809 = !DIEnumerator(name: "MOD_WEBSOCKET_FRAME_STATE_INIT", value: 0)
!810 = !DIEnumerator(name: "MOD_WEBSOCKET_FRAME_STATE_READ_LENGTH", value: 1)
!811 = !DIEnumerator(name: "MOD_WEBSOCKET_FRAME_STATE_READ_EX_LENGTH", value: 2)
!812 = !DIEnumerator(name: "MOD_WEBSOCKET_FRAME_STATE_READ_MASK", value: 3)
!813 = !DIEnumerator(name: "MOD_WEBSOCKET_FRAME_STATE_READ_PAYLOAD", value: 4)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 138, baseType: !15, size: 32, elements: !815)
!815 = !{!816, !817, !818, !819, !820}
!816 = !DIEnumerator(name: "MOD_WEBSOCKET_FRAME_TYPE_TEXT", value: 0)
!817 = !DIEnumerator(name: "MOD_WEBSOCKET_FRAME_TYPE_BIN", value: 1)
!818 = !DIEnumerator(name: "MOD_WEBSOCKET_FRAME_TYPE_CLOSE", value: 2)
!819 = !DIEnumerator(name: "MOD_WEBSOCKET_FRAME_TYPE_PING", value: 3)
!820 = !DIEnumerator(name: "MOD_WEBSOCKET_FRAME_TYPE_PONG", value: 4)
!821 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !598, line: 16, baseType: !15, size: 32, elements: !822)
!822 = !{!823, !824, !825, !826, !827}
!823 = !DIEnumerator(name: "BACKEND_PROXY", value: 0)
!824 = !DIEnumerator(name: "BACKEND_CGI", value: 1)
!825 = !DIEnumerator(name: "BACKEND_FASTCGI", value: 2)
!826 = !DIEnumerator(name: "BACKEND_SCGI", value: 3)
!827 = !DIEnumerator(name: "BACKEND_AJP13", value: 4)
!828 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !829, line: 7, baseType: !15, size: 32, elements: !830)
!829 = !DIFile(filename: "spack-src/src/base64.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "34cccdb3ccaf9748e170a5a70cd9656a")
!830 = !{!831, !832}
!831 = !DIEnumerator(name: "BASE64_STANDARD", value: 0)
!832 = !DIEnumerator(name: "BASE64_URL", value: 1)
!833 = !{!28, !834, !15, !49, !1007, !87, !1016, !4, !1054, !1055, !454, !531, !1056, !47, !1057, !193}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "gw_plugin_data", file: !91, line: 283, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gw_plugin_data", file: !91, line: 278, size: 1024, elements: !837)
!837 = !{!838, !839, !840, !863, !865, !866, !1006}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !836, file: !91, line: 279, baseType: !87, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "nconfig", scope: !836, file: !91, line: 279, baseType: !87, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "cvlist", scope: !836, file: !91, line: 279, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_plugin_value_t", file: !464, line: 124, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config_plugin_value", file: !464, line: 110, size: 128, elements: !844)
!844 = !{!845, !846, !848}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "k_id", scope: !843, file: !464, line: 111, baseType: !87, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !843, file: !464, line: 112, baseType: !847, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_values_type_t", file: !464, line: 102, baseType: !692)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !843, file: !464, line: 123, baseType: !849, size: 64, offset: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "v_u", file: !464, line: 113, size: 64, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !849, file: !464, line: 114, baseType: !28, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !849, file: !464, line: 115, baseType: !144, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !849, file: !464, line: 116, baseType: !476, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !849, file: !464, line: 117, baseType: !163, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !849, file: !464, line: 118, baseType: !15, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "shrt", scope: !849, file: !464, line: 119, baseType: !318, size: 16)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !849, file: !464, line: 120, baseType: !614, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !849, file: !464, line: 121, baseType: !116, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "u2", scope: !849, file: !464, line: 122, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 64, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 2)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !836, file: !91, line: 279, baseType: !864, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "srv_pid", scope: !836, file: !91, line: 280, baseType: !439, size: 32, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !836, file: !91, line: 281, baseType: !867, size: 384, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "gw_plugin_config", file: !91, line: 275, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gw_plugin_config", file: !91, line: 267, size: 384, elements: !869)
!869 = !{!870, !1000, !1001, !1002, !1003, !1004, !1005}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "exts", scope: !868, file: !91, line: 268, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "gw_exts", file: !91, line: 257, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 253, size: 128, elements: !874)
!874 = !{!875, !998, !999}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "exts", scope: !873, file: !91, line: 254, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "gw_extension", file: !91, line: 251, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 242, size: 320, elements: !879)
!879 = !{!880, !881, !882, !883, !996, !997}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !878, file: !91, line: 243, baseType: !477, size: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "note_is_sent", scope: !878, file: !91, line: 245, baseType: !87, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "last_used_ndx", scope: !878, file: !91, line: 246, baseType: !87, size: 32, offset: 160)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "hosts", scope: !878, file: !91, line: 248, baseType: !884, size: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "gw_host", file: !91, line: 221, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 47, size: 1664, elements: !888)
!888 = !{!889, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !887, file: !91, line: 55, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "gw_proc", file: !91, line: 43, baseType: !708)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "active_procs", scope: !887, file: !91, line: 57, baseType: !49, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gw_hash", scope: !887, file: !91, line: 58, baseType: !49, size: 32, offset: 96)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !887, file: !91, line: 60, baseType: !193, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "stats_load", scope: !887, file: !91, line: 61, baseType: !716, size: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "stats_global_active", scope: !887, file: !91, line: 62, baseType: !716, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !887, file: !91, line: 74, baseType: !318, size: 16, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !887, file: !91, line: 75, baseType: !318, size: 16, offset: 336)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !887, file: !91, line: 76, baseType: !476, size: 64, offset: 384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !887, file: !91, line: 79, baseType: !476, size: 64, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "unused_procs", scope: !887, file: !91, line: 80, baseType: !890, size: 64, offset: 512)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "min_procs", scope: !887, file: !91, line: 92, baseType: !318, size: 16, offset: 576)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "max_procs", scope: !887, file: !91, line: 93, baseType: !318, size: 16, offset: 592)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "num_procs", scope: !887, file: !91, line: 94, baseType: !49, size: 32, offset: 608)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "max_load_per_proc", scope: !887, file: !91, line: 96, baseType: !318, size: 16, offset: 640)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout", scope: !887, file: !91, line: 106, baseType: !318, size: 16, offset: 656)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "disable_time", scope: !887, file: !91, line: 114, baseType: !318, size: 16, offset: 672)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !887, file: !91, line: 116, baseType: !318, size: 16, offset: 688)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "write_timeout", scope: !887, file: !91, line: 117, baseType: !318, size: 16, offset: 704)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "connect_timeout", scope: !887, file: !91, line: 118, baseType: !318, size: 16, offset: 720)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "hctxs", scope: !887, file: !91, line: 119, baseType: !912, size: 64, offset: 768)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gw_handler_ctx", file: !91, line: 300, size: 2816, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !956, !957, !958, !959, !960, !961, !962, !966, !967, !968, !969, !973}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !913, file: !91, line: 301, baseType: !890, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !913, file: !91, line: 302, baseType: !885, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !913, file: !91, line: 303, baseType: !876, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ext_auth", scope: !913, file: !91, line: 304, baseType: !876, size: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gw_mode", scope: !913, file: !91, line: 305, baseType: !318, size: 16, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !913, file: !91, line: 307, baseType: !921, size: 32, offset: 288)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "gw_connection_state_t", file: !91, line: 292, baseType: !737)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !913, file: !91, line: 309, baseType: !96, size: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "wb_reqlen", scope: !913, file: !91, line: 310, baseType: !116, size: 64, offset: 384)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "wb", scope: !913, file: !91, line: 311, baseType: !97, size: 448, offset: 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !913, file: !91, line: 313, baseType: !114, size: 64, offset: 896)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ev", scope: !913, file: !91, line: 315, baseType: !89, size: 64, offset: 960)
