; ModuleID = 'samples/608.bc'
source_filename = "ncache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.dns_rdatasetmethods = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.isc_buffer = type { i32, ptr, i32, i32, i32, i32, %struct.anon.5, ptr, i8 }
%struct.anon.5 = type { ptr, ptr }
%struct.isc_region = type { ptr, i32 }
%struct.dns_rdata = type { ptr, i32, i16, i16, i32, %struct.anon.4 }
%struct.anon.4 = type { ptr, ptr }
%struct.dns_rdataset = type { i32, ptr, %struct.anon.8, i16, i16, i32, i32, i16, i16, i32, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr }
%struct.anon.8 = type { ptr, ptr }
%struct.dns_rdatalist = type { i16, i16, i16, i32, %struct.anon.10, %struct.anon.11, [32 x i8] }
%struct.anon.10 = type { ptr, ptr }
%struct.anon.11 = type { ptr, ptr }
%struct.dns_message = type { i32, i16, i32, i16, i16, i16, [4 x i32], [4 x %struct.dns_namelist_t], [4 x ptr], ptr, ptr, ptr, i32, i16, i32, i32, i32, i16, i32, ptr, ptr, ptr, ptr, ptr, %struct.isc_bufferlist_t, %struct.isc_bufferlist_t, %struct.anon, %struct.anon.0, %struct.anon.1, %struct.anon.2, %struct.anon.3, i16, i16, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, i16, %struct.isc_region, %struct.isc_region, ptr, %struct.dns_sortlist_arg }
%struct.dns_namelist_t = type { ptr, ptr }
%struct.isc_bufferlist_t = type { ptr, ptr }
%struct.anon = type { ptr, ptr }

!250 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!251 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_trust_t", file: !111, line: 140, baseType: !247)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatatype_t", file: !111, line: 126, baseType: !247)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rcode_t", file: !111, line: 118, baseType: !247)
!255 = !{!0, !8, !13, !18, !23, !28, !33, !35, !40, !45, !47, !49, !51, !56, !58, !63, !68, !73, !78, !83, !88, !93, !95, !97, !99, !104, !256, !261, !263, !268, !270, !275, !277, !282, !284, !286, !291, !296, !301, !303, !106, !308}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !2, line: 621, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 17)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !2, line: 634, type: !30, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !2, line: 641, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 10)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 703, type: !15, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !2, line: 713, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 34)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !30, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !2, line: 210, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 42)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !42, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !279, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !2, line: 257, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 16)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 57)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 15)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !20, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !2, line: 74, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 18)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !305, isLocal: true, isDefinition: true)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetmethods_t", file: !311, line: 96, baseType: !312)
!311 = !DIFile(filename: "include/dns/rdataset.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "a2414fd23f718a363582354673aed6a8")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetmethods", file: !311, line: 64, size: 1024, elements: !313)
!313 = !{!314, !354, !360, !361, !380, !384, !388, !438, !442, !443, !444, !448, !449, !450, !454, !460}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "disassociate", scope: !312, file: !311, line: 65, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataset_t", file: !111, line: 123, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdataset", file: !311, line: 107, size: 960, elements: !321)
!321 = !{!322, !323, !325, !330, !332, !333, !337, !338, !339, !340, !341, !342, !345, !346, !347, !348, !349, !350, !353}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !320, file: !311, line: 108, baseType: !112, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !320, file: !311, line: 109, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !320, file: !311, line: 110, baseType: !326, size: 128, offset: 128)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !311, line: 110, size: 128, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !326, file: !311, line: 110, baseType: !318, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !311, line: 110, baseType: !318, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !320, file: !311, line: 117, baseType: !331, size: 16, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataclass_t", file: !111, line: 121, baseType: !247)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !311, line: 118, baseType: !253, size: 16, offset: 272)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !320, file: !311, line: 119, baseType: !334, size: 32, offset: 288)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_ttl_t", file: !111, line: 144, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !248, line: 26, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !250, line: 42, baseType: !112)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "stale_ttl", scope: !320, file: !311, line: 124, baseType: !334, size: 32, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !320, file: !311, line: 125, baseType: !252, size: 16, offset: 352)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "covers", scope: !320, file: !311, line: 126, baseType: !253, size: 16, offset: 368)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !320, file: !311, line: 131, baseType: !112, size: 32, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !320, file: !311, line: 139, baseType: !335, size: 32, offset: 416)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "resign", scope: !320, file: !311, line: 145, baseType: !343, size: 32, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_stdtime_t", file: !344, line: 26, baseType: !335)
!344 = !DIFile(filename: "../../lib/isc/unix/include/isc/stdtime.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "b8868fded6c0eb282ad50986c628a693")
!345 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !320, file: !311, line: 152, baseType: !244, size: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !320, file: !311, line: 153, baseType: !244, size: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !320, file: !311, line: 154, baseType: !244, size: 64, offset: 640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "privateuint4", scope: !320, file: !311, line: 155, baseType: !112, size: 32, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !320, file: !311, line: 156, baseType: !244, size: 64, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !320, file: !311, line: 157, baseType: !351, size: 64, offset: 832)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "private7", scope: !320, file: !311, line: 158, baseType: !351, size: 64, offset: 896)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !312, file: !311, line: 66, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!358, !318}
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_result_t", file: !359, line: 67, baseType: !112)
!359 = !DIFile(filename: "isc/include/isc/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "6a355582c4f962c465b18bab43b68c96")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !311, line: 67, baseType: !355, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !312, file: !311, line: 68, baseType: !362, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !318, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdata_t", file: !111, line: 119, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdata", file: !368, line: 112, size: 320, elements: !369)
!368 = !DIFile(filename: "include/dns/rdata.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "e790fb4f336bc4fdcd566550403b32a6")
!369 = !{!370, !371, !372, !373, !374, !375}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !367, file: !368, line: 113, baseType: !245, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !367, file: !368, line: 114, baseType: !112, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !367, file: !368, line: 115, baseType: !331, size: 16, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !368, line: 116, baseType: !253, size: 16, offset: 112)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !367, file: !368, line: 117, baseType: !112, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !367, file: !368, line: 118, baseType: !376, size: 128, offset: 192)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !367, file: !368, line: 118, size: 128, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !376, file: !368, line: 118, baseType: !365, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !376, file: !368, line: 118, baseType: !365, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !312, file: !311, line: 70, baseType: !381, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !318, !318}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !312, file: !311, line: 72, baseType: !385, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!112, !318}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "addnoqname", scope: !312, file: !311, line: 73, baseType: !389, size: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!358, !318, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_name_t", file: !111, line: 107, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_name", file: !396, line: 104, size: 640, elements: !397)
!396 = !DIFile(filename: "include/dns/name.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "ec64c9a43875cd86cb4b0e37c1191a89")
!397 = !{!398, !399, !400, !401, !402, !403, !404, !427, !433}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !395, file: !396, line: 105, baseType: !112, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ndata", scope: !395, file: !396, line: 106, baseType: !245, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !395, file: !396, line: 107, baseType: !112, size: 32, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !395, file: !396, line: 108, baseType: !112, size: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !395, file: !396, line: 109, baseType: !112, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !395, file: !396, line: 110, baseType: !245, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !395, file: !396, line: 111, baseType: !405, size: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_buffer_t", file: !359, line: 35, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_buffer", file: !408, line: 173, size: 512, elements: !409)
!408 = !DIFile(filename: "isc/include/isc/buffer.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "feec9784066f3891a27281dd5bdccd55")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !421, !425}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !407, file: !408, line: 174, baseType: !112, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !407, file: !408, line: 175, baseType: !244, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !407, file: !408, line: 178, baseType: !112, size: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !407, file: !408, line: 179, baseType: !112, size: 32, offset: 160)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !407, file: !408, line: 180, baseType: !112, size: 32, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !407, file: !408, line: 181, baseType: !112, size: 32, offset: 224)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !407, file: !408, line: 184, baseType: !417, size: 128, offset: 256)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !408, line: 184, size: 128, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !408, line: 184, baseType: !405, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !408, line: 184, baseType: !405, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !407, file: !408, line: 186, baseType: !422, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mem_t", file: !359, line: 59, baseType: !424)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mem", file: !359, line: 59, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "autore", scope: !407, file: !408, line: 188, baseType: !426, size: 8, offset: 448)
!426 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !395, file: !396, line: 112, baseType: !428, size: 128, offset: 384)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !395, file: !396, line: 112, size: 128, elements: !429)
!429 = !{!430, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !428, file: !396, line: 112, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !428, file: !396, line: 112, baseType: !431, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !395, file: !396, line: 113, baseType: !434, size: 128, offset: 512)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !395, file: !396, line: 113, size: 128, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !434, file: !396, line: 113, baseType: !318, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !434, file: !396, line: 113, baseType: !318, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "getnoqname", scope: !312, file: !311, line: 75, baseType: !439, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!358, !318, !431, !318, !318}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "addclosest", scope: !312, file: !311, line: 79, baseType: !389, size: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "getclosest", scope: !312, file: !311, line: 81, baseType: !439, size: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "settrust", scope: !312, file: !311, line: 85, baseType: !445, size: 64, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !318, !252}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !312, file: !311, line: 87, baseType: !315, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "clearprefetch", scope: !312, file: !311, line: 88, baseType: !315, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "setownercase", scope: !312, file: !311, line: 89, baseType: !451, size: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !318, !392}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "getownercase", scope: !312, file: !311, line: 91, baseType: !455, size: 64, offset: 896)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !458, !431}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "addglue", scope: !312, file: !311, line: 93, baseType: !461, size: 64, offset: 960)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!358, !318, !464, !466}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbversion_t", file: !111, line: 61, baseType: null)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_message_t", file: !111, line: 103, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_message", file: !469, line: 197, size: 3840, elements: !470)
!469 = !DIFile(filename: "include/dns/message.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "6416f0e57c4314c86bb1ccbb29bdbc0d")
!470 = !{!471, !472, !474, !475, !476, !478, !479, !483, !490, !492, !493, !494, !495, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !547, !548, !552, !553, !559, !560, !568, !573, !578, !583, !609, !610, !611, !612, !613, !617, !622, !623, !624, !625, !629, !630, !631, !632, !639}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !468, file: !469, line: 199, baseType: !112, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !468, file: !469, line: 201, baseType: !473, size: 16, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_messageid_t", file: !111, line: 104, baseType: !247)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !468, file: !469, line: 202, baseType: !112, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !468, file: !469, line: 203, baseType: !254, size: 16, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !468, file: !469, line: 204, baseType: !477, size: 16, offset: 112)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_opcode_t", file: !111, line: 111, baseType: !247)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !468, file: !469, line: 205, baseType: !331, size: 16, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !468, file: !469, line: 208, baseType: !480, size: 128, offset: 160)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 4)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sections", scope: !468, file: !469, line: 211, baseType: !484, size: 512, offset: 320)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 512, elements: !481)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_namelist_t", file: !111, line: 108, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 108, size: 128, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !486, file: !111, line: 108, baseType: !431, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !486, file: !111, line: 108, baseType: !431, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cursors", scope: !468, file: !469, line: 212, baseType: !491, size: 256, offset: 832)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 256, elements: !481)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !468, file: !469, line: 213, baseType: !318, size: 64, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sig0", scope: !468, file: !469, line: 214, baseType: !318, size: 64, offset: 1152)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tsig", scope: !468, file: !469, line: 215, baseType: !318, size: 64, offset: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !468, file: !469, line: 217, baseType: !496, size: 32, offset: 1280)
!496 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "from_to_wire", scope: !468, file: !469, line: 218, baseType: !112, size: 2, offset: 1312, flags: DIFlagBitField, extraData: i64 1312)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "header_ok", scope: !468, file: !469, line: 219, baseType: !112, size: 1, offset: 1314, flags: DIFlagBitField, extraData: i64 1312)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "question_ok", scope: !468, file: !469, line: 220, baseType: !112, size: 1, offset: 1315, flags: DIFlagBitField, extraData: i64 1312)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_continuation", scope: !468, file: !469, line: 221, baseType: !112, size: 1, offset: 1316, flags: DIFlagBitField, extraData: i64 1312)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "verified_sig", scope: !468, file: !469, line: 222, baseType: !112, size: 1, offset: 1317, flags: DIFlagBitField, extraData: i64 1312)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "verify_attempted", scope: !468, file: !469, line: 223, baseType: !112, size: 1, offset: 1318, flags: DIFlagBitField, extraData: i64 1312)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "free_query", scope: !468, file: !469, line: 224, baseType: !112, size: 1, offset: 1319, flags: DIFlagBitField, extraData: i64 1312)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "free_saved", scope: !468, file: !469, line: 225, baseType: !112, size: 1, offset: 1320, flags: DIFlagBitField, extraData: i64 1312)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cc_ok", scope: !468, file: !469, line: 226, baseType: !112, size: 1, offset: 1321, flags: DIFlagBitField, extraData: i64 1312)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cc_bad", scope: !468, file: !469, line: 227, baseType: !112, size: 1, offset: 1322, flags: DIFlagBitField, extraData: i64 1312)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tkey", scope: !468, file: !469, line: 228, baseType: !112, size: 1, offset: 1323, flags: DIFlagBitField, extraData: i64 1312)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass_set", scope: !468, file: !469, line: 229, baseType: !112, size: 1, offset: 1324, flags: DIFlagBitField, extraData: i64 1312)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "opt_reserved", scope: !468, file: !469, line: 231, baseType: !112, size: 32, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sig_reserved", scope: !468, file: !469, line: 232, baseType: !112, size: 32, offset: 1376)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !468, file: !469, line: 233, baseType: !112, size: 32, offset: 1408)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !468, file: !469, line: 235, baseType: !247, size: 16, offset: 1440)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "padding_off", scope: !468, file: !469, line: 236, baseType: !112, size: 32, offset: 1472)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !468, file: !469, line: 238, baseType: !405, size: 64, offset: 1536)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cctx", scope: !468, file: !469, line: 239, baseType: !516, size: 64, offset: 1600)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compress_t", file: !111, line: 53, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compress", file: !519, line: 66, size: 18688, elements: !520)
!519 = !DIFile(filename: "include/dns/compress.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "ae360072e6dd15c4fe76c4efa2dcea4c")
!520 = !{!521, !522, !523, !524, !543, !545, !546}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !518, file: !519, line: 67, baseType: !112, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !518, file: !519, line: 68, baseType: !112, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "edns", scope: !518, file: !519, line: 69, baseType: !496, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !518, file: !519, line: 71, baseType: !525, size: 4096, offset: 128)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 4096, elements: !541)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compressnode_t", file: !519, line: 56, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compressnode", file: !519, line: 58, size: 896, elements: !529)
!529 = !{!530, !531, !532, !533, !540}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !528, file: !519, line: 59, baseType: !526, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !528, file: !519, line: 60, baseType: !247, size: 16, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !528, file: !519, line: 61, baseType: !247, size: 16, offset: 80)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !528, file: !519, line: 62, baseType: !534, size: 128, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_region_t", file: !359, line: 65, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_region", file: !536, line: 21, size: 128, elements: !537)
!536 = !DIFile(filename: "isc/include/isc/region.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "2ed4a07dc05ddbd48f51e2dc9be9f317")
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !535, file: !536, line: 22, baseType: !245, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !535, file: !536, line: 23, baseType: !112, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !519, line: 63, baseType: !394, size: 640, offset: 256)
!541 = !{!542}
!542 = !DISubrange(count: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "initialnodes", scope: !518, file: !519, line: 73, baseType: !544, size: 14336, offset: 4224)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 14336, elements: !289)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !518, file: !519, line: 74, baseType: !247, size: 16, offset: 18560)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !518, file: !519, line: 75, baseType: !422, size: 64, offset: 18624)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !468, file: !469, line: 241, baseType: !422, size: 64, offset: 1664)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "namepool", scope: !468, file: !469, line: 242, baseType: !549, size: 64, offset: 1728)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mempool_t", file: !359, line: 60, baseType: !551)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mempool", file: !359, line: 60, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rdspool", scope: !468, file: !469, line: 243, baseType: !549, size: 64, offset: 1792)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "scratchpad", scope: !468, file: !469, line: 245, baseType: !554, size: 128, offset: 1856)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_bufferlist_t", file: !359, line: 36, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 36, size: 128, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !555, file: !359, line: 36, baseType: !405, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !555, file: !359, line: 36, baseType: !405, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !468, file: !469, line: 246, baseType: !554, size: 128, offset: 1984)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rdatas", scope: !468, file: !469, line: 248, baseType: !561, size: 128, offset: 2112)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !469, line: 248, size: 128, elements: !562)
!562 = !{!563, !567}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !561, file: !469, line: 248, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_msgblock_t", file: !469, line: 189, baseType: !566)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_msgblock", file: !469, line: 189, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !561, file: !469, line: 248, baseType: !564, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rdatalists", scope: !468, file: !469, line: 249, baseType: !569, size: 128, offset: 2240)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !469, line: 249, size: 128, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !569, file: !469, line: 249, baseType: !564, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !569, file: !469, line: 249, baseType: !564, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !468, file: !469, line: 250, baseType: !574, size: 128, offset: 2368)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !469, line: 250, size: 128, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !574, file: !469, line: 250, baseType: !564, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !574, file: !469, line: 250, baseType: !564, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "freerdata", scope: !468, file: !469, line: 252, baseType: !579, size: 128, offset: 2496)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !469, line: 252, size: 128, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !579, file: !469, line: 252, baseType: !365, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !579, file: !469, line: 252, baseType: !365, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "freerdatalist", scope: !468, file: !469, line: 253, baseType: !584, size: 128, offset: 2624)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !469, line: 253, size: 128, elements: !585)
!585 = !{!586, !608}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !584, file: !469, line: 253, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatalist_t", file: !111, line: 122, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatalist", file: !590, line: 47, size: 640, elements: !591)
!590 = !DIFile(filename: "include/dns/rdatalist.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "83ad1004003459f099937cac6d2eb8e0")
!591 = !{!592, !593, !594, !595, !596, !601, !606}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !589, file: !590, line: 48, baseType: !331, size: 16)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !589, file: !590, line: 49, baseType: !253, size: 16, offset: 16)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "covers", scope: !589, file: !590, line: 50, baseType: !253, size: 16, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !589, file: !590, line: 51, baseType: !334, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rdata", scope: !589, file: !590, line: 52, baseType: !597, size: 128, offset: 128)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !589, file: !590, line: 52, size: 128, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !597, file: !590, line: 52, baseType: !365, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !597, file: !590, line: 52, baseType: !365, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !589, file: !590, line: 53, baseType: !602, size: 128, offset: 256)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !589, file: !590, line: 53, size: 128, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !602, file: !590, line: 53, baseType: !587, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !602, file: !590, line: 53, baseType: !587, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !589, file: !590, line: 59, baseType: !607, size: 256, offset: 384)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 256, elements: !26)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !584, file: !469, line: 253, baseType: !587, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tsigstatus", scope: !468, file: !469, line: 255, baseType: !254, size: 16, offset: 2752)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "querytsigstatus", scope: !468, file: !469, line: 256, baseType: !254, size: 16, offset: 2768)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tsigname", scope: !468, file: !469, line: 257, baseType: !431, size: 64, offset: 2816)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "querytsig", scope: !468, file: !469, line: 258, baseType: !318, size: 64, offset: 2880)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "tsigkey", scope: !468, file: !469, line: 259, baseType: !614, size: 64, offset: 2944)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_tsigkey_t", file: !111, line: 143, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_tsigkey", file: !111, line: 143, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tsigctx", scope: !468, file: !469, line: 260, baseType: !618, size: 64, offset: 3008)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_context_t", file: !620, line: 45, baseType: !621)
!620 = !DIFile(filename: "include/dst/dst.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "10e76bcacbe005e6cc7dee2ac6ffac9a")
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_context", file: !620, line: 45, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sigstart", scope: !468, file: !469, line: 261, baseType: !496, size: 32, offset: 3072)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "timeadjust", scope: !468, file: !469, line: 262, baseType: !496, size: 32, offset: 3104)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "sig0name", scope: !468, file: !469, line: 264, baseType: !431, size: 64, offset: 3136)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sig0key", scope: !468, file: !469, line: 265, baseType: !626, size: 64, offset: 3200)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_key_t", file: !620, line: 44, baseType: !628)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_key", file: !620, line: 44, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sig0status", scope: !468, file: !469, line: 266, baseType: !254, size: 16, offset: 3264)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !468, file: !469, line: 267, baseType: !534, size: 128, offset: 3328)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !468, file: !469, line: 268, baseType: !534, size: 128, offset: 3456)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !468, file: !469, line: 270, baseType: !633, size: 64, offset: 3584)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetorderfunc_t", file: !111, line: 415, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!496, !637, !351}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "order_arg", scope: !468, file: !469, line: 271, baseType: !640, size: 192, offset: 3648)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_sortlist_arg_t", file: !111, line: 134, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_sortlist_arg", file: !469, line: 191, size: 192, elements: !642)
!642 = !{!643, !647, !652}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !641, file: !469, line: 192, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclenv_t", file: !111, line: 32, baseType: !646)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclenv", file: !111, line: 32, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !641, file: !469, line: 193, baseType: !648, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_acl_t", file: !111, line: 30, baseType: !651)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_acl", file: !111, line: 30, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !641, file: !469, line: 194, baseType: !653, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclelement_t", file: !111, line: 31, baseType: !656)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclelement", file: !111, line: 31, flags: DIFlagFwdDecl)
!657 = !{i32 7, !"Dwarf Version", i32 5}
!658 = !{i32 2, !"Debug Info Version", i32 3}
!659 = !{i32 1, !"wchar_size", i32 4}
!660 = !{i32 8, !"PIC Level", i32 2}
!661 = !{i32 7, !"uwtable", i32 2}
!662 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!663 = distinct !DISubprogram(name: "dns_ncache_add", scope: !2, file: !2, line: 98, type: !664, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !1072)
!664 = !DISubroutineType(types: !665)
!665 = !{!358, !466, !666, !783, !253, !343, !334, !334, !318}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_db_t", file: !111, line: 54, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_db", file: !669, line: 223, size: 1024, elements: !670)
!669 = !DIFile(filename: "include/dns/db.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "f7341a6445a0da00d6edbc7f74bf2ce5")
!670 = !{!671, !672, !673, !1048, !1049, !1050, !1051, !1052}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !668, file: !669, line: 224, baseType: !112, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !668, file: !669, line: 225, baseType: !112, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !668, file: !669, line: 226, baseType: !674, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbmethods_t", file: !669, line: 200, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_dbmethods", file: !669, line: 71, size: 3072, elements: !677)
!677 = !{!678, !683, !687, !694, !695, !755, !761, !766, !770, !774, !778, !785, !789, !793, !797, !801, !805, !809, !817, !821, !829, !833, !837, !841, !845, !849, !850, !854, !861, !865, !869, !880, !881, !885, !889, !893, !894, !901, !905, !909, !1012, !1016, !1023, !1027, !1031, !1038, !1042, !1047}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "attach", scope: !676, file: !669, line: 72, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !666, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !676, file: !669, line: 73, baseType: !684, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !682}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "beginload", scope: !676, file: !669, line: 74, baseType: !688, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!358, !666, !691}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatacallbacks_t", file: !111, line: 120, baseType: !693)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatacallbacks", file: !111, line: 120, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "endload", scope: !676, file: !669, line: 76, baseType: !688, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "serialize", scope: !676, file: !669, line: 78, baseType: !696, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!358, !666, !464, !699}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !701, line: 7, baseType: !702)
!701 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !703, line: 49, size: 1728, elements: !704)
!703 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!704 = !{!705, !706, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !721, !723, !724, !725, !728, !729, !731, !735, !738, !740, !743, !746, !747, !748, !752, !753}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !702, file: !703, line: 51, baseType: !496, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !702, file: !703, line: 54, baseType: !707, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !702, file: !703, line: 55, baseType: !707, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !702, file: !703, line: 56, baseType: !707, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !702, file: !703, line: 57, baseType: !707, size: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !702, file: !703, line: 58, baseType: !707, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !702, file: !703, line: 59, baseType: !707, size: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !702, file: !703, line: 60, baseType: !707, size: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !702, file: !703, line: 61, baseType: !707, size: 64, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !702, file: !703, line: 64, baseType: !707, size: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !702, file: !703, line: 65, baseType: !707, size: 64, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !702, file: !703, line: 66, baseType: !707, size: 64, offset: 704)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !702, file: !703, line: 68, baseType: !719, size: 64, offset: 768)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !703, line: 36, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !702, file: !703, line: 70, baseType: !722, size: 64, offset: 832)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !702, file: !703, line: 72, baseType: !496, size: 32, offset: 896)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !702, file: !703, line: 73, baseType: !496, size: 32, offset: 928)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !702, file: !703, line: 74, baseType: !726, size: 64, offset: 960)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !250, line: 152, baseType: !727)
!727 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !702, file: !703, line: 77, baseType: !251, size: 16, offset: 1024)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !702, file: !703, line: 78, baseType: !730, size: 8, offset: 1040)
!730 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !702, file: !703, line: 79, baseType: !732, size: 8, offset: 1048)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 1)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !702, file: !703, line: 81, baseType: !736, size: 64, offset: 1088)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !703, line: 43, baseType: null)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !702, file: !703, line: 89, baseType: !739, size: 64, offset: 1152)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !250, line: 153, baseType: !727)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !702, file: !703, line: 91, baseType: !741, size: 64, offset: 1216)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !703, line: 37, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !702, file: !703, line: 92, baseType: !744, size: 64, offset: 1280)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !703, line: 38, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !702, file: !703, line: 93, baseType: !722, size: 64, offset: 1344)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !702, file: !703, line: 94, baseType: !244, size: 64, offset: 1408)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !702, file: !703, line: 95, baseType: !749, size: 64, offset: 1472)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !750, line: 70, baseType: !751)
!750 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!751 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !702, file: !703, line: 96, baseType: !496, size: 32, offset: 1536)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !702, file: !703, line: 98, baseType: !754, size: 160, offset: 1568)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !676, file: !669, line: 80, baseType: !756, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!358, !666, !464, !759, !760}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_masterformat_t", file: !111, line: 218, baseType: !110)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "currentversion", scope: !676, file: !669, line: 83, baseType: !762, size: 64, offset: 384)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !666, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "newversion", scope: !676, file: !669, line: 85, baseType: !767, size: 64, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!358, !666, !765}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "attachversion", scope: !676, file: !669, line: 87, baseType: !771, size: 64, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !666, !464, !765}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "closeversion", scope: !676, file: !669, line: 89, baseType: !775, size: 64, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !666, !765, !426}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "findnode", scope: !676, file: !669, line: 92, baseType: !779, size: 64, offset: 640)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!358, !666, !392, !426, !782}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbnode_t", file: !111, line: 58, baseType: null)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !676, file: !669, line: 95, baseType: !786, size: 64, offset: 704)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!358, !666, !392, !464, !253, !112, !343, !782, !431, !318, !318}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "findzonecut", scope: !676, file: !669, line: 102, baseType: !790, size: 64, offset: 768)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!358, !666, !392, !112, !343, !782, !431, !431, !318, !318}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "attachnode", scope: !676, file: !669, line: 109, baseType: !794, size: 64, offset: 832)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !666, !783, !782}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "detachnode", scope: !676, file: !669, line: 112, baseType: !798, size: 64, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !666, !782}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "expirenode", scope: !676, file: !669, line: 114, baseType: !802, size: 64, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!358, !666, !783, !343}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "printnode", scope: !676, file: !669, line: 116, baseType: !806, size: 64, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !666, !783, !699}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "createiterator", scope: !676, file: !669, line: 118, baseType: !810, size: 64, offset: 1088)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!358, !666, !112, !813}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbiterator_t", file: !111, line: 56, baseType: !816)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_dbiterator", file: !111, line: 56, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "findrdataset", scope: !676, file: !669, line: 120, baseType: !818, size: 64, offset: 1152)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!358, !666, !783, !464, !253, !253, !343, !318, !318}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "allrdatasets", scope: !676, file: !669, line: 127, baseType: !822, size: 64, offset: 1216)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!358, !666, !783, !464, !343, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetiter_t", file: !111, line: 125, baseType: !828)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetiter", file: !111, line: 125, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "addrdataset", scope: !676, file: !669, line: 131, baseType: !830, size: 64, offset: 1280)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!358, !666, !783, !464, !343, !318, !112, !318}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "subtractrdataset", scope: !676, file: !669, line: 137, baseType: !834, size: 64, offset: 1344)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!358, !666, !783, !464, !318, !112, !318}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "deleterdataset", scope: !676, file: !669, line: 142, baseType: !838, size: 64, offset: 1408)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!358, !666, !783, !464, !253, !253}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "issecure", scope: !676, file: !669, line: 146, baseType: !842, size: 64, offset: 1472)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!426, !666}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nodecount", scope: !676, file: !669, line: 147, baseType: !846, size: 64, offset: 1536)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!112, !666}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ispersistent", scope: !676, file: !669, line: 148, baseType: !842, size: 64, offset: 1600)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "overmem", scope: !676, file: !669, line: 149, baseType: !851, size: 64, offset: 1664)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !666, !426}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "settask", scope: !676, file: !669, line: 150, baseType: !855, size: 64, offset: 1728)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !666, !858}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_task_t", file: !359, line: 77, baseType: !860)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_task", file: !359, line: 77, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "getoriginnode", scope: !676, file: !669, line: 151, baseType: !862, size: 64, offset: 1792)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!358, !666, !782}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "transfernode", scope: !676, file: !669, line: 152, baseType: !866, size: 64, offset: 1856)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !666, !782, !782}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "getnsec3parameters", scope: !676, file: !669, line: 154, baseType: !870, size: 64, offset: 1920)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!358, !666, !464, !873, !875, !878, !245, !879}
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_hash_t", file: !111, line: 166, baseType: !118)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !248, line: 24, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !250, line: 38, baseType: !246)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "findnsec3node", scope: !676, file: !669, line: 161, baseType: !779, size: 64, offset: 1984)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "setsigningtime", scope: !676, file: !669, line: 164, baseType: !882, size: 64, offset: 2048)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!358, !666, !318, !343}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "getsigningtime", scope: !676, file: !669, line: 167, baseType: !886, size: 64, offset: 2112)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!358, !666, !318, !431}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "resigned", scope: !676, file: !669, line: 170, baseType: !890, size: 64, offset: 2176)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !666, !318, !464}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "isdnssec", scope: !676, file: !669, line: 172, baseType: !842, size: 64, offset: 2240)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "getrrsetstats", scope: !676, file: !669, line: 173, baseType: !895, size: 64, offset: 2304)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!898, !666}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_stats_t", file: !111, line: 137, baseType: !900)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_stats", file: !111, line: 137, flags: DIFlagFwdDecl)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "rpz_attach", scope: !676, file: !669, line: 174, baseType: !902, size: 64, offset: 2368)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !666, !244, !876}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rpz_ready", scope: !676, file: !669, line: 176, baseType: !906, size: 64, offset: 2432)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!358, !666}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "findnodeext", scope: !676, file: !669, line: 177, baseType: !910, size: 64, offset: 2496)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!358, !666, !392, !426, !913, !925, !782}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_clientinfomethods_t", file: !915, line: 68, baseType: !916)
!915 = !DIFile(filename: "include/dns/clientinfo.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/dns", checksumkind: CSK_MD5, checksum: "f273dbbef534c5352c6d152e1993b2e9")
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_clientinfomethods", file: !915, line: 64, size: 128, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !916, file: !915, line: 65, baseType: !247, size: 16)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !916, file: !915, line: 66, baseType: !247, size: 16, offset: 16)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "sourceip", scope: !916, file: !915, line: 67, baseType: !921, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_clientinfo_sourceip_t", file: !915, line: 58, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!358, !925, !932}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_clientinfo_t", file: !915, line: 56, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_clientinfo", file: !915, line: 52, size: 192, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !927, file: !915, line: 53, baseType: !247, size: 16)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !927, file: !915, line: 54, baseType: !244, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dbversion", scope: !927, file: !915, line: 55, baseType: !244, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_sockaddr_t", file: !359, line: 69, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_sockaddr", file: !936, line: 27, size: 1216, elements: !937)
!936 = !DIFile(filename: "isc/include/isc/sockaddr.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib", checksumkind: CSK_MD5, checksum: "b46a0f057942d922d0824c5621821d46")
!937 = !{!938, !1005, !1006}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !935, file: !936, line: 36, baseType: !939, size: 1024)
!939 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !935, file: !936, line: 28, size: 1024, elements: !940)
!940 = !{!941, !952, !968, !987, !996}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !939, file: !936, line: 29, baseType: !942, size: 128)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !943, line: 180, size: 128, elements: !944)
!943 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!944 = !{!945, !948}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !942, file: !943, line: 182, baseType: !946, size: 16)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !947, line: 28, baseType: !251)
!947 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!948 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !942, file: !943, line: 183, baseType: !949, size: 112, offset: 16)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 112, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 14)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !939, file: !936, line: 30, baseType: !953, size: 128)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !954, line: 245, size: 128, elements: !955)
!954 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!955 = !{!956, !957, !959, !964}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !953, file: !954, line: 247, baseType: !946, size: 16)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !953, file: !954, line: 248, baseType: !958, size: 16, offset: 16)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !954, line: 123, baseType: !247)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !953, file: !954, line: 249, baseType: !960, size: 32, offset: 32)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !954, line: 31, size: 32, elements: !961)
!961 = !{!962}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !960, file: !954, line: 33, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !954, line: 30, baseType: !335)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !953, file: !954, line: 252, baseType: !965, size: 64, offset: 64)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 64, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 8)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !939, file: !936, line: 31, baseType: !969, size: 224)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !954, line: 260, size: 224, elements: !970)
!970 = !{!971, !972, !973, !974, !986}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !969, file: !954, line: 262, baseType: !946, size: 16)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !969, file: !954, line: 263, baseType: !958, size: 16, offset: 16)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !969, file: !954, line: 264, baseType: !335, size: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !969, file: !954, line: 265, baseType: !975, size: 128, offset: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !954, line: 219, size: 128, elements: !976)
!976 = !{!977}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !975, file: !954, line: 226, baseType: !978, size: 128)
!978 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !975, file: !954, line: 221, size: 128, elements: !979)
!979 = !{!980, !982, !984}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !978, file: !954, line: 223, baseType: !981, size: 128)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 128, elements: !289)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !978, file: !954, line: 224, baseType: !983, size: 128)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 128, elements: !966)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !978, file: !954, line: 225, baseType: !985, size: 128)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 128, elements: !481)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !969, file: !954, line: 266, baseType: !335, size: 32, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !939, file: !936, line: 32, baseType: !988, size: 1024)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !943, line: 193, size: 1024, elements: !989)
!989 = !{!990, !991, !995}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !988, file: !943, line: 195, baseType: !946, size: 16)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !988, file: !943, line: 196, baseType: !992, size: 944, offset: 16)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 944, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 118)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !988, file: !943, line: 197, baseType: !751, size: 64, offset: 960)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "sunix", scope: !939, file: !936, line: 34, baseType: !997, size: 880)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !998, line: 29, size: 880, elements: !999)
!998 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !997, file: !998, line: 31, baseType: !946, size: 16)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !997, file: !998, line: 32, baseType: !1002, size: 864, offset: 16)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 864, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 108)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !935, file: !936, line: 37, baseType: !112, size: 32, offset: 1024)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !935, file: !936, line: 38, baseType: !1007, size: 128, offset: 1088)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !935, file: !936, line: 38, size: 128, elements: !1008)
!1008 = !{!1009, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1007, file: !936, line: 38, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1007, file: !936, line: 38, baseType: !1010, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "findext", scope: !676, file: !669, line: 182, baseType: !1013, size: 64, offset: 2560)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!358, !666, !392, !464, !253, !112, !343, !782, !431, !913, !925, !318, !318}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "setcachestats", scope: !676, file: !669, line: 191, baseType: !1017, size: 64, offset: 2624)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!358, !666, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_stats_t", file: !359, line: 74, baseType: !1022)
!1022 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_stats", file: !359, line: 74, flags: DIFlagFwdDecl)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "hashsize", scope: !676, file: !669, line: 192, baseType: !1024, size: 64, offset: 2688)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!749, !666}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nodefullname", scope: !676, file: !669, line: 193, baseType: !1028, size: 64, offset: 2752)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!358, !666, !783, !431}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !676, file: !669, line: 195, baseType: !1032, size: 64, offset: 2816)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!358, !666, !464, !1035, !1035}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !248, line: 27, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !250, line: 45, baseType: !751)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "setservestalettl", scope: !676, file: !669, line: 197, baseType: !1039, size: 64, offset: 2880)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!358, !666, !334}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "getservestalettl", scope: !676, file: !669, line: 198, baseType: !1043, size: 64, offset: 2944)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!358, !666, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "setgluecachestats", scope: !676, file: !669, line: 199, baseType: !1017, size: 64, offset: 3008)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !668, file: !669, line: 227, baseType: !247, size: 16, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !668, file: !669, line: 228, baseType: !331, size: 16, offset: 144)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !668, file: !669, line: 229, baseType: !394, size: 640, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !668, file: !669, line: 230, baseType: !422, size: 64, offset: 832)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "update_listeners", scope: !668, file: !669, line: 231, baseType: !1053, size: 128, offset: 896)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !668, file: !669, line: 231, size: 128, elements: !1054)
!1054 = !{!1055, !1071}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1053, file: !669, line: 231, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbonupdatelistener_t", file: !111, line: 59, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_dbonupdatelistener", file: !669, line: 237, size: 256, elements: !1059)
!1059 = !{!1060, !1065, !1066}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "onupdate", scope: !1058, file: !669, line: 238, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbupdate_callback_t", file: !669, line: 209, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!358, !666, !244}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "onupdate_arg", scope: !1058, file: !669, line: 239, baseType: !244, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1058, file: !669, line: 240, baseType: !1067, size: 128, offset: 128)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1058, file: !669, line: 240, size: 128, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1067, file: !669, line: 240, baseType: !1056, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1067, file: !669, line: 240, baseType: !1056, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1053, file: !669, line: 231, baseType: !1056, size: 64, offset: 64)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080}
!1073 = !DILocalVariable(name: "message", arg: 1, scope: !663, file: !2, line: 98, type: !466)
!1074 = !DILocalVariable(name: "cache", arg: 2, scope: !663, file: !2, line: 98, type: !666)
!1075 = !DILocalVariable(name: "node", arg: 3, scope: !663, file: !2, line: 98, type: !783)
!1076 = !DILocalVariable(name: "covers", arg: 4, scope: !663, file: !2, line: 99, type: !253)
!1077 = !DILocalVariable(name: "now", arg: 5, scope: !663, file: !2, line: 99, type: !343)
!1078 = !DILocalVariable(name: "minttl", arg: 6, scope: !663, file: !2, line: 100, type: !334)
!1079 = !DILocalVariable(name: "maxttl", arg: 7, scope: !663, file: !2, line: 100, type: !334)
!1080 = !DILocalVariable(name: "addedrdataset", arg: 8, scope: !663, file: !2, line: 101, type: !318)
!1081 = !DILocation(line: 98, column: 31, scope: !663)
!1082 = !DILocation(line: 98, column: 50, scope: !663)
!1083 = !DILocation(line: 98, column: 71, scope: !663)
!1084 = !DILocation(line: 99, column: 25, scope: !663)
!1085 = !DILocation(line: 99, column: 47, scope: !663)
!1086 = !DILocation(line: 100, column: 19, scope: !663)
!1087 = !DILocation(line: 100, column: 37, scope: !663)
!1088 = !DILocation(line: 101, column: 25, scope: !663)
!1089 = !DILocation(line: 103, column: 20, scope: !663)
!1090 = !DILocation(line: 103, column: 29, scope: !663)
!1091 = !DILocation(line: 103, column: 36, scope: !663)
!1092 = !DILocation(line: 103, column: 42, scope: !663)
!1093 = !DILocation(line: 103, column: 50, scope: !663)
!1094 = !DILocation(line: 103, column: 55, scope: !663)
!1095 = !DILocation(line: 103, column: 63, scope: !663)
!1096 = !DILocation(line: 104, column: 20, scope: !663)
!1097 = !DILocation(line: 103, column: 10, scope: !663)
!1098 = !DILocation(line: 103, column: 2, scope: !663)
!1099 = distinct !DISubprogram(name: "addoptout", scope: !2, file: !2, line: 119, type: !1100, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !1102)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!358, !466, !666, !783, !253, !343, !334, !334, !426, !426, !318}
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1125, !1126, !1127, !1131, !1132, !1142, !1143, !1146, !1148, !1149}
!1103 = !DILocalVariable(name: "message", arg: 1, scope: !1099, file: !2, line: 119, type: !466)
!1104 = !DILocalVariable(name: "cache", arg: 2, scope: !1099, file: !2, line: 119, type: !666)
!1105 = !DILocalVariable(name: "node", arg: 3, scope: !1099, file: !2, line: 119, type: !783)
!1106 = !DILocalVariable(name: "covers", arg: 4, scope: !1099, file: !2, line: 120, type: !253)
!1107 = !DILocalVariable(name: "now", arg: 5, scope: !1099, file: !2, line: 120, type: !343)
!1108 = !DILocalVariable(name: "minttl", arg: 6, scope: !1099, file: !2, line: 121, type: !334)
!1109 = !DILocalVariable(name: "maxttl", arg: 7, scope: !1099, file: !2, line: 121, type: !334)
!1110 = !DILocalVariable(name: "optout", arg: 8, scope: !1099, file: !2, line: 122, type: !426)
!1111 = !DILocalVariable(name: "secure", arg: 9, scope: !1099, file: !2, line: 122, type: !426)
!1112 = !DILocalVariable(name: "addedrdataset", arg: 10, scope: !1099, file: !2, line: 123, type: !318)
!1113 = !DILocalVariable(name: "result", scope: !1099, file: !2, line: 125, type: !358)
!1114 = !DILocalVariable(name: "buffer", scope: !1099, file: !2, line: 126, type: !406)
!1115 = !DILocalVariable(name: "r", scope: !1099, file: !2, line: 127, type: !534)
!1116 = !DILocalVariable(name: "rdataset", scope: !1099, file: !2, line: 128, type: !318)
!1117 = !DILocalVariable(name: "type", scope: !1099, file: !2, line: 129, type: !253)
!1118 = !DILocalVariable(name: "name", scope: !1099, file: !2, line: 130, type: !431)
!1119 = !DILocalVariable(name: "ttl", scope: !1099, file: !2, line: 131, type: !334)
!1120 = !DILocalVariable(name: "trust", scope: !1099, file: !2, line: 132, type: !252)
!1121 = !DILocalVariable(name: "rdata", scope: !1099, file: !2, line: 133, type: !1122)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 32000, elements: !1123)
!1123 = !{!1124}
!1124 = !DISubrange(count: 100)
!1125 = !DILocalVariable(name: "ncrdataset", scope: !1099, file: !2, line: 134, type: !319)
!1126 = !DILocalVariable(name: "ncrdatalist", scope: !1099, file: !2, line: 135, type: !588)
!1127 = !DILocalVariable(name: "data", scope: !1099, file: !2, line: 136, type: !1128)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 524288, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 65536)
!1131 = !DILocalVariable(name: "next", scope: !1099, file: !2, line: 137, type: !112)
!1132 = !DILocalVariable(name: "_cp", scope: !1133, file: !2, line: 210, type: !245)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 210, column: 6)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !2, line: 185, column: 38)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 183, column: 9)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !2, line: 176, column: 51)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !2, line: 174, column: 4)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !2, line: 174, column: 4)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !2, line: 173, column: 54)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !2, line: 173, column: 7)
!1141 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 169, column: 34)
!1142 = !DILocalVariable(name: "_val2", scope: !1133, file: !2, line: 210, type: !247)
!1143 = !DILocalVariable(name: "_tmp", scope: !1144, file: !2, line: 210, type: !405)
!1144 = distinct !DILexicalBlock(scope: !1145, file: !2, line: 210, column: 6)
!1145 = distinct !DILexicalBlock(scope: !1133, file: !2, line: 210, column: 6)
!1146 = !DILocalVariable(name: "_cp", scope: !1147, file: !2, line: 212, type: !245)
!1147 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 212, column: 6)
!1148 = !DILocalVariable(name: "_val2", scope: !1147, file: !2, line: 212, type: !876)
!1149 = !DILocalVariable(name: "_tmp", scope: !1150, file: !2, line: 212, type: !405)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !2, line: 212, column: 6)
!1151 = distinct !DILexicalBlock(scope: !1147, file: !2, line: 212, column: 6)
!1152 = !DILocation(line: 119, column: 26, scope: !1099)
!1153 = !DILocation(line: 119, column: 45, scope: !1099)
!1154 = !DILocation(line: 119, column: 66, scope: !1099)
!1155 = !DILocation(line: 120, column: 20, scope: !1099)
!1156 = !DILocation(line: 120, column: 42, scope: !1099)
!1157 = !DILocation(line: 121, column: 14, scope: !1099)
!1158 = !DILocation(line: 121, column: 32, scope: !1099)
!1159 = !DILocation(line: 122, column: 9, scope: !1099)
!1160 = !DILocation(line: 122, column: 22, scope: !1099)
!1161 = !DILocation(line: 123, column: 20, scope: !1099)
!1162 = !DILocation(line: 125, column: 2, scope: !1099)
!1163 = !DILocation(line: 125, column: 15, scope: !1099)
!1164 = !DILocation(line: 126, column: 2, scope: !1099)
!1165 = !DILocation(line: 126, column: 15, scope: !1099)
!1166 = !DILocation(line: 127, column: 2, scope: !1099)
!1167 = !DILocation(line: 127, column: 15, scope: !1099)
!1168 = !DILocation(line: 128, column: 2, scope: !1099)
!1169 = !DILocation(line: 128, column: 18, scope: !1099)
!1170 = !DILocation(line: 129, column: 2, scope: !1099)
!1171 = !DILocation(line: 129, column: 18, scope: !1099)
!1172 = !DILocation(line: 130, column: 2, scope: !1099)
!1173 = !DILocation(line: 130, column: 14, scope: !1099)
!1174 = !DILocation(line: 131, column: 2, scope: !1099)
!1175 = !DILocation(line: 131, column: 12, scope: !1099)
!1176 = !DILocation(line: 132, column: 2, scope: !1099)
!1177 = !DILocation(line: 132, column: 14, scope: !1099)
!1178 = !DILocation(line: 133, column: 2, scope: !1099)
!1179 = !DILocation(line: 133, column: 14, scope: !1099)
!1180 = !DILocation(line: 134, column: 2, scope: !1099)
!1181 = !DILocation(line: 134, column: 17, scope: !1099)
!1182 = !DILocation(line: 135, column: 2, scope: !1099)
!1183 = !DILocation(line: 135, column: 18, scope: !1099)
!1184 = !DILocation(line: 136, column: 2, scope: !1099)
!1185 = !DILocation(line: 136, column: 16, scope: !1099)
!1186 = !DILocation(line: 137, column: 2, scope: !1099)
!1187 = !DILocation(line: 137, column: 15, scope: !1099)
!1188 = !DILocation(line: 144, column: 2, scope: !1099)
!1189 = !DILocation(line: 154, column: 2, scope: !1099)
!1190 = !DILocation(line: 155, column: 37, scope: !1099)
!1191 = !DILocation(line: 155, column: 24, scope: !1099)
!1192 = !DILocation(line: 155, column: 14, scope: !1099)
!1193 = !DILocation(line: 155, column: 22, scope: !1099)
!1194 = !DILocation(line: 156, column: 23, scope: !1099)
!1195 = !DILocation(line: 156, column: 14, scope: !1099)
!1196 = !DILocation(line: 156, column: 21, scope: !1099)
!1197 = !DILocation(line: 157, column: 20, scope: !1099)
!1198 = !DILocation(line: 157, column: 14, scope: !1099)
!1199 = !DILocation(line: 157, column: 18, scope: !1099)
!1200 = !DILocation(line: 162, column: 8, scope: !1099)
!1201 = !DILocation(line: 162, column: 6, scope: !1099)
!1202 = !DILocation(line: 163, column: 8, scope: !1099)
!1203 = !DILocation(line: 164, column: 2, scope: !1099)
!1204 = !DILocation(line: 164, column: 2, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 164, column: 2)
!1206 = !DILocation(line: 164, column: 2, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1205, file: !2, line: 164, column: 2)
!1208 = !DILocation(line: 165, column: 6, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 165, column: 6)
!1210 = !DILocation(line: 165, column: 15, scope: !1209)
!1211 = !DILocation(line: 165, column: 6, scope: !1099)
!1212 = !DILocation(line: 166, column: 34, scope: !1209)
!1213 = !DILocation(line: 166, column: 12, scope: !1209)
!1214 = !DILocation(line: 166, column: 10, scope: !1209)
!1215 = !DILocation(line: 166, column: 3, scope: !1209)
!1216 = !DILocation(line: 168, column: 10, scope: !1209)
!1217 = !DILocation(line: 169, column: 2, scope: !1099)
!1218 = !DILocation(line: 169, column: 9, scope: !1099)
!1219 = !DILocation(line: 169, column: 16, scope: !1099)
!1220 = !DILocation(line: 170, column: 8, scope: !1141)
!1221 = !DILocation(line: 171, column: 27, scope: !1141)
!1222 = !DILocation(line: 171, column: 3, scope: !1141)
!1223 = !DILocation(line: 173, column: 8, scope: !1140)
!1224 = !DILocation(line: 173, column: 14, scope: !1140)
!1225 = !DILocation(line: 173, column: 25, scope: !1140)
!1226 = !DILocation(line: 173, column: 48, scope: !1140)
!1227 = !DILocation(line: 173, column: 7, scope: !1141)
!1228 = !DILocation(line: 174, column: 20, scope: !1138)
!1229 = !DILocation(line: 174, column: 18, scope: !1138)
!1230 = !DILocation(line: 174, column: 9, scope: !1138)
!1231 = !DILocation(line: 175, column: 9, scope: !1137)
!1232 = !DILocation(line: 175, column: 18, scope: !1137)
!1233 = !DILocation(line: 174, column: 4, scope: !1138)
!1234 = !DILocation(line: 177, column: 10, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 177, column: 9)
!1236 = !DILocation(line: 177, column: 20, scope: !1235)
!1237 = !DILocation(line: 177, column: 31, scope: !1235)
!1238 = !DILocation(line: 178, column: 35, scope: !1235)
!1239 = !DILocation(line: 177, column: 9, scope: !1136)
!1240 = !DILocation(line: 179, column: 6, scope: !1235)
!1241 = !DILocation(line: 180, column: 12, scope: !1136)
!1242 = !DILocation(line: 180, column: 22, scope: !1136)
!1243 = !DILocation(line: 180, column: 10, scope: !1136)
!1244 = !DILocation(line: 181, column: 9, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 181, column: 9)
!1246 = !DILocation(line: 181, column: 14, scope: !1245)
!1247 = !DILocation(line: 181, column: 9, scope: !1136)
!1248 = !DILocation(line: 182, column: 13, scope: !1245)
!1249 = !DILocation(line: 182, column: 23, scope: !1245)
!1250 = !DILocation(line: 182, column: 11, scope: !1245)
!1251 = !DILocation(line: 182, column: 6, scope: !1245)
!1252 = !DILocation(line: 183, column: 9, scope: !1135)
!1253 = !DILocation(line: 183, column: 14, scope: !1135)
!1254 = !DILocation(line: 183, column: 35, scope: !1135)
!1255 = !DILocation(line: 184, column: 9, scope: !1135)
!1256 = !DILocation(line: 184, column: 14, scope: !1135)
!1257 = !DILocation(line: 184, column: 36, scope: !1135)
!1258 = !DILocation(line: 185, column: 9, scope: !1135)
!1259 = !DILocation(line: 185, column: 14, scope: !1135)
!1260 = !DILocation(line: 183, column: 9, scope: !1136)
!1261 = !DILocation(line: 186, column: 10, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 186, column: 10)
!1263 = !DILocation(line: 186, column: 16, scope: !1262)
!1264 = !DILocation(line: 186, column: 26, scope: !1262)
!1265 = !DILocation(line: 186, column: 14, scope: !1262)
!1266 = !DILocation(line: 186, column: 10, scope: !1134)
!1267 = !DILocation(line: 187, column: 13, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1262, file: !2, line: 186, column: 31)
!1269 = !DILocation(line: 187, column: 23, scope: !1268)
!1270 = !DILocation(line: 187, column: 11, scope: !1268)
!1271 = !DILocation(line: 188, column: 6, scope: !1268)
!1272 = !DILocation(line: 189, column: 10, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 189, column: 10)
!1274 = !DILocation(line: 189, column: 16, scope: !1273)
!1275 = !DILocation(line: 189, column: 14, scope: !1273)
!1276 = !DILocation(line: 189, column: 10, scope: !1134)
!1277 = !DILocation(line: 190, column: 13, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1273, file: !2, line: 189, column: 24)
!1279 = !DILocation(line: 190, column: 11, scope: !1278)
!1280 = !DILocation(line: 191, column: 6, scope: !1278)
!1281 = !DILocation(line: 192, column: 10, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 192, column: 10)
!1283 = !DILocation(line: 192, column: 18, scope: !1282)
!1284 = !DILocation(line: 192, column: 28, scope: !1282)
!1285 = !DILocation(line: 192, column: 16, scope: !1282)
!1286 = !DILocation(line: 192, column: 10, scope: !1134)
!1287 = !DILocation(line: 193, column: 15, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1282, file: !2, line: 192, column: 35)
!1289 = !DILocation(line: 193, column: 25, scope: !1288)
!1290 = !DILocation(line: 193, column: 13, scope: !1288)
!1291 = !DILocation(line: 194, column: 6, scope: !1288)
!1292 = !DILocation(line: 198, column: 24, scope: !1134)
!1293 = !DILocation(line: 198, column: 6, scope: !1134)
!1294 = !DILocation(line: 199, column: 15, scope: !1134)
!1295 = !DILocation(line: 199, column: 13, scope: !1134)
!1296 = !DILocation(line: 201, column: 10, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 201, column: 10)
!1298 = !DILocation(line: 201, column: 17, scope: !1297)
!1299 = !DILocation(line: 201, column: 10, scope: !1134)
!1300 = !DILocation(line: 202, column: 15, scope: !1297)
!1301 = !DILocation(line: 202, column: 7, scope: !1297)
!1302 = !DILocation(line: 206, column: 6, scope: !1134)
!1303 = !DILocation(line: 206, column: 6, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 206, column: 6)
!1305 = !DILocation(line: 208, column: 12, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 208, column: 10)
!1307 = !DILocation(line: 208, column: 19, scope: !1306)
!1308 = !DILocation(line: 208, column: 10, scope: !1134)
!1309 = !DILocation(line: 209, column: 7, scope: !1306)
!1310 = !DILocation(line: 210, column: 6, scope: !1134)
!1311 = !DILocation(line: 210, column: 6, scope: !1133)
!1312 = !DILocation(line: 210, column: 6, scope: !1145)
!1313 = !{i8 0, i8 2}
!1314 = !{}
!1315 = !DILocation(line: 210, column: 6, scope: !1144)
!1316 = !DILocation(line: 212, column: 6, scope: !1134)
!1317 = !DILocation(line: 212, column: 6, scope: !1147)
!1318 = !DILocation(line: 212, column: 6, scope: !1151)
!1319 = !DILocation(line: 212, column: 6, scope: !1150)
!1320 = !DILocation(line: 217, column: 29, scope: !1134)
!1321 = !DILocation(line: 217, column: 15, scope: !1134)
!1322 = !DILocation(line: 217, column: 13, scope: !1134)
!1323 = !DILocation(line: 219, column: 10, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 219, column: 10)
!1325 = !DILocation(line: 219, column: 17, scope: !1324)
!1326 = !DILocation(line: 219, column: 10, scope: !1134)
!1327 = !DILocation(line: 220, column: 15, scope: !1324)
!1328 = !DILocation(line: 220, column: 7, scope: !1324)
!1329 = !DILocation(line: 222, column: 10, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 222, column: 10)
!1331 = !DILocation(line: 222, column: 15, scope: !1330)
!1332 = !DILocation(line: 222, column: 10, scope: !1134)
!1333 = !DILocation(line: 223, column: 7, scope: !1330)
