; ModuleID = 'samples/615.bc'
source_filename = "src/mutex_pool.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mutex_pool_s = type { [256 x %struct.malloc_mutex_s] }
%struct.malloc_mutex_s = type { %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { %struct.mutex_prof_data_t, %union.pthread_mutex_t, %struct.atomic_b_t }
%struct.mutex_prof_data_t = type { %struct.nstime_t, %struct.nstime_t, i64, i64, i32, %struct.atomic_u32_t, i64, ptr, i64 }
%struct.nstime_t = type { i64 }
%struct.atomic_u32_t = type { i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.atomic_b_t = type { i8 }

; Function Attrs: nounwind uwtable
define dso_local zeroext i1 @je_mutex_pool_init(ptr noundef %pool, ptr noundef %name, i32 noundef %rank) #0 !dbg !23 {
entry:
  %retval = alloca i1, align 1
  %pool.addr = alloca ptr, align 8
  %name.addr = alloca ptr, align 8
  %rank.addr = alloca i32, align 4
  %i = alloca i32, align 4
  %cleanup.dest.slot = alloca i32, align 4
  store ptr %pool, ptr %pool.addr, align 8, !tbaa !630
  tail call void @llvm.dbg.declare(metadata ptr %pool.addr, metadata !625, metadata !DIExpression()), !dbg !634
  store ptr %name, ptr %name.addr, align 8, !tbaa !630

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "src/mutex_pool.c", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "294463727fce2f01010c975ecc49f68b")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 12, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "include/jemalloc/internal/extent_structs.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "0d97df4eb670615e0551e631af75b655")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "extent_state_active", value: 0)
!8 = !DIEnumerator(name: "extent_state_dirty", value: 1)
!9 = !DIEnumerator(name: "extent_state_muzzy", value: 2)
!10 = !DIEnumerator(name: "extent_state_retained", value: 3)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 9, baseType: !5, size: 32, elements: !13)
!12 = !DIFile(filename: "include/jemalloc/internal/mutex.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "917cce942e4a6b564502cd3d8e486d0c")
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "malloc_mutex_rank_exclusive", value: 0)
!15 = !DIEnumerator(name: "malloc_mutex_address_ordered", value: 1)
!16 = !{i32 7, !"Dwarf Version", i32 5}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{i32 8, !"PIC Level", i32 2}
!20 = !{i32 7, !"PIE Level", i32 2}
!21 = !{i32 7, !"uwtable", i32 2}
!22 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!23 = distinct !DISubprogram(name: "je_mutex_pool_init", scope: !1, file: !1, line: 10, type: !24, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !624)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !27, !565, !568}
!26 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_pool_t", file: !29, line: 11, baseType: !30)
!29 = !DIFile(filename: "include/jemalloc/internal/mutex_pool.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "3b672a850b48a84d4c839979658ce5cb")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex_pool_s", file: !29, line: 12, size: 229376, elements: !31)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "mutexes", scope: !30, file: !29, line: 13, baseType: !33, size: 229376)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 229376, elements: !622)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_t", file: !12, line: 19, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "malloc_mutex_s", file: !12, line: 20, size: 896, elements: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, scope: !35, file: !12, line: 21, baseType: !38, size: 896)
!38 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !35, file: !12, line: 21, size: 896, elements: !39)
!39 = !{!40, !619, !620}
!40 = !DIDerivedType(tag: DW_TAG_member, scope: !38, file: !12, line: 22, baseType: !41, size: 896)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !38, file: !12, line: 22, size: 896, elements: !42)
!42 = !{!43, !584, !614}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "prof_data", scope: !41, file: !12, line: 31, baseType: !44, size: 512)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_prof_data_t", file: !45, line: 106, baseType: !46)
!45 = !DIFile(filename: "include/jemalloc/internal/mutex_prof.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "4a1798f9510ae9d91f888a30d80fb7cc")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 76, size: 512, elements: !47)
!47 = !{!48, !59, !60, !61, !62, !65, !71, !72, !583}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tot_wait_time", scope: !46, file: !45, line: 82, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "nstime_t", file: !50, line: 10, baseType: !51)
!50 = !DIFile(filename: "include/jemalloc/internal/nstime.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "3b54840f5e61842f175755b038667aab")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 8, size: 64, elements: !52)
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !51, file: !50, line: 9, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !55, line: 27, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !57, line: 45, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!58 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "max_wait_time", scope: !46, file: !45, line: 84, baseType: !49, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "n_wait_times", scope: !46, file: !45, line: 86, baseType: !54, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "n_spin_acquired", scope: !46, file: !45, line: 88, baseType: !54, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "max_n_thds", scope: !46, file: !45, line: 90, baseType: !63, size: 32, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !55, line: 26, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !57, line: 42, baseType: !5)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "n_waiting_thds", scope: !46, file: !45, line: 92, baseType: !66, size: 32, offset: 288)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u32_t", file: !67, line: 78, baseType: !68)
!67 = !DIFile(filename: "include/jemalloc/internal/atomic.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "f4ec326d3284c13a241314e27e68ccae")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 78, size: 32, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !68, file: !67, line: 78, baseType: !63, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "n_owner_switches", scope: !46, file: !45, line: 101, baseType: !54, size: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prev_owner", scope: !46, file: !45, line: 103, baseType: !73, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsdn_t", file: !75, line: 7, baseType: !76)
!75 = !DIFile(filename: "include/jemalloc/internal/tsd_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "d541d97bbf6e4823e1bac63f2add6f7d")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsdn_s", file: !77, line: 219, size: 50368, elements: !78)
!77 = !DIFile(filename: "include/jemalloc/internal/tsd.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9f081fe8da1112924f8bffbbaecc948d")
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tsd", scope: !76, file: !77, line: 220, baseType: !80, size: 50368)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_t", file: !75, line: 6, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsd_s", file: !77, line: 185, size: 50368, elements: !82)
!82 = !{!83, !91, !92, !93, !98, !99, !100, !101, !102, !106, !178, !208, !536, !537, !543, !549, !550}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !81, file: !77, line: 196, baseType: !84, size: 8)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u8_t", file: !67, line: 76, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 76, size: 8, elements: !86)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !85, file: !67, line: 76, baseType: !88, size: 8)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !55, line: 24, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !57, line: 38, baseType: !90)
!90 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache_enabled", scope: !81, file: !77, line: 199, baseType: !26, size: 8, offset: 8)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arenas_tdata_bypass", scope: !81, file: !77, line: 199, baseType: !26, size: 8, offset: 16)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_reentrancy_level", scope: !81, file: !77, line: 199, baseType: !94, size: 8, offset: 24)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !95, line: 24, baseType: !96)
!95 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !57, line: 37, baseType: !97)
!97 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_narenas_tdata", scope: !81, file: !77, line: 199, baseType: !63, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_offset_state", scope: !81, file: !77, line: 199, baseType: !54, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_allocated", scope: !81, file: !77, line: 199, baseType: !54, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_deallocated", scope: !81, file: !77, line: 199, baseType: !54, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_bytes_until_sample", scope: !81, file: !77, line: 199, baseType: !103, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !95, line: 27, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !57, line: 44, baseType: !105)
!105 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prof_tdata", scope: !81, file: !77, line: 199, baseType: !107, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_tdata_t", file: !109, line: 9, baseType: !110)
!109 = !DIFile(filename: "include/jemalloc/internal/prof_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "893bb7e5be32d3ed1d6a52ee080689bf")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_tdata_s", file: !111, line: 135, size: 9472, elements: !112)
!111 = !DIFile(filename: "include/jemalloc/internal/prof_structs.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "d36bd8a0b03505e79f5871fe1b41e8be")
!112 = !{!113, !115, !116, !117, !120, !121, !122, !127, !128, !159, !160, !161, !162, !163, !164, !165, !173}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !110, file: !111, line: 136, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "thr_uid", scope: !110, file: !111, line: 139, baseType: !54, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "thr_discrim", scope: !110, file: !111, line: 145, baseType: !54, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "thread_name", scope: !110, file: !111, line: 148, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "attached", scope: !110, file: !111, line: 150, baseType: !26, size: 8, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "expired", scope: !110, file: !111, line: 151, baseType: !26, size: 8, offset: 264)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tdata_link", scope: !110, file: !111, line: 153, baseType: !123, size: 128, offset: 320)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !111, line: 153, size: 128, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rbn_left", scope: !123, file: !111, line: 153, baseType: !107, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rbn_right_red", scope: !123, file: !111, line: 153, baseType: !107, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tctx_uid_next", scope: !110, file: !111, line: 160, baseType: !54, size: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bt2tctx", scope: !110, file: !111, line: 168, baseType: !129, size: 384, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_t", file: !130, line: 63, baseType: !131)
!130 = !DIFile(filename: "include/jemalloc/internal/ckh.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "764fcd222e751d77d1875da9f00741d3")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 34, size: 384, elements: !132)
!132 = !{!133, !134, !137, !138, !139, !147, !152}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "prng_state", scope: !131, file: !130, line: 45, baseType: !54, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !131, file: !130, line: 48, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !136, line: 70, baseType: !58)
!136 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "lg_minbuckets", scope: !131, file: !130, line: 54, baseType: !5, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "lg_curbuckets", scope: !131, file: !130, line: 55, baseType: !5, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !131, file: !130, line: 58, baseType: !140, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_hash_t", file: !130, line: 24, baseType: !142)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144, !146}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "keycomp", scope: !131, file: !130, line: 59, baseType: !148, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckh_keycomp_t", file: !130, line: 25, baseType: !150)
!150 = !DISubroutineType(types: !151)
!151 = !{!26, !144, !144}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !131, file: !130, line: 62, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ckhc_t", file: !130, line: 31, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 28, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !155, file: !130, line: 29, baseType: !144, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !130, line: 30, baseType: !144, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prng_state", scope: !110, file: !111, line: 171, baseType: !54, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "enq", scope: !110, file: !111, line: 174, baseType: !26, size: 8, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "enq_idump", scope: !110, file: !111, line: 175, baseType: !26, size: 8, offset: 968)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "enq_gdump", scope: !110, file: !111, line: 176, baseType: !26, size: 8, offset: 976)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "dumping", scope: !110, file: !111, line: 184, baseType: !26, size: 8, offset: 984)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !110, file: !111, line: 190, baseType: !26, size: 8, offset: 992)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "cnt_summed", scope: !110, file: !111, line: 193, baseType: !166, size: 256, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_cnt_t", file: !109, line: 6, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_cnt_s", file: !111, line: 32, size: 256, elements: !168)
!168 = !{!169, !170, !171, !172}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "curobjs", scope: !167, file: !111, line: 34, baseType: !54, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "curbytes", scope: !167, file: !111, line: 35, baseType: !54, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "accumobjs", scope: !167, file: !111, line: 36, baseType: !54, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "accumbytes", scope: !167, file: !111, line: 37, baseType: !54, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !110, file: !111, line: 196, baseType: !174, size: 8192, offset: 1280)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 8192, elements: !176)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!176 = !{!177}
!177 = !DISubrange(count: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_rtree_ctx", scope: !81, file: !77, line: 199, baseType: !179, size: 3072, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_ctx_t", file: !180, line: 40, baseType: !181)
!180 = !DIFile(filename: "include/jemalloc/internal/rtree_tsd.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "e327e8ed7b8fd5299eed4833d6c507b8")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_ctx_s", file: !180, line: 41, size: 3072, elements: !182)
!182 = !{!183, !204}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !181, file: !180, line: 43, baseType: !184, size: 2048)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 2048, elements: !202)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_ctx_cache_elm_t", file: !180, line: 34, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_ctx_cache_elm_s", file: !180, line: 35, size: 128, elements: !187)
!187 = !{!188, !191}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "leafkey", scope: !186, file: !180, line: 36, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !190, line: 90, baseType: !58)
!190 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !186, file: !180, line: 37, baseType: !192, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_leaf_elm_t", file: !180, line: 32, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_leaf_elm_s", file: !195, line: 46, size: 64, elements: !196)
!195 = !DIFile(filename: "include/jemalloc/internal/rtree.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "82bfd1f58142b0639c309a4aeac9c506")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "le_bits", scope: !194, file: !195, line: 60, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_p_t", file: !67, line: 62, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 62, size: 64, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !199, file: !67, line: 62, baseType: !175, size: 64)
!202 = !{!203}
!203 = !DISubrange(count: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "l2_cache", scope: !181, file: !180, line: 45, baseType: !205, size: 1024, offset: 2048)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 1024, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 8)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_iarena", scope: !81, file: !77, line: 199, baseType: !209, size: 64, offset: 3456)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_t", file: !211, line: 18, baseType: !212)
!211 = !DIFile(filename: "include/jemalloc/internal/arena_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "1e2faaf6aaaed7809a70484596be6198")
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_s", file: !213, line: 77, size: 236160, elements: !214)
!213 = !DIFile(filename: "include/jemalloc/internal/arena_structs_b.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "3e62069c856b92d645a4c13996ca2396")
!214 = !{!215, !223, !224, !225, !280, !352, !356, !357, !362, !363, !364, !365, !366, !411, !412, !437, !438, !439, !463, !464, !466, !467, !468, !473, !474, !475, !506, !535}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !212, file: !213, line: 91, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 64, elements: !221)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u_t", file: !67, line: 70, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 70, size: 32, elements: !219)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !218, file: !67, line: 70, baseType: !5, size: 32)
!221 = !{!222}
!222 = !DISubrange(count: 2)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "binshard_next", scope: !212, file: !213, line: 94, baseType: !217, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "last_thd", scope: !212, file: !213, line: 101, baseType: !73, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !212, file: !213, line: 104, baseType: !226, size: 81280, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_t", file: !227, line: 81, baseType: !228)
!227 = !DIFile(filename: "include/jemalloc/internal/arena_stats.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "797d71161d3430446f16b1c8dd4487de")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_s", file: !227, line: 82, size: 81280, elements: !229)
!229 = !{!230, !235, !236, !237, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !266, !279}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !228, file: !227, line: 88, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zu_t", file: !67, line: 72, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 72, size: 64, elements: !233)
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !232, file: !67, line: 72, baseType: !135, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "retained", scope: !228, file: !227, line: 95, baseType: !231, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail", scope: !228, file: !227, line: 98, baseType: !231, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "decay_dirty", scope: !228, file: !227, line: 100, baseType: !238, size: 192, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_decay_t", file: !227, line: 50, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_decay_s", file: !227, line: 51, size: 192, elements: !240)
!240 = !{!241, !247, !248}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "npurge", scope: !239, file: !227, line: 53, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_u64_t", file: !227, line: 17, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u64_t", file: !67, line: 81, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 81, size: 64, elements: !245)
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !244, file: !67, line: 81, baseType: !54, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "nmadvise", scope: !239, file: !227, line: 55, baseType: !242, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !239, file: !227, line: 57, baseType: !242, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "decay_muzzy", scope: !228, file: !227, line: 101, baseType: !238, size: 192, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !228, file: !227, line: 103, baseType: !231, size: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !228, file: !227, line: 104, baseType: !231, size: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !228, file: !227, line: 105, baseType: !231, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_thp", scope: !228, file: !227, line: 106, baseType: !231, size: 64, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_large", scope: !228, file: !227, line: 108, baseType: !231, size: 64, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc_large", scope: !228, file: !227, line: 109, baseType: !242, size: 64, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc_large", scope: !228, file: !227, line: 110, baseType: !242, size: 64, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nfills_large", scope: !228, file: !227, line: 111, baseType: !242, size: 64, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes_large", scope: !228, file: !227, line: 112, baseType: !242, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests_large", scope: !228, file: !227, line: 113, baseType: !242, size: 64, offset: 1152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "abandoned_vm", scope: !228, file: !227, line: 116, baseType: !231, size: 64, offset: 1216)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_bytes", scope: !228, file: !227, line: 119, baseType: !231, size: 64, offset: 1280)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_prof_data", scope: !228, file: !227, line: 121, baseType: !263, size: 4608, offset: 1344)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 4608, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 9)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "lstats", scope: !228, file: !227, line: 124, baseType: !267, size: 75264, offset: 5952)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 75264, elements: !277)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_large_t", file: !227, line: 23, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_large_s", file: !227, line: 24, size: 384, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc", scope: !269, file: !227, line: 29, baseType: !242, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc", scope: !269, file: !227, line: 30, baseType: !242, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !269, file: !227, line: 37, baseType: !242, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nfills", scope: !269, file: !227, line: 43, baseType: !242, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes", scope: !269, file: !227, line: 44, baseType: !242, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "curlextents", scope: !269, file: !227, line: 47, baseType: !135, size: 64, offset: 320)
!277 = !{!278}
!278 = !DISubrange(count: 196)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "uptime", scope: !228, file: !227, line: 127, baseType: !49, size: 64, offset: 81216)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_ql", scope: !212, file: !213, line: 113, baseType: !281, size: 64, offset: 81472)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !212, file: !213, line: 113, size: 64, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !281, file: !213, line: 113, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcache_t", file: !286, line: 6, baseType: !287)
!286 = !DIFile(filename: "include/jemalloc/internal/tcache_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9b2852fa8ffe77d9fa097e3d9e569fb0")
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcache_s", file: !288, line: 13, size: 46272, elements: !289)
!288 = !DIFile(filename: "include/jemalloc/internal/tcache_structs.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "639b312cb1f4b9dc92d248ca33e2878d")
!289 = !{!290, !291, !301, !319, !324, !330, !331, !344, !345, !348, !350}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prof_accumbytes", scope: !287, file: !288, line: 20, baseType: !54, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "gc_ticker", scope: !287, file: !288, line: 22, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ticker_t", file: !293, line: 17, baseType: !294)
!293 = !DIFile(filename: "include/jemalloc/internal/ticker.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "2982b928838e20f58cc0968805d8a2fd")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 14, size: 64, elements: !295)
!295 = !{!296, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tick", scope: !294, file: !293, line: 15, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !95, line: 26, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 41, baseType: !299)
!299 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nticks", scope: !294, file: !293, line: 16, baseType: !297, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bins_small", scope: !287, file: !288, line: 28, baseType: !302, size: 7488, offset: 128)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 7488, elements: !317)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_t", file: !304, line: 43, baseType: !305)
!304 = !DIFile(filename: "include/jemalloc/internal/cache_bin.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9d448b7baf024f90644dd6d3180d79e7")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_s", file: !304, line: 44, size: 192, elements: !306)
!306 = !{!307, !309, !310, !315}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "low_water", scope: !305, file: !304, line: 46, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_sz_t", file: !304, line: 22, baseType: !297)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ncached", scope: !305, file: !304, line: 48, baseType: !308, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tstats", scope: !305, file: !304, line: 54, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_stats_t", file: !304, line: 24, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_stats_s", file: !304, line: 25, size: 64, elements: !313)
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !312, file: !304, line: 30, baseType: !54, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !305, file: !304, line: 64, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!317 = !{!318}
!318 = !DISubrange(count: 39)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !287, file: !288, line: 35, baseType: !320, size: 128, offset: 7616)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !288, line: 35, size: 128, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !320, file: !288, line: 35, baseType: !284, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !320, file: !288, line: 35, baseType: !284, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tsd_link", scope: !287, file: !288, line: 38, baseType: !325, size: 128, offset: 7744)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !288, line: 38, size: 128, elements: !326)
!326 = !{!327, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !325, file: !288, line: 38, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !325, file: !288, line: 38, baseType: !328, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "in_hook", scope: !287, file: !288, line: 39, baseType: !26, size: 8, offset: 7872)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor", scope: !287, file: !288, line: 46, baseType: !332, size: 256, offset: 7936)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_array_descriptor_t", file: !304, line: 67, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_array_descriptor_s", file: !304, line: 68, size: 256, elements: !334)
!334 = !{!335, !341, !343}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !333, file: !304, line: 73, baseType: !336, size: 128)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !304, line: 73, size: 128, elements: !337)
!337 = !{!338, !340}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !336, file: !304, line: 73, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !336, file: !304, line: 73, baseType: !339, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "bins_small", scope: !333, file: !304, line: 75, baseType: !342, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bins_large", scope: !333, file: !304, line: 76, baseType: !342, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !287, file: !288, line: 49, baseType: !209, size: 64, offset: 8192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next_gc_bin", scope: !287, file: !288, line: 51, baseType: !346, size: 32, offset: 8256)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "szind_t", file: !347, line: 10, baseType: !5)
!347 = !DIFile(filename: "include/jemalloc/internal/jemalloc_internal_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9fabb1c7fca697e7a645839e73a4d9d5")
!348 = !DIDerivedType(tag: DW_TAG_member, name: "lg_fill_div", scope: !287, file: !288, line: 53, baseType: !349, size: 312, offset: 8288)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 312, elements: !317)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "bins_large", scope: !287, file: !288, line: 59, baseType: !351, size: 37632, offset: 8640)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 37632, elements: !277)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor_ql", scope: !212, file: !213, line: 114, baseType: !353, size: 64, offset: 81536)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !212, file: !213, line: 114, size: 64, elements: !354)
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !353, file: !213, line: 114, baseType: !339, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_ql_mtx", scope: !212, file: !213, line: 115, baseType: !34, size: 896, offset: 81600)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prof_accum", scope: !212, file: !213, line: 118, baseType: !358, size: 64, offset: 82496)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_accum_t", file: !109, line: 5, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_accum_s", file: !111, line: 23, size: 64, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "accumbytes", scope: !359, file: !111, line: 28, baseType: !243, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "offset_state", scope: !212, file: !213, line: 126, baseType: !231, size: 64, offset: 82560)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "extent_sn_next", scope: !212, file: !213, line: 133, baseType: !231, size: 64, offset: 82624)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dss_prec", scope: !212, file: !213, line: 140, baseType: !217, size: 32, offset: 82688)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !212, file: !213, line: 147, baseType: !231, size: 64, offset: 82752)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !212, file: !213, line: 154, baseType: !367, size: 64, offset: 82816)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_list_t", file: !4, line: 184, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 184, size: 64, elements: !369)
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !368, file: !4, line: 184, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_t", file: !373, line: 4, baseType: !374)
!373 = !DIFile(filename: "include/jemalloc/internal/extent_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "feed1f2f8b22932a2312223b59645f74")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_s", file: !4, line: 20, size: 1024, elements: !375)
!375 = !{!376, !377, !378, !383, !388, !394}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "e_bits", scope: !374, file: !4, line: 92, baseType: !54, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "e_addr", scope: !374, file: !4, line: 139, baseType: !175, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !4, line: 141, baseType: !379, size: 64, offset: 128)
!379 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !4, line: 141, size: 64, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "e_size_esn", scope: !379, file: !4, line: 149, baseType: !135, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "e_bsize", scope: !379, file: !4, line: 153, baseType: !135, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link", scope: !374, file: !4, line: 163, baseType: !384, size: 128, offset: 192)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !4, line: 163, size: 128, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !384, file: !4, line: 163, baseType: !371, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !384, file: !4, line: 163, baseType: !371, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ph_link", scope: !374, file: !4, line: 169, baseType: !389, size: 192, offset: 320)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !4, line: 169, size: 192, elements: !390)
!390 = !{!391, !392, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "phn_prev", scope: !389, file: !4, line: 169, baseType: !371, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "phn_next", scope: !389, file: !4, line: 169, baseType: !371, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "phn_lchild", scope: !389, file: !4, line: 169, baseType: !371, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !4, line: 171, baseType: !395, size: 512, offset: 512)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !4, line: 171, size: 512, elements: !396)
!396 = !{!397, !406}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "e_slab_data", scope: !395, file: !4, line: 173, baseType: !398, size: 512)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_slab_data_t", file: !211, line: 16, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_slab_data_s", file: !400, line: 6, size: 512, elements: !401)
!400 = !DIFile(filename: "include/jemalloc/internal/arena_structs_a.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "7b5b961b3d2ed5fcaf6c26f10c066bf6")
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !399, file: !400, line: 8, baseType: !403, size: 512)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 512, elements: !206)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_t", file: !405, line: 8, baseType: !58)
!405 = !DIFile(filename: "include/jemalloc/internal/bitmap.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "58e1c4ef6d1ba9c779b287089e4d138b")
!406 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !4, line: 176, baseType: !407, size: 128)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !395, file: !4, line: 176, size: 128, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "e_alloc_time", scope: !407, file: !4, line: 178, baseType: !49, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_tctx", scope: !407, file: !4, line: 180, baseType: !198, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "large_mtx", scope: !212, file: !213, line: 156, baseType: !34, size: 896, offset: 82880)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "extents_dirty", scope: !212, file: !213, line: 164, baseType: !413, size: 39744, offset: 83776)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "extents_t", file: !373, line: 5, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extents_s", file: !4, line: 189, size: 39744, elements: !415)
!415 = !{!416, !417, !425, !427, !428, !432, !433, !434, !436}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !414, file: !4, line: 190, baseType: !34, size: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "heaps", scope: !414, file: !4, line: 197, baseType: !418, size: 12800, offset: 896)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 12800, elements: !423)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_heap_t", file: !4, line: 186, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 186, size: 64, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ph_root", scope: !420, file: !4, line: 186, baseType: !371, size: 64)
!423 = !{!424}
!424 = !DISubrange(count: 200)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nextents", scope: !414, file: !4, line: 198, baseType: !426, size: 12800, offset: 13696)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 12800, elements: !423)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !414, file: !4, line: 199, baseType: !426, size: 12800, offset: 26496)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !414, file: !4, line: 206, baseType: !429, size: 256, offset: 39296)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 256, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 4)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !414, file: !4, line: 213, baseType: !367, size: 64, offset: 39552)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "npages", scope: !414, file: !4, line: 223, baseType: !231, size: 64, offset: 39616)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !414, file: !4, line: 226, baseType: !435, size: 32, offset: 39680)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_state_t", file: !4, line: 17, baseType: !3)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "delay_coalesce", scope: !414, file: !4, line: 232, baseType: !26, size: 8, offset: 39712)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "extents_muzzy", scope: !212, file: !213, line: 165, baseType: !413, size: 39744, offset: 123520)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "extents_retained", scope: !212, file: !213, line: 166, baseType: !413, size: 39744, offset: 163264)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "decay_dirty", scope: !212, file: !213, line: 174, baseType: !440, size: 14272, offset: 203008)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_decay_t", file: !211, line: 17, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_decay_s", file: !213, line: 17, size: 14272, elements: !442)
!442 = !{!443, !444, !445, !453, !454, !455, !456, !457, !458, !460, !462}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !441, file: !213, line: 19, baseType: !34, size: 896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "purging", scope: !441, file: !213, line: 24, baseType: !26, size: 8, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "time_ms", scope: !441, file: !213, line: 30, baseType: !446, size: 64, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zd_t", file: !67, line: 74, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 74, size: 64, elements: !448)
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !447, file: !67, line: 74, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !451, line: 108, baseType: !452)
!451 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !57, line: 194, baseType: !105)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !441, file: !213, line: 32, baseType: !49, size: 64, offset: 1024)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !441, file: !213, line: 40, baseType: !49, size: 64, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "jitter_state", scope: !441, file: !213, line: 42, baseType: !54, size: 64, offset: 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !441, file: !213, line: 50, baseType: !49, size: 64, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nunpurged", scope: !441, file: !213, line: 57, baseType: !135, size: 64, offset: 1280)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !441, file: !213, line: 64, baseType: !459, size: 12800, offset: 1344)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 12800, elements: !423)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !441, file: !213, line: 72, baseType: !461, size: 64, offset: 14144)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ceil_npages", scope: !441, file: !213, line: 74, baseType: !54, size: 64, offset: 14208)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "decay_muzzy", scope: !212, file: !213, line: 175, baseType: !440, size: 14272, offset: 217280)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "extent_grow_next", scope: !212, file: !213, line: 190, baseType: !465, size: 32, offset: 231552)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "pszind_t", file: !347, line: 7, baseType: !5)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "retain_grow_limit", scope: !212, file: !213, line: 191, baseType: !465, size: 32, offset: 231584)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "extent_grow_mtx", scope: !212, file: !213, line: 192, baseType: !34, size: 896, offset: 231616)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail", scope: !212, file: !213, line: 200, baseType: !469, size: 64, offset: 232512)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_tree_t", file: !4, line: 185, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 185, size: 64, elements: !471)
!471 = !{!472}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ph_root", scope: !470, file: !4, line: 185, baseType: !371, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail_cnt", scope: !212, file: !213, line: 201, baseType: !231, size: 64, offset: 232576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "extent_avail_mtx", scope: !212, file: !213, line: 202, baseType: !34, size: 896, offset: 232640)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !212, file: !213, line: 209, baseType: !476, size: 2496, offset: 233536)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 2496, elements: !317)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "bins_t", file: !478, line: 86, baseType: !479)
!478 = !DIFile(filename: "include/jemalloc/internal/bin.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "498400e4bc130e370fcaa245db662b71")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bins_s", file: !478, line: 87, size: 64, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bin_shards", scope: !479, file: !478, line: 89, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_t", file: !478, line: 58, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_s", file: !478, line: 59, size: 2240, elements: !485)
!485 = !{!486, !487, !488, !489, !490}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !484, file: !478, line: 61, baseType: !34, size: 896)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "slabcur", scope: !484, file: !478, line: 69, baseType: !371, size: 64, offset: 896)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_nonfull", scope: !484, file: !478, line: 76, baseType: !419, size: 64, offset: 960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_full", scope: !484, file: !478, line: 79, baseType: !367, size: 64, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !484, file: !478, line: 82, baseType: !491, size: 1152, offset: 1088)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_stats_t", file: !492, line: 6, baseType: !493)
!492 = !DIFile(filename: "include/jemalloc/internal/bin_stats.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "4968efeedc9165ec9a1d6102ebef1b3c")
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_stats_s", file: !492, line: 7, size: 1152, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc", scope: !493, file: !492, line: 14, baseType: !54, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc", scope: !493, file: !492, line: 15, baseType: !54, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !493, file: !492, line: 22, baseType: !54, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "curregs", scope: !493, file: !492, line: 28, baseType: !135, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nfills", scope: !493, file: !492, line: 31, baseType: !54, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes", scope: !493, file: !492, line: 34, baseType: !54, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nslabs", scope: !493, file: !492, line: 37, baseType: !54, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "reslabs", scope: !493, file: !492, line: 43, baseType: !54, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "curslabs", scope: !493, file: !492, line: 46, baseType: !135, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nonfull_slabs", scope: !493, file: !492, line: 49, baseType: !135, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_data", scope: !493, file: !492, line: 51, baseType: !44, size: 512, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !212, file: !213, line: 216, baseType: !507, size: 64, offset: 236032)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "base_t", file: !509, line: 5, baseType: !510)
!509 = !DIFile(filename: "include/jemalloc/internal/base_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "7f7034d6fa75fa649e18edc6668e90f4")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_s", file: !511, line: 20, size: 16512, elements: !512)
!511 = !DIFile(filename: "include/jemalloc/internal/base_structs.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "336d77d7a7b3192aa2dbcb6782483f7a")
!512 = !{!513, !514, !515, !516, !517, !518, !519, !527, !531, !532, !533, !534}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !510, file: !511, line: 22, baseType: !5, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "extent_hooks", scope: !510, file: !511, line: 28, baseType: !198, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !510, file: !511, line: 31, baseType: !34, size: 896, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "auto_thp_switched", scope: !510, file: !511, line: 34, baseType: !26, size: 8, offset: 1024)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pind_last", scope: !510, file: !511, line: 40, baseType: !465, size: 32, offset: 1056)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "extent_sn_next", scope: !510, file: !511, line: 43, baseType: !135, size: 64, offset: 1088)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !510, file: !511, line: 46, baseType: !520, size: 64, offset: 1152)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "base_block_t", file: !509, line: 4, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_block_s", file: !511, line: 9, size: 1152, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !522, file: !511, line: 11, baseType: !135, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !522, file: !511, line: 14, baseType: !520, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !522, file: !511, line: 17, baseType: !372, size: 1024, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !510, file: !511, line: 49, baseType: !528, size: 15040, offset: 1216)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 15040, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 235)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !510, file: !511, line: 52, baseType: !135, size: 64, offset: 16256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !510, file: !511, line: 53, baseType: !135, size: 64, offset: 16320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !510, file: !511, line: 54, baseType: !135, size: 64, offset: 16384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "n_thp", scope: !510, file: !511, line: 56, baseType: !135, size: 64, offset: 16448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "create_time", scope: !212, file: !213, line: 218, baseType: !49, size: 64, offset: 236096)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arena", scope: !81, file: !77, line: 199, baseType: !209, size: 64, offset: 3520)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arenas_tdata", scope: !81, file: !77, line: 199, baseType: !538, size: 64, offset: 3584)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_tdata_t", file: !211, line: 19, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_tdata_s", file: !213, line: 222, size: 64, elements: !541)
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "decay_ticker", scope: !540, file: !213, line: 223, baseType: !292, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_binshards", scope: !81, file: !77, line: 199, baseType: !544, size: 312, offset: 3648)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_binshards_t", file: !545, line: 12, baseType: !546)
!545 = !DIFile(filename: "include/jemalloc/internal/bin_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "900f45601acc6d8c9838905f3ff9fe5c")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsd_binshards_s", file: !545, line: 13, size: 312, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "binshard", scope: !546, file: !545, line: 14, baseType: !349, size: 312)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache", scope: !81, file: !77, line: 199, baseType: !285, size: 46272, offset: 3968)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_witness_tsd", scope: !81, file: !77, line: 199, baseType: !551, size: 128, offset: 50240)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_tsd_t", file: !552, line: 107, baseType: !553)
!552 = !DIFile(filename: "include/jemalloc/internal/witness.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "fb8675f0725894e4a6abb6181efc1d0a")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_tsd_s", file: !552, line: 108, size: 128, elements: !554)
!554 = !{!555, !582}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "witnesses", scope: !553, file: !552, line: 109, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_list_t", file: !552, line: 76, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 76, size: 64, elements: !558)
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !557, file: !552, line: 76, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_t", file: !552, line: 74, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_s", file: !552, line: 80, size: 384, elements: !563)
!563 = !{!564, !567, !569, !576, !577}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !552, line: 82, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !562, file: !552, line: 88, baseType: !568, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_rank_t", file: !552, line: 75, baseType: !5)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !562, file: !552, line: 95, baseType: !570, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_comp_t", file: !552, line: 77, baseType: !572)
!572 = !DISubroutineType(types: !573)
!573 = !{!299, !574, !175, !574, !175}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !562, file: !552, line: 98, baseType: !175, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !562, file: !552, line: 101, baseType: !578, size: 128, offset: 256)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !562, file: !552, line: 101, size: 128, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !578, file: !552, line: 101, baseType: !560, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !578, file: !552, line: 101, baseType: !560, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "forking", scope: !553, file: !552, line: 110, baseType: !26, size: 8, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "n_lock_ops", scope: !46, file: !45, line: 105, baseType: !54, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !41, file: !12, line: 44, baseType: !585, size: 320, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !586, line: 72, baseType: !587)
!586 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!587 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !586, line: 67, size: 320, elements: !588)
!588 = !{!589, !609, !613}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !587, file: !586, line: 69, baseType: !590, size: 320)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !591, line: 22, size: 320, elements: !592)
!591 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!592 = !{!593, !594, !595, !596, !597, !598, !600, !601}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !590, file: !591, line: 24, baseType: !299, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !590, file: !591, line: 25, baseType: !5, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !590, file: !591, line: 26, baseType: !299, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !590, file: !591, line: 28, baseType: !5, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !590, file: !591, line: 32, baseType: !299, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !590, file: !591, line: 34, baseType: !599, size: 16, offset: 160)
!599 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !590, file: !591, line: 35, baseType: !599, size: 16, offset: 176)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !590, file: !591, line: 36, baseType: !602, size: 128, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !603, line: 55, baseType: !604)
!603 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !603, line: 51, size: 128, elements: !605)
!605 = !{!606, !608}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !604, file: !603, line: 53, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !604, file: !603, line: 54, baseType: !607, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !587, file: !586, line: 70, baseType: !610, size: 320)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 320, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 40)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !587, file: !586, line: 71, baseType: !105, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !41, file: !12, line: 50, baseType: !615, size: 8, offset: 832)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_b_t", file: !67, line: 68, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 68, size: 8, elements: !617)
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !616, file: !67, line: 68, baseType: !26, size: 8)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "witness", scope: !38, file: !12, line: 59, baseType: !561, size: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lock_order", scope: !38, file: !12, line: 60, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_lock_order_t", file: !12, line: 17, baseType: !11)
!622 = !{!623}
!623 = !DISubrange(count: 256)
!624 = !{!625, !626, !627, !628}
!625 = !DILocalVariable(name: "pool", arg: 1, scope: !23, file: !1, line: 10, type: !27)
!626 = !DILocalVariable(name: "name", arg: 2, scope: !23, file: !1, line: 10, type: !565)
!627 = !DILocalVariable(name: "rank", arg: 3, scope: !23, file: !1, line: 10, type: !568)
!628 = !DILocalVariable(name: "i", scope: !629, file: !1, line: 11, type: !299)
!629 = distinct !DILexicalBlock(scope: !23, file: !1, line: 11, column: 2)
!630 = !{!631, !631, i64 0}
!631 = !{!"any pointer", !632, i64 0}
!632 = !{!"omnipotent char", !633, i64 0}
!633 = !{!"Simple C/C++ TBAA"}
!634 = !DILocation(line: 10, column: 31, scope: !23)
!635 = !DILocation(line: 10, column: 49, scope: !23)
!636 = !{!637, !637, i64 0}
!637 = !{!"int", !632, i64 0}
!638 = !DILocation(line: 10, column: 70, scope: !23)
!639 = !DILocation(line: 11, column: 7, scope: !629)
!640 = !DILocation(line: 11, column: 11, scope: !629)
!641 = !DILocation(line: 11, column: 18, scope: !642)
!642 = distinct !DILexicalBlock(scope: !629, file: !1, line: 11, column: 2)
!643 = !DILocation(line: 11, column: 20, scope: !642)
!644 = !DILocation(line: 11, column: 2, scope: !629)
!645 = !DILocation(line: 12, column: 26, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 12, column: 7)
!647 = distinct !DILexicalBlock(scope: !642, file: !1, line: 11, column: 44)
!648 = !DILocation(line: 12, column: 32, scope: !646)
!649 = !DILocation(line: 12, column: 40, scope: !646)
!650 = !DILocation(line: 12, column: 44, scope: !646)
!651 = !DILocation(line: 12, column: 50, scope: !646)
!652 = !DILocation(line: 12, column: 7, scope: !646)
!653 = !DILocation(line: 12, column: 7, scope: !647)
!654 = !DILocation(line: 14, column: 4, scope: !655)
!655 = distinct !DILexicalBlock(scope: !646, file: !1, line: 13, column: 38)
!656 = !DILocation(line: 16, column: 2, scope: !647)
!657 = !DILocation(line: 11, column: 39, scope: !642)
!658 = !DILocation(line: 11, column: 2, scope: !642)
!659 = distinct !{!659, !644, !660}
!660 = !DILocation(line: 16, column: 2, scope: !629)
!661 = !DILocation(line: 17, column: 2, scope: !23)
!662 = !DILocation(line: 18, column: 1, scope: !23)
!663 = !DISubprogram(name: "je_malloc_mutex_init", scope: !12, file: !12, line: 143, type: !664, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!664 = !DISubroutineType(types: !665)
!665 = !{!26, !114, !565, !568, !621}
