; ModuleID = 'samples/619.bc'
source_filename = "ftl_reloc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ftl_reloc = type { ptr, i8, ptr, %struct.anon, i64, i8, i64, ptr, [5 x %struct.anon.0] }
%struct.anon = type { ptr, ptr }
%struct.anon.0 = type { ptr, ptr }
%struct.spdk_ftl_dev = type { %struct.spdk_ftl_conf, %struct.ftl_layout, ptr, ptr, ptr, %struct.anon.6, ptr, i64, i8, i8, i8, i8, ptr, %struct.ftl_nv_cache, ptr, ptr, ptr, %struct.ftl_trace, %struct.ftl_stats, ptr, i64, ptr, %struct.anon.14, %struct.anon.15, i64, ptr, %struct.anon.16, i64, ptr, i64, i64, i32, i32, ptr, ptr, ptr, ptr, ptr, %struct.anon.17, %struct.anon.18, %struct.anon.19, ptr, ptr, i64, i8, %struct.ftl_writer, %struct.ftl_writer, i32, i8, %struct.anon.22 }
%struct.spdk_ftl_conf = type { ptr, %struct.spdk_uuid, i64, i64, ptr, i64, [4 x i64], i32, %struct.anon.1, [4 x i8], ptr, ptr, i8, [7 x i8], i64 }
%struct.spdk_uuid = type { %union.anon }
%union.anon = type { [16 x i8] }
%struct.anon.1 = type { i32, i32 }
%struct.ftl_layout = type { %struct.anon.2, %struct.anon.3, %struct.anon.4, %struct.anon.5, [16 x %struct.ftl_layout_region], [16 x ptr] }
%struct.anon.2 = type { i64, i64, i64 }
%struct.anon.3 = type { i64, i64, i64, i64, i64 }
%struct.anon.4 = type { i64, i64, i64 }
%struct.anon.5 = type { i64 }

!75 = !DIEnumerator(name: "FTL_BAND_TYPE_GC", value: 1)
!76 = !DIEnumerator(name: "FTL_BAND_TYPE_COMPACTION", value: 2)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftl_md_status", file: !73, line: 46, baseType: !27, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84}
!79 = !DIEnumerator(name: "FTL_MD_SUCCESS", value: 0)
!80 = !DIEnumerator(name: "FTL_MD_IO_FAILURE", value: 1)
!81 = !DIEnumerator(name: "FTL_MD_INVALID_VER", value: 2)
!82 = !DIEnumerator(name: "FTL_MD_NO_MD", value: 3)
!83 = !DIEnumerator(name: "FTL_MD_INVALID_CRC", value: 4)
!84 = !DIEnumerator(name: "FTL_MD_INVALID_SIZE", value: 5)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftl_io_type", file: !86, line: 34, baseType: !27, size: 32, elements: !87)
!86 = !DIFile(filename: "./ftl_io.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "dbc694b485774c77420341a94dbbe416")
!87 = !{!88, !89, !90}
!88 = !DIEnumerator(name: "FTL_IO_READ", value: 0)
!89 = !DIEnumerator(name: "FTL_IO_WRITE", value: 1)
!90 = !DIEnumerator(name: "FTL_IO_UNMAP", value: 2)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ftl_reloc_move_state", file: !2, line: 18, baseType: !27, size: 32, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !98}
!93 = !DIEnumerator(name: "FTL_RELOC_STATE_READ", value: 0)
!94 = !DIEnumerator(name: "FTL_RELOC_STATE_PIN", value: 1)
!95 = !DIEnumerator(name: "FTL_RELOC_STATE_WRITE", value: 2)
!96 = !DIEnumerator(name: "FTL_RELOC_STATE_WAIT", value: 3)
!97 = !DIEnumerator(name: "FTL_RELOC_STATE_HALT", value: 4)
!98 = !DIEnumerator(name: "FTL_RELOC_STATE_MAX", value: 5)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "spdk_log_level", file: !100, line: 52, baseType: !101, size: 32, elements: !102)
!100 = !DIFile(filename: "include/spdk/log.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "dc79cb206a5da324f77777fd137cb5d7")
!101 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!102 = !{!103, !104, !105, !106, !107, !108}
!103 = !DIEnumerator(name: "SPDK_LOG_DISABLED", value: -1)
!104 = !DIEnumerator(name: "SPDK_LOG_ERROR", value: 0)
!105 = !DIEnumerator(name: "SPDK_LOG_WARN", value: 1)
!106 = !DIEnumerator(name: "SPDK_LOG_NOTICE", value: 2)
!107 = !DIEnumerator(name: "SPDK_LOG_INFO", value: 3)
!108 = !DIEnumerator(name: "SPDK_LOG_DEBUG", value: 4)
!109 = !{!110, !111, !112}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_addr", file: !73, line: 32, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !113, line: 27, baseType: !114)
!113 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !115, line: 45, baseType: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!116 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!117 = !{!0, !7, !13, !18}
!118 = !{i32 7, !"Dwarf Version", i32 5}
!119 = !{i32 2, !"Debug Info Version", i32 3}
!120 = !{i32 1, !"wchar_size", i32 4}
!121 = !{i32 8, !"PIC Level", i32 2}
!122 = !{i32 7, !"uwtable", i32 2}
!123 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!124 = distinct !DISubprogram(name: "ftl_reloc_init", scope: !2, file: !2, line: 105, type: !125, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !23, retainedNodes: !952)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !131}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_reloc", file: !2, line: 44, size: 1216, elements: !129)
!129 = !{!130, !920, !921, !922, !927, !928, !929, !930, !944}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !128, file: !2, line: 46, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_ftl_dev", file: !133, line: 42, size: 30720, elements: !134)
!133 = !DIFile(filename: "./ftl_core.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "37cad5a800a858b02f32e26afc2ef2b0")
!134 = !{!135, !182, !322, !349, !363, !364, !390, !391, !392, !393, !394, !395, !396, !399, !759, !760, !761, !762, !767, !791, !792, !793, !794, !799, !804, !805, !806, !811, !812, !813, !814, !815, !816, !817, !818, !821, !822, !823, !824, !867, !872, !877, !878, !879, !880, !881, !903, !904, !905, !906}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !132, file: !133, line: 44, baseType: !136, size: 1088)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_ftl_conf", file: !137, line: 81, size: 1088, elements: !138)
!137 = !DIFile(filename: "include/spdk/ftl.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "39b048091f7c910e883a0ee44a4990de")
!138 = !{!139, !141, !155, !156, !159, !160, !161, !163, !166, !171, !173, !174, !175, !177, !181}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 83, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !136, file: !137, line: 86, baseType: !142, size: 128, offset: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_uuid", file: !143, line: 21, size: 128, elements: !144)
!143 = !DIFile(filename: "include/spdk/uuid.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "184998928e884963453b933bb411eaa6")
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !142, file: !143, line: 24, baseType: !146, size: 128)
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !143, line: 22, size: 128, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !146, file: !143, line: 23, baseType: !149, size: 128)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !153)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !113, line: 24, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !115, line: 38, baseType: !152)
!152 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!153 = !{!154}
!154 = !DISubrange(count: 16)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "overprovisioning", scope: !136, file: !137, line: 89, baseType: !112, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "l2p_dram_limit", scope: !136, file: !137, line: 92, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !158, line: 29, baseType: !116)
!158 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "core_mask", scope: !136, file: !137, line: 95, baseType: !140, size: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "user_io_pool_size", scope: !136, file: !137, line: 98, baseType: !157, size: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "limits", scope: !136, file: !137, line: 101, baseType: !162, size: 256, offset: 448)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 256, elements: !21)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !136, file: !137, line: 104, baseType: !164, size: 32, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !113, line: 26, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !115, line: 42, baseType: !27)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nv_cache", scope: !136, file: !137, line: 112, baseType: !167, size: 64, offset: 736)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !136, file: !137, line: 106, size: 64, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_compaction_threshold", scope: !167, file: !137, line: 108, baseType: !164, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_free_target", scope: !167, file: !137, line: 111, baseType: !164, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !136, file: !137, line: 115, baseType: !172, size: 32, offset: 800)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 32, elements: !21)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "base_bdev", scope: !136, file: !137, line: 118, baseType: !140, size: 64, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bdev", scope: !136, file: !137, line: 121, baseType: !140, size: 64, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fast_shutdown", scope: !136, file: !137, line: 124, baseType: !176, size: 8, offset: 960)
!176 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !136, file: !137, line: 127, baseType: !178, size: 56, offset: 968)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 56, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 7)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "conf_size", scope: !136, file: !137, line: 134, baseType: !157, size: 64, offset: 1024)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !132, file: !133, line: 47, baseType: !183, size: 17152, offset: 1088)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_layout", file: !26, line: 127, size: 17152, elements: !184)
!184 = !{!185, !191, !199, !205, !209, !247}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !183, file: !26, line: 133, baseType: !186, size: 192)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !183, file: !26, line: 129, size: 192, elements: !187)
!187 = !{!188, !189, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "total_blocks", scope: !186, file: !26, line: 130, baseType: !112, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "num_usable_blocks", scope: !186, file: !26, line: 131, baseType: !112, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "user_blocks", scope: !186, file: !26, line: 132, baseType: !112, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nvc", scope: !183, file: !26, line: 142, baseType: !192, size: 320, offset: 192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !183, file: !26, line: 136, size: 320, elements: !193)
!193 = !{!194, !195, !196, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "total_blocks", scope: !192, file: !26, line: 137, baseType: !112, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_data_blocks", scope: !192, file: !26, line: 138, baseType: !112, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_meta_size", scope: !192, file: !26, line: 139, baseType: !112, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_count", scope: !192, file: !26, line: 140, baseType: !112, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_tail_md_num_blocks", scope: !192, file: !26, line: 141, baseType: !112, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "l2p", scope: !183, file: !26, line: 152, baseType: !200, size: 192, offset: 512)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !183, file: !26, line: 145, size: 192, elements: !201)
!201 = !{!202, !203, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "addr_length", scope: !200, file: !26, line: 147, baseType: !112, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "addr_size", scope: !200, file: !26, line: 149, baseType: !112, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lbas_in_page", scope: !200, file: !26, line: 151, baseType: !112, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "p2l", scope: !183, file: !26, line: 158, baseType: !206, size: 64, offset: 704)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !183, file: !26, line: 155, size: 64, elements: !207)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ckpt_pages", scope: !206, file: !26, line: 157, baseType: !112, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !183, file: !26, line: 160, baseType: !210, size: 15360, offset: 768)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 15360, elements: !153)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_layout_region", file: !26, line: 88, size: 960, elements: !212)
!212 = !{!213, !215, !216, !217, !235, !236, !237, !238, !239, !243}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !26, line: 90, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !211, file: !26, line: 93, baseType: !25, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_type", scope: !211, file: !26, line: 96, baseType: !25, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !211, file: !26, line: 99, baseType: !218, size: 256, offset: 128)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_layout_region_descriptor", file: !26, line: 74, size: 256, elements: !219)
!219 = !{!220, !221, !222, !223}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !218, file: !26, line: 76, baseType: !112, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !218, file: !26, line: 79, baseType: !112, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !218, file: !26, line: 82, baseType: !112, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "sb_md_reg", scope: !218, file: !26, line: 84, baseType: !224, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_superblock_md_region", file: !226, line: 48, size: 256, elements: !227)
!226 = !DIFile(filename: "./ftl_sb_common.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "4e2b3ed6e002be341073dc542da38b27")
!227 = !{!228, !229, !230, !231, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !226, line: 49, baseType: !164, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !225, file: !226, line: 50, baseType: !164, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "blk_offs", scope: !225, file: !226, line: 51, baseType: !112, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "blk_sz", scope: !225, file: !226, line: 52, baseType: !112, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "df_next", scope: !225, file: !226, line: 53, baseType: !233, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_df_obj_id", file: !234, line: 12, baseType: !112)
!234 = !DIFile(filename: "./utils/ftl_df.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "52ec2517c2959b262ff51f96d4eec83e")
!235 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !211, file: !26, line: 102, baseType: !218, size: 256, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "entry_size", scope: !211, file: !26, line: 109, baseType: !112, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !211, file: !26, line: 112, baseType: !112, size: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "vss_blksz", scope: !211, file: !26, line: 115, baseType: !112, size: 64, offset: 768)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_desc", scope: !211, file: !26, line: 118, baseType: !240, size: 64, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_desc", file: !242, line: 99, flags: DIFlagFwdDecl)
!242 = !DIFile(filename: "include/spdk/bdev.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "ad5de07e01a6cdcb8de0ed834fd6bc82")
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ioch", scope: !211, file: !26, line: 121, baseType: !244, size: 64, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_io_channel", file: !246, line: 689, flags: DIFlagFwdDecl)
!246 = !DIFile(filename: "include/spdk/thread.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "049d1606c4c83167baed644453ef96cb")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !183, file: !26, line: 163, baseType: !248, size: 1024, offset: 16128)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 1024, elements: !153)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_md", file: !49, line: 28, size: 3776, elements: !251)
!251 = !{!252, !257, !262, !263, !266, !267, !268, !269, !270, !299, !300, !304, !305, !306, !314, !319, !320, !321}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !250, file: !49, line: 36, baseType: !253, size: 128)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !49, line: 30, size: 128, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !253, file: !49, line: 32, baseType: !110, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cb_ctx", scope: !253, file: !49, line: 35, baseType: !110, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !250, file: !49, line: 39, baseType: !258, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_md_cb", file: !49, line: 16, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !131, !249, !101}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !250, file: !49, line: 42, baseType: !131, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !250, file: !49, line: 45, baseType: !264, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !250, file: !49, line: 48, baseType: !110, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "data_blocks", scope: !250, file: !49, line: 51, baseType: !112, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "vss_data", scope: !250, file: !49, line: 54, baseType: !110, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "entry_vss_dma_buf", scope: !250, file: !49, line: 57, baseType: !110, size: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !250, file: !49, line: 69, baseType: !271, size: 704, offset: 576)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !49, line: 60, size: 704, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !271, file: !49, line: 61, baseType: !110, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !271, file: !49, line: 62, baseType: !110, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !271, file: !49, line: 63, baseType: !112, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !271, file: !49, line: 64, baseType: !112, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data_offset", scope: !271, file: !49, line: 65, baseType: !112, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !271, file: !49, line: 66, baseType: !101, size: 32, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !271, file: !49, line: 67, baseType: !48, size: 32, offset: 352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_io_wait", scope: !271, file: !49, line: 68, baseType: !281, size: 320, offset: 384)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev_io_wait_entry", file: !242, line: 1790, size: 320, elements: !282)
!282 = !{!283, !286, !291, !292}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bdev", scope: !281, file: !242, line: 1791, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_bdev", file: !242, line: 57, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cb_fn", scope: !281, file: !242, line: 1792, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "spdk_bdev_io_wait_cb", file: !242, line: 1785, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !110}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cb_arg", scope: !281, file: !242, line: 1793, baseType: !110, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !281, file: !242, line: 1794, baseType: !293, size: 128, offset: 192)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !281, file: !242, line: 1794, size: 128, elements: !294)
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !293, file: !242, line: 1794, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !293, file: !242, line: 1794, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "shm_fd", scope: !250, file: !49, line: 72, baseType: !101, size: 32, offset: 1280)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !250, file: !49, line: 75, baseType: !301, size: 2048, offset: 1312)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "shm_mmap_flags", scope: !250, file: !49, line: 78, baseType: !101, size: 32, offset: 3360)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "shm_sz", scope: !250, file: !49, line: 81, baseType: !157, size: 64, offset: 3392)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "shm_open", scope: !250, file: !49, line: 84, baseType: !307, size: 64, offset: 3456)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "shm_open_t", file: !49, line: 24, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!101, !214, !101, !311}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !312, line: 69, baseType: !313)
!312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !115, line: 150, baseType: !27)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "shm_unlink", scope: !250, file: !49, line: 87, baseType: !315, size: 64, offset: 3520)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "shm_unlink_t", file: !49, line: 25, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!101, !214}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mem_reg", scope: !250, file: !49, line: 90, baseType: !176, size: 8, offset: 3584)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "mirror", scope: !250, file: !49, line: 93, baseType: !249, size: 64, offset: 3648)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_enabled", scope: !250, file: !49, line: 96, baseType: !176, size: 8, offset: 3712)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sb", scope: !132, file: !133, line: 50, baseType: !323, size: 64, offset: 18240)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_superblock", file: !325, line: 15, size: 1344, elements: !326)
!325 = !DIFile(filename: "./ftl_sb_current.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "edcbfeaf54501013c764a3d5e3ad829e")
!326 = !{!327, !333, !334, !335, !336, !337, !338, !339, !340, !341, !348}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !324, file: !325, line: 16, baseType: !328, size: 192)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_superblock_header", file: !226, line: 40, size: 192, elements: !329)
!329 = !{!330, !331, !332}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !328, file: !226, line: 41, baseType: !112, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !328, file: !226, line: 42, baseType: !112, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !328, file: !226, line: 43, baseType: !112, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !324, file: !325, line: 18, baseType: !142, size: 128, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "seq_id", scope: !324, file: !325, line: 21, baseType: !112, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !324, file: !325, line: 24, baseType: !112, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "lba_cnt", scope: !324, file: !325, line: 27, baseType: !112, size: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "overprovisioning", scope: !324, file: !325, line: 30, baseType: !112, size: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "max_reloc_qdepth", scope: !324, file: !325, line: 33, baseType: !112, size: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reserved3", scope: !324, file: !325, line: 36, baseType: !149, size: 128, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ckpt_seq_id", scope: !324, file: !325, line: 39, baseType: !112, size: 64, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "gc_info", scope: !324, file: !325, line: 41, baseType: !342, size: 256, offset: 832)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_superblock_gc_info", file: !226, line: 25, size: 256, elements: !343)
!343 = !{!344, !345, !346, !347}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "band_id_high_prio", scope: !342, file: !226, line: 29, baseType: !112, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "current_band_id", scope: !342, file: !226, line: 31, baseType: !112, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "band_phys_id", scope: !342, file: !226, line: 33, baseType: !112, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !342, file: !226, line: 35, baseType: !112, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "md_layout_head", scope: !324, file: !325, line: 43, baseType: !225, size: 256, offset: 1088)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sb_shm", scope: !132, file: !133, line: 53, baseType: !350, size: 64, offset: 18304)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_superblock_shm", file: !226, line: 58, size: 576, elements: !352)
!352 = !{!353, !354, !355, !362}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "shm_ready", scope: !351, file: !226, line: 60, baseType: !176, size: 8)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "shm_clean", scope: !351, file: !226, line: 63, baseType: !176, size: 8, offset: 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "trim", scope: !351, file: !226, line: 71, baseType: !356, size: 256, offset: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !351, file: !226, line: 66, size: 256, elements: !357)
!357 = !{!358, !359, !360, !361}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "in_progress", scope: !356, file: !226, line: 67, baseType: !176, size: 8)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "start_lba", scope: !356, file: !226, line: 68, baseType: !112, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !356, file: !226, line: 69, baseType: !112, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "seq_id", scope: !356, file: !226, line: 70, baseType: !112, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "gc_info", scope: !351, file: !226, line: 73, baseType: !342, size: 256, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sb_shm_md", scope: !132, file: !133, line: 54, baseType: !249, size: 64, offset: 18368)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ioch_queue", scope: !132, file: !133, line: 57, baseType: !365, size: 128, offset: 18432)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !133, line: 57, size: 128, elements: !366)
!366 = !{!367, !389}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !365, file: !133, line: 57, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_io_channel", file: !86, line: 42, size: 448, elements: !370)
!370 = !{!371, !372, !378, !381, !384, !388}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !369, file: !86, line: 44, baseType: !131, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !369, file: !86, line: 46, baseType: !373, size: 128, offset: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !86, line: 46, size: 128, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !373, file: !86, line: 46, baseType: !368, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !373, file: !86, line: 46, baseType: !377, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "map_pool", scope: !369, file: !86, line: 48, baseType: !379, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_mempool", file: !86, line: 48, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !369, file: !86, line: 50, baseType: !382, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_poller", file: !246, line: 45, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !369, file: !86, line: 52, baseType: !385, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_ring", file: !387, line: 557, flags: DIFlagFwdDecl)
!387 = !DIFile(filename: "include/spdk/env.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "c5bb62a61dfb30b3c4fe3f80f0d985bb")
!388 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !369, file: !86, line: 54, baseType: !385, size: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !365, file: !133, line: 57, baseType: !377, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "base_bdev_desc", scope: !132, file: !133, line: 60, baseType: !240, size: 64, offset: 18560)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks_in_band", scope: !132, file: !133, line: 63, baseType: !112, size: 64, offset: 18624)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "is_zoned", scope: !132, file: !133, line: 64, baseType: !176, size: 8, offset: 18688)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !132, file: !133, line: 67, baseType: !176, size: 8, offset: 18696)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "halt", scope: !132, file: !133, line: 70, baseType: !176, size: 8, offset: 18704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "io_device_registered", scope: !132, file: !133, line: 73, baseType: !176, size: 8, offset: 18712)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "unregister_process", scope: !132, file: !133, line: 76, baseType: !397, size: 64, offset: 18752)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_mngt_process", file: !73, line: 117, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nv_cache", scope: !132, file: !133, line: 79, baseType: !400, size: 3776, offset: 18816)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_nv_cache", file: !55, line: 132, size: 3776, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !588, !593, !594, !599, !600, !605, !606, !611, !612, !617, !618, !735, !736, !737, !738, !739, !740, !742, !752}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "halt", scope: !400, file: !55, line: 134, baseType: !176, size: 8)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_desc", scope: !400, file: !55, line: 137, baseType: !240, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cache_ioch", scope: !400, file: !55, line: 140, baseType: !244, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "md_pool", scope: !400, file: !55, line: 143, baseType: !379, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "p2l_pool", scope: !400, file: !55, line: 146, baseType: !379, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_md_pool", scope: !400, file: !55, line: 149, baseType: !379, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "free_chunk_md_pool", scope: !400, file: !55, line: 152, baseType: !379, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "md_size", scope: !400, file: !55, line: 155, baseType: !112, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !400, file: !55, line: 158, baseType: !249, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocks", scope: !400, file: !55, line: 161, baseType: !112, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tail_md_chunk_blocks", scope: !400, file: !55, line: 164, baseType: !112, size: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_count", scope: !400, file: !55, line: 167, baseType: !112, size: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_current", scope: !400, file: !55, line: 170, baseType: !415, size: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_nv_cache_chunk", file: !55, line: 95, size: 2688, elements: !417)
!417 = !{!418, !420, !437, !438, !486, !578, !584, !585, !586, !587}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nv_cache", scope: !416, file: !55, line: 96, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !416, file: !55, line: 98, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_nv_cache_chunk_md", file: !55, line: 59, size: 32768, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "seq_id", scope: !422, file: !55, line: 61, baseType: !112, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "close_seq_id", scope: !422, file: !55, line: 64, baseType: !112, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "write_pointer", scope: !422, file: !55, line: 67, baseType: !164, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_written", scope: !422, file: !55, line: 70, baseType: !164, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_skipped", scope: !422, file: !55, line: 73, baseType: !164, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "read_pointer", scope: !422, file: !55, line: 76, baseType: !164, size: 32, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_compacted", scope: !422, file: !55, line: 79, baseType: !164, size: 32, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !422, file: !55, line: 82, baseType: !54, size: 32, offset: 288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "p2l_map_checksum", scope: !422, file: !55, line: 85, baseType: !164, size: 32, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !422, file: !55, line: 88, baseType: !434, size: 32416, offset: 352)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 32416, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 4052)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !416, file: !55, line: 101, baseType: !112, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "p2l_map", scope: !416, file: !55, line: 104, baseType: !439, size: 384, offset: 192)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_p2l_map", file: !73, line: 76, size: 384, elements: !440)
!440 = !{!441, !442, !443, !447, !457, !483}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "num_valid", scope: !439, file: !73, line: 78, baseType: !157, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ref_cnt", scope: !439, file: !73, line: 81, baseType: !157, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !439, file: !73, line: 84, baseType: !444, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_bitmap", file: !446, line: 11, flags: DIFlagFwdDecl)
!446 = !DIFile(filename: "./utils/ftl_bitmap.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "2c6a07f26f6c458013e36e233acb2f3d")
!447 = !DIDerivedType(tag: DW_TAG_member, scope: !439, file: !73, line: 87, baseType: !448, size: 64, offset: 192)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !439, file: !73, line: 87, size: 64, elements: !449)
!449 = !{!450, !456}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "band_map", scope: !448, file: !73, line: 88, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_p2l_map_entry", file: !73, line: 60, size: 128, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lba", scope: !452, file: !73, line: 61, baseType: !112, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "seq_id", scope: !452, file: !73, line: 62, baseType: !112, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_map", scope: !448, file: !73, line: 89, baseType: !110, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, scope: !439, file: !73, line: 93, baseType: !458, size: 64, offset: 256)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !439, file: !73, line: 93, size: 64, elements: !459)
!459 = !{!460, !482}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "band_dma_md", scope: !458, file: !73, line: 94, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_band_md", file: !62, line: 48, size: 32768, elements: !463)
!463 = !{!464, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !462, file: !62, line: 56, baseType: !465, size: 128)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !462, file: !62, line: 50, size: 128, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !465, file: !62, line: 52, baseType: !111, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !465, file: !62, line: 55, baseType: !112, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !462, file: !62, line: 59, baseType: !61, size: 32, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !62, line: 62, baseType: !72, size: 32, offset: 160)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "p2l_md_region", scope: !462, file: !62, line: 65, baseType: !25, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !462, file: !62, line: 68, baseType: !172, size: 32, offset: 224)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !462, file: !62, line: 71, baseType: !112, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "close_seq_id", scope: !462, file: !62, line: 74, baseType: !112, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "wr_cnt", scope: !462, file: !62, line: 77, baseType: !112, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "df_p2l_map", scope: !462, file: !62, line: 80, baseType: !233, size: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "p2l_map_checksum", scope: !462, file: !62, line: 83, baseType: !164, size: 32, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !462, file: !62, line: 86, baseType: !479, size: 32224, offset: 544)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 32224, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 4028)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_dma_md", scope: !458, file: !73, line: 96, baseType: !421, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "p2l_ckpt", scope: !439, file: !73, line: 100, baseType: !484, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_p2l_ckpt", file: !73, line: 100, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_rq", scope: !416, file: !55, line: 107, baseType: !487, size: 1024, offset: 576)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_basic_rq", file: !86, line: 255, size: 1024, elements: !488)
!488 = !{!489, !490, !497, !498, !499, !500, !508}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !487, file: !86, line: 256, baseType: !131, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "qentry", scope: !487, file: !86, line: 259, baseType: !491, size: 128, offset: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !86, line: 259, size: 128, elements: !492)
!492 = !{!493, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !491, file: !86, line: 259, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !491, file: !86, line: 259, baseType: !496, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !487, file: !86, line: 262, baseType: !112, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "io_payload", scope: !487, file: !86, line: 265, baseType: !110, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "success", scope: !487, file: !86, line: 268, baseType: !176, size: 8, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !487, file: !86, line: 277, baseType: !501, size: 128, offset: 384)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !86, line: 271, size: 128, elements: !502)
!502 = !{!503, !507}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !501, file: !86, line: 273, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !494}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !501, file: !86, line: 276, baseType: !110, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !487, file: !86, line: 291, baseType: !509, size: 512, offset: 512)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !86, line: 280, size: 512, elements: !510)
!510 = !{!511, !512, !576, !577}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !509, file: !86, line: 282, baseType: !111, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "band", scope: !509, file: !86, line: 285, baseType: !513, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_band", file: !62, line: 91, size: 3072, elements: !515)
!515 = !{!516, !517, !518, !519, !542, !543, !544, !545, !546, !547, !548, !549, !555, !571}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !514, file: !62, line: 93, baseType: !131, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !514, file: !62, line: 95, baseType: !461, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "queue_depth", scope: !514, file: !62, line: 98, baseType: !112, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !514, file: !62, line: 116, baseType: !520, size: 256, offset: 192)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !62, line: 101, size: 256, elements: !521)
!521 = !{!522, !523, !528, !541}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !520, file: !62, line: 103, baseType: !110, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "state_change_fn", scope: !520, file: !62, line: 106, baseType: !524, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_band_state_change_fn", file: !62, line: 43, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !513}
!528 = !DIDerivedType(tag: DW_TAG_member, scope: !520, file: !62, line: 109, baseType: !529, size: 64, offset: 128)
!529 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !520, file: !62, line: 109, size: 64, elements: !530)
!530 = !{!531, !536}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ops_fn", scope: !529, file: !62, line: 110, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_band_ops_cb", file: !62, line: 44, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !513, !110, !176}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "md_fn", scope: !529, file: !62, line: 111, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_band_md_cb", file: !62, line: 45, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !513, !110, !77}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !520, file: !62, line: 115, baseType: !112, size: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "p2l_map", scope: !514, file: !62, line: 119, baseType: !439, size: 384, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "reloc", scope: !514, file: !62, line: 122, baseType: !176, size: 8, offset: 832)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !514, file: !62, line: 125, baseType: !164, size: 32, offset: 864)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "phys_id", scope: !514, file: !62, line: 131, baseType: !164, size: 32, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "start_addr", scope: !514, file: !62, line: 134, baseType: !111, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tail_md_addr", scope: !514, file: !62, line: 137, baseType: !111, size: 64, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_rq", scope: !514, file: !62, line: 140, baseType: !487, size: 1024, offset: 1088)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "queue_entry", scope: !514, file: !62, line: 147, baseType: !550, size: 128, offset: 2112)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !62, line: 147, size: 128, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !550, file: !62, line: 147, baseType: !513, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !550, file: !62, line: 147, baseType: !554, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "md_persist_entry_ctx", scope: !514, file: !62, line: 150, baseType: !556, size: 768, offset: 2240)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_md_io_entry_ctx", file: !49, line: 101, size: 768, elements: !557)
!557 = !{!558, !559, !560, !565, !566, !567, !568, !569, !570}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !556, file: !49, line: 102, baseType: !164, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !556, file: !49, line: 103, baseType: !101, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !556, file: !49, line: 104, baseType: !561, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_md_io_entry_cb", file: !49, line: 99, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !101, !110}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cb_arg", scope: !556, file: !49, line: 105, baseType: !110, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !556, file: !49, line: 106, baseType: !249, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "start_entry", scope: !556, file: !49, line: 107, baseType: !112, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !556, file: !49, line: 108, baseType: !110, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "vss_buffer", scope: !556, file: !49, line: 109, baseType: !110, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_io_wait", scope: !556, file: !49, line: 110, baseType: !281, size: 320, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "validate_cb", scope: !514, file: !62, line: 153, baseType: !572, size: 64, offset: 3008)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_band_validate_md_cb", file: !62, line: 46, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !513, !176}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !509, file: !86, line: 288, baseType: !415, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_io_wait", scope: !509, file: !86, line: 290, baseType: !281, size: 320, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !416, file: !55, line: 109, baseType: !579, size: 128, offset: 1600)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !416, file: !55, line: 109, size: 128, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !579, file: !55, line: 109, baseType: !415, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !579, file: !55, line: 109, baseType: !583, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "recovery", scope: !416, file: !55, line: 112, baseType: !176, size: 8, offset: 1728)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "compaction_start_tsc", scope: !416, file: !55, line: 115, baseType: !112, size: 64, offset: 1792)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "compaction_length_tsc", scope: !416, file: !55, line: 118, baseType: !112, size: 64, offset: 1856)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "md_persist_entry_ctx", scope: !416, file: !55, line: 121, baseType: !556, size: 768, offset: 1920)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_free_list", scope: !400, file: !55, line: 173, baseType: !589, size: 128, offset: 832)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !55, line: 173, size: 128, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !589, file: !55, line: 173, baseType: !415, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !589, file: !55, line: 173, baseType: !583, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_free_count", scope: !400, file: !55, line: 174, baseType: !112, size: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_open_list", scope: !400, file: !55, line: 177, baseType: !595, size: 128, offset: 1024)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !55, line: 177, size: 128, elements: !596)
!596 = !{!597, !598}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !595, file: !55, line: 177, baseType: !415, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !595, file: !55, line: 177, baseType: !583, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_open_count", scope: !400, file: !55, line: 178, baseType: !112, size: 64, offset: 1152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_full_list", scope: !400, file: !55, line: 181, baseType: !601, size: 128, offset: 1216)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !55, line: 181, size: 128, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !601, file: !55, line: 181, baseType: !415, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !601, file: !55, line: 181, baseType: !583, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_full_count", scope: !400, file: !55, line: 182, baseType: !112, size: 64, offset: 1344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_comp_list", scope: !400, file: !55, line: 185, baseType: !607, size: 128, offset: 1408)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !55, line: 185, size: 128, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !607, file: !55, line: 185, baseType: !415, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !607, file: !55, line: 185, baseType: !583, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_comp_count", scope: !400, file: !55, line: 186, baseType: !112, size: 64, offset: 1536)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free_persist_list", scope: !400, file: !55, line: 189, baseType: !613, size: 128, offset: 1600)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !55, line: 189, size: 128, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !613, file: !55, line: 189, baseType: !415, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !613, file: !55, line: 189, baseType: !583, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_free_persist_count", scope: !400, file: !55, line: 190, baseType: !112, size: 64, offset: 1728)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "compactor_list", scope: !400, file: !55, line: 192, baseType: !619, size: 128, offset: 1792)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !55, line: 192, size: 128, elements: !620)
!620 = !{!621, !734}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !619, file: !55, line: 192, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_nv_cache_compactor", file: !55, line: 124, size: 640, elements: !624)
!624 = !{!625, !626, !726, !727, !733}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "nv_cache", scope: !623, file: !55, line: 125, baseType: !419, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "wr", scope: !623, file: !55, line: 126, baseType: !627, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_rq", file: !86, line: 181, size: 2304, elements: !629)
!629 = !{!630, !631, !637, !638, !639, !640, !641, !650, !651, !652, !665, !673, !679, !680}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !628, file: !86, line: 182, baseType: !131, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "qentry", scope: !628, file: !86, line: 185, baseType: !632, size: 128, offset: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !628, file: !86, line: 185, size: 128, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !632, file: !86, line: 185, baseType: !627, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !632, file: !86, line: 185, baseType: !636, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !628, file: !86, line: 188, baseType: !112, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "io_md", scope: !628, file: !86, line: 191, baseType: !110, size: 64, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "io_md_size", scope: !628, file: !86, line: 194, baseType: !112, size: 64, offset: 320)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "io_vec_size", scope: !628, file: !86, line: 197, baseType: !112, size: 64, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "io_vec", scope: !628, file: !86, line: 200, baseType: !642, size: 64, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !644, line: 26, size: 128, elements: !645)
!644 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !643, file: !644, line: 28, baseType: !110, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !643, file: !644, line: 29, baseType: !648, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !649, line: 70, baseType: !116)
!649 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!650 = !DIDerivedType(tag: DW_TAG_member, name: "io_payload", scope: !628, file: !86, line: 203, baseType: !110, size: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "success", scope: !628, file: !86, line: 206, baseType: !176, size: 8, offset: 576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !628, file: !86, line: 222, baseType: !653, size: 256, offset: 640)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !628, file: !86, line: 209, size: 256, elements: !654)
!654 = !{!655, !659, !663, !664}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !653, file: !86, line: 211, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !627}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !653, file: !86, line: 214, baseType: !660, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !627, !513, !112, !112}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !653, file: !86, line: 218, baseType: !110, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "compaction", scope: !653, file: !86, line: 221, baseType: !176, size: 8, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !628, file: !86, line: 235, baseType: !666, size: 160, offset: 896)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !628, file: !86, line: 225, size: 160, elements: !667)
!667 = !{!668, !669, !670, !671, !672}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !666, file: !86, line: 226, baseType: !164, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !666, file: !86, line: 228, baseType: !164, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "qd", scope: !666, file: !86, line: 231, baseType: !164, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !666, file: !86, line: 233, baseType: !164, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !666, file: !86, line: 234, baseType: !101, size: 32, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !628, file: !86, line: 246, baseType: !674, size: 448, offset: 1088)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !628, file: !86, line: 238, size: 448, elements: !675)
!675 = !{!676, !677, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !674, file: !86, line: 240, baseType: !111, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "band", scope: !674, file: !86, line: 243, baseType: !513, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_io_wait", scope: !674, file: !86, line: 245, baseType: !281, size: 320, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "md_persist_entry_ctx", scope: !628, file: !86, line: 249, baseType: !556, size: 768, offset: 1536)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !628, file: !86, line: 251, baseType: !681, offset: 2304)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, elements: !724)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_rq_entry", file: !86, line: 136, size: 1344, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !691, !695, !699, !718}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "io_payload", scope: !682, file: !86, line: 138, baseType: !110, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "io_md", scope: !682, file: !86, line: 140, baseType: !110, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !682, file: !86, line: 146, baseType: !111, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lba", scope: !682, file: !86, line: 149, baseType: !112, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "seq_id", scope: !682, file: !86, line: 152, baseType: !112, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !682, file: !86, line: 155, baseType: !690, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !682, file: !86, line: 159, baseType: !692, size: 64, offset: 384)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !682, file: !86, line: 157, size: 64, elements: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !692, file: !86, line: 158, baseType: !110, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !682, file: !86, line: 164, baseType: !696, size: 64, offset: 448)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !682, file: !86, line: 162, size: 64, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "band", scope: !696, file: !86, line: 163, baseType: !513, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "l2p_pin_ctx", scope: !682, file: !86, line: 167, baseType: !700, size: 384, offset: 512)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_l2p_pin_ctx", file: !701, line: 26, size: 384, elements: !702)
!701 = !DIFile(filename: "./ftl_l2p.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "4e1308098fc9e1827f9d87efff6ff9b7")
!702 = !{!703, !704, !705, !711, !712}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lba", scope: !700, file: !701, line: 27, baseType: !112, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !700, file: !701, line: 28, baseType: !112, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !700, file: !701, line: 29, baseType: !706, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ftl_l2p_pin_cb", file: !701, line: 20, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !131, !101, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "cb_ctx", scope: !700, file: !701, line: 30, baseType: !110, size: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !700, file: !701, line: 31, baseType: !713, size: 128, offset: 256)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !700, file: !701, line: 31, size: 128, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !713, file: !701, line: 31, baseType: !710, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !713, file: !701, line: 31, baseType: !717, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_io", scope: !682, file: !86, line: 173, baseType: !719, size: 448, offset: 896)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !682, file: !86, line: 169, size: 448, elements: !720)
!720 = !{!721, !722, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "offset_blocks", scope: !719, file: !86, line: 170, baseType: !112, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !719, file: !86, line: 171, baseType: !112, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "wait_entry", scope: !719, file: !86, line: 172, baseType: !281, size: 320, offset: 128)
!724 = !{!725}
!725 = !DISubrange(count: -1)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !623, file: !55, line: 127, baseType: !627, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !623, file: !55, line: 128, baseType: !728, size: 128, offset: 192)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !623, file: !55, line: 128, size: 128, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !728, file: !55, line: 128, baseType: !622, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !728, file: !55, line: 128, baseType: !732, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_io_wait", scope: !623, file: !55, line: 129, baseType: !281, size: 320, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !619, file: !55, line: 192, baseType: !732, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "compaction_active_count", scope: !400, file: !55, line: 193, baseType: !112, size: 64, offset: 1920)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_compaction_threshold", scope: !400, file: !55, line: 194, baseType: !112, size: 64, offset: 1984)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "chunks", scope: !400, file: !55, line: 196, baseType: !415, size: 64, offset: 2048)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "last_seq_id", scope: !400, file: !55, line: 198, baseType: !112, size: 64, offset: 2112)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_free_target", scope: !400, file: !55, line: 200, baseType: !112, size: 64, offset: 2176)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "compaction_sma", scope: !400, file: !55, line: 203, baseType: !741, size: 64, offset: 2240)
!741 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "compaction_recent_bw", scope: !400, file: !55, line: 212, baseType: !743, size: 1216, offset: 2304)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "compaction_bw_stats", file: !55, line: 207, size: 1216, elements: !744)
!744 = !{!745, !747, !750, !751}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !743, file: !55, line: 208, baseType: !746, size: 1024)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 1024, elements: !153)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !743, file: !55, line: 209, baseType: !748, size: 64, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !649, line: 59, baseType: !749)
!749 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !743, file: !55, line: 210, baseType: !157, size: 64, offset: 1088)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !743, file: !55, line: 211, baseType: !741, size: 64, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "throttle", scope: !400, file: !55, line: 219, baseType: !753, size: 256, offset: 3520)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !55, line: 214, size: 256, elements: !754)
!754 = !{!755, !756, !757, !758}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "interval_tsc", scope: !753, file: !55, line: 215, baseType: !112, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "start_tsc", scope: !753, file: !55, line: 216, baseType: !112, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_submitted", scope: !753, file: !55, line: 217, baseType: !112, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_submitted_limit", scope: !753, file: !55, line: 218, baseType: !112, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "p2l_pool", scope: !132, file: !133, line: 82, baseType: !379, size: 64, offset: 22592)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "p2l_pool_md", scope: !132, file: !133, line: 85, baseType: !249, size: 64, offset: 22656)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "band_md_pool", scope: !132, file: !133, line: 88, baseType: !379, size: 64, offset: 22720)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "trace", scope: !132, file: !133, line: 91, baseType: !763, size: 64, offset: 22784)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_trace", file: !764, line: 19, size: 64, elements: !765)
!764 = !DIFile(filename: "./ftl_trace.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "738b8251f0db103d44568a9a6ca7c3e7")
!765 = !{!766}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !763, file: !764, line: 21, baseType: !112, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !132, file: !133, line: 94, baseType: !768, size: 4160, offset: 22848)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_stats", file: !137, line: 57, size: 4160, elements: !769)
!769 = !{!770, !772, !773}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "limits", scope: !768, file: !137, line: 63, baseType: !771, size: 256)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 256, elements: !21)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "io_activity_total", scope: !768, file: !137, line: 69, baseType: !112, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !768, file: !137, line: 71, baseType: !774, size: 3840, offset: 320)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 3840, elements: !789)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_stats_entry", file: !137, line: 42, size: 640, elements: !776)
!776 = !{!777, !788}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !775, file: !137, line: 43, baseType: !778, size: 320)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_stats_group", file: !137, line: 36, size: 320, elements: !779)
!779 = !{!780, !781, !782}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ios", scope: !778, file: !137, line: 37, baseType: !112, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !778, file: !137, line: 38, baseType: !112, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !778, file: !137, line: 39, baseType: !783, size: 192, offset: 128)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_stats_error", file: !137, line: 30, size: 192, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "media", scope: !783, file: !137, line: 31, baseType: !112, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !783, file: !137, line: 32, baseType: !112, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !783, file: !137, line: 33, baseType: !112, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !775, file: !137, line: 44, baseType: !778, size: 320, offset: 320)
!789 = !{!790}
!790 = !DISubrange(count: 6)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bands", scope: !132, file: !133, line: 97, baseType: !513, size: 64, offset: 27008)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "num_bands", scope: !132, file: !133, line: 100, baseType: !112, size: 64, offset: 27072)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "next_band", scope: !132, file: !133, line: 103, baseType: !513, size: 64, offset: 27136)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "free_bands", scope: !132, file: !133, line: 106, baseType: !795, size: 128, offset: 27200)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !133, line: 106, size: 128, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !795, file: !133, line: 106, baseType: !513, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !795, file: !133, line: 106, baseType: !554, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "shut_bands", scope: !132, file: !133, line: 109, baseType: !800, size: 128, offset: 27328)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !133, line: 109, size: 128, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !800, file: !133, line: 109, baseType: !513, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !800, file: !133, line: 109, baseType: !554, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "num_free", scope: !132, file: !133, line: 112, baseType: !112, size: 64, offset: 27456)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "l2p", scope: !132, file: !133, line: 115, baseType: !110, size: 64, offset: 27520)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "l2p_deferred_pins", scope: !132, file: !133, line: 118, baseType: !807, size: 128, offset: 27584)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !133, line: 118, size: 128, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !807, file: !133, line: 118, baseType: !710, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !807, file: !133, line: 118, baseType: !717, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "num_lbas", scope: !132, file: !133, line: 121, baseType: !112, size: 64, offset: 27712)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "valid_map", scope: !132, file: !133, line: 124, baseType: !444, size: 64, offset: 27776)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "md_size", scope: !132, file: !133, line: 127, baseType: !112, size: 64, offset: 27840)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_size", scope: !132, file: !133, line: 130, baseType: !112, size: 64, offset: 27904)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !132, file: !133, line: 133, baseType: !101, size: 32, offset: 27968)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "num_inflight", scope: !132, file: !133, line: 136, baseType: !164, size: 32, offset: 28000)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "reloc", scope: !132, file: !133, line: 139, baseType: !127, size: 64, offset: 28032)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "core_thread", scope: !132, file: !133, line: 142, baseType: !819, size: 64, offset: 28096)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_thread", file: !246, line: 40, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ioch", scope: !132, file: !133, line: 147, baseType: !244, size: 64, offset: 28160)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "base_ioch", scope: !132, file: !133, line: 150, baseType: !244, size: 64, offset: 28224)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "core_poller", scope: !132, file: !133, line: 153, baseType: !382, size: 64, offset: 28288)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rd_sq", scope: !132, file: !133, line: 156, baseType: !825, size: 128, offset: 28352)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !133, line: 156, size: 128, elements: !826)
!826 = !{!827, !866}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !825, file: !133, line: 156, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_io", file: !86, line: 58, size: 2176, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !851, !852, !853, !854, !855, !861, !862, !863, !865}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !829, file: !86, line: 60, baseType: !131, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ioch", scope: !829, file: !86, line: 63, baseType: !244, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lba", scope: !829, file: !86, line: 66, baseType: !112, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !829, file: !86, line: 69, baseType: !111, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !829, file: !86, line: 72, baseType: !157, size: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !829, file: !86, line: 75, baseType: !157, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !829, file: !86, line: 78, baseType: !642, size: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !829, file: !86, line: 81, baseType: !110, size: 64, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "iov_cnt", scope: !829, file: !86, line: 84, baseType: !157, size: 64, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "iov_pos", scope: !829, file: !86, line: 87, baseType: !157, size: 64, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "iov_off", scope: !829, file: !86, line: 90, baseType: !157, size: 64, offset: 640)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "band", scope: !829, file: !86, line: 93, baseType: !513, size: 64, offset: 704)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !829, file: !86, line: 96, baseType: !101, size: 32, offset: 768)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "req_cnt", scope: !829, file: !86, line: 99, baseType: !157, size: 64, offset: 832)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "cb_ctx", scope: !829, file: !86, line: 102, baseType: !110, size: 64, offset: 896)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "user_fn", scope: !829, file: !86, line: 105, baseType: !847, size: 64, offset: 960)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "spdk_ftl_fn", file: !137, line: 157, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !110, !101}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !829, file: !86, line: 108, baseType: !101, size: 32, offset: 1024)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !829, file: !86, line: 111, baseType: !85, size: 32, offset: 1056)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !829, file: !86, line: 114, baseType: !176, size: 8, offset: 1088)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "trace", scope: !829, file: !86, line: 117, baseType: !112, size: 64, offset: 1152)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "queue_entry", scope: !829, file: !86, line: 120, baseType: !856, size: 128, offset: 1216)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !829, file: !86, line: 120, size: 128, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !856, file: !86, line: 120, baseType: !828, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !856, file: !86, line: 120, baseType: !860, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nv_cache_chunk", scope: !829, file: !86, line: 123, baseType: !415, size: 64, offset: 1344)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "l2p_pin_ctx", scope: !829, file: !86, line: 126, baseType: !700, size: 384, offset: 1408)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !829, file: !86, line: 130, baseType: !864, size: 64, offset: 1792)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_io_wait", scope: !829, file: !86, line: 132, baseType: !281, size: 320, offset: 1856)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !825, file: !133, line: 156, baseType: !860, size: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "wr_sq", scope: !132, file: !133, line: 159, baseType: !868, size: 128, offset: 28480)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !133, line: 159, size: 128, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !868, file: !133, line: 159, baseType: !828, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !868, file: !133, line: 159, baseType: !860, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "unmap_sq", scope: !132, file: !133, line: 162, baseType: !873, size: 128, offset: 28608)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !133, line: 162, size: 128, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !873, file: !133, line: 162, baseType: !828, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !873, file: !133, line: 162, baseType: !860, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "unmap_map", scope: !132, file: !133, line: 165, baseType: !444, size: 64, offset: 28736)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "unmap_map_md", scope: !132, file: !133, line: 166, baseType: !249, size: 64, offset: 28800)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "unmap_qd", scope: !132, file: !133, line: 167, baseType: !157, size: 64, offset: 28864)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "unmap_in_progress", scope: !132, file: !133, line: 168, baseType: !176, size: 8, offset: 28928)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "writer_user", scope: !132, file: !133, line: 171, baseType: !882, size: 704, offset: 28992)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_writer", file: !883, line: 14, size: 704, elements: !884)
!883 = !DIFile(filename: "./ftl_writer.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/ftl", checksumkind: CSK_MD5, checksum: "7cf22c54234e488fa1c5090db7da82bf")
!884 = !{!885, !886, !891, !892, !893, !894, !899, !900, !901, !902}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !882, file: !883, line: 15, baseType: !131, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rq_queue", scope: !882, file: !883, line: 17, baseType: !887, size: 128, offset: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !882, file: !883, line: 17, size: 128, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !887, file: !883, line: 17, baseType: !627, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !887, file: !883, line: 17, baseType: !636, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "band", scope: !882, file: !883, line: 20, baseType: !513, size: 64, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "num_bands", scope: !882, file: !883, line: 23, baseType: !112, size: 64, offset: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "next_band", scope: !882, file: !883, line: 26, baseType: !513, size: 64, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "full_bands", scope: !882, file: !883, line: 29, baseType: !895, size: 128, offset: 384)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !882, file: !883, line: 29, size: 128, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !895, file: !883, line: 29, baseType: !513, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !895, file: !883, line: 29, baseType: !554, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !882, file: !883, line: 32, baseType: !101, size: 32, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "halt", scope: !882, file: !883, line: 35, baseType: !176, size: 8, offset: 544)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "writer_type", scope: !882, file: !883, line: 38, baseType: !72, size: 32, offset: 576)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "last_seq_id", scope: !882, file: !883, line: 40, baseType: !112, size: 64, offset: 640)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "writer_gc", scope: !132, file: !133, line: 174, baseType: !882, size: 704, offset: 29696)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "num_logical_bands_in_physical", scope: !132, file: !133, line: 176, baseType: !164, size: 32, offset: 30400)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "init_retry", scope: !132, file: !133, line: 179, baseType: !176, size: 8, offset: 30432)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "p2l_ckpt", scope: !132, file: !133, line: 187, baseType: !907, size: 256, offset: 30464)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !133, line: 182, size: 256, elements: !908)
!908 = !{!909, !915}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !907, file: !133, line: 184, baseType: !910, size: 128)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !907, file: !133, line: 184, size: 128, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !910, file: !133, line: 184, baseType: !484, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !910, file: !133, line: 184, baseType: !914, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !907, file: !133, line: 186, baseType: !916, size: 128, offset: 128)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !907, file: !133, line: 186, size: 128, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !916, file: !133, line: 186, baseType: !484, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !916, file: !133, line: 186, baseType: !914, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "halt", scope: !128, file: !2, line: 49, baseType: !176, size: 8, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "band", scope: !128, file: !2, line: 52, baseType: !513, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "band_done", scope: !128, file: !2, line: 55, baseType: !923, size: 128, offset: 192)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !128, file: !2, line: 55, size: 128, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !923, file: !2, line: 55, baseType: !513, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !923, file: !2, line: 55, baseType: !554, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "band_done_count", scope: !128, file: !2, line: 56, baseType: !157, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "band_waiting", scope: !128, file: !2, line: 59, baseType: !176, size: 8, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdepth", scope: !128, file: !2, line: 62, baseType: !157, size: 64, offset: 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "move_buffer", scope: !128, file: !2, line: 65, baseType: !931, size: 64, offset: 512)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ftl_reloc_move", file: !2, line: 28, size: 384, elements: !933)
!933 = !{!934, !935, !936, !937, !938}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !932, file: !2, line: 30, baseType: !131, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "reloc", scope: !932, file: !2, line: 32, baseType: !127, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rq", scope: !932, file: !2, line: 35, baseType: !627, size: 64, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !932, file: !2, line: 38, baseType: !91, size: 32, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "qentry", scope: !932, file: !2, line: 41, baseType: !939, size: 128, offset: 256)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !932, file: !2, line: 41, size: 128, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !939, file: !2, line: 41, baseType: !931, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !939, file: !2, line: 41, baseType: !943, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "move_queue", scope: !128, file: !2, line: 68, baseType: !945, size: 640, offset: 576)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 640, elements: !950)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !128, file: !2, line: 68, size: 128, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !946, file: !2, line: 68, baseType: !931, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !946, file: !2, line: 68, baseType: !943, size: 64, offset: 64)
!950 = !{!951}
!951 = !DISubrange(count: 5)
!952 = !{!953, !954, !955, !956, !957, !958}
!953 = !DILocalVariable(name: "dev", arg: 1, scope: !124, file: !2, line: 105, type: !131)
!954 = !DILocalVariable(name: "reloc", scope: !124, file: !2, line: 107, type: !127)
!955 = !DILocalVariable(name: "move", scope: !124, file: !2, line: 108, type: !931)
!956 = !DILocalVariable(name: "i", scope: !124, file: !2, line: 109, type: !157)
!957 = !DILocalVariable(name: "count", scope: !124, file: !2, line: 109, type: !157)
!958 = !DILabel(scope: !124, name: "error", file: !2, line: 143)
!959 = !DILocation(line: 105, column: 37, scope: !124)
!960 = !DILocation(line: 107, column: 2, scope: !124)
!961 = !DILocation(line: 107, column: 20, scope: !124)
!962 = !DILocation(line: 108, column: 2, scope: !124)
!963 = !DILocation(line: 108, column: 25, scope: !124)
!964 = !DILocation(line: 109, column: 2, scope: !124)
!965 = !DILocation(line: 109, column: 9, scope: !124)
!966 = !DILocation(line: 109, column: 12, scope: !124)
!967 = !DILocation(line: 111, column: 10, scope: !124)
!968 = !DILocation(line: 111, column: 8, scope: !124)
!969 = !DILocation(line: 112, column: 7, scope: !970)
!970 = distinct !DILexicalBlock(scope: !124, file: !2, line: 112, column: 6)
!971 = !DILocation(line: 112, column: 6, scope: !124)
!972 = !DILocation(line: 113, column: 3, scope: !973)
!973 = distinct !DILexicalBlock(scope: !970, file: !2, line: 112, column: 14)
!974 = !DILocation(line: 116, column: 15, scope: !124)
!975 = !DILocation(line: 116, column: 2, scope: !124)
!976 = !DILocation(line: 116, column: 9, scope: !124)
!977 = !DILocation(line: 116, column: 13, scope: !124)
!978 = !DILocation(line: 117, column: 2, scope: !124)
!979 = !DILocation(line: 117, column: 9, scope: !124)
!980 = !DILocation(line: 117, column: 14, scope: !124)
!981 = !DILocation(line: 118, column: 22, scope: !124)
!982 = !DILocation(line: 118, column: 27, scope: !124)
!983 = !DILocation(line: 118, column: 31, scope: !124)
!984 = !DILocation(line: 118, column: 2, scope: !124)
!985 = !DILocation(line: 118, column: 9, scope: !124)
!986 = !DILocation(line: 118, column: 20, scope: !124)
!987 = !DILocation(line: 120, column: 30, scope: !124)
!988 = !DILocation(line: 120, column: 37, scope: !124)
!989 = !DILocation(line: 120, column: 23, scope: !124)
!990 = !DILocation(line: 120, column: 2, scope: !124)
!991 = !DILocation(line: 120, column: 9, scope: !124)
!992 = !DILocation(line: 120, column: 21, scope: !124)
!993 = !DILocation(line: 121, column: 7, scope: !994)
