; ModuleID = 'samples/622.bc'
source_filename = "src/large.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.emap_s = type { %struct.rtree_s }
%struct.rtree_s = type { ptr, %struct.malloc_mutex_s, [262144 x %struct.rtree_node_elm_s] }
%struct.malloc_mutex_s = type { %union.anon }
%union.anon = type { %struct.anon.1 }
%struct.anon.1 = type { %struct.mutex_prof_data_t, %union.pthread_mutex_t, %struct.atomic_b_t }
%struct.mutex_prof_data_t = type { %struct.nstime_t, %struct.nstime_t, i64, i64, i32, %struct.atomic_u32_t, i64, ptr, i64 }
%struct.nstime_t = type { i64 }
%struct.atomic_u32_t = type { i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.atomic_b_t = type { i8 }
%struct.rtree_node_elm_s = type { %struct.atomic_p_t }
%struct.atomic_p_t = type { ptr }
%struct.arena_config_s = type { ptr, i8 }
%struct.rtree_level_s = type { i32, i32 }
%struct.arena_s = type { [2 x %struct.atomic_u_t], %struct.atomic_u_t, ptr, %struct.arena_stats_s, %struct.anon, %struct.anon.0, %struct.malloc_mutex_s, %struct.atomic_u_t, %struct.edata_list_active_t, %struct.malloc_mutex_s, %struct.pa_shard_s, i32, ptr, %struct.nstime_t, [0 x %struct.bin_s] }

!104 = !DIEnumerator(name: "percpu_arena_disabled", value: 2)
!105 = !DIEnumerator(name: "percpu_arena_mode_names_limit", value: 3)
!106 = !DIEnumerator(name: "percpu_arena_mode_enabled_base", value: 3)
!107 = !DIEnumerator(name: "percpu_arena", value: 3)
!108 = !DIEnumerator(name: "per_phycpu_arena", value: 4)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 8, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "include/jemalloc/internal/atomic_gcc_atomic.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "08b4de137309508f556f5697e2840f8f")
!111 = !{!112, !113, !114, !115, !116}
!112 = !DIEnumerator(name: "atomic_memory_order_relaxed", value: 0)
!113 = !DIEnumerator(name: "atomic_memory_order_acquire", value: 1)
!114 = !DIEnumerator(name: "atomic_memory_order_release", value: 2)
!115 = !DIEnumerator(name: "atomic_memory_order_acq_rel", value: 3)
!116 = !DIEnumerator(name: "atomic_memory_order_seq_cst", value: 4)
!117 = !{!118, !121, !122, !124, !1191, !208, !174, !7, !1192, !1194, !164, !156, !340, !1199, !185, !680, !377, !1241, !1039, !1244, !333, !326}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !119, line: 70, baseType: !120)
!119 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!120 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !123, line: 90, baseType: !120)
!123 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_tctx_t", file: !126, line: 6, baseType: !127)
!126 = !DIFile(filename: "include/jemalloc/internal/prof_types.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "5609d474728c2c85be6d4c5780ac3fd5")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_tctx_s", file: !92, line: 44, size: 1600, elements: !128)
!128 = !{!129, !1151, !1152, !1153, !1154, !1155, !1181, !1182, !1187, !1188, !1190}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tdata", scope: !127, file: !92, line: 46, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_tdata_t", file: !126, line: 9, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prof_tdata_s", file: !92, line: 147, size: 9664, elements: !133)
!133 = !{!134, !1091, !1092, !1093, !1095, !1096, !1097, !1102, !1103, !1132, !1133, !1134, !1135, !1136, !1137, !1149}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !132, file: !92, line: 148, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_t", file: !53, line: 21, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "malloc_mutex_s", file: !53, line: 22, size: 896, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !137, file: !53, line: 23, baseType: !140, size: 896)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !53, line: 23, size: 896, elements: !141)
!141 = !{!142, !1088, !1089}
!142 = !DIDerivedType(tag: DW_TAG_member, scope: !140, file: !53, line: 24, baseType: !143, size: 896)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !53, line: 24, size: 896, elements: !144)
!144 = !{!145, !1057, !1087}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prof_data", scope: !143, file: !53, line: 33, baseType: !146, size: 512)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_prof_data_t", file: !147, line: 115, baseType: !148)
!147 = !DIFile(filename: "include/jemalloc/internal/mutex_prof.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "49c8e72069e699cf6374eaad10c70adc")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 85, size: 512, elements: !149)
!149 = !{!150, !160, !161, !162, !163, !166, !172, !173, !1056}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tot_wait_time", scope: !148, file: !147, line: 91, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "nstime_t", file: !152, line: 19, baseType: !153)
!152 = !DIFile(filename: "include/jemalloc/internal/nstime.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "701f458fd2e964b721f378de413dbf72")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 14, size: 64, elements: !154)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !153, file: !152, line: 15, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !157, line: 27, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !159, line: 45, baseType: !120)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "max_wait_time", scope: !148, file: !147, line: 93, baseType: !151, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "n_wait_times", scope: !148, file: !147, line: 95, baseType: !156, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "n_spin_acquired", scope: !148, file: !147, line: 97, baseType: !156, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "max_n_thds", scope: !148, file: !147, line: 99, baseType: !164, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !157, line: 26, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !159, line: 42, baseType: !7)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "n_waiting_thds", scope: !148, file: !147, line: 101, baseType: !167, size: 32, offset: 288)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u32_t", file: !168, line: 99, baseType: !169)
!168 = !DIFile(filename: "include/jemalloc/internal/atomic.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "6938e37e0ea24e4ceb6a513894764870")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 99, size: 32, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !169, file: !168, line: 99, baseType: !164, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "n_owner_switches", scope: !148, file: !147, line: 110, baseType: !156, size: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prev_owner", scope: !148, file: !147, line: 112, baseType: !174, size: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsdn_t", file: !176, line: 7, baseType: !177)
!176 = !DIFile(filename: "include/jemalloc/internal/tsd_types.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "cbf25f26419957a9e3f438c41fcdab12")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsdn_s", file: !178, line: 277, size: 21056, elements: !179)
!178 = !DIFile(filename: "include/jemalloc/internal/tsd.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "2eb9c29e572c9c67f268e9042ddf801e")
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tsd", scope: !177, file: !178, line: 278, baseType: !181, size: 21056)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_t", file: !176, line: 6, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsd_s", file: !178, line: 240, size: 21056, elements: !183)
!183 = !{!184, !186, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !947, !948, !958, !959, !965, !972, !973, !980, !991, !992, !1013, !1018, !1019, !1020, !1021, !1022, !1023}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache_enabled", scope: !182, file: !178, line: 250, baseType: !185, size: 8)
!185 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_reentrancy_level", scope: !182, file: !178, line: 250, baseType: !187, size: 8, offset: 8)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !188, line: 24, baseType: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !159, line: 37, baseType: !190)
!190 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_allocated_last_event", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_allocated_next_event", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_deallocated_last_event", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_deallocated_next_event", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache_gc_event_wait", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache_gc_dalloc_event_wait", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prof_sample_event_wait", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prof_sample_last_event", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_stats_interval_event_wait", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_stats_interval_last_event", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_peak_alloc_event_wait", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_peak_dalloc_event_wait", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prof_tdata", scope: !182, file: !178, line: 250, baseType: !130, size: 64, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prng_state", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_san_extents_until_guard_small", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_san_extents_until_guard_large", scope: !182, file: !178, line: 250, baseType: !156, size: 64, offset: 1024)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_iarena", scope: !182, file: !178, line: 250, baseType: !208, size: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_t", file: !99, line: 13, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_s", file: !211, line: 20, size: 631616, elements: !212)
!211 = !DIFile(filename: "include/jemalloc/internal/arena_structs.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "dc0232497de09cf78e6bf4500191b508")
!212 = !{!213, !221, !222, !223, !294, !363, !367, !368, !369, !498, !499, !917, !918, !919, !920}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !210, file: !211, line: 34, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 64, elements: !219)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u_t", file: !168, line: 91, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 91, size: 32, elements: !217)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !216, file: !168, line: 91, baseType: !7, size: 32)
!219 = !{!220}
!220 = !DISubrange(count: 2)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "binshard_next", scope: !210, file: !211, line: 37, baseType: !215, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "last_thd", scope: !210, file: !211, line: 44, baseType: !174, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !210, file: !211, line: 47, baseType: !224, size: 82944, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_t", file: !225, line: 45, baseType: !226)
!225 = !DIFile(filename: "include/jemalloc/internal/arena_stats.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "99cda11c8482c984e6b5456c8fe70a6c")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_s", file: !225, line: 46, size: 82944, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !237, !238, !239, !240, !241, !242, !243, !274, !275, !276, !280, !293}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !226, file: !225, line: 53, baseType: !118, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !226, file: !225, line: 54, baseType: !118, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_thp", scope: !226, file: !225, line: 55, baseType: !118, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !226, file: !225, line: 56, baseType: !118, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !226, file: !225, line: 58, baseType: !233, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zu_t", file: !168, line: 93, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 93, size: 64, elements: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !234, file: !168, line: 93, baseType: !118, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_large", scope: !226, file: !225, line: 60, baseType: !118, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc_large", scope: !226, file: !225, line: 61, baseType: !156, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc_large", scope: !226, file: !225, line: 62, baseType: !156, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nfills_large", scope: !226, file: !225, line: 63, baseType: !156, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes_large", scope: !226, file: !225, line: 64, baseType: !156, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests_large", scope: !226, file: !225, line: 65, baseType: !156, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pa_shard_stats", scope: !226, file: !225, line: 72, baseType: !244, size: 640, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "pa_shard_stats_t", file: !245, line: 39, baseType: !246)
!245 = !DIFile(filename: "include/jemalloc/internal/pa.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "55be87c3139e48b12a220c7b4dc8c2b0")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pa_shard_stats_s", file: !245, line: 40, size: 640, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "edata_avail", scope: !246, file: !245, line: 42, baseType: !118, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pac_stats", scope: !246, file: !245, line: 49, baseType: !250, size: 576, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "pac_stats_t", file: !251, line: 52, baseType: !252)
!251 = !DIFile(filename: "include/jemalloc/internal/pac.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "877669e56bce0e5aaa98ec99cb11f799")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pac_stats_s", file: !251, line: 53, size: 576, elements: !253)
!253 = !{!254, !270, !271, !272, !273}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "decay_dirty", scope: !252, file: !251, line: 54, baseType: !255, size: 192)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "pac_decay_stats_t", file: !251, line: 25, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pac_decay_stats_s", file: !251, line: 26, size: 192, elements: !257)
!257 = !{!258, !268, !269}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "npurge", scope: !256, file: !251, line: 28, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "locked_u64_t", file: !260, line: 10, baseType: !261)
!260 = !DIFile(filename: "include/jemalloc/internal/lockedint.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "fd9906bc13a7d545799faac7a9a4b49b")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "locked_u64_s", file: !260, line: 12, size: 64, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !261, file: !260, line: 13, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u64_t", file: !168, line: 102, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 102, size: 64, elements: !266)
!266 = !{!267}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !265, file: !168, line: 102, baseType: !156, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nmadvise", scope: !256, file: !251, line: 30, baseType: !259, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !256, file: !251, line: 32, baseType: !259, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "decay_muzzy", scope: !252, file: !251, line: 55, baseType: !255, size: 192, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "retained", scope: !252, file: !251, line: 62, baseType: !118, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pac_mapped", scope: !252, file: !251, line: 71, baseType: !233, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "abandoned_vm", scope: !252, file: !251, line: 74, baseType: !233, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_bytes", scope: !226, file: !225, line: 75, baseType: !118, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_stashed_bytes", scope: !226, file: !225, line: 76, baseType: !118, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_prof_data", scope: !226, file: !225, line: 78, baseType: !277, size: 6144, offset: 1472)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 6144, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 12)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "lstats", scope: !226, file: !225, line: 81, baseType: !281, size: 75264, offset: 7616)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 75264, elements: !291)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_stats_large_t", file: !225, line: 13, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arena_stats_large_s", file: !225, line: 14, size: 384, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc", scope: !283, file: !225, line: 19, baseType: !259, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc", scope: !283, file: !225, line: 20, baseType: !259, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !283, file: !225, line: 27, baseType: !259, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nfills", scope: !283, file: !225, line: 33, baseType: !259, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes", scope: !283, file: !225, line: 34, baseType: !259, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "curlextents", scope: !283, file: !225, line: 37, baseType: !118, size: 64, offset: 320)
!291 = !{!292}
!292 = !DISubrange(count: 196)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "uptime", scope: !226, file: !225, line: 84, baseType: !151, size: 64, offset: 82880)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_ql", scope: !210, file: !211, line: 56, baseType: !295, size: 64, offset: 83136)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !211, line: 56, size: 64, elements: !296)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !295, file: !211, line: 56, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcache_slow_t", file: !300, line: 6, baseType: !301)
!300 = !DIFile(filename: "include/jemalloc/internal/tcache_types.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "fcc0bdea671703d1a9ea9b3c0ad5a2cc")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcache_slow_s", file: !302, line: 20, size: 1408, elements: !303)
!302 = !DIFile(filename: "include/jemalloc/internal/tcache_structs.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "4677e5af02cb08492d3f27ae4899356f")
!303 = !{!304, !309, !338, !339, !342, !349, !351, !352, !353}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !301, file: !302, line: 22, baseType: !305, size: 128)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !301, file: !302, line: 22, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !305, file: !302, line: 22, baseType: !298, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !305, file: !302, line: 22, baseType: !298, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor", scope: !301, file: !302, line: 29, baseType: !310, size: 192, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_array_descriptor_t", file: !311, line: 133, baseType: !312)
!311 = !DIFile(filename: "include/jemalloc/internal/cache_bin.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "346bac98cae298112dab87b1fb1cd3dc")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_array_descriptor_s", file: !311, line: 134, size: 192, elements: !313)
!313 = !{!314, !320}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !312, file: !311, line: 139, baseType: !315, size: 128)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !312, file: !311, line: 139, size: 128, elements: !316)
!316 = !{!317, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !315, file: !311, line: 139, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !315, file: !311, line: 139, baseType: !318, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !312, file: !311, line: 141, baseType: !321, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_t", file: !311, line: 81, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_s", file: !311, line: 82, size: 192, elements: !324)
!324 = !{!325, !327, !332, !336, !337}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "stack_head", scope: !323, file: !311, line: 88, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tstats", scope: !323, file: !311, line: 94, baseType: !328, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_stats_t", file: !311, line: 49, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_stats_s", file: !311, line: 50, size: 64, elements: !330)
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !329, file: !311, line: 55, baseType: !156, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "low_bits_low_water", scope: !323, file: !311, line: 104, baseType: !333, size: 16, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !157, line: 25, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !159, line: 40, baseType: !335)
!335 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "low_bits_full", scope: !323, file: !311, line: 115, baseType: !333, size: 16, offset: 144)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "low_bits_empty", scope: !323, file: !311, line: 124, baseType: !333, size: 16, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !301, file: !302, line: 32, baseType: !208, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next_gc_bin", scope: !301, file: !302, line: 34, baseType: !340, size: 32, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "szind_t", file: !341, line: 29, baseType: !7)
!341 = !DIFile(filename: "include/jemalloc/internal/sz.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "b9ea65fced4fed60be8d476b16546a70")
!342 = !DIDerivedType(tag: DW_TAG_member, name: "lg_fill_div", scope: !301, file: !302, line: 36, baseType: !343, size: 288, offset: 416)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 288, elements: !347)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !157, line: 24, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !159, line: 38, baseType: !346)
!346 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!347 = !{!348}
!348 = !DISubrange(count: 36)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "bin_refilled", scope: !301, file: !302, line: 38, baseType: !350, size: 288, offset: 704)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 288, elements: !347)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "bin_flush_delay_items", scope: !301, file: !302, line: 43, baseType: !343, size: 288, offset: 992)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_alloc", scope: !301, file: !302, line: 49, baseType: !121, size: 64, offset: 1280)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tcache", scope: !301, file: !302, line: 52, baseType: !354, size: 64, offset: 1344)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcache_t", file: !300, line: 7, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcache_s", file: !302, line: 55, size: 14080, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_slow", scope: !356, file: !302, line: 56, baseType: !298, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !356, file: !302, line: 57, baseType: !360, size: 14016, offset: 64)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 14016, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 73)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor_ql", scope: !210, file: !211, line: 57, baseType: !364, size: 64, offset: 83200)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !211, line: 57, size: 64, elements: !365)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !364, file: !211, line: 57, baseType: !318, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tcache_ql_mtx", scope: !210, file: !211, line: 58, baseType: !136, size: 896, offset: 83264)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dss_prec", scope: !210, file: !211, line: 65, baseType: !215, size: 32, offset: 84160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !210, file: !211, line: 72, baseType: !370, size: 64, offset: 84224)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_list_active_t", file: !58, line: 253, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 253, size: 64, elements: !372)
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !371, file: !58, line: 253, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !371, file: !58, line: 253, size: 64, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !374, file: !58, line: 253, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_t", file: !58, line: 89, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edata_s", file: !58, line: 92, size: 1024, elements: !380)
!380 = !{!381, !382, !383, !388, !447, !448, !469}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "e_bits", scope: !379, file: !58, line: 142, baseType: !156, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "e_addr", scope: !379, file: !58, line: 190, baseType: !121, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, scope: !379, file: !58, line: 192, baseType: !384, size: 64, offset: 128)
!384 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !379, file: !58, line: 192, size: 64, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "e_size_esn", scope: !384, file: !58, line: 200, baseType: !118, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "e_bsize", scope: !384, file: !58, line: 204, baseType: !118, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "e_ps", scope: !379, file: !58, line: 212, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpdata_t", file: !391, line: 20, baseType: !392)
!391 = !DIFile(filename: "include/jemalloc/internal/hpdata.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "227d9acce318e355ef8af46ae9961791")
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hpdata_s", file: !391, line: 22, size: 1984, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !427, !432, !437, !438, !439, !445, !446}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "h_address", scope: !392, file: !391, line: 33, baseType: !121, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "h_age", scope: !392, file: !391, line: 35, baseType: !156, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "h_huge", scope: !392, file: !391, line: 37, baseType: !185, size: 8, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "h_alloc_allowed", scope: !392, file: !391, line: 52, baseType: !185, size: 8, offset: 136)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "h_in_psset_alloc_container", scope: !392, file: !391, line: 53, baseType: !185, size: 8, offset: 144)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "h_purge_allowed", scope: !392, file: !391, line: 61, baseType: !185, size: 8, offset: 152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "h_hugify_allowed", scope: !392, file: !391, line: 64, baseType: !185, size: 8, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "h_time_hugify_allowed", scope: !392, file: !391, line: 66, baseType: !151, size: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "h_in_psset_hugify_container", scope: !392, file: !391, line: 67, baseType: !185, size: 8, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "h_mid_purge", scope: !392, file: !391, line: 70, baseType: !185, size: 8, offset: 264)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "h_mid_hugify", scope: !392, file: !391, line: 71, baseType: !185, size: 8, offset: 272)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "h_updating", scope: !392, file: !391, line: 79, baseType: !185, size: 8, offset: 280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "h_in_psset", scope: !392, file: !391, line: 82, baseType: !185, size: 8, offset: 288)
!407 = !DIDerivedType(tag: DW_TAG_member, scope: !392, file: !391, line: 84, baseType: !408, size: 192, offset: 320)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !392, file: !391, line: 84, size: 192, elements: !409)
!409 = !{!410, !422}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "age_link", scope: !408, file: !391, line: 86, baseType: !411, size: 192)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpdata_age_heap_link_t", file: !391, line: 21, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 21, size: 192, elements: !413)
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !412, file: !391, line: 21, baseType: !415, size: 192)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "phn_link_t", file: !416, line: 55, baseType: !417)
!416 = !DIFile(filename: "include/jemalloc/internal/ph.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "ceeb9a10f054380a38a1ec33a7da11ad")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phn_link_s", file: !416, line: 56, size: 192, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !416, line: 57, baseType: !121, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !416, line: 58, baseType: !121, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lchild", scope: !417, file: !416, line: 59, baseType: !121, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link_empty", scope: !408, file: !391, line: 91, baseType: !423, size: 128)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !391, line: 91, size: 128, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !423, file: !391, line: 91, baseType: !389, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !423, file: !391, line: 91, baseType: !389, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link_purge", scope: !392, file: !391, line: 97, baseType: !428, size: 128, offset: 512)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !391, line: 97, size: 128, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !428, file: !391, line: 97, baseType: !389, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !428, file: !391, line: 97, baseType: !389, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link_hugify", scope: !392, file: !391, line: 98, baseType: !433, size: 128, offset: 640)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !391, line: 98, size: 128, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !433, file: !391, line: 98, baseType: !389, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !433, file: !391, line: 98, baseType: !389, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "h_longest_free_range", scope: !392, file: !391, line: 101, baseType: !118, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "h_nactive", scope: !392, file: !391, line: 104, baseType: !118, size: 64, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "active_pages", scope: !392, file: !391, line: 107, baseType: !440, size: 512, offset: 896)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 512, elements: !443)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "fb_group_t", file: !442, line: 12, baseType: !120)
!442 = !DIFile(filename: "include/jemalloc/internal/fb.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "617442e449dfdc2ed891a67ec59d7ccf")
!443 = !{!444}
!444 = !DISubrange(count: 8)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "h_ntouched", scope: !392, file: !391, line: 114, baseType: !118, size: 64, offset: 1408)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "touched_pages", scope: !392, file: !391, line: 117, baseType: !440, size: 512, offset: 1472)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "e_sn", scope: !379, file: !58, line: 218, baseType: !156, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !379, file: !58, line: 220, baseType: !449, size: 192, offset: 320)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !379, file: !58, line: 220, size: 192, elements: !450)
!450 = !{!451, !456}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link_active", scope: !449, file: !58, line: 225, baseType: !452, size: 128)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !58, line: 225, size: 128, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !452, file: !58, line: 225, baseType: !377, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !452, file: !58, line: 225, baseType: !377, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, scope: !449, file: !58, line: 232, baseType: !457, size: 192)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !449, file: !58, line: 232, size: 192, elements: !458)
!458 = !{!459, !464}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "heap_link", scope: !457, file: !58, line: 233, baseType: !460, size: 192)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_heap_link_t", file: !58, line: 91, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 91, size: 192, elements: !462)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !461, file: !58, line: 91, baseType: !415, size: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "avail_link", scope: !457, file: !58, line: 234, baseType: !465, size: 192)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_avail_link_t", file: !58, line: 90, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 90, size: 192, elements: !467)
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !466, file: !58, line: 90, baseType: !415, size: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, scope: !379, file: !58, line: 238, baseType: !470, size: 512, offset: 512)
!470 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !379, file: !58, line: 238, size: 512, elements: !471)
!471 = !{!472, !477, !486}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ql_link_inactive", scope: !470, file: !58, line: 244, baseType: !473, size: 128)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !470, file: !58, line: 244, size: 128, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !473, file: !58, line: 244, baseType: !377, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !473, file: !58, line: 244, baseType: !377, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "e_slab_data", scope: !470, file: !58, line: 246, baseType: !478, size: 512)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "slab_data_t", file: !479, line: 6, baseType: !480)
!479 = !DIFile(filename: "include/jemalloc/internal/slab_data.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "3957c6c0ea3d34f7841f7b97dcad1035")
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slab_data_s", file: !479, line: 7, size: 512, elements: !481)
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !480, file: !479, line: 9, baseType: !483, size: 512)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 512, elements: !443)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_t", file: !485, line: 7, baseType: !120)
!485 = !DIFile(filename: "include/jemalloc/internal/bitmap.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "97e6c829f154125215bd6d0de76c5988")
!486 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_info", scope: !470, file: !58, line: 249, baseType: !487, size: 256)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "e_prof_info_t", file: !58, line: 63, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "e_prof_info_s", file: !58, line: 49, size: 256, elements: !489)
!489 = !{!490, !491, !492, !497}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_alloc_time", scope: !488, file: !58, line: 51, baseType: !151, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_alloc_size", scope: !488, file: !58, line: 53, baseType: !118, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_tctx", scope: !488, file: !58, line: 55, baseType: !493, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_p_t", file: !168, line: 83, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 83, size: 64, elements: !495)
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !494, file: !168, line: 83, baseType: !121, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "e_prof_recent_alloc", scope: !488, file: !58, line: 61, baseType: !493, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "large_mtx", scope: !210, file: !211, line: 74, baseType: !136, size: 896, offset: 84288)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pa_shard", scope: !210, file: !211, line: 77, baseType: !500, size: 546240, offset: 85184)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "pa_shard_t", file: !245, line: 67, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pa_shard_s", file: !245, line: 68, size: 546240, elements: !502)
!502 = !{!503, !587, !588, !593, !594, !769, !804, !910, !911, !912, !913, !915, !916}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "central", scope: !501, file: !245, line: 70, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "pa_central_t", file: !245, line: 23, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pa_central_s", file: !245, line: 24, size: 2496, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hpa", scope: !506, file: !245, line: 25, baseType: !509, size: 2496)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpa_central_t", file: !510, line: 10, baseType: !511)
!510 = !DIFile(filename: "include/jemalloc/internal/hpa.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "b167af9349348ab02109568222c99503")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hpa_central_s", file: !510, line: 11, size: 2496, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !561, !562}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !511, file: !510, line: 16, baseType: !136, size: 896)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "grow_mtx", scope: !511, file: !510, line: 22, baseType: !136, size: 896, offset: 896)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "eden", scope: !511, file: !510, line: 30, baseType: !121, size: 64, offset: 1792)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "eden_len", scope: !511, file: !510, line: 31, baseType: !118, size: 64, offset: 1856)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !511, file: !510, line: 33, baseType: !518, size: 64, offset: 1920)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "base_t", file: !520, line: 42, baseType: !521)
!520 = !DIFile(filename: "include/jemalloc/internal/base.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "1c0df8e6773a67ccaaf4e186891ff5bb")
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_s", file: !520, line: 43, size: 31296, elements: !522)
!522 = !{!523, !530, !531, !532, !533, !535, !536, !544, !557, !558, !559, !560}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ehooks", scope: !521, file: !520, line: 47, baseType: !524, size: 128)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ehooks_t", file: !525, line: 21, baseType: !526)
!525 = !DIFile(filename: "include/jemalloc/internal/ehooks.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "6c296cf246258b3220ac1cb2e396e4b5")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ehooks_s", file: !525, line: 22, size: 128, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !526, file: !525, line: 28, baseType: !7, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !526, file: !525, line: 30, baseType: !493, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ehooks_base", scope: !521, file: !520, line: 52, baseType: !524, size: 128, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !521, file: !520, line: 55, baseType: !136, size: 896, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "auto_thp_switched", scope: !521, file: !520, line: 58, baseType: !185, size: 8, offset: 1152)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pind_last", scope: !521, file: !520, line: 64, baseType: !534, size: 32, offset: 1184)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "pszind_t", file: !341, line: 26, baseType: !7)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "extent_sn_next", scope: !521, file: !520, line: 67, baseType: !118, size: 64, offset: 1216)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !521, file: !520, line: 70, baseType: !537, size: 64, offset: 1280)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "base_block_t", file: !520, line: 30, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_block_s", file: !520, line: 31, size: 1152, elements: !540)
!540 = !{!541, !542, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !539, file: !520, line: 33, baseType: !118, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !539, file: !520, line: 36, baseType: !537, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !539, file: !520, line: 39, baseType: !378, size: 1024, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !521, file: !520, line: 73, baseType: !545, size: 29696, offset: 1344)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 29696, elements: !555)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_heap_t", file: !58, line: 91, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 91, size: 128, elements: !548)
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ph", scope: !547, file: !58, line: 91, baseType: !550, size: 128)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ph_t", file: !416, line: 62, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ph_s", file: !416, line: 63, size: 128, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !551, file: !416, line: 64, baseType: !121, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "auxcount", scope: !551, file: !416, line: 71, baseType: !118, size: 64, offset: 64)
!555 = !{!556}
!556 = !DISubrange(count: 232)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !521, file: !520, line: 76, baseType: !118, size: 64, offset: 31040)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "resident", scope: !521, file: !520, line: 77, baseType: !118, size: 64, offset: 31104)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !521, file: !520, line: 78, baseType: !118, size: 64, offset: 31168)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "n_thp", scope: !521, file: !520, line: 80, baseType: !118, size: 64, offset: 31232)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "age_counter", scope: !511, file: !510, line: 35, baseType: !156, size: 64, offset: 1984)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !511, file: !510, line: 38, baseType: !563, size: 448, offset: 2048)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpa_hooks_t", file: !564, line: 4, baseType: !565)
!564 = !DIFile(filename: "include/jemalloc/internal/hpa_hooks.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "0980fb000517829e6b7477bbc3494118")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hpa_hooks_s", file: !564, line: 5, size: 448, elements: !566)
!566 = !{!567, !571, !575, !576, !577, !578, !583}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !565, file: !564, line: 6, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!121, !118}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "unmap", scope: !565, file: !564, line: 7, baseType: !572, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !121, !118}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "purge", scope: !565, file: !564, line: 8, baseType: !572, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "hugify", scope: !565, file: !564, line: 9, baseType: !572, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dehugify", scope: !565, file: !564, line: 10, baseType: !572, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "curtime", scope: !565, file: !564, line: 11, baseType: !579, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !582, !185}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ms_since", scope: !565, file: !564, line: 12, baseType: !584, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!156, !582}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !501, file: !245, line: 77, baseType: !233, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "use_hpa", scope: !501, file: !245, line: 86, baseType: !589, size: 8, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_b_t", file: !168, line: 89, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 89, size: 8, elements: !591)
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !590, file: !168, line: 89, baseType: !185, size: 8)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ever_used_hpa", scope: !501, file: !245, line: 93, baseType: !185, size: 8, offset: 136)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pac", scope: !501, file: !245, line: 96, baseType: !595, size: 497920, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "pac_t", file: !251, line: 77, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pac_s", file: !251, line: 78, size: 497920, elements: !597)
!597 = !{!598, !634, !685, !686, !687, !688, !709, !723, !730, !731, !738, !739, !764, !765, !766, !768}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pai", scope: !596, file: !251, line: 83, baseType: !599, size: 448)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "pai_t", file: !600, line: 6, baseType: !601)
!600 = !DIFile(filename: "include/jemalloc/internal/pai.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "6205721010343a74af256b178d9d9dbd")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pai_s", file: !600, line: 7, size: 448, elements: !602)
!602 = !{!603, !609, !614, !618, !622, !626, !630}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !601, file: !600, line: 9, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!377, !174, !607, !118, !118, !185, !185, !185, !608}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_batch", scope: !601, file: !600, line: 18, baseType: !610, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!118, !174, !607, !118, !118, !613, !608}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "expand", scope: !601, file: !600, line: 21, baseType: !615, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!185, !174, !607, !377, !118, !118, !185, !608}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "shrink", scope: !601, file: !600, line: 24, baseType: !619, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!185, !174, !607, !377, !118, !118, !608}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dalloc", scope: !601, file: !600, line: 26, baseType: !623, size: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !174, !607, !377, !608}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dalloc_batch", scope: !601, file: !600, line: 29, baseType: !627, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !174, !607, !613, !608}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "time_until_deferred_work", scope: !601, file: !600, line: 31, baseType: !631, size: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!156, !174, !607}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ecache_dirty", scope: !596, file: !251, line: 90, baseType: !635, size: 155520, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ecache_t", file: !636, line: 8, baseType: !637)
!636 = !DIFile(filename: "include/jemalloc/internal/ecache.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "78d215f47eec710b9137eacb5e234a5e")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ecache_s", file: !636, line: 9, size: 155520, elements: !638)
!638 = !{!639, !640, !681, !682, !683, !684}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !637, file: !636, line: 10, baseType: !136, size: 896)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "eset", scope: !637, file: !636, line: 11, baseType: !641, size: 77248, offset: 896)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "eset_t", file: !642, line: 37, baseType: !643)
!642 = !DIFile(filename: "include/jemalloc/internal/eset.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "8831525b8469e6d512e893965968cd22")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eset_s", file: !642, line: 38, size: 77248, elements: !644)
!644 = !{!645, !649, !663, !670, !678, !679}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !643, file: !642, line: 40, baseType: !646, size: 256)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 256, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 4)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !643, file: !642, line: 43, baseType: !650, size: 51200, offset: 256)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 51200, elements: !661)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "eset_bin_t", file: !642, line: 18, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eset_bin_s", file: !642, line: 19, size: 256, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !652, file: !642, line: 20, baseType: !546, size: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "heap_min", scope: !652, file: !642, line: 28, baseType: !656, size: 128, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_cmp_summary_t", file: !58, line: 82, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edata_cmp_summary_s", file: !58, line: 83, size: 128, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !657, file: !58, line: 84, baseType: !156, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !657, file: !58, line: 85, baseType: !122, size: 64, offset: 64)
!661 = !{!662}
!662 = !DISubrange(count: 200)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bin_stats", scope: !643, file: !642, line: 45, baseType: !664, size: 25600, offset: 51456)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 25600, elements: !661)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "eset_bin_stats_t", file: !642, line: 31, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eset_bin_stats_s", file: !642, line: 32, size: 128, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "nextents", scope: !666, file: !642, line: 33, baseType: !233, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !666, file: !642, line: 34, baseType: !233, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !643, file: !642, line: 48, baseType: !671, size: 64, offset: 77056)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_list_inactive_t", file: !58, line: 254, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 254, size: 64, elements: !673)
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !672, file: !58, line: 254, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !672, file: !58, line: 254, size: 64, elements: !676)
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !675, file: !58, line: 254, baseType: !377, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "npages", scope: !643, file: !642, line: 51, baseType: !233, size: 64, offset: 77120)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !643, file: !642, line: 57, baseType: !680, size: 32, offset: 77184)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "extent_state_t", file: !58, line: 31, baseType: !57)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "guarded_eset", scope: !637, file: !636, line: 12, baseType: !641, size: 77248, offset: 78144)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !637, file: !636, line: 14, baseType: !680, size: 32, offset: 155392)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !637, file: !636, line: 16, baseType: !7, size: 32, offset: 155424)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "delay_coalesce", scope: !637, file: !636, line: 21, baseType: !185, size: 8, offset: 155456)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ecache_muzzy", scope: !596, file: !251, line: 91, baseType: !635, size: 155520, offset: 155968)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ecache_retained", scope: !596, file: !251, line: 92, baseType: !635, size: 155520, offset: 311488)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !596, file: !251, line: 94, baseType: !518, size: 64, offset: 467008)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "emap", scope: !596, file: !251, line: 95, baseType: !689, size: 64, offset: 467072)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "emap_t", file: !691, line: 16, baseType: !692)
!691 = !DIFile(filename: "include/jemalloc/internal/emap.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "4886c34b97d6ef6486963c4e0200b09f")
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "emap_s", file: !691, line: 17, size: 16778176, elements: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rtree", scope: !692, file: !691, line: 18, baseType: !695, size: 16778176)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_t", file: !696, line: 98, baseType: !697)
!696 = !DIFile(filename: "include/jemalloc/internal/rtree.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "103cd0a954fb1863bb498eb7b2d89316")
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_s", file: !696, line: 99, size: 16778176, elements: !698)
!698 = !{!699, !700, !701}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !697, file: !696, line: 100, baseType: !518, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "init_lock", scope: !697, file: !696, line: 101, baseType: !136, size: 896, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !697, file: !696, line: 104, baseType: !702, size: 16777216, offset: 960)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 16777216, elements: !707)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_node_elm_t", file: !696, line: 38, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_node_elm_s", file: !696, line: 39, size: 64, elements: !705)
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !704, file: !696, line: 40, baseType: !493, size: 64)
!707 = !{!708}
!708 = !DISubrange(count: 262144)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "edata_cache", scope: !596, file: !251, line: 96, baseType: !710, size: 64, offset: 467136)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_cache_t", file: !712, line: 15, baseType: !713)
!712 = !DIFile(filename: "include/jemalloc/internal/edata_cache.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "3d63723d254bad4e2554b9f9134fce37")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edata_cache_s", file: !712, line: 16, size: 1152, elements: !714)
!714 = !{!715, !720, !721, !722}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !713, file: !712, line: 17, baseType: !716, size: 128)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_avail_t", file: !58, line: 90, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 90, size: 128, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ph", scope: !717, file: !58, line: 90, baseType: !550, size: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !713, file: !712, line: 18, baseType: !233, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !713, file: !712, line: 19, baseType: !136, size: 896, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !713, file: !712, line: 20, baseType: !518, size: 64, offset: 1088)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "exp_grow", scope: !596, file: !251, line: 99, baseType: !724, size: 64, offset: 467200)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "exp_grow_t", file: !725, line: 4, baseType: !726)
!725 = !DIFile(filename: "include/jemalloc/internal/exp_grow.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "bf6848675fbb3c1f8c6ab15998625e74")
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exp_grow_s", file: !725, line: 5, size: 64, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !725, line: 17, baseType: !534, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !726, file: !725, line: 18, baseType: !534, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "grow_mtx", scope: !596, file: !251, line: 100, baseType: !136, size: 896, offset: 467264)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sba", scope: !596, file: !251, line: 103, baseType: !732, size: 960, offset: 468160)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "san_bump_alloc_t", file: !733, line: 15, baseType: !734)
!733 = !DIFile(filename: "include/jemalloc/internal/san_bump.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "1c2aa883cd4eaa1bdaec306a4e50c081")
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "san_bump_alloc_s", file: !733, line: 16, size: 960, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !734, file: !733, line: 17, baseType: !136, size: 896)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "curr_reg", scope: !734, file: !733, line: 19, baseType: !377, size: 64, offset: 896)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "oversize_threshold", scope: !596, file: !251, line: 106, baseType: !233, size: 64, offset: 469120)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "decay_dirty", scope: !596, file: !251, line: 114, baseType: !740, size: 14272, offset: 469184)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "decay_t", file: !741, line: 23, baseType: !742)
!741 = !DIFile(filename: "include/jemalloc/internal/decay.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "0d27b26766983c10c5dfe1de80068510")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decay_s", file: !741, line: 24, size: 14272, elements: !743)
!743 = !{!744, !745, !746, !755, !756, !757, !758, !759, !760, !761, !763}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !742, file: !741, line: 26, baseType: !136, size: 896)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "purging", scope: !742, file: !741, line: 31, baseType: !185, size: 8, offset: 896)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "time_ms", scope: !742, file: !741, line: 37, baseType: !747, size: 64, offset: 960)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zd_t", file: !168, line: 95, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 95, size: 64, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !748, file: !168, line: 95, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !752, line: 108, baseType: !753)
!752 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !159, line: 194, baseType: !754)
!754 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !742, file: !741, line: 39, baseType: !151, size: 64, offset: 1024)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !742, file: !741, line: 47, baseType: !151, size: 64, offset: 1088)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "jitter_state", scope: !742, file: !741, line: 49, baseType: !156, size: 64, offset: 1152)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !742, file: !741, line: 57, baseType: !151, size: 64, offset: 1216)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "npages_limit", scope: !742, file: !741, line: 63, baseType: !118, size: 64, offset: 1280)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "nunpurged", scope: !742, file: !741, line: 70, baseType: !118, size: 64, offset: 1344)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !742, file: !741, line: 80, baseType: !762, size: 12800, offset: 1408)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 12800, elements: !661)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ceil_npages", scope: !742, file: !741, line: 83, baseType: !156, size: 64, offset: 14208)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "decay_muzzy", scope: !596, file: !251, line: 115, baseType: !740, size: 14272, offset: 483456)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "stats_mtx", scope: !596, file: !251, line: 117, baseType: !135, size: 64, offset: 497728)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !596, file: !251, line: 118, baseType: !767, size: 64, offset: 497792)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "extent_sn_next", scope: !596, file: !251, line: 121, baseType: !233, size: 64, offset: 497856)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hpa_sec", scope: !501, file: !245, line: 103, baseType: !770, size: 960, offset: 498112)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "sec_t", file: !771, line: 87, baseType: !772)
!771 = !DIFile(filename: "include/jemalloc/internal/sec.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "ddbad2fd3266825bf2985ec75d9b308d")
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sec_s", file: !771, line: 88, size: 960, elements: !773)
!773 = !{!774, !775, !776, !786, !803}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pai", scope: !772, file: !771, line: 89, baseType: !599, size: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fallback", scope: !772, file: !771, line: 90, baseType: !607, size: 64, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !772, file: !771, line: 92, baseType: !777, size: 320, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "sec_opts_t", file: !778, line: 9, baseType: !779)
!778 = !DIFile(filename: "include/jemalloc/internal/sec_opts.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "8e74e2e488441438e14e59d407f14329")
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sec_opts_s", file: !778, line: 10, size: 320, elements: !780)
!780 = !{!781, !782, !783, !784, !785}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "nshards", scope: !779, file: !778, line: 15, baseType: !118, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "max_alloc", scope: !779, file: !778, line: 21, baseType: !118, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes", scope: !779, file: !778, line: 26, baseType: !118, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_after_flush", scope: !779, file: !778, line: 35, baseType: !118, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "batch_fill_extra", scope: !779, file: !778, line: 42, baseType: !118, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "shards", scope: !772, file: !771, line: 93, baseType: !787, size: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "sec_shard_t", file: !771, line: 62, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sec_shard_s", file: !771, line: 63, size: 1152, elements: !790)
!790 = !{!791, !792, !793, !801, !802}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !789, file: !771, line: 69, baseType: !136, size: 896)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !789, file: !771, line: 79, baseType: !185, size: 8, offset: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !789, file: !771, line: 80, baseType: !794, size: 64, offset: 960)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "sec_bin_t", file: !771, line: 32, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sec_bin_s", file: !771, line: 33, size: 192, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "being_batch_filled", scope: !796, file: !771, line: 50, baseType: !185, size: 8)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_cur", scope: !796, file: !771, line: 58, baseType: !118, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !796, file: !771, line: 59, baseType: !370, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_cur", scope: !789, file: !771, line: 82, baseType: !118, size: 64, offset: 1024)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "to_flush_next", scope: !789, file: !771, line: 84, baseType: !534, size: 32, offset: 1088)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "npsizes", scope: !772, file: !771, line: 94, baseType: !534, size: 32, offset: 896)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "hpa_shard", scope: !501, file: !245, line: 104, baseType: !805, size: 45696, offset: 499072)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpa_shard_t", file: !510, line: 79, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hpa_shard_s", file: !510, line: 80, size: 45696, elements: !807)
!807 = !{!808, !809, !811, !812, !813, !814, !821, !884, !885, !886, !887, !900, !901, !909}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pai", scope: !806, file: !510, line: 85, baseType: !599, size: 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "central", scope: !806, file: !510, line: 88, baseType: !810, size: 64, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !806, file: !510, line: 90, baseType: !136, size: 896, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "grow_mtx", scope: !806, file: !510, line: 96, baseType: !136, size: 896, offset: 1408)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !806, file: !510, line: 98, baseType: !518, size: 64, offset: 2304)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ecf", scope: !806, file: !510, line: 105, baseType: !815, size: 192, offset: 2368)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "edata_cache_fast_t", file: !712, line: 36, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edata_cache_fast_s", file: !712, line: 37, size: 192, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !816, file: !712, line: 38, baseType: !671, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fallback", scope: !816, file: !712, line: 39, baseType: !710, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !816, file: !712, line: 40, baseType: !185, size: 8, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "psset", scope: !806, file: !510, line: 107, baseType: !822, size: 42240, offset: 2560)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "psset_t", file: !823, line: 63, baseType: !824)
!823 = !DIFile(filename: "include/jemalloc/internal/psset.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "ac7317bc4820a45856300accafbe13ce")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "psset_s", file: !823, line: 64, size: 42240, elements: !825)
!825 = !{!826, !834, !838, !845, !855, !863, !874, !876}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pageslabs", scope: !824, file: !823, line: 69, baseType: !827, size: 8192)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 8192, elements: !832)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpdata_age_heap_t", file: !391, line: 21, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 21, size: 128, elements: !830)
!830 = !{!831}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ph", scope: !829, file: !391, line: 21, baseType: !550, size: 128)
!832 = !{!833}
!833 = !DISubrange(count: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pageslab_bitmap", scope: !824, file: !823, line: 71, baseType: !835, size: 64, offset: 8192)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 64, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 1)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "merged_stats", scope: !824, file: !823, line: 77, baseType: !839, size: 192, offset: 8256)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "psset_bin_stats_t", file: !823, line: 34, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "psset_bin_stats_s", file: !823, line: 35, size: 192, elements: !841)
!841 = !{!842, !843, !844}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "npageslabs", scope: !840, file: !823, line: 37, baseType: !118, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !840, file: !823, line: 39, baseType: !118, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ndirty", scope: !840, file: !823, line: 41, baseType: !118, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !824, file: !823, line: 78, baseType: !846, size: 25344, offset: 8448)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "psset_stats_t", file: !823, line: 44, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "psset_stats_s", file: !823, line: 45, size: 25344, elements: !848)
!848 = !{!849, !852, !854}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nonfull_slabs", scope: !847, file: !823, line: 51, baseType: !850, size: 24576)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 24576, elements: !851)
!851 = !{!833, !220}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "full_slabs", scope: !847, file: !823, line: 57, baseType: !853, size: 384, offset: 24576)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 384, elements: !219)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "empty_slabs", scope: !847, file: !823, line: 60, baseType: !853, size: 384, offset: 24960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !824, file: !823, line: 83, baseType: !856, size: 64, offset: 33792)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpdata_empty_list_t", file: !391, line: 120, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 120, size: 64, elements: !858)
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !857, file: !391, line: 120, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !857, file: !391, line: 120, size: 64, elements: !861)
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !860, file: !391, line: 120, baseType: !389, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "to_purge", scope: !824, file: !823, line: 89, baseType: !864, size: 8192, offset: 33856)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 8192, elements: !872)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpdata_purge_list_t", file: !391, line: 121, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 121, size: 64, elements: !867)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !866, file: !391, line: 121, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !866, file: !391, line: 121, size: 64, elements: !870)
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !869, file: !391, line: 121, baseType: !389, size: 64)
!872 = !{!873}
!873 = !DISubrange(count: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "purge_bitmap", scope: !824, file: !823, line: 91, baseType: !875, size: 128, offset: 42048)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 128, elements: !219)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "to_hugify", scope: !824, file: !823, line: 93, baseType: !877, size: 64, offset: 42176)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpdata_hugify_list_t", file: !391, line: 122, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 122, size: 64, elements: !879)
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !878, file: !391, line: 122, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !391, line: 122, size: 64, elements: !882)
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !881, file: !391, line: 122, baseType: !389, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "age_counter", scope: !806, file: !510, line: 114, baseType: !156, size: 64, offset: 44800)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !806, file: !510, line: 117, baseType: !7, size: 32, offset: 44864)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "emap", scope: !806, file: !510, line: 123, baseType: !689, size: 64, offset: 44928)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !806, file: !510, line: 126, baseType: !888, size: 320, offset: 44992)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpa_shard_opts_t", file: !889, line: 11, baseType: !890)
!889 = !DIFile(filename: "include/jemalloc/internal/hpa_opts.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "e1a33a4a56f1e144d3404a61859ead58")
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hpa_shard_opts_s", file: !889, line: 12, size: 320, elements: !891)
!891 = !{!892, !893, !894, !897, !898, !899}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "slab_max_alloc", scope: !890, file: !889, line: 19, baseType: !118, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "hugification_threshold", scope: !890, file: !889, line: 25, baseType: !118, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_mult", scope: !890, file: !889, line: 31, baseType: !895, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "fxp_t", file: !896, line: 23, baseType: !164)
!896 = !DIFile(filename: "include/jemalloc/internal/fxp.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "1f72cf9a1fa1e722da228477653e0fd3")
!897 = !DIDerivedType(tag: DW_TAG_member, name: "deferral_allowed", scope: !890, file: !889, line: 39, baseType: !185, size: 8, offset: 160)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "hugify_delay_ms", scope: !890, file: !889, line: 45, baseType: !156, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "min_purge_interval_ms", scope: !890, file: !889, line: 50, baseType: !156, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "npending_purge", scope: !806, file: !510, line: 132, baseType: !118, size: 64, offset: 45312)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !806, file: !510, line: 138, baseType: !902, size: 256, offset: 45376)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "hpa_shard_nonderived_stats_t", file: !510, line: 41, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hpa_shard_nonderived_stats_s", file: !510, line: 42, size: 256, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "npurge_passes", scope: !903, file: !510, line: 48, baseType: !156, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "npurges", scope: !903, file: !510, line: 56, baseType: !156, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "nhugifies", scope: !903, file: !510, line: 63, baseType: !156, size: 64, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ndehugifies", scope: !903, file: !510, line: 69, baseType: !156, size: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "last_purge", scope: !806, file: !510, line: 143, baseType: !151, size: 64, offset: 45632)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "edata_cache", scope: !501, file: !245, line: 107, baseType: !711, size: 1152, offset: 544768)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !501, file: !245, line: 109, baseType: !7, size: 32, offset: 545920)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "stats_mtx", scope: !501, file: !245, line: 111, baseType: !135, size: 64, offset: 545984)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !501, file: !245, line: 112, baseType: !914, size: 64, offset: 546048)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "emap", scope: !501, file: !245, line: 115, baseType: !689, size: 64, offset: 546112)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !501, file: !245, line: 118, baseType: !518, size: 64, offset: 546176)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !210, file: !211, line: 83, baseType: !7, size: 32, offset: 631424)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 90, baseType: !518, size: 64, offset: 631488)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "create_time", scope: !210, file: !211, line: 92, baseType: !151, size: 64, offset: 631552)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "bins", scope: !210, file: !211, line: 98, baseType: !921, offset: 631616)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, elements: !945)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_t", file: !923, line: 14, baseType: !924)
!923 = !DIFile(filename: "include/jemalloc/internal/bin.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "1555ce3b2d1f4242c5e8f5e8a8530dd2")
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_s", file: !923, line: 15, size: 1792, elements: !925)
!925 = !{!926, !927, !942, !943, !944}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !924, file: !923, line: 17, baseType: !136, size: 896)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !924, file: !923, line: 23, baseType: !928, size: 640, offset: 896)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_stats_t", file: !929, line: 6, baseType: !930)
!929 = !DIFile(filename: "include/jemalloc/internal/bin_stats.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "6084e64226164dc89ecbf220d8798196")
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_stats_s", file: !929, line: 7, size: 640, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !937, !938, !939, !940, !941}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "nmalloc", scope: !930, file: !929, line: 14, baseType: !156, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ndalloc", scope: !930, file: !929, line: 15, baseType: !156, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !930, file: !929, line: 22, baseType: !156, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "curregs", scope: !930, file: !929, line: 28, baseType: !118, size: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "nfills", scope: !930, file: !929, line: 31, baseType: !156, size: 64, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "nflushes", scope: !930, file: !929, line: 34, baseType: !156, size: 64, offset: 320)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nslabs", scope: !930, file: !929, line: 37, baseType: !156, size: 64, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "reslabs", scope: !930, file: !929, line: 43, baseType: !156, size: 64, offset: 448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "curslabs", scope: !930, file: !929, line: 46, baseType: !118, size: 64, offset: 512)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "nonfull_slabs", scope: !930, file: !929, line: 49, baseType: !118, size: 64, offset: 576)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "slabcur", scope: !924, file: !923, line: 31, baseType: !377, size: 64, offset: 1536)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_nonfull", scope: !924, file: !923, line: 38, baseType: !546, size: 128, offset: 1600)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_full", scope: !924, file: !923, line: 41, baseType: !370, size: 64, offset: 1728)
!945 = !{!946}
!946 = !DISubrange(count: 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arena", scope: !182, file: !178, line: 250, baseType: !208, size: 64, offset: 1152)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arena_decay_ticker", scope: !182, file: !178, line: 250, baseType: !949, size: 64, offset: 1216)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "ticker_geom_t", file: !950, line: 116, baseType: !951)
!950 = !DIFile(filename: "include/jemalloc/internal/ticker.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "4f08e06764a534efd56d8b453c3ab4c6")
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ticker_geom_s", file: !950, line: 117, size: 64, elements: !952)
!952 = !{!953, !957}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "tick", scope: !951, file: !950, line: 118, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !188, line: 26, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !159, line: 41, baseType: !956)
!956 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "nticks", scope: !951, file: !950, line: 119, baseType: !954, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_sec_shard", scope: !182, file: !178, line: 250, baseType: !344, size: 8, offset: 1280)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_binshards", scope: !182, file: !178, line: 250, baseType: !960, size: 288, offset: 1288)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_binshards_t", file: !961, line: 12, baseType: !962)
!961 = !DIFile(filename: "include/jemalloc/internal/bin_types.h", directory: "/local-ssd/jemalloc-jgelsfk4zpnuevzavzyyfzw3pop64gjj-build/aidengro/spack-stage-jemalloc-5.3.0-jgelsfk4zpnuevzavzyyfzw3pop64gjj/spack-src", checksumkind: CSK_MD5, checksum: "fc7f646211d9805be8d5bf0ceecadef1")
