; ModuleID = 'samples/625.bc'
source_filename = "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src/src/libmongoc/src/mongoc/mongoc-gridfs-file-page.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._mongoc_gridfs_file_page_t = type { ptr, ptr, i32, i32, i32 }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [37 x i8] c"%s:%d %s(): precondition failed: %s\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [202 x i8] c"/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src/src/libmongoc/src/mongoc/mongoc-gridfs-file-page.c\00", align 1, !dbg !7
@__func__._mongoc_gridfs_file_page_new = private unnamed_addr constant [29 x i8] c"_mongoc_gridfs_file_page_new\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [5 x i8] c"data\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [18 x i8] c"len <= chunk_size\00", align 1, !dbg !23
@__func__._mongoc_gridfs_file_page_seek = private unnamed_addr constant [30 x i8] c"_mongoc_gridfs_file_page_seek\00", align 1, !dbg !28
@.str.4 = private unnamed_addr constant [5 x i8] c"page\00", align 1, !dbg !33

!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!16 = !{!17}
!17 = !DISubrange(count: 29)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !20, isLocal: true, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 5)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 18)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 30)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !20, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !30, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 4)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 248, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 31)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !39, isLocal: true, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(scope: null, file: !2, line: 155, type: !51, isLocal: true, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 264, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 33)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 272, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 34)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !51, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(scope: null, file: !2, line: 204, type: !30, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !56, isLocal: true, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !67, globals: !90, splitDebugInlining: false, nameTableKind: None)
!66 = !DIFile(filename: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src/src/libmongoc/src/mongoc/mongoc-gridfs-file-page.c", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src/spack-build/src/libmongoc", checksumkind: CSK_MD5, checksum: "6f0ed4d860816a02bfd98c9b50340227")
!67 = !{!68, !83}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "mongoc_gridfs_file_page_t", file: !70, line: 32, baseType: !71)
!70 = !DIFile(filename: "src/libmongoc/src/mongoc/mongoc-gridfs-file-page.h", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src", checksumkind: CSK_MD5, checksum: "3b932d73546d72dae9fcb918c41de57d")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mongoc_gridfs_file_page_t", file: !72, line: 30, size: 256, elements: !73)
!72 = !DIFile(filename: "src/libmongoc/src/mongoc/mongoc-gridfs-file-page-private.h", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src", checksumkind: CSK_MD5, checksum: "282f5e691bb325deb6b8891eb13149f2")
!73 = !{!74, !82, !84, !88, !89}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !71, file: !72, line: 31, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !78, line: 24, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !80, line: 38, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !71, file: !72, line: 32, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !71, file: !72, line: 33, baseType: !85, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !78, line: 26, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !80, line: 42, baseType: !87)
!87 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !71, file: !72, line: 34, baseType: !85, size: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !71, file: !72, line: 35, baseType: !85, size: 32, offset: 192)
!90 = !{!0, !7, !12, !18, !23, !28, !33, !35, !37, !42, !47, !49, !54, !59, !61, !63}
!91 = !{i32 7, !"Dwarf Version", i32 5}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{i32 1, !"wchar_size", i32 4}
!94 = !{i32 8, !"PIC Level", i32 2}
!95 = !{i32 7, !"uwtable", i32 2}
!96 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!97 = distinct !DISubprogram(name: "_mongoc_gridfs_file_page_new", scope: !2, file: !2, line: 32, type: !98, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !65, retainedNodes: !100)
!98 = !DISubroutineType(types: !99)
!99 = !{!68, !75, !85, !85}
!100 = !{!101, !102, !103, !104}
!101 = !DILocalVariable(name: "data", arg: 1, scope: !97, file: !2, line: 32, type: !75)
!102 = !DILocalVariable(name: "len", arg: 2, scope: !97, file: !2, line: 33, type: !85)
!103 = !DILocalVariable(name: "chunk_size", arg: 3, scope: !97, file: !2, line: 34, type: !85)
!104 = !DILocalVariable(name: "page", scope: !97, file: !2, line: 36, type: !68)
!105 = !{!106, !106, i64 0}
!106 = !{!"any pointer", !107, i64 0}
!107 = !{!"omnipotent char", !108, i64 0}
!108 = !{!"Simple C/C++ TBAA"}
!109 = !DILocation(line: 32, column: 46, scope: !97)
!110 = !{!111, !111, i64 0}
!111 = !{!"int", !107, i64 0}
!112 = !DILocation(line: 33, column: 40, scope: !97)
!113 = !DILocation(line: 34, column: 40, scope: !97)
!114 = !DILocation(line: 36, column: 4, scope: !97)
!115 = !DILocation(line: 36, column: 31, scope: !97)
!116 = !DILocation(line: 38, column: 4, scope: !97)
!117 = !DILocation(line: 38, column: 4, scope: !118)
!118 = distinct !DILexicalBlock(scope: !97, file: !2, line: 38, column: 4)
!119 = !DILocation(line: 40, column: 4, scope: !97)
!120 = !DILocation(line: 40, column: 4, scope: !121)
!121 = distinct !DILexicalBlock(scope: !122, file: !2, line: 40, column: 4)
!122 = distinct !DILexicalBlock(scope: !97, file: !2, line: 40, column: 4)
!123 = !DILocation(line: 40, column: 4, scope: !122)
!124 = !DILocation(line: 40, column: 4, scope: !125)
!125 = distinct !DILexicalBlock(scope: !121, file: !2, line: 40, column: 4)
!126 = !DILocation(line: 41, column: 4, scope: !97)
!127 = !DILocation(line: 41, column: 4, scope: !128)
!128 = distinct !DILexicalBlock(scope: !129, file: !2, line: 41, column: 4)
!129 = distinct !DILexicalBlock(scope: !97, file: !2, line: 41, column: 4)
!130 = !DILocation(line: 41, column: 4, scope: !129)
!131 = !DILocation(line: 41, column: 4, scope: !132)
!132 = distinct !DILexicalBlock(scope: !128, file: !2, line: 41, column: 4)
!133 = !DILocation(line: 43, column: 41, scope: !97)
!134 = !DILocation(line: 43, column: 9, scope: !97)
!135 = !DILocation(line: 45, column: 23, scope: !97)
!136 = !DILocation(line: 45, column: 4, scope: !97)
!137 = !DILocation(line: 45, column: 10, scope: !97)
!138 = !DILocation(line: 45, column: 21, scope: !97)
!139 = !{!140, !111, i64 20}
!140 = !{!"_mongoc_gridfs_file_page_t", !106, i64 0, !106, i64 8, !111, i64 16, !111, i64 20, !111, i64 24}
!141 = !DILocation(line: 46, column: 21, scope: !97)
!142 = !DILocation(line: 46, column: 4, scope: !97)
!143 = !DILocation(line: 46, column: 10, scope: !97)
!144 = !DILocation(line: 46, column: 19, scope: !97)
!145 = !{!140, !106, i64 0}
!146 = !DILocation(line: 47, column: 16, scope: !97)
!147 = !DILocation(line: 47, column: 4, scope: !97)
!148 = !DILocation(line: 47, column: 10, scope: !97)
!149 = !DILocation(line: 47, column: 14, scope: !97)
!150 = !{!140, !111, i64 16}
!151 = !DILocation(line: 49, column: 4, scope: !97)
!152 = !DILocation(line: 49, column: 4, scope: !153)
!153 = distinct !DILexicalBlock(scope: !97, file: !2, line: 49, column: 4)
!154 = !DILocation(line: 50, column: 1, scope: !97)
!155 = !DISubprogram(name: "fprintf", scope: !156, file: !156, line: 350, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!156 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !160, !221, null}
!159 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !163, line: 7, baseType: !164)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !165, line: 49, size: 1728, elements: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!166 = !{!167, !168, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !183, !185, !186, !187, !190, !192, !194, !198, !201, !203, !206, !209, !210, !212, !216, !217}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !164, file: !165, line: 51, baseType: !159, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !164, file: !165, line: 54, baseType: !169, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !164, file: !165, line: 55, baseType: !169, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !164, file: !165, line: 56, baseType: !169, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !164, file: !165, line: 57, baseType: !169, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !164, file: !165, line: 58, baseType: !169, size: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !164, file: !165, line: 59, baseType: !169, size: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !164, file: !165, line: 60, baseType: !169, size: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !164, file: !165, line: 61, baseType: !169, size: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !164, file: !165, line: 64, baseType: !169, size: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !164, file: !165, line: 65, baseType: !169, size: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !164, file: !165, line: 66, baseType: !169, size: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !164, file: !165, line: 68, baseType: !181, size: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !165, line: 36, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !164, file: !165, line: 70, baseType: !184, size: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !164, file: !165, line: 72, baseType: !159, size: 32, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !164, file: !165, line: 73, baseType: !159, size: 32, offset: 928)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !164, file: !165, line: 74, baseType: !188, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 152, baseType: !189)
!189 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !164, file: !165, line: 77, baseType: !191, size: 16, offset: 1024)
!191 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !164, file: !165, line: 78, baseType: !193, size: 8, offset: 1040)
!193 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !164, file: !165, line: 79, baseType: !195, size: 8, offset: 1048)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 1)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !164, file: !165, line: 81, baseType: !199, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !165, line: 43, baseType: null)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !164, file: !165, line: 89, baseType: !202, size: 64, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !80, line: 153, baseType: !189)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !164, file: !165, line: 91, baseType: !204, size: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !165, line: 37, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !164, file: !165, line: 92, baseType: !207, size: 64, offset: 1280)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !165, line: 38, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !164, file: !165, line: 93, baseType: !184, size: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !164, file: !165, line: 94, baseType: !211, size: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !164, file: !165, line: 95, baseType: !213, size: 64, offset: 1472)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !214, line: 70, baseType: !215)
!214 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!215 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !164, file: !165, line: 96, baseType: !159, size: 32, offset: 1536)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !164, file: !165, line: 98, baseType: !218, size: 160, offset: 1568)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 20)
!221 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!223 = !DISubprogram(name: "abort", scope: !224, file: !224, line: 598, type: !225, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!224 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!225 = !DISubroutineType(types: !226)
!226 = !{null}
!227 = !DISubprogram(name: "bson_malloc0", scope: !228, file: !228, line: 51, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/linux-ubuntu22.04-zen2/clang-18.0.0/libbson-1.24.4-3emagvezomjldhykavhwzeddzez6p3tl/include/libbson-1.0/bson/bson-memory.h", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build", checksumkind: CSK_MD5, checksum: "bd1060bd64476ebf607005ba6da351c4")
!229 = !DISubroutineType(types: !230)
!230 = !{!211, !213}
!231 = distinct !DISubprogram(name: "_mongoc_gridfs_file_page_seek", scope: !2, file: !2, line: 54, type: !232, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !65, retainedNodes: !235)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !68, !85}
!234 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!235 = !{!236, !237}
!236 = !DILocalVariable(name: "page", arg: 1, scope: !231, file: !2, line: 54, type: !68)
!237 = !DILocalVariable(name: "offset", arg: 2, scope: !231, file: !2, line: 54, type: !85)
!238 = !DILocation(line: 54, column: 59, scope: !231)
!239 = !DILocation(line: 54, column: 74, scope: !231)
!240 = !DILocation(line: 56, column: 4, scope: !231)
!241 = !DILocation(line: 56, column: 4, scope: !242)
!242 = distinct !DILexicalBlock(scope: !231, file: !2, line: 56, column: 4)
!243 = !DILocation(line: 58, column: 4, scope: !231)
!244 = !DILocation(line: 58, column: 4, scope: !245)
!245 = distinct !DILexicalBlock(scope: !246, file: !2, line: 58, column: 4)
!246 = distinct !DILexicalBlock(scope: !231, file: !2, line: 58, column: 4)
!247 = !DILocation(line: 58, column: 4, scope: !246)
!248 = !DILocation(line: 58, column: 4, scope: !249)
!249 = distinct !DILexicalBlock(scope: !245, file: !2, line: 58, column: 4)
!250 = !DILocation(line: 60, column: 19, scope: !231)
!251 = !DILocation(line: 60, column: 4, scope: !231)
!252 = !DILocation(line: 60, column: 10, scope: !231)
!253 = !DILocation(line: 60, column: 17, scope: !231)
!254 = !{!140, !111, i64 24}
!255 = !DILocation(line: 62, column: 4, scope: !231)
!256 = !DILocation(line: 62, column: 4, scope: !257)
!257 = distinct !DILexicalBlock(scope: !231, file: !2, line: 62, column: 4)
!258 = distinct !DISubprogram(name: "_mongoc_gridfs_file_page_read", scope: !2, file: !2, line: 67, type: !259, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !65, retainedNodes: !264)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !68, !211, !85}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !262, line: 26, baseType: !263)
