; ModuleID = 'samples/668.bc'
source_filename = "src/os/unix/ngx_files.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i64, i64, ptr, i8 }
%struct.ngx_str_t = type { i64, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.ngx_log_s = type { i64, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_iovec_t = type { ptr, i64, i64, i64 }
%struct.iovec = type { ptr, i64 }
%struct.ngx_chain_s = type { ptr, ptr }
%struct.ngx_buf_s = type { ptr, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, i16, i32 }
%struct.timeval = type { i64, i64 }
%struct.ngx_time_t = type { i64, i64, i64 }
%struct.ngx_file_mapping_t = type { ptr, i64, ptr, i32, ptr }
%struct.ngx_dir_t = type { ptr, ptr, %struct.stat, i16 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.ngx_glob_t = type { i64, %struct.glob_t, ptr, ptr, i64 }
%struct.glob_t = type { i64, ptr, i64, i32, ptr, ptr, ptr, ptr, ptr }
%struct.flock = type { i16, i16, i64, i64, i32 }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }

@.str = private unnamed_addr constant [20 x i8] c"pread() \22%s\22 failed\00", align 1, !dbg !0

!11 = !DISubrange(count: 21)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 625, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 19)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 631, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 24)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 642, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 22)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 648, type: !3, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !2, line: 660, type: !19, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(scope: null, file: !2, line: 415, type: !24, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(scope: null, file: !2, line: 421, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 42)
!38 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !39, globals: !56, splitDebugInlining: false, nameTableKind: None)
!39 = !{!40, !43, !45, !46, !52, !53}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !41, line: 29, baseType: !42)
!41 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!42 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !48, line: 33, baseType: !49)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !50, line: 31, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!51 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !48, line: 87, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 153, baseType: !55)
!55 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!56 = !{!0, !7, !12, !17, !22, !27, !29, !31, !33}
!57 = !{i32 7, !"Dwarf Version", i32 5}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{i32 1, !"wchar_size", i32 4}
!60 = !{i32 8, !"PIC Level", i32 2}
!61 = !{i32 7, !"PIE Level", i32 2}
!62 = !{i32 7, !"uwtable", i32 2}
!63 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!64 = distinct !DISubprogram(name: "ngx_read_file", scope: !2, file: !2, line: 31, type: !65, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !174)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !69, !46, !40, !53}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !48, line: 108, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !50, line: 194, baseType: !55)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !71, line: 23, baseType: !72)
!71 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "20a149d22b95b5c7a0a8830d485b97ae")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !73, line: 16, size: 1600, elements: !74)
!73 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!74 = !{!75, !79, !86, !126, !127, !128, !172, !173}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !72, file: !73, line: 17, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !77, line: 16, baseType: !78)
!77 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "5c6995d5f659dd97ea6d10eff0ad0f12")
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !73, line: 18, baseType: !80, size: 128, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !81, line: 19, baseType: !82)
!81 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2f3ab61eca09df707b083ffd5eafea4f")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 16, size: 128, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !82, file: !81, line: 17, baseType: !40, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !82, file: !81, line: 18, baseType: !46, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !72, file: !73, line: 19, baseType: !87, size: 1152, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !77, line: 17, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !89, line: 26, size: 1152, elements: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!90 = !{!91, !93, !95, !97, !100, !102, !104, !105, !106, !108, !110, !112, !120, !121, !122}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !88, file: !89, line: 31, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !50, line: 145, baseType: !42)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !88, file: !89, line: 36, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !50, line: 148, baseType: !42)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !88, file: !89, line: 44, baseType: !96, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !50, line: 151, baseType: !42)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !88, file: !89, line: 45, baseType: !98, size: 32, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !50, line: 150, baseType: !99)
!99 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !88, file: !89, line: 47, baseType: !101, size: 32, offset: 224)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !50, line: 146, baseType: !99)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !88, file: !89, line: 48, baseType: !103, size: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !50, line: 147, baseType: !99)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !88, file: !89, line: 50, baseType: !78, size: 32, offset: 288)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !88, file: !89, line: 52, baseType: !92, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !88, file: !89, line: 57, baseType: !107, size: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 152, baseType: !55)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !88, file: !89, line: 61, baseType: !109, size: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !50, line: 175, baseType: !55)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !88, file: !89, line: 63, baseType: !111, size: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !50, line: 180, baseType: !55)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !88, file: !89, line: 74, baseType: !113, size: 128, offset: 576)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !114, line: 11, size: 128, elements: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!115 = !{!116, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !113, file: !114, line: 16, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !50, line: 160, baseType: !55)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !113, file: !114, line: 21, baseType: !119, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !50, line: 197, baseType: !55)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !88, file: !89, line: 75, baseType: !113, size: 128, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !88, file: !89, line: 76, baseType: !113, size: 128, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !88, file: !89, line: 89, baseType: !123, size: 192, offset: 960)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 192, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 3)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !72, file: !73, line: 21, baseType: !53, size: 64, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !72, file: !73, line: 22, baseType: !53, size: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !72, file: !73, line: 24, baseType: !129, size: 64, offset: 1472)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !71, line: 20, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !132, line: 50, size: 640, elements: !133)
!132 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "81257099415bdc5e18cdef9b4461d934")
!133 = !{!134, !139, !152, !155, !158, !163, !164, !169, !170, !171}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !131, file: !132, line: 51, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !136, line: 79, baseType: !137)
!136 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !138, line: 90, baseType: !42)
!138 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !131, file: !132, line: 52, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !71, line: 21, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !143, line: 89, size: 320, elements: !144)
!143 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "b737d189253ca17c55f83e424debf52b")
!144 = !{!145, !146, !147, !151}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !142, file: !143, line: 90, baseType: !76, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !143, line: 91, baseType: !80, size: 128, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !142, file: !143, line: 93, baseType: !148, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !140, !129}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !143, line: 94, baseType: !45, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !131, file: !132, line: 54, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !154, line: 48, baseType: !42)
!154 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "5d14beceab1860bcc051d3b7a146b2a2")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !131, file: !132, line: 56, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !157, line: 10, baseType: !117)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !131, file: !132, line: 58, baseType: !159, size: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !132, line: 45, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!46, !129, !46, !40}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !132, line: 59, baseType: !45, size: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !131, file: !132, line: 61, baseType: !165, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !132, line: 46, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !129, !135, !46, !40}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !131, file: !132, line: 62, baseType: !45, size: 64, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !131, file: !132, line: 70, baseType: !52, size: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !132, line: 72, baseType: !129, size: 64, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !72, file: !73, line: 37, baseType: !99, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !72, file: !73, line: 38, baseType: !99, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!174 = !{!175, !176, !177, !178, !179}
!175 = !DILocalVariable(name: "file", arg: 1, scope: !64, file: !2, line: 31, type: !69)
!176 = !DILocalVariable(name: "buf", arg: 2, scope: !64, file: !2, line: 31, type: !46)
!177 = !DILocalVariable(name: "size", arg: 3, scope: !64, file: !2, line: 31, type: !40)
!178 = !DILocalVariable(name: "offset", arg: 4, scope: !64, file: !2, line: 31, type: !53)
!179 = !DILocalVariable(name: "n", scope: !64, file: !2, line: 33, type: !67)
!180 = !{!181, !181, i64 0}
!181 = !{!"any pointer", !182, i64 0}
!182 = !{!"omnipotent char", !183, i64 0}
!183 = !{!"Simple C/C++ TBAA"}
!184 = !DILocation(line: 31, column: 27, scope: !64)
!185 = !DILocation(line: 31, column: 41, scope: !64)
!186 = !{!187, !187, i64 0}
!187 = !{!"long", !182, i64 0}
!188 = !DILocation(line: 31, column: 53, scope: !64)
!189 = !DILocation(line: 31, column: 65, scope: !64)
!190 = !DILocation(line: 33, column: 5, scope: !64)
!191 = !DILocation(line: 33, column: 14, scope: !64)
!192 = !DILocation(line: 40, column: 15, scope: !64)
!193 = !DILocation(line: 40, column: 21, scope: !64)
!194 = !{!195, !196, i64 0}
!195 = !{!"ngx_file_s", !196, i64 0, !197, i64 8, !198, i64 24, !187, i64 168, !187, i64 176, !181, i64 184, !196, i64 192, !196, i64 192}
!196 = !{!"int", !182, i64 0}
!197 = !{!"", !187, i64 0, !181, i64 8}
!198 = !{!"stat", !187, i64 0, !187, i64 8, !187, i64 16, !196, i64 24, !196, i64 28, !196, i64 32, !196, i64 36, !187, i64 40, !187, i64 48, !187, i64 56, !187, i64 64, !199, i64 72, !199, i64 88, !199, i64 104, !182, i64 120}
!199 = !{!"timespec", !187, i64 0, !187, i64 8}
!200 = !DILocation(line: 40, column: 25, scope: !64)
!201 = !DILocation(line: 40, column: 30, scope: !64)
!202 = !DILocation(line: 40, column: 36, scope: !64)
!203 = !DILocation(line: 40, column: 9, scope: !64)
!204 = !DILocation(line: 40, column: 7, scope: !64)
!205 = !DILocation(line: 42, column: 9, scope: !206)
!206 = distinct !DILexicalBlock(scope: !64, file: !2, line: 42, column: 9)
!207 = !DILocation(line: 42, column: 11, scope: !206)
!208 = !DILocation(line: 42, column: 9, scope: !64)
!209 = !DILocation(line: 43, column: 9, scope: !210)
!210 = distinct !DILexicalBlock(scope: !211, file: !2, line: 43, column: 9)
!211 = distinct !DILexicalBlock(scope: !206, file: !2, line: 42, column: 18)
!212 = !{!195, !181, i64 184}
!213 = !{!214, !187, i64 0}
!214 = !{!"ngx_log_s", !187, i64 0, !181, i64 8, !187, i64 16, !187, i64 24, !181, i64 32, !181, i64 40, !181, i64 48, !181, i64 56, !181, i64 64, !181, i64 72}
!215 = !DILocation(line: 43, column: 9, scope: !211)
!216 = !{!196, !196, i64 0}
!217 = !{!195, !181, i64 16}
!218 = !DILocation(line: 45, column: 9, scope: !211)
!219 = !DILocation(line: 72, column: 21, scope: !64)
!220 = !DILocation(line: 72, column: 5, scope: !64)
!221 = !DILocation(line: 72, column: 11, scope: !64)
!222 = !DILocation(line: 72, column: 18, scope: !64)
!223 = !{!195, !187, i64 168}
!224 = !DILocation(line: 74, column: 12, scope: !64)
!225 = !DILocation(line: 74, column: 5, scope: !64)
!226 = !DILocation(line: 75, column: 1, scope: !64)
!227 = !DISubprogram(name: "pread", linkageName: "pread64", scope: !228, file: !228, line: 404, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!229 = !DISubroutineType(types: !230)
!230 = !{!67, !78, !45, !231, !54}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !232, line: 70, baseType: !42)
!232 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!233 = !DISubprogram(name: "ngx_log_error_core", scope: !132, file: !132, line: 88, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !135, !129, !236, !43, null}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_err_t", file: !237, line: 16, baseType: !78)
!237 = !DIFile(filename: "src/os/unix/ngx_errno.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "30ed2ad8bb523aef1235abc1478ad7cf")
!238 = !DISubprogram(name: "__errno_location", scope: !239, file: !239, line: 37, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!239 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!240 = !DISubroutineType(types: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!243 = distinct !DISubprogram(name: "ngx_write_file", scope: !2, file: !2, line: 193, type: !65, scopeLine: 194, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251}
!245 = !DILocalVariable(name: "file", arg: 1, scope: !243, file: !2, line: 193, type: !69)
!246 = !DILocalVariable(name: "buf", arg: 2, scope: !243, file: !2, line: 193, type: !46)
!247 = !DILocalVariable(name: "size", arg: 3, scope: !243, file: !2, line: 193, type: !40)
!248 = !DILocalVariable(name: "offset", arg: 4, scope: !243, file: !2, line: 193, type: !53)
!249 = !DILocalVariable(name: "n", scope: !243, file: !2, line: 195, type: !67)
!250 = !DILocalVariable(name: "written", scope: !243, file: !2, line: 195, type: !67)
!251 = !DILocalVariable(name: "err", scope: !243, file: !2, line: 196, type: !236)
!252 = !DILocation(line: 193, column: 28, scope: !243)
!253 = !DILocation(line: 193, column: 42, scope: !243)
!254 = !DILocation(line: 193, column: 54, scope: !243)
!255 = !DILocation(line: 193, column: 66, scope: !243)
!256 = !DILocation(line: 195, column: 5, scope: !243)
!257 = !DILocation(line: 195, column: 16, scope: !243)
!258 = !DILocation(line: 195, column: 19, scope: !243)
!259 = !DILocation(line: 196, column: 5, scope: !243)
!260 = !DILocation(line: 196, column: 16, scope: !243)
!261 = !DILocation(line: 201, column: 13, scope: !243)
!262 = !DILocation(line: 205, column: 5, scope: !243)
!263 = !DILocation(line: 206, column: 20, scope: !264)
!264 = distinct !DILexicalBlock(scope: !265, file: !2, line: 205, column: 16)
!265 = distinct !DILexicalBlock(scope: !266, file: !2, line: 205, column: 5)
!266 = distinct !DILexicalBlock(scope: !243, file: !2, line: 205, column: 5)
!267 = !DILocation(line: 206, column: 26, scope: !264)
!268 = !DILocation(line: 206, column: 30, scope: !264)
!269 = !DILocation(line: 206, column: 36, scope: !264)
!270 = !DILocation(line: 206, column: 34, scope: !264)
!271 = !DILocation(line: 206, column: 45, scope: !264)
!272 = !DILocation(line: 206, column: 51, scope: !264)
!273 = !DILocation(line: 206, column: 13, scope: !264)
!274 = !DILocation(line: 206, column: 11, scope: !264)
!275 = !DILocation(line: 208, column: 13, scope: !276)
!276 = distinct !DILexicalBlock(scope: !264, file: !2, line: 208, column: 13)
!277 = !DILocation(line: 208, column: 15, scope: !276)
!278 = !DILocation(line: 208, column: 13, scope: !264)
!279 = !DILocation(line: 209, column: 19, scope: !280)
!280 = distinct !DILexicalBlock(scope: !276, file: !2, line: 208, column: 22)
!281 = !DILocation(line: 209, column: 17, scope: !280)
!282 = !DILocation(line: 211, column: 17, scope: !283)
!283 = distinct !DILexicalBlock(scope: !280, file: !2, line: 211, column: 17)
!284 = !DILocation(line: 211, column: 21, scope: !283)
!285 = !DILocation(line: 211, column: 17, scope: !280)
!286 = !DILocation(line: 214, column: 17, scope: !287)
!287 = distinct !DILexicalBlock(scope: !283, file: !2, line: 211, column: 35)
!288 = distinct !{!288, !289, !290, !291}
!289 = !DILocation(line: 205, column: 5, scope: !266)
!290 = !DILocation(line: 231, column: 5, scope: !266)
!291 = !{!"llvm.loop.unroll.disable"}
!292 = !DILocation(line: 217, column: 13, scope: !293)
!293 = distinct !DILexicalBlock(scope: !280, file: !2, line: 217, column: 13)
!294 = !DILocation(line: 217, column: 13, scope: !280)
!295 = !DILocation(line: 219, column: 13, scope: !280)
!296 = !DILocation(line: 222, column: 25, scope: !264)
!297 = !DILocation(line: 222, column: 9, scope: !264)
!298 = !DILocation(line: 222, column: 15, scope: !264)
!299 = !DILocation(line: 222, column: 22, scope: !264)
!300 = !DILocation(line: 223, column: 20, scope: !264)
!301 = !DILocation(line: 223, column: 17, scope: !264)
!302 = !DILocation(line: 225, column: 22, scope: !303)
!303 = distinct !DILexicalBlock(scope: !264, file: !2, line: 225, column: 13)
!304 = !DILocation(line: 225, column: 27, scope: !303)
!305 = !DILocation(line: 225, column: 24, scope: !303)
!306 = !DILocation(line: 225, column: 13, scope: !264)
!307 = !DILocation(line: 226, column: 20, scope: !308)
!308 = distinct !DILexicalBlock(scope: !303, file: !2, line: 225, column: 33)
!309 = !DILocation(line: 226, column: 13, scope: !308)
!310 = !DILocation(line: 229, column: 19, scope: !264)
!311 = !DILocation(line: 229, column: 16, scope: !264)
!312 = !DILocation(line: 230, column: 17, scope: !264)
!313 = !DILocation(line: 230, column: 14, scope: !264)
!314 = !DILocation(line: 205, column: 5, scope: !265)
!315 = !DILocation(line: 273, column: 1, scope: !243)
!316 = !DISubprogram(name: "pwrite", linkageName: "pwrite64", scope: !228, file: !228, line: 408, type: !317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!317 = !DISubroutineType(types: !318)
!318 = !{!67, !78, !319, !231, !54}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!321 = distinct !DISubprogram(name: "ngx_open_tempfile", scope: !2, file: !2, line: 277, type: !322, scopeLine: 278, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{!76, !46, !135, !135}
!324 = !{!325, !326, !327, !328}
!325 = !DILocalVariable(name: "name", arg: 1, scope: !321, file: !2, line: 277, type: !46)
!326 = !DILocalVariable(name: "persistent", arg: 2, scope: !321, file: !2, line: 277, type: !135)
!327 = !DILocalVariable(name: "access", arg: 3, scope: !321, file: !2, line: 277, type: !135)
!328 = !DILocalVariable(name: "fd", scope: !321, file: !2, line: 279, type: !76)
!329 = !DILocation(line: 277, column: 27, scope: !321)
!330 = !DILocation(line: 277, column: 44, scope: !321)
!331 = !DILocation(line: 277, column: 67, scope: !321)
!332 = !DILocation(line: 279, column: 5, scope: !321)
!333 = !DILocation(line: 279, column: 15, scope: !321)
!334 = !DILocation(line: 281, column: 30, scope: !321)
!335 = !DILocation(line: 282, column: 15, scope: !321)
!336 = !DILocation(line: 282, column: 24, scope: !321)
!337 = !DILocation(line: 281, column: 10, scope: !321)
!338 = !DILocation(line: 281, column: 8, scope: !321)
!339 = !DILocation(line: 284, column: 9, scope: !340)
!340 = distinct !DILexicalBlock(scope: !321, file: !2, line: 284, column: 9)
!341 = !DILocation(line: 284, column: 12, scope: !340)
!342 = !DILocation(line: 284, column: 18, scope: !340)
!343 = !DILocation(line: 284, column: 22, scope: !340)
!344 = !DILocation(line: 284, column: 9, scope: !321)
!345 = !DILocation(line: 285, column: 38, scope: !346)
!346 = distinct !DILexicalBlock(scope: !340, file: !2, line: 284, column: 34)
!347 = !DILocation(line: 285, column: 16, scope: !346)
!348 = !DILocation(line: 286, column: 5, scope: !346)
!349 = !DILocation(line: 288, column: 12, scope: !321)
!350 = !DILocation(line: 289, column: 1, scope: !321)
!351 = !DILocation(line: 288, column: 5, scope: !321)
!352 = !DISubprogram(name: "open", linkageName: "open64", scope: !353, file: !353, line: 184, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!353 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!354 = !DISubroutineType(types: !355)
!355 = !{!78, !43, !78, null}
!356 = !DISubprogram(name: "unlink", scope: !228, file: !228, line: 858, type: !357, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DISubroutineType(types: !358)
!358 = !{!78, !43}
!359 = distinct !DISubprogram(name: "ngx_write_chain_to_file", scope: !2, file: !2, line: 293, type: !360, scopeLine: 295, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !431)
!360 = !DISubroutineType(types: !361)
!361 = !{!67, !69, !362, !53, !395}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !71, line: 19, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !365, line: 59, size: 128, elements: !366)
!365 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6333220b53b7706731e71ee9d0416317")
!366 = !{!367, !394}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !364, file: !365, line: 60, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !365, line: 18, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !365, line: 20, size: 640, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !370, file: !365, line: 21, baseType: !46, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !370, file: !365, line: 22, baseType: !46, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !370, file: !365, line: 23, baseType: !53, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !370, file: !365, line: 24, baseType: !53, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !370, file: !365, line: 26, baseType: !46, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !370, file: !365, line: 27, baseType: !46, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !370, file: !365, line: 28, baseType: !379, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !365, line: 16, baseType: !45)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !370, file: !365, line: 29, baseType: !69, size: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !370, file: !365, line: 30, baseType: !368, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !370, file: !365, line: 34, baseType: !99, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !370, file: !365, line: 40, baseType: !99, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !370, file: !365, line: 43, baseType: !99, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !370, file: !365, line: 45, baseType: !99, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !370, file: !365, line: 46, baseType: !99, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !370, file: !365, line: 47, baseType: !99, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !370, file: !365, line: 48, baseType: !99, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !370, file: !365, line: 49, baseType: !99, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !370, file: !365, line: 50, baseType: !99, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !370, file: !365, line: 52, baseType: !99, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !370, file: !365, line: 53, baseType: !99, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !370, file: !365, line: 55, baseType: !78, size: 32, offset: 608)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !365, line: 61, baseType: !362, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !71, line: 18, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !398, line: 57, size: 640, elements: !399)
!398 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!399 = !{!400, !408, !409, !410, !411, !418, !430}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !397, file: !398, line: 58, baseType: !401, size: 256)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !398, line: 54, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 49, size: 256, elements: !403)
!403 = !{!404, !405, !406, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !402, file: !398, line: 50, baseType: !46, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !402, file: !398, line: 51, baseType: !46, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !402, file: !398, line: 52, baseType: !395, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !402, file: !398, line: 53, baseType: !135, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !397, file: !398, line: 59, baseType: !40, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !397, file: !398, line: 60, baseType: !395, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !397, file: !398, line: 61, baseType: !362, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !397, file: !398, line: 62, baseType: !412, size: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !398, line: 41, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !398, line: 43, size: 128, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !414, file: !398, line: 44, baseType: !412, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !414, file: !398, line: 45, baseType: !45, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !397, file: !398, line: 63, baseType: !419, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !398, line: 32, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !398, line: 34, size: 192, elements: !422)
!422 = !{!423, !428, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !421, file: !398, line: 35, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !398, line: 30, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !45}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !421, file: !398, line: 36, baseType: !45, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !398, line: 37, baseType: !419, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !397, file: !398, line: 64, baseType: !129, size: 64, offset: 576)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !453}
!432 = !DILocalVariable(name: "file", arg: 1, scope: !359, file: !2, line: 293, type: !69)
!433 = !DILocalVariable(name: "cl", arg: 2, scope: !359, file: !2, line: 293, type: !362)
!434 = !DILocalVariable(name: "offset", arg: 3, scope: !359, file: !2, line: 293, type: !53)
!435 = !DILocalVariable(name: "pool", arg: 4, scope: !359, file: !2, line: 294, type: !395)
!436 = !DILocalVariable(name: "total", scope: !359, file: !2, line: 296, type: !67)
!437 = !DILocalVariable(name: "n", scope: !359, file: !2, line: 296, type: !67)
!438 = !DILocalVariable(name: "vec", scope: !359, file: !2, line: 297, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_iovec_t", file: !440, line: 69, baseType: !441)
!440 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 64, size: 256, elements: !442)
!442 = !{!443, !450, !451, !452}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "iovs", scope: !441, file: !440, line: 65, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !446, line: 26, size: 128, elements: !447)
!446 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !445, file: !446, line: 28, baseType: !45, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !445, file: !446, line: 29, baseType: !40, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !441, file: !440, line: 66, baseType: !135, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !441, file: !440, line: 67, baseType: !40, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !441, file: !440, line: 68, baseType: !135, size: 64, offset: 192)
!453 = !DILocalVariable(name: "iovs", scope: !359, file: !2, line: 298, type: !454)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 8192, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 64)
!457 = !DILocation(line: 293, column: 37, scope: !359)
!458 = !DILocation(line: 293, column: 56, scope: !359)
!459 = !DILocation(line: 293, column: 66, scope: !359)
!460 = !DILocation(line: 294, column: 17, scope: !359)
!461 = !DILocation(line: 296, column: 5, scope: !359)
!462 = !DILocation(line: 296, column: 20, scope: !359)
!463 = !DILocation(line: 296, column: 27, scope: !359)
!464 = !DILocation(line: 297, column: 5, scope: !359)
!465 = !DILocation(line: 297, column: 20, scope: !359)
!466 = !DILocation(line: 298, column: 5, scope: !359)
!467 = !DILocation(line: 298, column: 20, scope: !359)
!468 = !DILocation(line: 302, column: 9, scope: !469)
!469 = distinct !DILexicalBlock(scope: !359, file: !2, line: 302, column: 9)
!470 = !DILocation(line: 302, column: 13, scope: !469)
!471 = !{!472, !181, i64 8}
!472 = !{!"ngx_chain_s", !181, i64 0, !181, i64 8}
!473 = !DILocation(line: 302, column: 18, scope: !469)
!474 = !DILocation(line: 302, column: 9, scope: !359)
!475 = !DILocation(line: 303, column: 31, scope: !476)
!476 = distinct !DILexicalBlock(scope: !469, file: !2, line: 302, column: 27)
!477 = !DILocation(line: 303, column: 37, scope: !476)
!478 = !DILocation(line: 303, column: 41, scope: !476)
!479 = !{!472, !181, i64 0}
!480 = !DILocation(line: 303, column: 46, scope: !476)
!481 = !{!482, !181, i64 0}
!482 = !{!"ngx_buf_s", !181, i64 0, !181, i64 8, !187, i64 16, !187, i64 24, !181, i64 32, !181, i64 40, !181, i64 48, !181, i64 56, !181, i64 64, !196, i64 72, !196, i64 72, !196, i64 72, !196, i64 72, !196, i64 72, !196, i64 72, !196, i64 72, !196, i64 72, !196, i64 73, !196, i64 73, !196, i64 73, !196, i64 76}
!483 = !DILocation(line: 304, column: 41, scope: !476)
!484 = !DILocation(line: 304, column: 45, scope: !476)
!485 = !DILocation(line: 304, column: 50, scope: !476)
!486 = !{!482, !181, i64 8}
!487 = !DILocation(line: 304, column: 57, scope: !476)
!488 = !DILocation(line: 304, column: 61, scope: !476)
!489 = !DILocation(line: 304, column: 66, scope: !476)
!490 = !DILocation(line: 304, column: 55, scope: !476)
!491 = !DILocation(line: 305, column: 31, scope: !476)
!492 = !DILocation(line: 303, column: 16, scope: !476)
!493 = !DILocation(line: 303, column: 9, scope: !476)
!494 = !DILocation(line: 308, column: 11, scope: !359)
!495 = !DILocation(line: 310, column: 16, scope: !359)
!496 = !DILocation(line: 310, column: 9, scope: !359)
!497 = !DILocation(line: 310, column: 14, scope: !359)
!498 = !{!499, !181, i64 0}
!499 = !{!"", !181, i64 0, !187, i64 8, !187, i64 16, !187, i64 24}
!500 = !DILocation(line: 311, column: 9, scope: !359)
!501 = !DILocation(line: 311, column: 16, scope: !359)
!502 = !{!499, !187, i64 24}
!503 = !DILocation(line: 313, column: 5, scope: !359)
!504 = !DILocation(line: 315, column: 39, scope: !505)
!505 = distinct !DILexicalBlock(scope: !359, file: !2, line: 313, column: 8)
!506 = !DILocation(line: 315, column: 14, scope: !505)
!507 = !DILocation(line: 315, column: 12, scope: !505)
!508 = !DILocation(line: 319, column: 17, scope: !509)
!509 = distinct !DILexicalBlock(scope: !505, file: !2, line: 319, column: 13)
!510 = !{!499, !187, i64 8}
!511 = !DILocation(line: 319, column: 23, scope: !509)
!512 = !DILocation(line: 319, column: 13, scope: !505)
!513 = !DILocation(line: 320, column: 32, scope: !514)
!514 = distinct !DILexicalBlock(scope: !509, file: !2, line: 319, column: 29)
!515 = !DILocation(line: 320, column: 49, scope: !514)
!516 = !DILocation(line: 320, column: 57, scope: !514)
!517 = !{!518, !181, i64 0}
!518 = !{!"iovec", !181, i64 0, !187, i64 8}
!519 = !DILocation(line: 321, column: 32, scope: !514)
!520 = !DILocation(line: 321, column: 40, scope: !514)
!521 = !{!518, !187, i64 8}
!522 = !DILocation(line: 321, column: 49, scope: !514)
!523 = !DILocation(line: 320, column: 17, scope: !514)
!524 = !DILocation(line: 320, column: 15, scope: !514)
!525 = !DILocation(line: 323, column: 17, scope: !526)
!526 = distinct !DILexicalBlock(scope: !514, file: !2, line: 323, column: 17)
!527 = !DILocation(line: 323, column: 19, scope: !526)
!528 = !DILocation(line: 323, column: 17, scope: !514)
!529 = !DILocation(line: 324, column: 24, scope: !530)
!530 = distinct !DILexicalBlock(scope: !526, file: !2, line: 323, column: 33)
!531 = !DILocation(line: 324, column: 17, scope: !530)
!532 = !DILocation(line: 327, column: 20, scope: !514)
!533 = !DILocation(line: 327, column: 28, scope: !514)
!534 = !DILocation(line: 327, column: 26, scope: !514)
!535 = !DILocation(line: 327, column: 13, scope: !514)
!536 = !DILocation(line: 330, column: 29, scope: !505)
!537 = !DILocation(line: 330, column: 41, scope: !505)
!538 = !DILocation(line: 330, column: 13, scope: !505)
!539 = !DILocation(line: 330, column: 11, scope: !505)
!540 = !DILocation(line: 332, column: 13, scope: !541)
!541 = distinct !DILexicalBlock(scope: !505, file: !2, line: 332, column: 13)
!542 = !DILocation(line: 332, column: 15, scope: !541)
!543 = !DILocation(line: 332, column: 13, scope: !505)
!544 = !DILocation(line: 333, column: 20, scope: !545)
!545 = distinct !DILexicalBlock(scope: !541, file: !2, line: 332, column: 29)
!546 = !DILocation(line: 333, column: 13, scope: !545)
!547 = !DILocation(line: 336, column: 19, scope: !505)
!548 = !DILocation(line: 336, column: 16, scope: !505)
!549 = !DILocation(line: 337, column: 18, scope: !505)
!550 = !DILocation(line: 337, column: 15, scope: !505)
!551 = !DILocation(line: 339, column: 5, scope: !505)
!552 = !DILocation(line: 339, column: 14, scope: !359)
!553 = distinct !{!553, !503, !554, !555, !291}
!554 = !DILocation(line: 339, column: 16, scope: !359)
!555 = !{!"llvm.loop.mustprogress"}
!556 = !DILocation(line: 341, column: 12, scope: !359)
!557 = !DILocation(line: 341, column: 5, scope: !359)
!558 = !DILocation(line: 342, column: 1, scope: !359)
!559 = distinct !DISubprogram(name: "ngx_chain_to_iovec", scope: !2, file: !2, line: 346, type: !560, scopeLine: 347, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !563)
!560 = !DISubroutineType(types: !561)
!561 = !{!362, !562, !362}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!563 = !{!564, !565, !566, !567, !568, !569, !570}
!564 = !DILocalVariable(name: "vec", arg: 1, scope: !559, file: !2, line: 346, type: !562)
!565 = !DILocalVariable(name: "cl", arg: 2, scope: !559, file: !2, line: 346, type: !362)
!566 = !DILocalVariable(name: "total", scope: !559, file: !2, line: 348, type: !40)
!567 = !DILocalVariable(name: "size", scope: !559, file: !2, line: 348, type: !40)
!568 = !DILocalVariable(name: "prev", scope: !559, file: !2, line: 349, type: !46)
!569 = !DILocalVariable(name: "n", scope: !559, file: !2, line: 350, type: !135)
!570 = !DILocalVariable(name: "iov", scope: !559, file: !2, line: 351, type: !444)
!571 = !DILocation(line: 346, column: 33, scope: !559)
!572 = !DILocation(line: 346, column: 51, scope: !559)
!573 = !DILocation(line: 348, column: 5, scope: !559)
!574 = !DILocation(line: 348, column: 20, scope: !559)
!575 = !DILocation(line: 348, column: 27, scope: !559)
!576 = !DILocation(line: 349, column: 5, scope: !559)
!577 = !DILocation(line: 349, column: 20, scope: !559)
!578 = !DILocation(line: 350, column: 5, scope: !559)
!579 = !DILocation(line: 350, column: 20, scope: !559)
!580 = !DILocation(line: 351, column: 5, scope: !559)
!581 = !DILocation(line: 351, column: 20, scope: !559)
!582 = !DILocation(line: 353, column: 9, scope: !559)
!583 = !DILocation(line: 354, column: 10, scope: !559)
!584 = !DILocation(line: 355, column: 11, scope: !559)
!585 = !DILocation(line: 356, column: 7, scope: !559)
!586 = !DILocation(line: 358, column: 5, scope: !559)
!587 = !DILocation(line: 358, column: 24, scope: !588)
!588 = distinct !DILexicalBlock(scope: !589, file: !2, line: 358, column: 5)
!589 = distinct !DILexicalBlock(scope: !559, file: !2, line: 358, column: 5)
!590 = !DILocation(line: 358, column: 5, scope: !589)
!591 = !DILocation(line: 360, column: 13, scope: !592)
!592 = distinct !DILexicalBlock(scope: !593, file: !2, line: 360, column: 13)
!593 = distinct !DILexicalBlock(scope: !588, file: !2, line: 358, column: 43)
!594 = !DILocation(line: 360, column: 13, scope: !593)
!595 = !DILocation(line: 361, column: 13, scope: !596)
!596 = distinct !DILexicalBlock(scope: !592, file: !2, line: 360, column: 39)
!597 = !DILocation(line: 364, column: 16, scope: !593)
!598 = !DILocation(line: 364, column: 20, scope: !593)
!599 = !DILocation(line: 364, column: 25, scope: !593)
!600 = !DILocation(line: 364, column: 32, scope: !593)
!601 = !DILocation(line: 364, column: 36, scope: !593)
!602 = !DILocation(line: 364, column: 41, scope: !593)
!603 = !DILocation(line: 364, column: 30, scope: !593)
!604 = !DILocation(line: 364, column: 14, scope: !593)
!605 = !DILocation(line: 366, column: 13, scope: !606)
!606 = distinct !DILexicalBlock(scope: !593, file: !2, line: 366, column: 13)
!607 = !DILocation(line: 366, column: 21, scope: !606)
!608 = !DILocation(line: 366, column: 25, scope: !606)
!609 = !DILocation(line: 366, column: 30, scope: !606)
!610 = !DILocation(line: 366, column: 18, scope: !606)
!611 = !DILocation(line: 366, column: 13, scope: !593)
!612 = !DILocation(line: 367, column: 29, scope: !613)
!613 = distinct !DILexicalBlock(scope: !606, file: !2, line: 366, column: 35)
!614 = !DILocation(line: 367, column: 13, scope: !613)
!615 = !DILocation(line: 367, column: 18, scope: !613)
!616 = !DILocation(line: 367, column: 26, scope: !613)
!617 = !DILocation(line: 369, column: 9, scope: !613)
!618 = !DILocation(line: 370, column: 17, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !2, line: 370, column: 17)
!620 = distinct !DILexicalBlock(scope: !606, file: !2, line: 369, column: 16)
!621 = !DILocation(line: 370, column: 22, scope: !619)
!622 = !DILocation(line: 370, column: 27, scope: !619)
!623 = !DILocation(line: 370, column: 19, scope: !619)
!624 = !DILocation(line: 370, column: 17, scope: !620)
!625 = !DILocation(line: 371, column: 17, scope: !626)
!626 = distinct !DILexicalBlock(scope: !619, file: !2, line: 370, column: 35)
!627 = !DILocation(line: 374, column: 20, scope: !620)
!628 = !DILocation(line: 374, column: 25, scope: !620)
!629 = !DILocation(line: 374, column: 31, scope: !620)
!630 = !DILocation(line: 374, column: 17, scope: !620)
!631 = !DILocation(line: 376, column: 38, scope: !620)
!632 = !DILocation(line: 376, column: 42, scope: !620)
!633 = !DILocation(line: 376, column: 47, scope: !620)
!634 = !DILocation(line: 376, column: 13, scope: !620)
!635 = !DILocation(line: 376, column: 18, scope: !620)
!636 = !DILocation(line: 376, column: 27, scope: !620)
!637 = !DILocation(line: 377, column: 28, scope: !620)
!638 = !DILocation(line: 377, column: 13, scope: !620)
!639 = !DILocation(line: 377, column: 18, scope: !620)
!640 = !DILocation(line: 377, column: 26, scope: !620)
!641 = !DILocation(line: 380, column: 16, scope: !593)
!642 = !DILocation(line: 380, column: 20, scope: !593)
!643 = !DILocation(line: 380, column: 25, scope: !593)
!644 = !DILocation(line: 380, column: 31, scope: !593)
!645 = !DILocation(line: 380, column: 29, scope: !593)
!646 = !DILocation(line: 380, column: 14, scope: !593)
!647 = !DILocation(line: 381, column: 18, scope: !593)
!648 = !DILocation(line: 381, column: 15, scope: !593)
!649 = !DILocation(line: 382, column: 5, scope: !593)
!650 = !DILocation(line: 358, column: 33, scope: !588)
!651 = !DILocation(line: 358, column: 37, scope: !588)
!652 = !DILocation(line: 358, column: 31, scope: !588)
!653 = !DILocation(line: 358, column: 5, scope: !588)
!654 = distinct !{!654, !590, !655, !555, !291}
!655 = !DILocation(line: 382, column: 5, scope: !589)
!656 = !DILocation(line: 384, column: 18, scope: !559)
!657 = !DILocation(line: 384, column: 5, scope: !559)
!658 = !DILocation(line: 384, column: 10, scope: !559)
!659 = !DILocation(line: 384, column: 16, scope: !559)
!660 = !DILocation(line: 385, column: 17, scope: !559)
!661 = !DILocation(line: 385, column: 5, scope: !559)
!662 = !DILocation(line: 385, column: 10, scope: !559)
!663 = !DILocation(line: 385, column: 15, scope: !559)
!664 = !{!499, !187, i64 16}
!665 = !DILocation(line: 387, column: 12, scope: !559)
!666 = !DILocation(line: 388, column: 1, scope: !559)
!667 = !DILocation(line: 387, column: 5, scope: !559)
!668 = distinct !DISubprogram(name: "ngx_writev_file", scope: !2, file: !2, line: 392, type: !669, scopeLine: 393, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{!67, !69, !562, !53}
!671 = !{!672, !673, !674, !675, !676, !677}
!672 = !DILocalVariable(name: "file", arg: 1, scope: !668, file: !2, line: 392, type: !69)
!673 = !DILocalVariable(name: "vec", arg: 2, scope: !668, file: !2, line: 392, type: !562)
!674 = !DILocalVariable(name: "offset", arg: 3, scope: !668, file: !2, line: 392, type: !53)
!675 = !DILocalVariable(name: "n", scope: !668, file: !2, line: 394, type: !67)
!676 = !DILocalVariable(name: "err", scope: !668, file: !2, line: 395, type: !236)
!677 = !DILabel(scope: !668, name: "eintr", file: !2, line: 402)
!678 = !DILocation(line: 392, column: 29, scope: !668)
!679 = !DILocation(line: 392, column: 48, scope: !668)
!680 = !DILocation(line: 392, column: 59, scope: !668)
!681 = !DILocation(line: 394, column: 5, scope: !668)
!682 = !DILocation(line: 394, column: 16, scope: !668)
!683 = !DILocation(line: 395, column: 5, scope: !668)
!684 = !DILocation(line: 395, column: 16, scope: !668)
!685 = !DILocation(line: 402, column: 1, scope: !668)
!686 = !DILocation(line: 404, column: 17, scope: !668)
!687 = !DILocation(line: 404, column: 23, scope: !668)
!688 = !DILocation(line: 404, column: 27, scope: !668)
!689 = !DILocation(line: 404, column: 32, scope: !668)
!690 = !DILocation(line: 404, column: 38, scope: !668)
!691 = !DILocation(line: 404, column: 43, scope: !668)
!692 = !DILocation(line: 404, column: 50, scope: !668)
!693 = !DILocation(line: 404, column: 9, scope: !668)
!694 = !DILocation(line: 404, column: 7, scope: !668)
!695 = !DILocation(line: 406, column: 9, scope: !696)
!696 = distinct !DILexicalBlock(scope: !668, file: !2, line: 406, column: 9)
!697 = !DILocation(line: 406, column: 11, scope: !696)
!698 = !DILocation(line: 406, column: 9, scope: !668)
!699 = !DILocation(line: 407, column: 15, scope: !700)
!700 = distinct !DILexicalBlock(scope: !696, file: !2, line: 406, column: 18)
!701 = !DILocation(line: 407, column: 13, scope: !700)
!702 = !DILocation(line: 409, column: 13, scope: !703)
!703 = distinct !DILexicalBlock(scope: !700, file: !2, line: 409, column: 13)
!704 = !DILocation(line: 409, column: 17, scope: !703)
!705 = !DILocation(line: 409, column: 13, scope: !700)
!706 = !DILocation(line: 412, column: 13, scope: !707)
!707 = distinct !DILexicalBlock(scope: !703, file: !2, line: 409, column: 31)
!708 = !DILocation(line: 415, column: 9, scope: !709)
!709 = distinct !DILexicalBlock(scope: !700, file: !2, line: 415, column: 9)
!710 = !DILocation(line: 415, column: 9, scope: !700)
!711 = !DILocation(line: 417, column: 9, scope: !700)
!712 = !DILocation(line: 420, column: 18, scope: !713)
!713 = distinct !DILexicalBlock(scope: !668, file: !2, line: 420, column: 9)
!714 = !DILocation(line: 420, column: 23, scope: !713)
!715 = !DILocation(line: 420, column: 28, scope: !713)
!716 = !DILocation(line: 420, column: 20, scope: !713)
!717 = !DILocation(line: 420, column: 9, scope: !668)
!718 = !DILocation(line: 421, column: 9, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !2, line: 421, column: 9)
!720 = distinct !DILexicalBlock(scope: !713, file: !2, line: 420, column: 34)
!721 = !DILocation(line: 421, column: 9, scope: !720)
!722 = !DILocation(line: 424, column: 9, scope: !720)
!723 = !DILocation(line: 468, column: 21, scope: !668)
!724 = !DILocation(line: 468, column: 5, scope: !668)
!725 = !DILocation(line: 468, column: 11, scope: !668)
!726 = !DILocation(line: 468, column: 18, scope: !668)
!727 = !DILocation(line: 470, column: 12, scope: !668)
!728 = !DILocation(line: 470, column: 5, scope: !668)
!729 = !DILocation(line: 471, column: 1, scope: !668)
!730 = distinct !DISubprogram(name: "ngx_set_file_time", scope: !2, file: !2, line: 601, type: !731, scopeLine: 602, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !736)
!731 = !DISubroutineType(types: !732)
!732 = !{!733, !46, !76, !156}
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !136, line: 78, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !228, line: 267, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !50, line: 207, baseType: !55)
!736 = !{!737, !738, !739, !740}
!737 = !DILocalVariable(name: "name", arg: 1, scope: !730, file: !2, line: 601, type: !46)
!738 = !DILocalVariable(name: "fd", arg: 2, scope: !730, file: !2, line: 601, type: !76)
!739 = !DILocalVariable(name: "s", arg: 3, scope: !730, file: !2, line: 601, type: !156)
!740 = !DILocalVariable(name: "tv", scope: !730, file: !2, line: 603, type: !741)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 256, elements: !748)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !743, line: 8, size: 128, elements: !744)
!743 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !742, file: !743, line: 14, baseType: !117, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !742, file: !743, line: 15, baseType: !747, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !50, line: 162, baseType: !55)
!748 = !{!749}
!749 = !DISubrange(count: 2)
!750 = !DILocation(line: 601, column: 27, scope: !730)
!751 = !DILocation(line: 601, column: 42, scope: !730)
!752 = !DILocation(line: 601, column: 53, scope: !730)
!753 = !DILocation(line: 603, column: 5, scope: !730)
!754 = !DILocation(line: 603, column: 21, scope: !730)
!755 = !DILocation(line: 605, column: 20, scope: !730)
!756 = !{!757, !187, i64 0}
!757 = !{!"", !187, i64 0, !187, i64 8, !187, i64 16}
!758 = !DILocation(line: 605, column: 5, scope: !730)
!759 = !DILocation(line: 605, column: 11, scope: !730)
!760 = !DILocation(line: 605, column: 18, scope: !730)
!761 = !{!762, !187, i64 0}
!762 = !{!"timeval", !187, i64 0, !187, i64 8}
!763 = !DILocation(line: 606, column: 5, scope: !730)
!764 = !DILocation(line: 606, column: 11, scope: !730)
!765 = !DILocation(line: 606, column: 19, scope: !730)
!766 = !{!762, !187, i64 8}
!767 = !DILocation(line: 607, column: 20, scope: !730)
!768 = !DILocation(line: 607, column: 5, scope: !730)
!769 = !DILocation(line: 607, column: 11, scope: !730)
!770 = !DILocation(line: 607, column: 18, scope: !730)
!771 = !DILocation(line: 608, column: 5, scope: !730)
!772 = !DILocation(line: 608, column: 11, scope: !730)
!773 = !DILocation(line: 608, column: 19, scope: !730)
!774 = !DILocation(line: 610, column: 25, scope: !775)
!775 = distinct !DILexicalBlock(scope: !730, file: !2, line: 610, column: 9)
!776 = !DILocation(line: 610, column: 31, scope: !775)
!777 = !DILocation(line: 610, column: 9, scope: !775)
!778 = !DILocation(line: 610, column: 35, scope: !775)
!779 = !DILocation(line: 610, column: 9, scope: !730)
!780 = !DILocation(line: 611, column: 9, scope: !781)
!781 = distinct !DILexicalBlock(scope: !775, file: !2, line: 610, column: 42)
!782 = !DILocation(line: 614, column: 5, scope: !730)
!783 = !DILocation(line: 615, column: 1, scope: !730)
!784 = !DISubprogram(name: "utimes", scope: !785, file: !785, line: 162, type: !786, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!785 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/time.h", directory: "", checksumkind: CSK_MD5, checksum: "b36e339815f62ba7208e5294180e353c")
!786 = !DISubroutineType(types: !787)
!787 = !{!78, !43, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!790 = distinct !DISubprogram(name: "ngx_create_file_mapping", scope: !2, file: !2, line: 619, type: !791, scopeLine: 620, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !802)
!791 = !DISubroutineType(types: !792)
!792 = !{!733, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_mapping_t", file: !77, line: 27, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 21, size: 320, elements: !796)
!796 = !{!797, !798, !799, !800, !801}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !795, file: !77, line: 22, baseType: !46, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !795, file: !77, line: 23, baseType: !40, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !795, file: !77, line: 24, baseType: !45, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !795, file: !77, line: 25, baseType: !76, size: 32, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !795, file: !77, line: 26, baseType: !129, size: 64, offset: 256)
!802 = !{!803, !804}
!803 = !DILocalVariable(name: "fm", arg: 1, scope: !790, file: !2, line: 619, type: !793)
!804 = !DILabel(scope: !790, name: "failed", file: !2, line: 645)
!805 = !DILocation(line: 619, column: 45, scope: !790)
!806 = !DILocation(line: 621, column: 14, scope: !790)
!807 = !{!808, !181, i64 0}
!808 = !{!"", !181, i64 0, !187, i64 8, !181, i64 16, !196, i64 24, !181, i64 32}
!809 = !DILocation(line: 621, column: 5, scope: !790)
!810 = !DILocation(line: 621, column: 9, scope: !790)
!811 = !DILocation(line: 621, column: 12, scope: !790)
!812 = !{!808, !196, i64 24}
!813 = !DILocation(line: 624, column: 9, scope: !814)
!814 = distinct !DILexicalBlock(scope: !790, file: !2, line: 624, column: 9)
!815 = !DILocation(line: 624, column: 13, scope: !814)
!816 = !DILocation(line: 624, column: 16, scope: !814)
!817 = !DILocation(line: 624, column: 9, scope: !790)
!818 = !DILocation(line: 625, column: 9, scope: !819)
!819 = distinct !DILexicalBlock(scope: !820, file: !2, line: 625, column: 9)
!820 = distinct !DILexicalBlock(scope: !814, file: !2, line: 624, column: 37)
!821 = !{!808, !181, i64 32}
!822 = !DILocation(line: 625, column: 9, scope: !820)
!823 = !DILocation(line: 627, column: 9, scope: !820)
!824 = !DILocation(line: 630, column: 19, scope: !825)
!825 = distinct !DILexicalBlock(scope: !790, file: !2, line: 630, column: 9)
!826 = !DILocation(line: 630, column: 23, scope: !825)
!827 = !DILocation(line: 630, column: 27, scope: !825)
!828 = !DILocation(line: 630, column: 31, scope: !825)
!829 = !{!808, !187, i64 8}
!830 = !DILocation(line: 630, column: 9, scope: !825)
!831 = !DILocation(line: 630, column: 37, scope: !825)
!832 = !DILocation(line: 630, column: 9, scope: !790)
!833 = !DILocation(line: 631, column: 9, scope: !834)
!834 = distinct !DILexicalBlock(scope: !835, file: !2, line: 631, column: 9)
!835 = distinct !DILexicalBlock(scope: !825, file: !2, line: 630, column: 44)
!836 = !DILocation(line: 631, column: 9, scope: !835)
!837 = !DILocation(line: 633, column: 9, scope: !835)
!838 = !DILocation(line: 636, column: 27, scope: !790)
!839 = !DILocation(line: 636, column: 31, scope: !790)
!840 = !DILocation(line: 637, column: 21, scope: !790)
!841 = !DILocation(line: 637, column: 25, scope: !790)
!842 = !DILocation(line: 636, column: 16, scope: !790)
!843 = !DILocation(line: 636, column: 5, scope: !790)
!844 = !DILocation(line: 636, column: 9, scope: !790)
!845 = !DILocation(line: 636, column: 14, scope: !790)
!846 = !{!808, !181, i64 16}
!847 = !DILocation(line: 638, column: 9, scope: !848)
!848 = distinct !DILexicalBlock(scope: !790, file: !2, line: 638, column: 9)
!849 = !DILocation(line: 638, column: 13, scope: !848)
!850 = !DILocation(line: 638, column: 18, scope: !848)
!851 = !DILocation(line: 638, column: 9, scope: !790)
!852 = !DILocation(line: 639, column: 9, scope: !853)
!853 = distinct !DILexicalBlock(scope: !848, file: !2, line: 638, column: 33)
!854 = !DILocation(line: 642, column: 5, scope: !855)
!855 = distinct !DILexicalBlock(scope: !790, file: !2, line: 642, column: 5)
!856 = !DILocation(line: 642, column: 5, scope: !790)
!857 = !DILocation(line: 645, column: 1, scope: !790)
!858 = !DILocation(line: 647, column: 24, scope: !859)
!859 = distinct !DILexicalBlock(scope: !790, file: !2, line: 647, column: 9)
!860 = !DILocation(line: 647, column: 28, scope: !859)
!861 = !DILocation(line: 647, column: 9, scope: !859)
!862 = !DILocation(line: 647, column: 32, scope: !859)
!863 = !DILocation(line: 647, column: 9, scope: !790)
!864 = !DILocation(line: 648, column: 9, scope: !865)
!865 = distinct !DILexicalBlock(scope: !866, file: !2, line: 648, column: 9)
!866 = distinct !DILexicalBlock(scope: !859, file: !2, line: 647, column: 51)
!867 = !DILocation(line: 648, column: 9, scope: !866)
!868 = !DILocation(line: 650, column: 5, scope: !866)
!869 = !DILocation(line: 652, column: 5, scope: !790)
!870 = !DILocation(line: 653, column: 1, scope: !790)
!871 = !DISubprogram(name: "ftruncate", linkageName: "ftruncate64", scope: !228, file: !228, line: 1052, type: !872, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!872 = !DISubroutineType(types: !873)
!873 = !{!78, !78, !54}
!874 = !DISubprogram(name: "mmap", linkageName: "mmap64", scope: !875, file: !875, line: 61, type: !876, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!875 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/mman.h", directory: "", checksumkind: CSK_MD5, checksum: "93a87cc3b0558893646eb0c257165272")
!876 = !DISubroutineType(types: !877)
!877 = !{!45, !45, !40, !78, !78, !78, !54}
!878 = !DISubprogram(name: "close", scope: !228, file: !228, line: 358, type: !879, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!879 = !DISubroutineType(types: !880)
!880 = !{!78, !78}
!881 = distinct !DISubprogram(name: "ngx_close_file_mapping", scope: !2, file: !2, line: 657, type: !882, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !793}
!884 = !{!885}
!885 = !DILocalVariable(name: "fm", arg: 1, scope: !881, file: !2, line: 657, type: !793)
!886 = !DILocation(line: 657, column: 44, scope: !881)
!887 = !DILocation(line: 659, column: 16, scope: !888)
!888 = distinct !DILexicalBlock(scope: !881, file: !2, line: 659, column: 9)
!889 = !DILocation(line: 659, column: 20, scope: !888)
!890 = !DILocation(line: 659, column: 26, scope: !888)
!891 = !DILocation(line: 659, column: 30, scope: !888)
!892 = !DILocation(line: 659, column: 9, scope: !888)
!893 = !DILocation(line: 659, column: 36, scope: !888)
!894 = !DILocation(line: 659, column: 9, scope: !881)
!895 = !DILocation(line: 660, column: 9, scope: !896)
!896 = distinct !DILexicalBlock(scope: !897, file: !2, line: 660, column: 9)
!897 = distinct !DILexicalBlock(scope: !888, file: !2, line: 659, column: 43)
!898 = !DILocation(line: 660, column: 9, scope: !897)
!899 = !DILocation(line: 662, column: 5, scope: !897)
!900 = !DILocation(line: 664, column: 24, scope: !901)
!901 = distinct !DILexicalBlock(scope: !881, file: !2, line: 664, column: 9)
!902 = !DILocation(line: 664, column: 28, scope: !901)
!903 = !DILocation(line: 664, column: 9, scope: !901)
!904 = !DILocation(line: 664, column: 32, scope: !901)
!905 = !DILocation(line: 664, column: 9, scope: !881)
!906 = !DILocation(line: 665, column: 9, scope: !907)
!907 = distinct !DILexicalBlock(scope: !908, file: !2, line: 665, column: 9)
!908 = distinct !DILexicalBlock(scope: !901, file: !2, line: 664, column: 51)
!909 = !DILocation(line: 665, column: 9, scope: !908)
!910 = !DILocation(line: 667, column: 5, scope: !908)
!911 = !DILocation(line: 668, column: 1, scope: !881)
!912 = !DISubprogram(name: "munmap", scope: !875, file: !875, line: 76, type: !913, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!913 = !DISubroutineType(types: !914)
!914 = !{!78, !45, !40}
!915 = distinct !DISubprogram(name: "ngx_open_dir", scope: !2, file: !2, line: 672, type: !916, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !946)
!916 = !DISubroutineType(types: !917)
!917 = !{!733, !918, !919}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_dir_t", file: !77, line: 37, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 30, size: 1344, elements: !922)
!922 = !{!923, !928, !943, !944, !945}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !921, file: !77, line: 31, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !926, line: 127, baseType: !927)
!926 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !926, line: 127, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "de", scope: !921, file: !77, line: 32, baseType: !929, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !931, line: 22, size: 2240, elements: !932)
!931 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "bc8b10a1ddd2747862e3ae7b91dbf464")
!932 = !{!933, !935, !936, !938, !939}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !930, file: !931, line: 28, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !50, line: 149, baseType: !42)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !930, file: !931, line: 29, baseType: !54, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !930, file: !931, line: 31, baseType: !937, size: 16, offset: 128)
!937 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !930, file: !931, line: 32, baseType: !51, size: 8, offset: 144)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !930, file: !931, line: 33, baseType: !940, size: 2048, offset: 152)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 256)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !921, file: !77, line: 33, baseType: !88, size: 1152, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !921, file: !77, line: 35, baseType: !99, size: 8, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !921, file: !77, line: 36, baseType: !99, size: 1, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!946 = !{!947, !948}
!947 = !DILocalVariable(name: "name", arg: 1, scope: !915, file: !2, line: 672, type: !918)
!948 = !DILocalVariable(name: "dir", arg: 2, scope: !915, file: !2, line: 672, type: !919)
!949 = !DILocation(line: 672, column: 25, scope: !915)
!950 = !DILocation(line: 672, column: 42, scope: !915)
!951 = !DILocation(line: 674, column: 39, scope: !915)
!952 = !DILocation(line: 674, column: 45, scope: !915)
!953 = !{!197, !181, i64 8}
!954 = !DILocation(line: 674, column: 16, scope: !915)
!955 = !DILocation(line: 674, column: 5, scope: !915)
!956 = !DILocation(line: 674, column: 10, scope: !915)
!957 = !DILocation(line: 674, column: 14, scope: !915)
!958 = !{!959, !181, i64 0}
!959 = !{!"", !181, i64 0, !181, i64 8, !198, i64 16, !196, i64 160, !196, i64 161}
!960 = !DILocation(line: 676, column: 9, scope: !961)
!961 = distinct !DILexicalBlock(scope: !915, file: !2, line: 676, column: 9)
!962 = !DILocation(line: 676, column: 14, scope: !961)
!963 = !DILocation(line: 676, column: 18, scope: !961)
!964 = !DILocation(line: 676, column: 9, scope: !915)
!965 = !DILocation(line: 677, column: 9, scope: !966)
!966 = distinct !DILexicalBlock(scope: !961, file: !2, line: 676, column: 27)
!967 = !DILocation(line: 680, column: 5, scope: !915)
!968 = !DILocation(line: 680, column: 10, scope: !915)
!969 = !DILocation(line: 680, column: 21, scope: !915)
!970 = !DILocation(line: 682, column: 5, scope: !915)
!971 = !DILocation(line: 683, column: 1, scope: !915)
!972 = !DISubprogram(name: "opendir", scope: !926, file: !926, line: 134, type: !973, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!973 = !DISubroutineType(types: !974)
!974 = !{!924, !43}
!975 = distinct !DISubprogram(name: "ngx_read_dir", scope: !2, file: !2, line: 687, type: !976, scopeLine: 688, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !978)
!976 = !DISubroutineType(types: !977)
!977 = !{!733, !919}
!978 = !{!979}
!979 = !DILocalVariable(name: "dir", arg: 1, scope: !975, file: !2, line: 687, type: !919)
!980 = !DILocation(line: 687, column: 25, scope: !975)
!981 = !DILocation(line: 689, column: 23, scope: !975)
!982 = !DILocation(line: 689, column: 28, scope: !975)
!983 = !DILocation(line: 689, column: 15, scope: !975)
!984 = !DILocation(line: 689, column: 5, scope: !975)
!985 = !DILocation(line: 689, column: 10, scope: !975)
!986 = !DILocation(line: 689, column: 13, scope: !975)
!987 = !{!959, !181, i64 8}
!988 = !DILocation(line: 691, column: 9, scope: !989)
!989 = distinct !DILexicalBlock(scope: !975, file: !2, line: 691, column: 9)
!990 = !DILocation(line: 691, column: 14, scope: !989)
!991 = !DILocation(line: 691, column: 9, scope: !975)
!992 = !DILocation(line: 693, column: 21, scope: !993)
!993 = distinct !DILexicalBlock(scope: !989, file: !2, line: 691, column: 18)
!994 = !DILocation(line: 693, column: 26, scope: !993)
!995 = !DILocation(line: 693, column: 30, scope: !993)
!996 = !{!997, !182, i64 18}
!997 = !{!"dirent", !187, i64 0, !187, i64 8, !998, i64 16, !182, i64 18, !182, i64 19}
!998 = !{!"short", !182, i64 0}
!999 = !DILocation(line: 693, column: 9, scope: !993)
!1000 = !DILocation(line: 693, column: 14, scope: !993)
!1001 = !DILocation(line: 693, column: 19, scope: !993)
!1002 = !DILocation(line: 697, column: 9, scope: !993)
!1003 = !DILocation(line: 700, column: 5, scope: !975)
!1004 = !DILocation(line: 701, column: 1, scope: !975)
!1005 = !DISubprogram(name: "readdir", linkageName: "readdir64", scope: !926, file: !926, line: 165, type: !1006, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!929, !924}
!1008 = distinct !DISubprogram(name: "ngx_open_glob", scope: !2, file: !2, line: 705, type: !1009, scopeLine: 706, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !1046)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!733, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_glob_t", file: !77, line: 46, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 40, size: 832, elements: !1014)
!1014 = !{!1015, !1016, !1043, !1044, !1045}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1013, file: !77, line: 41, baseType: !40, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "pglob", scope: !1013, file: !77, line: 42, baseType: !1017, size: 576, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "glob_t", file: !41, line: 105, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 82, size: 576, elements: !1019)
!1019 = !{!1020, !1022, !1024, !1025, !1026, !1027, !1031, !1035, !1042}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathc", scope: !1018, file: !41, line: 84, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !41, line: 27, baseType: !42)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathv", scope: !1018, file: !41, line: 85, baseType: !1023, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gl_offs", scope: !1018, file: !41, line: 86, baseType: !1021, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "gl_flags", scope: !1018, file: !41, line: 87, baseType: !78, size: 32, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "gl_closedir", scope: !1018, file: !41, line: 91, baseType: !425, size: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gl_readdir", scope: !1018, file: !41, line: 93, baseType: !1028, size: 64, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!929, !45}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "gl_opendir", scope: !1018, file: !41, line: 97, baseType: !1032, size: 64, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!45, !43}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gl_lstat", scope: !1018, file: !41, line: 99, baseType: !1036, size: 64, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!78, !1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!1040 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gl_stat", scope: !1018, file: !41, line: 100, baseType: !1036, size: 64, offset: 512)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !1013, file: !77, line: 43, baseType: !46, size: 64, offset: 640)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !1013, file: !77, line: 44, baseType: !129, size: 64, offset: 704)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !1013, file: !77, line: 45, baseType: !135, size: 64, offset: 768)
!1046 = !{!1047, !1048}
!1047 = !DILocalVariable(name: "gl", arg: 1, scope: !1008, file: !2, line: 705, type: !1011)
!1048 = !DILocalVariable(name: "n", scope: !1008, file: !2, line: 707, type: !78)
!1049 = !DILocation(line: 705, column: 27, scope: !1008)
!1050 = !DILocation(line: 707, column: 5, scope: !1008)
!1051 = !DILocation(line: 707, column: 10, scope: !1008)
!1052 = !DILocation(line: 709, column: 23, scope: !1008)
!1053 = !DILocation(line: 709, column: 27, scope: !1008)
!1054 = !{!1055, !181, i64 80}
!1055 = !{!"", !187, i64 0, !1056, i64 8, !181, i64 80, !181, i64 88, !187, i64 96}
!1056 = !{!"", !187, i64 0, !181, i64 8, !187, i64 16, !196, i64 24, !181, i64 32, !181, i64 40, !181, i64 48, !181, i64 56, !181, i64 64}
!1057 = !DILocation(line: 709, column: 46, scope: !1008)
!1058 = !DILocation(line: 709, column: 50, scope: !1008)
!1059 = !DILocation(line: 709, column: 9, scope: !1008)
!1060 = !DILocation(line: 709, column: 7, scope: !1008)
!1061 = !DILocation(line: 711, column: 9, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 711, column: 9)
!1063 = !DILocation(line: 711, column: 11, scope: !1062)
!1064 = !DILocation(line: 711, column: 9, scope: !1008)
!1065 = !DILocation(line: 712, column: 9, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 711, column: 17)
!1067 = !DILocation(line: 717, column: 9, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 717, column: 9)
!1069 = !DILocation(line: 717, column: 11, scope: !1068)
!1070 = !DILocation(line: 717, column: 27, scope: !1068)
!1071 = !DILocation(line: 717, column: 30, scope: !1068)
!1072 = !DILocation(line: 717, column: 34, scope: !1068)
!1073 = !{!1055, !187, i64 96}
!1074 = !DILocation(line: 717, column: 9, scope: !1008)
!1075 = !DILocation(line: 718, column: 9, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1068, file: !2, line: 717, column: 40)
!1077 = !DILocation(line: 723, column: 5, scope: !1008)
!1078 = !DILocation(line: 724, column: 1, scope: !1008)
!1079 = !DISubprogram(name: "glob", linkageName: "glob64", scope: !41, file: !41, line: 163, type: !1080, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!78, !1039, !78, !1082, !1085}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!78, !43, !78}
!1085 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1086)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1087 = distinct !DISubprogram(name: "ngx_read_glob", scope: !2, file: !2, line: 728, type: !1088, scopeLine: 729, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !1090)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!733, !1011, !918}
!1090 = !{!1091, !1092, !1093}
!1091 = !DILocalVariable(name: "gl", arg: 1, scope: !1087, file: !2, line: 728, type: !1011)
!1092 = !DILocalVariable(name: "name", arg: 2, scope: !1087, file: !2, line: 728, type: !918)
!1093 = !DILocalVariable(name: "count", scope: !1087, file: !2, line: 730, type: !40)
!1094 = !DILocation(line: 728, column: 27, scope: !1087)
!1095 = !DILocation(line: 728, column: 42, scope: !1087)
!1096 = !DILocation(line: 730, column: 5, scope: !1087)
!1097 = !DILocation(line: 730, column: 13, scope: !1087)
!1098 = !DILocation(line: 733, column: 22, scope: !1087)
!1099 = !DILocation(line: 733, column: 26, scope: !1087)
!1100 = !DILocation(line: 733, column: 32, scope: !1087)
!1101 = !{!1055, !187, i64 8}
!1102 = !DILocation(line: 733, column: 11, scope: !1087)
!1103 = !DILocation(line: 738, column: 9, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1087, file: !2, line: 738, column: 9)
!1105 = !DILocation(line: 738, column: 13, scope: !1104)
!1106 = !{!1055, !187, i64 0}
!1107 = !DILocation(line: 738, column: 17, scope: !1104)
!1108 = !DILocation(line: 738, column: 15, scope: !1104)
!1109 = !DILocation(line: 738, column: 9, scope: !1087)
!1110 = !DILocation(line: 740, column: 30, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1104, file: !2, line: 738, column: 24)
!1112 = !{!1055, !181, i64 16}
!1113 = !DILocation(line: 740, column: 9, scope: !1111)
!1114 = !DILocation(line: 740, column: 15, scope: !1111)
!1115 = !DILocation(line: 740, column: 19, scope: !1111)
!1116 = !{!197, !187, i64 0}
!1117 = !DILocation(line: 741, column: 33, scope: !1111)
!1118 = !DILocation(line: 741, column: 37, scope: !1111)
!1119 = !DILocation(line: 741, column: 43, scope: !1111)
!1120 = !DILocation(line: 741, column: 52, scope: !1111)
!1121 = !DILocation(line: 741, column: 56, scope: !1111)
!1122 = !DILocation(line: 741, column: 9, scope: !1111)
!1123 = !DILocation(line: 741, column: 15, scope: !1111)
!1124 = !DILocation(line: 741, column: 20, scope: !1111)
!1125 = !DILocation(line: 742, column: 9, scope: !1111)
!1126 = !DILocation(line: 742, column: 13, scope: !1111)
!1127 = !DILocation(line: 742, column: 14, scope: !1111)
!1128 = !DILocation(line: 744, column: 9, scope: !1111)
!1129 = !DILocation(line: 747, column: 5, scope: !1087)
!1130 = !DILocation(line: 748, column: 1, scope: !1087)
!1131 = !DISubprogram(name: "strlen", scope: !1132, file: !1132, line: 407, type: !1133, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1132 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!42, !43}
!1135 = distinct !DISubprogram(name: "ngx_close_glob", scope: !2, file: !2, line: 752, type: !1136, scopeLine: 753, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !1138)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !1011}
!1138 = !{!1139}
!1139 = !DILocalVariable(name: "gl", arg: 1, scope: !1135, file: !2, line: 752, type: !1011)
!1140 = !DILocation(line: 752, column: 28, scope: !1135)
!1141 = !DILocation(line: 754, column: 15, scope: !1135)
!1142 = !DILocation(line: 754, column: 19, scope: !1135)
!1143 = !DILocation(line: 754, column: 5, scope: !1135)
!1144 = !DILocation(line: 755, column: 1, scope: !1135)
!1145 = !DISubprogram(name: "globfree", linkageName: "globfree64", scope: !41, file: !41, line: 168, type: !1146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null, !1086}
!1148 = distinct !DISubprogram(name: "ngx_trylock_fd", scope: !2, file: !2, line: 759, type: !1149, scopeLine: 760, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !1151)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!236, !76}
!1151 = !{!1152, !1153}
!1152 = !DILocalVariable(name: "fd", arg: 1, scope: !1148, file: !2, line: 759, type: !76)
!1153 = !DILocalVariable(name: "fl", scope: !1148, file: !2, line: 761, type: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flock", file: !1155, line: 35, size: 256, elements: !1156)
!1155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "3ed8466d7581e54a3f782dda83e77be7")
!1156 = !{!1157, !1159, !1160, !1161, !1162}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "l_type", scope: !1154, file: !1155, line: 37, baseType: !1158, size: 16)
!1158 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "l_whence", scope: !1154, file: !1155, line: 38, baseType: !1158, size: 16, offset: 16)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "l_start", scope: !1154, file: !1155, line: 43, baseType: !54, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "l_len", scope: !1154, file: !1155, line: 44, baseType: !54, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "l_pid", scope: !1154, file: !1155, line: 46, baseType: !1163, size: 32, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !50, line: 154, baseType: !78)
!1164 = !DILocation(line: 759, column: 25, scope: !1148)
!1165 = !DILocation(line: 761, column: 5, scope: !1148)
!1166 = !DILocation(line: 761, column: 19, scope: !1148)
!1167 = !DILocation(line: 763, column: 5, scope: !1148)
!1168 = !DILocation(line: 764, column: 8, scope: !1148)
!1169 = !DILocation(line: 764, column: 15, scope: !1148)
!1170 = !{!1171, !998, i64 0}
!1171 = !{!"flock", !998, i64 0, !998, i64 2, !187, i64 8, !187, i64 16, !196, i64 24}
!1172 = !DILocation(line: 765, column: 8, scope: !1148)
!1173 = !DILocation(line: 765, column: 17, scope: !1148)
!1174 = !{!1171, !998, i64 2}
!1175 = !DILocation(line: 767, column: 15, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1148, file: !2, line: 767, column: 9)
!1177 = !DILocation(line: 767, column: 9, scope: !1176)
!1178 = !DILocation(line: 767, column: 33, scope: !1176)
!1179 = !DILocation(line: 767, column: 9, scope: !1148)
!1180 = !DILocation(line: 768, column: 16, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1176, file: !2, line: 767, column: 40)
!1182 = !DILocation(line: 768, column: 9, scope: !1181)
!1183 = !DILocation(line: 771, column: 5, scope: !1148)
!1184 = !DILocation(line: 772, column: 1, scope: !1148)
!1185 = !DISubprogram(name: "fcntl", linkageName: "fcntl64", scope: !353, file: !353, line: 152, type: !1186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!78, !78, !78, null}
!1188 = distinct !DISubprogram(name: "ngx_lock_fd", scope: !2, file: !2, line: 776, type: !1149, scopeLine: 777, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !1189)
!1189 = !{!1190, !1191}
!1190 = !DILocalVariable(name: "fd", arg: 1, scope: !1188, file: !2, line: 776, type: !76)
!1191 = !DILocalVariable(name: "fl", scope: !1188, file: !2, line: 778, type: !1154)
!1192 = !DILocation(line: 776, column: 22, scope: !1188)
!1193 = !DILocation(line: 778, column: 5, scope: !1188)
!1194 = !DILocation(line: 778, column: 19, scope: !1188)
!1195 = !DILocation(line: 780, column: 5, scope: !1188)
!1196 = !DILocation(line: 781, column: 8, scope: !1188)
!1197 = !DILocation(line: 781, column: 15, scope: !1188)
!1198 = !DILocation(line: 782, column: 8, scope: !1188)
!1199 = !DILocation(line: 782, column: 17, scope: !1188)
!1200 = !DILocation(line: 784, column: 15, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1188, file: !2, line: 784, column: 9)
!1202 = !DILocation(line: 784, column: 9, scope: !1201)
!1203 = !DILocation(line: 784, column: 34, scope: !1201)
!1204 = !DILocation(line: 784, column: 9, scope: !1188)
!1205 = !DILocation(line: 785, column: 16, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1201, file: !2, line: 784, column: 41)
!1207 = !DILocation(line: 785, column: 9, scope: !1206)
!1208 = !DILocation(line: 788, column: 5, scope: !1188)
!1209 = !DILocation(line: 789, column: 1, scope: !1188)
!1210 = distinct !DISubprogram(name: "ngx_unlock_fd", scope: !2, file: !2, line: 793, type: !1149, scopeLine: 794, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !1211)
!1211 = !{!1212, !1213}
!1212 = !DILocalVariable(name: "fd", arg: 1, scope: !1210, file: !2, line: 793, type: !76)
!1213 = !DILocalVariable(name: "fl", scope: !1210, file: !2, line: 795, type: !1154)
!1214 = !DILocation(line: 793, column: 24, scope: !1210)
!1215 = !DILocation(line: 795, column: 5, scope: !1210)
!1216 = !DILocation(line: 795, column: 19, scope: !1210)
!1217 = !DILocation(line: 797, column: 5, scope: !1210)
!1218 = !DILocation(line: 798, column: 8, scope: !1210)
!1219 = !DILocation(line: 798, column: 15, scope: !1210)
!1220 = !DILocation(line: 799, column: 8, scope: !1210)
!1221 = !DILocation(line: 799, column: 17, scope: !1210)
!1222 = !DILocation(line: 801, column: 15, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1210, file: !2, line: 801, column: 9)
!1224 = !DILocation(line: 801, column: 9, scope: !1223)
!1225 = !DILocation(line: 801, column: 33, scope: !1223)
!1226 = !DILocation(line: 801, column: 9, scope: !1210)
!1227 = !DILocation(line: 802, column: 17, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1223, file: !2, line: 801, column: 40)
!1229 = !DILocation(line: 802, column: 9, scope: !1228)
!1230 = !DILocation(line: 805, column: 5, scope: !1210)
!1231 = !DILocation(line: 806, column: 1, scope: !1210)
!1232 = distinct !DISubprogram(name: "ngx_read_ahead", scope: !2, file: !2, line: 812, type: !1233, scopeLine: 813, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !1235)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!733, !76, !40}
!1235 = !{!1236, !1237, !1238}
!1236 = !DILocalVariable(name: "fd", arg: 1, scope: !1232, file: !2, line: 812, type: !76)
!1237 = !DILocalVariable(name: "n", arg: 2, scope: !1232, file: !2, line: 812, type: !40)
!1238 = !DILocalVariable(name: "err", scope: !1232, file: !2, line: 814, type: !78)
!1239 = !DILocation(line: 812, column: 25, scope: !1232)
!1240 = !DILocation(line: 812, column: 36, scope: !1232)
!1241 = !DILocation(line: 814, column: 5, scope: !1232)
!1242 = !DILocation(line: 814, column: 10, scope: !1232)
!1243 = !DILocation(line: 816, column: 25, scope: !1232)
!1244 = !DILocation(line: 816, column: 11, scope: !1232)
!1245 = !DILocation(line: 816, column: 9, scope: !1232)
!1246 = !DILocation(line: 818, column: 9, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1232, file: !2, line: 818, column: 9)
!1248 = !DILocation(line: 818, column: 13, scope: !1247)
!1249 = !DILocation(line: 818, column: 9, scope: !1232)
!1250 = !DILocation(line: 819, column: 9, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1247, file: !2, line: 818, column: 19)
!1252 = !DILocation(line: 822, column: 5, scope: !1232)
!1253 = !DILocation(line: 823, column: 5, scope: !1232)
!1254 = !DILocation(line: 824, column: 1, scope: !1232)
!1255 = !DISubprogram(name: "posix_fadvise", linkageName: "posix_fadvise64", scope: !353, file: !353, line: 277, type: !1256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!78, !78, !54, !54, !78}
!1258 = distinct !DISubprogram(name: "ngx_directio_on", scope: !2, file: !2, line: 832, type: !1259, scopeLine: 833, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !1261)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!733, !76}
!1261 = !{!1262, !1263}
!1262 = !DILocalVariable(name: "fd", arg: 1, scope: !1258, file: !2, line: 832, type: !76)
!1263 = !DILocalVariable(name: "flags", scope: !1258, file: !2, line: 834, type: !78)
!1264 = !DILocation(line: 832, column: 26, scope: !1258)
!1265 = !DILocation(line: 834, column: 5, scope: !1258)
!1266 = !DILocation(line: 834, column: 10, scope: !1258)
!1267 = !DILocation(line: 836, column: 19, scope: !1258)
!1268 = !DILocation(line: 836, column: 13, scope: !1258)
!1269 = !DILocation(line: 836, column: 11, scope: !1258)
!1270 = !DILocation(line: 838, column: 9, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1258, file: !2, line: 838, column: 9)
!1272 = !DILocation(line: 838, column: 15, scope: !1271)
!1273 = !DILocation(line: 838, column: 9, scope: !1258)
!1274 = !DILocation(line: 839, column: 9, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1271, file: !2, line: 838, column: 22)
!1276 = !DILocation(line: 842, column: 18, scope: !1258)
!1277 = !DILocation(line: 842, column: 31, scope: !1258)
!1278 = !DILocation(line: 842, column: 37, scope: !1258)
!1279 = !DILocation(line: 842, column: 12, scope: !1258)
!1280 = !DILocation(line: 842, column: 5, scope: !1258)
!1281 = !DILocation(line: 843, column: 1, scope: !1258)
!1282 = distinct !DISubprogram(name: "ngx_directio_off", scope: !2, file: !2, line: 847, type: !1259, scopeLine: 848, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !1283)
!1283 = !{!1284, !1285}
!1284 = !DILocalVariable(name: "fd", arg: 1, scope: !1282, file: !2, line: 847, type: !76)
!1285 = !DILocalVariable(name: "flags", scope: !1282, file: !2, line: 849, type: !78)
!1286 = !DILocation(line: 847, column: 27, scope: !1282)
!1287 = !DILocation(line: 849, column: 5, scope: !1282)
!1288 = !DILocation(line: 849, column: 10, scope: !1282)
!1289 = !DILocation(line: 851, column: 19, scope: !1282)
!1290 = !DILocation(line: 851, column: 13, scope: !1282)
!1291 = !DILocation(line: 851, column: 11, scope: !1282)
!1292 = !DILocation(line: 853, column: 9, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1282, file: !2, line: 853, column: 9)
!1294 = !DILocation(line: 853, column: 15, scope: !1293)
!1295 = !DILocation(line: 853, column: 9, scope: !1282)
!1296 = !DILocation(line: 854, column: 9, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1293, file: !2, line: 853, column: 22)
!1298 = !DILocation(line: 857, column: 18, scope: !1282)
!1299 = !DILocation(line: 857, column: 31, scope: !1282)
!1300 = !DILocation(line: 857, column: 37, scope: !1282)
!1301 = !DILocation(line: 857, column: 12, scope: !1282)
!1302 = !DILocation(line: 857, column: 5, scope: !1282)
!1303 = !DILocation(line: 858, column: 1, scope: !1282)
!1304 = distinct !DISubprogram(name: "ngx_fs_bsize", scope: !2, file: !2, line: 866, type: !1305, scopeLine: 867, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !1307)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!40, !46}
!1307 = !{!1308, !1309}
!1308 = !DILocalVariable(name: "name", arg: 1, scope: !1304, file: !2, line: 866, type: !46)
!1309 = !DILocalVariable(name: "fs", scope: !1304, file: !2, line: 868, type: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !1311, line: 24, size: 960, elements: !1312)
!1311 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/statfs.h", directory: "", checksumkind: CSK_MD5, checksum: "4c379ce582232e44e7b8fa7ccdecac58")
!1312 = !{!1313, !1315, !1316, !1318, !1319, !1320, !1322, !1323, !1329, !1330, !1331, !1332}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !1310, file: !1311, line: 26, baseType: !1314, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !50, line: 192, baseType: !55)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !1310, file: !1311, line: 27, baseType: !1314, size: 64, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !1310, file: !1311, line: 35, baseType: !1317, size: 64, offset: 128)
