; ModuleID = 'samples/676.bc'
source_filename = "topology-linux.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.hwloc_disc_component = type { ptr, i32, i32, ptr, i32, i32, ptr }
%struct.hwloc_component = type { i32, ptr, ptr, i32, i64, ptr }
%struct.cpu_set_t = type { [16 x i64] }
%struct.hwloc_topology = type { i32, i32, i32, ptr, ptr, i64, [20 x i32], [20 x i32], i32, i32, i32, i32, ptr, i64, ptr, i64, [6 x %struct.hwloc_special_level_s], ptr, ptr, %struct.hwloc_binding_hooks, %struct.hwloc_topology_support, ptr, ptr, i32, ptr, ptr, i32, i32, ptr, i32, i32, ptr, i32, i32, i32, [5 x float], i32, ptr, ptr, i32, i32, ptr, %struct.hwloc_numanode_attr_s, i32, i32, ptr, i64, i32, ptr, ptr, ptr }
%struct.hwloc_special_level_s = type { i32, ptr, ptr, ptr }
%struct.hwloc_binding_hooks = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.hwloc_topology_support = type { ptr, ptr, ptr, ptr }
%struct.hwloc_numanode_attr_s = type { i64, i32, ptr }
%struct.hwloc_obj = type { i32, ptr, i32, ptr, i64, ptr, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, i32, ptr, ptr, ptr, i32, i32, ptr, i32, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, i64 }
%struct.hwloc_topology_membind_support = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

!261 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!262 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!263 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!264 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!265 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!266 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!267 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!268 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!269 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!270 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!271 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!272 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!273 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!274 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!275 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!276 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!277 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!278 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!279 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!280 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!281 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!282 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!283 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!284 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!285 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!286 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!287 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!288 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!289 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!290 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!291 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!292 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!293 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!294 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!295 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!296 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!297 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!298 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!299 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!300 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!301 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!302 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!303 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!304 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!305 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!306 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!307 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!308 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!309 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!310 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!311 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!312 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!313 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!314 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!315 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!316 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!317 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!318 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!319 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!320 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!321 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!322 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!323 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!324 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!325 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!326 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!327 = !DIEnumerator(name: "_SC_MINSIGSTKSZ", value: 249)
!328 = !DIEnumerator(name: "_SC_SIGSTKSZ", value: 250)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 1155, baseType: !34, size: 32, elements: !330)
!330 = !{!331, !332, !333, !334}
!331 = !DIEnumerator(name: "HWLOC_CPUBIND_PROCESS", value: 1)
!332 = !DIEnumerator(name: "HWLOC_CPUBIND_THREAD", value: 2)
!333 = !DIEnumerator(name: "HWLOC_CPUBIND_STRICT", value: 4)
!334 = !DIEnumerator(name: "HWLOC_CPUBIND_NOMEMBIND", value: 8)
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 1461, baseType: !34, size: 32, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342}
!337 = !DIEnumerator(name: "HWLOC_MEMBIND_PROCESS", value: 1)
!338 = !DIEnumerator(name: "HWLOC_MEMBIND_THREAD", value: 2)
!339 = !DIEnumerator(name: "HWLOC_MEMBIND_STRICT", value: 4)
!340 = !DIEnumerator(name: "HWLOC_MEMBIND_MIGRATE", value: 8)
!341 = !DIEnumerator(name: "HWLOC_MEMBIND_NOCPUBIND", value: 16)
!342 = !DIEnumerator(name: "HWLOC_MEMBIND_BYNODESET", value: 32)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_linux_cgroup_type_e", file: !2, line: 2213, baseType: !34, size: 32, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIEnumerator(name: "HWLOC_LINUX_CGROUP2", value: 0)
!346 = !DIEnumerator(name: "HWLOC_LINUX_CGROUP1", value: 1)
!347 = !DIEnumerator(name: "HWLOC_LINUX_CPUSET", value: 2)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !349, file: !2, line: 49, baseType: !34, size: 32, elements: !378)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_linux_backend_data_s", file: !2, line: 41, size: 3584, elements: !350)
!350 = !{!351, !353, !354, !355, !357, !358, !359, !360, !361, !362, !363, !376, !377}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "root_path", scope: !349, file: !2, line: 42, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "root_fd", scope: !349, file: !2, line: 43, baseType: !81, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "is_real_fsroot", scope: !349, file: !2, line: 44, baseType: !81, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dumped_hwdata_dirname", scope: !349, file: !2, line: 48, baseType: !356, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !349, file: !2, line: 56, baseType: !348, size: 32, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "is_knl", scope: !349, file: !2, line: 57, baseType: !81, size: 32, offset: 224)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "is_amd_with_CU", scope: !349, file: !2, line: 58, baseType: !81, size: 32, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "use_numa_distances", scope: !349, file: !2, line: 59, baseType: !81, size: 32, offset: 288)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "use_numa_distances_for_cpuless", scope: !349, file: !2, line: 60, baseType: !81, size: 32, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "use_numa_initiators", scope: !349, file: !2, line: 61, baseType: !81, size: 32, offset: 352)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "utsname", scope: !349, file: !2, line: 62, baseType: !364, size: 3120, offset: 384)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !365, line: 48, size: 3120, elements: !366)
!365 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/utsname.h", directory: "", checksumkind: CSK_MD5, checksum: "025e6c1b1c47580289242d1d03561cee")
!366 = !{!367, !371, !372, !373, !374, !375}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !364, file: !365, line: 51, baseType: !368, size: 520)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 65)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !364, file: !365, line: 54, baseType: !368, size: 520, offset: 520)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !364, file: !365, line: 57, baseType: !368, size: 520, offset: 1040)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !364, file: !365, line: 59, baseType: !368, size: 520, offset: 1560)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !364, file: !365, line: 62, baseType: !368, size: 520, offset: 2080)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !364, file: !365, line: 67, baseType: !368, size: 520, offset: 2600)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fallback_nbprocessors", scope: !349, file: !2, line: 63, baseType: !81, size: 32, offset: 3520)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pagesize", scope: !349, file: !2, line: 64, baseType: !34, size: 32, offset: 3552)
!378 = !{!379, !380, !381, !382, !383, !384}
!379 = !DIEnumerator(name: "HWLOC_LINUX_ARCH_X86", value: 0)
!380 = !DIEnumerator(name: "HWLOC_LINUX_ARCH_IA64", value: 1)
!381 = !DIEnumerator(name: "HWLOC_LINUX_ARCH_ARM", value: 2)
!382 = !DIEnumerator(name: "HWLOC_LINUX_ARCH_POWER", value: 3)
!383 = !DIEnumerator(name: "HWLOC_LINUX_ARCH_S390", value: 4)
!384 = !DIEnumerator(name: "HWLOC_LINUX_ARCH_UNKNOWN", value: 5)
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_disc_status_flag_e", file: !95, line: 146, baseType: !34, size: 32, elements: !386)
!386 = !{!387}
!387 = !DIEnumerator(name: "HWLOC_DISC_STATUS_FLAG_GOT_ALLOWED_RESOURCES", value: 2)
!388 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_topology_flags_e", file: !33, line: 1914, baseType: !34, size: 32, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399}
!390 = !DIEnumerator(name: "HWLOC_TOPOLOGY_FLAG_INCLUDE_DISALLOWED", value: 1)
!391 = !DIEnumerator(name: "HWLOC_TOPOLOGY_FLAG_IS_THISSYSTEM", value: 2)
!392 = !DIEnumerator(name: "HWLOC_TOPOLOGY_FLAG_THISSYSTEM_ALLOWED_RESOURCES", value: 4)
!393 = !DIEnumerator(name: "HWLOC_TOPOLOGY_FLAG_IMPORT_SUPPORT", value: 8)
!394 = !DIEnumerator(name: "HWLOC_TOPOLOGY_FLAG_RESTRICT_TO_CPUBINDING", value: 16)
!395 = !DIEnumerator(name: "HWLOC_TOPOLOGY_FLAG_RESTRICT_TO_MEMBINDING", value: 32)
!396 = !DIEnumerator(name: "HWLOC_TOPOLOGY_FLAG_DONT_CHANGE_BINDING", value: 64)
!397 = !DIEnumerator(name: "HWLOC_TOPOLOGY_FLAG_NO_DISTANCES", value: 128)
!398 = !DIEnumerator(name: "HWLOC_TOPOLOGY_FLAG_NO_MEMATTRS", value: 256)
!399 = !DIEnumerator(name: "HWLOC_TOPOLOGY_FLAG_NO_CPUKINDS", value: 512)
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_get_type_depth_e", file: !33, line: 821, baseType: !81, size: 32, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409}
!402 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_UNKNOWN", value: -1)
!403 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_MULTIPLE", value: -2)
!404 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_NUMANODE", value: -3)
!405 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_BRIDGE", value: -4)
!406 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_PCI_DEVICE", value: -5)
!407 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_OS_DEVICE", value: -6)
!408 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_MISC", value: -7)
!409 = !DIEnumerator(name: "HWLOC_TYPE_DEPTH_MEMCACHE", value: -8)
!410 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_distances_kind_e", file: !411, line: 79, baseType: !34, size: 32, elements: !412)
!411 = !DIFile(filename: "include/hwloc/distances.h", directory: "/local-ssd/hwloc-ubziofckttpgdspp6a5dagjy5yrjyncp-build/aidengro/spack-stage-hwloc-2.9.1-ubziofckttpgdspp6a5dagjy5yrjyncp/spack-src", checksumkind: CSK_MD5, checksum: "863dd20681acdca3d698acf4037fd048")
!412 = !{!413, !414, !415, !416, !417}
!413 = !DIEnumerator(name: "HWLOC_DISTANCES_KIND_FROM_OS", value: 1)
!414 = !DIEnumerator(name: "HWLOC_DISTANCES_KIND_FROM_USER", value: 2)
!415 = !DIEnumerator(name: "HWLOC_DISTANCES_KIND_MEANS_LATENCY", value: 4)
!416 = !DIEnumerator(name: "HWLOC_DISTANCES_KIND_MEANS_BANDWIDTH", value: 8)
!417 = !DIEnumerator(name: "HWLOC_DISTANCES_KIND_HETEROGENEOUS_TYPES", value: 16)
!418 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_distances_add_flag_e", file: !411, line: 387, baseType: !34, size: 32, elements: !419)
!419 = !{!420, !421}
!420 = !DIEnumerator(name: "HWLOC_DISTANCES_ADD_FLAG_GROUP", value: 1)
!421 = !DIEnumerator(name: "HWLOC_DISTANCES_ADD_FLAG_GROUP_INACCURATE", value: 2)
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hwloc_memattr_id_e", file: !90, line: 69, baseType: !34, size: 32, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432}
!424 = !DIEnumerator(name: "HWLOC_MEMATTR_ID_CAPACITY", value: 0)
!425 = !DIEnumerator(name: "HWLOC_MEMATTR_ID_LOCALITY", value: 1)
!426 = !DIEnumerator(name: "HWLOC_MEMATTR_ID_BANDWIDTH", value: 2)
!427 = !DIEnumerator(name: "HWLOC_MEMATTR_ID_READ_BANDWIDTH", value: 4)
!428 = !DIEnumerator(name: "HWLOC_MEMATTR_ID_WRITE_BANDWIDTH", value: 5)
!429 = !DIEnumerator(name: "HWLOC_MEMATTR_ID_LATENCY", value: 3)
!430 = !DIEnumerator(name: "HWLOC_MEMATTR_ID_READ_LATENCY", value: 6)
!431 = !DIEnumerator(name: "HWLOC_MEMATTR_ID_WRITE_LATENCY", value: 7)
!432 = !DIEnumerator(name: "HWLOC_MEMATTR_ID_MAX", value: 8)
!433 = !{!34, !434, !437, !438, !436, !440, !441, !81, !443, !444, !352, !448, !450, !451, !452, !453, !457, !458}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__cpu_mask", file: !435, line: 32, baseType: !436)
!435 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/cpu-set.h", directory: "", checksumkind: CSK_MD5, checksum: "9b78eb5e247ecb71c5de90bcf65db505")
!436 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !442, line: 70, baseType: !436)
!442 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_bitmap_t", file: !445, line: 68, baseType: !446)
!445 = !DIFile(filename: "include/hwloc/bitmap.h", directory: "/local-ssd/hwloc-ubziofckttpgdspp6a5dagjy5yrjyncp-build/aidengro/spack-stage-hwloc-2.9.1-ubziofckttpgdspp6a5dagjy5yrjyncp/spack-src", checksumkind: CSK_MD5, checksum: "d0456df9b7335ef555b3fd609c469e99")
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_bitmap_s", file: !445, line: 68, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !449, line: 90, baseType: !436)
!449 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!450 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!451 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_obj_type_t", file: !33, line: 323, baseType: !32)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !454, line: 27, baseType: !455)
!454 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !456, line: 45, baseType: !436)
!456 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!457 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_uint64_t", file: !459, line: 226, baseType: !453)
!459 = !DIFile(filename: "include/hwloc/autogen/config.h", directory: "/local-ssd/hwloc-ubziofckttpgdspp6a5dagjy5yrjyncp-build/aidengro/spack-stage-hwloc-2.9.1-ubziofckttpgdspp6a5dagjy5yrjyncp/spack-src", checksumkind: CSK_MD5, checksum: "68cf5a9972c29b6ae535354edab6995a")
!460 = !{!0, !7, !12, !18, !23, !461, !479, !510, !512, !514, !1012, !1017, !1022, !1025, !1030, !1035, !1040, !1045, !1050, !1067, !1070, !1083, !1085, !1090, !1108, !1113, !1115, !1120, !1123, !1125, !1127, !1129, !1131, !1136, !1138, !1143, !1148, !1150, !1155, !1160, !1162, !1167, !1169, !1171, !1176, !1181, !1183, !1188, !1190, !1195, !1197, !1199, !1201, !1203, !1205, !1207, !1212, !1217, !1219, !1221, !1223, !1225, !1227, !1232, !28, !1235, !1237, !1242, !1244, !1249, !1254, !1256, !1258, !1263, !1265, !1270, !1272, !1274, !1276, !1278, !1280, !1282, !1284, !1286, !1288, !1290, !1292, !1294, !1296, !1301, !1306, !1308, !1313, !1318, !1323, !1328, !1330, !1332, !1337, !1339, !1344, !1346, !1348, !1350, !1352, !1354, !1356, !1361, !1363, !1368, !1370, !1372, !1374, !1376, !1378, !1380, !1382, !1384, !1386, !1388, !1390, !1392, !1394, !1396, !1398, !1400, !1402, !1407, !1409, !1411, !1413, !1418, !1420, !1422, !1424, !1426, !1428, !1430, !1432, !1434, !1436, !1438, !1440, !1442, !1444, !1446, !1448, !1450, !1452, !1454, !1456, !1458, !1460, !1462, !1464, !1466, !1468, !1470, !1472, !1474, !1476, !1478, !1480, !1482, !1484, !1486, !1488, !1490, !1492, !1494, !1496, !1498, !1500, !1502, !1504, !1506, !1508, !1510, !1515, !1517, !1519, !1521, !1526, !1528, !1533, !1535, !1537, !1542, !1544, !1549, !1551, !1553, !1558, !1560, !1562, !1567, !1569, !1571, !1573, !1575, !1577, !1579, !1581, !1584, !1589, !1591, !1593, !1595, !1597, !1599, !1601, !1603, !1605, !1607, !1609, !1611, !1613, !1615, !1617, !1619, !1621, !1623, !1625, !1627, !1629, !1631, !1636, !1638, !1643, !1645, !1647, !1652, !1657, !1659, !1661, !1663, !1665, !1670, !1672, !1674, !1679, !1681, !1683, !1685, !1687, !1689, !1691, !1693, !1698, !1700, !1703, !1705, !1710, !1712, !1714, !1716, !1718, !1720, !1722, !1724, !1729, !1731, !1733, !1735, !1737, !1739, !1744, !1749, !1754, !1756, !1758, !1760, !1762, !1767, !1769, !1771, !1773, !1775, !1777, !1779, !1781, !1783, !1785, !1787, !1789, !1794, !1796, !1798, !1800, !1802, !1807, !1809, !1811, !1813, !1815, !1817, !1819, !1821, !1823, !1825, !1827, !1829, !1831, !1833, !1835, !1837, !1839, !1841, !1846, !1848, !1850, !1852, !1854, !1856, !1858, !1860, !1865, !1867, !1872, !1874, !1876, !1878, !1883, !1885, !1890, !1895, !1900, !1905, !1910, !1915, !1917, !1919, !1921, !1923, !1925, !1927, !1929, !1931, !1933, !1935, !1937, !1939, !1941, !1943, !1945, !1947, !1949, !1951, !1953, !1955, !1957, !1959, !1961, !1963, !1965, !1967, !1969, !1971, !1973, !1975, !1977, !1979, !1981, !1983, !1985, !1987, !1989, !1991, !1993, !1998, !2000, !2002, !2004, !2006, !2008, !2010, !2012, !2014, !2016, !2018, !2020, !2022, !2024, !2029, !2031, !2036, !2038, !2040, !2042, !2044, !2046, !2048, !2050, !2052, !2054, !2056, !2058, !2060, !2062, !2064, !2066, !2068, !2070, !2072, !2074, !2076, !2078, !2080, !2082, !2084, !2086, !2088, !2090, !2092, !2094, !2096, !2098, !2100, !2102, !2104, !2106, !2108, !2110, !2112, !2114, !2116, !2118, !2120, !2122, !2124, !2126, !2191, !2196, !2198, !2203, !2205, !2207, !2209, !2211, !2213, !2215, !2218, !2220, !2222, !2224, !2226, !2228, !2230, !2232, !2234, !2236, !2238, !2240, !2242, !2244, !2246, !2248, !2250, !2252, !2254, !2256, !2258, !2260, !2262, !2264, !2266, !2268, !2270, !2272, !2274, !2276, !2278, !2280, !2282, !2284, !2286, !2288, !2290, !2292, !2294, !2296, !2298, !2300, !2302, !2304, !2306, !2308, !2310, !2312, !2314, !2316, !2318, !2320, !2322, !2324, !2326, !2328, !2330, !2332, !2334, !2336, !2338, !2340, !2342, !2344, !2346, !2348, !2350, !2352, !2354, !2356, !2358, !2360, !2362, !2364, !2366, !2368, !2370, !2372, !2374, !2376, !2378, !2380, !2382, !2384, !2386, !2388, !2390, !2392, !2394, !2396, !2398, !2400, !2402, !2404, !2406, !2408, !2410, !2412, !2414, !2416, !2418, !2420, !2422, !2424, !2426, !2428, !2430, !2432, !2434, !2436, !2438, !2440, !2442, !2444, !2446, !2448, !2450, !2452, !2454, !2456, !2458, !2460, !2462, !2464, !2466, !2468, !2470, !2472, !2474, !2476, !2478, !2480, !2482, !2484, !2486, !2488, !2490}
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "hwloc_linux_component", scope: !30, file: !2, line: 7283, type: !463, isLocal: false, isDefinition: true)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_component", file: !95, line: 270, size: 384, elements: !465)
!465 = !{!466, !467, !471, !475, !477, !478}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "abi", scope: !464, file: !95, line: 272, baseType: !34, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !464, file: !95, line: 291, baseType: !468, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!81, !436}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !464, file: !95, line: 304, baseType: !472, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !436}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !464, file: !95, line: 307, baseType: !476, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_component_type_t", file: !95, line: 263, baseType: !105)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !464, file: !95, line: 310, baseType: !436, size: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !464, file: !95, line: 313, baseType: !440, size: 64, offset: 320)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "_filesize", scope: !481, file: !2, line: 637, type: !441, isLocal: true, isDefinition: true)
!481 = distinct !DISubprogram(name: "hwloc__read_path_as_cpumask", scope: !2, file: !2, line: 635, type: !482, scopeLine: 636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !30, retainedNodes: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{!81, !356, !444, !81}
!484 = !{!485, !486, !487, !488, !489, !491, !492, !493, !494, !495, !496, !497, !498, !499, !503, !507, !508, !509}
!485 = !DILocalVariable(name: "path", arg: 1, scope: !481, file: !2, line: 635, type: !356)
!486 = !DILocalVariable(name: "set", arg: 2, scope: !481, file: !2, line: 635, type: !444)
!487 = !DILocalVariable(name: "fsroot_fd", arg: 3, scope: !481, file: !2, line: 635, type: !81)
!488 = !DILocalVariable(name: "filesize", scope: !481, file: !2, line: 638, type: !441)
!489 = !DILocalVariable(name: "maps", scope: !481, file: !2, line: 639, type: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!491 = !DILocalVariable(name: "map", scope: !481, file: !2, line: 640, type: !436)
!492 = !DILocalVariable(name: "nr_maps", scope: !481, file: !2, line: 641, type: !81)
!493 = !DILocalVariable(name: "nr_maps_allocated", scope: !481, file: !2, line: 645, type: !81)
!494 = !DILocalVariable(name: "buffer", scope: !481, file: !2, line: 646, type: !352)
!495 = !DILocalVariable(name: "tmpbuf", scope: !481, file: !2, line: 646, type: !352)
!496 = !DILocalVariable(name: "fd", scope: !481, file: !2, line: 647, type: !81)
!497 = !DILocalVariable(name: "err", scope: !481, file: !2, line: 647, type: !81)
!498 = !DILocalVariable(name: "i", scope: !481, file: !2, line: 648, type: !81)
!499 = !DILocalVariable(name: "tmp", scope: !500, file: !2, line: 686, type: !490)
!500 = distinct !DILexicalBlock(scope: !501, file: !2, line: 685, column: 39)
!501 = distinct !DILexicalBlock(scope: !502, file: !2, line: 685, column: 9)
!502 = distinct !DILexicalBlock(scope: !481, file: !2, line: 683, column: 44)
!503 = !DILocalVariable(name: "mask", scope: !504, file: !2, line: 715, type: !436)
!504 = distinct !DILexicalBlock(scope: !505, file: !2, line: 714, column: 34)
!505 = distinct !DILexicalBlock(scope: !506, file: !2, line: 714, column: 3)
!506 = distinct !DILexicalBlock(scope: !481, file: !2, line: 714, column: 3)
!507 = !DILabel(scope: !481, name: "out_with_maps", file: !2, line: 733)
!508 = !DILabel(scope: !481, name: "out_with_buffer", file: !2, line: 735)
!509 = !DILabel(scope: !481, name: "out", file: !2, line: 737)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "_nr_maps_allocated", scope: !481, file: !2, line: 642, type: !81, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !2, line: 683, type: !25, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "_nr_cpus", scope: !516, file: !2, line: 907, type: !81, isLocal: true, isDefinition: true)
!516 = distinct !DISubprogram(name: "hwloc_linux_find_kernel_nr_cpus", scope: !2, file: !2, line: 905, type: !517, scopeLine: 906, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !30, retainedNodes: !993)
!517 = !DISubroutineType(types: !518)
!518 = !{!81, !519}
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_topology_t", file: !33, line: 692, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology", file: !522, line: 63, size: 7232, elements: !523)
!522 = !DIFile(filename: "include/private/private.h", directory: "/local-ssd/hwloc-ubziofckttpgdspp6a5dagjy5yrjyncp-build/aidengro/spack-stage-hwloc-2.9.1-ubziofckttpgdspp6a5dagjy5yrjyncp/spack-src", checksumkind: CSK_MD5, checksum: "d5b6519b0f9aae3453b4c83bca837d9a")
!523 = !{!524, !525, !526, !527, !529, !646, !647, !651, !653, !654, !655, !656, !660, !661, !662, !663, !664, !674, !675, !676, !763, !815, !819, !823, !824, !844, !845, !846, !847, !884, !885, !886, !896, !897, !898, !899, !903, !904, !949, !950, !951, !952, !962, !963, !964, !965, !973, !974, !975, !981, !992}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "topology_abi", scope: !521, file: !522, line: 64, baseType: !34, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nb_levels", scope: !521, file: !522, line: 66, baseType: !34, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nb_levels_allocated", scope: !521, file: !522, line: 67, baseType: !34, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "level_nbobjects", scope: !521, file: !522, line: 68, baseType: !528, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !521, file: !522, line: 69, baseType: !530, size: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_obj", file: !33, line: 396, size: 1984, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !633, !634, !636, !637, !643, !644, !645}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !533, file: !33, line: 398, baseType: !452, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !533, file: !33, line: 399, baseType: !352, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "os_index", scope: !533, file: !33, line: 401, baseType: !34, size: 32, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !533, file: !33, line: 408, baseType: !352, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "total_memory", scope: !533, file: !33, line: 413, baseType: !458, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !533, file: !33, line: 415, baseType: !541, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "hwloc_obj_attr_u", file: !33, line: 599, size: 320, elements: !543)
!543 = !{!544, !555, !564, !572, !587, !607}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "numanode", scope: !542, file: !33, line: 613, baseType: !545, size: 192)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_numanode_attr_s", file: !33, line: 601, size: 192, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", scope: !545, file: !33, line: 602, baseType: !458, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "page_types_len", scope: !545, file: !33, line: 603, baseType: !34, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "page_types", scope: !545, file: !33, line: 612, baseType: !550, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_memory_page_type_s", file: !33, line: 609, size: 128, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !551, file: !33, line: 610, baseType: !458, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !551, file: !33, line: 611, baseType: !458, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !542, file: !33, line: 623, baseType: !556, size: 192)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_cache_attr_s", file: !33, line: 616, size: 192, elements: !557)
!557 = !{!558, !559, !560, !561, !562}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !33, line: 617, baseType: !458, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !556, file: !33, line: 618, baseType: !34, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !556, file: !33, line: 619, baseType: !34, size: 32, offset: 96)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "associativity", scope: !556, file: !33, line: 620, baseType: !81, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !556, file: !33, line: 622, baseType: !563, size: 32, offset: 160)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_obj_cache_type_t", file: !33, line: 330, baseType: !57)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !542, file: !33, line: 631, baseType: !565, size: 128)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_group_attr_s", file: !33, line: 625, size: 128, elements: !566)
!566 = !{!567, !568, !569, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !565, file: !33, line: 626, baseType: !34, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !565, file: !33, line: 628, baseType: !34, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "subkind", scope: !565, file: !33, line: 629, baseType: !34, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dont_merge", scope: !565, file: !33, line: 630, baseType: !571, size: 8, offset: 96)
!571 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pcidev", scope: !542, file: !33, line: 644, baseType: !573, size: 192)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_pcidev_attr_s", file: !33, line: 633, size: 192, elements: !574)
!574 = !{!575, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !573, file: !33, line: 635, baseType: !576, size: 16)
!576 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !573, file: !33, line: 639, baseType: !571, size: 8, offset: 16)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !573, file: !33, line: 639, baseType: !571, size: 8, offset: 24)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !573, file: !33, line: 639, baseType: !571, size: 8, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "class_id", scope: !573, file: !33, line: 640, baseType: !576, size: 16, offset: 48)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_id", scope: !573, file: !33, line: 641, baseType: !576, size: 16, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "device_id", scope: !573, file: !33, line: 641, baseType: !576, size: 16, offset: 80)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "subvendor_id", scope: !573, file: !33, line: 641, baseType: !576, size: 16, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "subdevice_id", scope: !573, file: !33, line: 641, baseType: !576, size: 16, offset: 112)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !573, file: !33, line: 642, baseType: !571, size: 8, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "linkspeed", scope: !573, file: !33, line: 643, baseType: !457, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "bridge", scope: !542, file: !33, line: 663, baseType: !588, size: 320)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_bridge_attr_s", file: !33, line: 646, size: 320, elements: !589)
!589 = !{!590, !594, !596, !605, !606}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !588, file: !33, line: 649, baseType: !591, size: 192)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !588, file: !33, line: 647, size: 192, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !591, file: !33, line: 648, baseType: !573, size: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_type", scope: !588, file: !33, line: 650, baseType: !595, size: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_obj_bridge_type_t", file: !33, line: 336, baseType: !62)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !588, file: !33, line: 660, baseType: !597, size: 32, offset: 224)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !588, file: !33, line: 651, size: 32, elements: !598)
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !597, file: !33, line: 659, baseType: !600, size: 32)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !33, line: 652, size: 32, elements: !601)
!601 = !{!602, !603, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !600, file: !33, line: 654, baseType: !576, size: 16)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_bus", scope: !600, file: !33, line: 658, baseType: !571, size: 8, offset: 16)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "subordinate_bus", scope: !600, file: !33, line: 658, baseType: !571, size: 8, offset: 24)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_type", scope: !588, file: !33, line: 661, baseType: !595, size: 32, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !588, file: !33, line: 662, baseType: !34, size: 32, offset: 288)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "osdev", scope: !542, file: !33, line: 667, baseType: !608, size: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_osdev_attr_s", file: !33, line: 665, size: 32, elements: !609)
!609 = !{!610}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !33, line: 666, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_obj_osdev_type_t", file: !33, line: 356, baseType: !66)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !533, file: !33, line: 419, baseType: !81, size: 32, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "logical_index", scope: !533, file: !33, line: 434, baseType: !34, size: 32, offset: 416)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next_cousin", scope: !533, file: !33, line: 442, baseType: !532, size: 64, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cousin", scope: !533, file: !33, line: 443, baseType: !532, size: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !533, file: !33, line: 446, baseType: !532, size: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_rank", scope: !533, file: !33, line: 447, baseType: !34, size: 32, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next_sibling", scope: !533, file: !33, line: 448, baseType: !532, size: 64, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sibling", scope: !533, file: !33, line: 449, baseType: !532, size: 64, offset: 768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !533, file: !33, line: 452, baseType: !34, size: 32, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !533, file: !33, line: 456, baseType: !531, size: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "first_child", scope: !533, file: !33, line: 457, baseType: !532, size: 64, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "last_child", scope: !533, file: !33, line: 458, baseType: !532, size: 64, offset: 1024)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_subtree", scope: !533, file: !33, line: 461, baseType: !81, size: 32, offset: 1088)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "memory_arity", scope: !533, file: !33, line: 472, baseType: !34, size: 32, offset: 1120)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "memory_first_child", scope: !533, file: !33, line: 475, baseType: !532, size: 64, offset: 1152)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "io_arity", scope: !533, file: !33, line: 490, baseType: !34, size: 32, offset: 1216)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "io_first_child", scope: !533, file: !33, line: 493, baseType: !532, size: 64, offset: 1280)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "misc_arity", scope: !533, file: !33, line: 502, baseType: !34, size: 32, offset: 1344)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "misc_first_child", scope: !533, file: !33, line: 505, baseType: !532, size: 64, offset: 1408)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !533, file: !33, line: 512, baseType: !632, size: 64, offset: 1472)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_cpuset_t", file: !33, line: 140, baseType: !444)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cpuset", scope: !533, file: !33, line: 527, baseType: !632, size: 64, offset: 1536)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "nodeset", scope: !533, file: !33, line: 540, baseType: !635, size: 64, offset: 1600)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_nodeset_t", file: !33, line: 157, baseType: !444)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "complete_nodeset", scope: !533, file: !33, line: 562, baseType: !635, size: 64, offset: 1664)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "infos", scope: !533, file: !33, line: 578, baseType: !638, size: 64, offset: 1728)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_info_s", file: !33, line: 674, size: 128, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !639, file: !33, line: 675, baseType: !352, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !639, file: !33, line: 676, baseType: !352, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "infos_count", scope: !533, file: !33, line: 579, baseType: !34, size: 32, offset: 1792)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !533, file: !33, line: 582, baseType: !440, size: 64, offset: 1856)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "gp_index", scope: !533, file: !33, line: 587, baseType: !458, size: 64, offset: 1920)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !521, file: !522, line: 70, baseType: !436, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "type_depth", scope: !521, file: !522, line: 71, baseType: !648, size: 640, offset: 320)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 640, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 20)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "type_filter", scope: !521, file: !522, line: 72, baseType: !652, size: 640, offset: 960)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 640, elements: !649)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "is_thissystem", scope: !521, file: !522, line: 73, baseType: !81, size: 32, offset: 1600)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "is_loaded", scope: !521, file: !522, line: 74, baseType: !81, size: 32, offset: 1632)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !521, file: !522, line: 75, baseType: !81, size: 32, offset: 1664)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !521, file: !522, line: 76, baseType: !657, size: 32, offset: 1696)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !658, line: 38, baseType: !659)
!658 = !DIFile(filename: "/usr/include/sched.h", directory: "", checksumkind: CSK_MD5, checksum: "52ea601aba54a9937a50019367077a72")
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !456, line: 154, baseType: !81)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !521, file: !522, line: 77, baseType: !440, size: 64, offset: 1728)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "next_gp_index", scope: !521, file: !522, line: 78, baseType: !453, size: 64, offset: 1792)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "adopted_shmem_addr", scope: !521, file: !522, line: 80, baseType: !440, size: 64, offset: 1856)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "adopted_shmem_length", scope: !521, file: !522, line: 81, baseType: !441, size: 64, offset: 1920)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "slevels", scope: !521, file: !522, line: 97, baseType: !665, size: 1536, offset: 1984)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 1536, elements: !672)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_special_level_s", file: !522, line: 93, size: 256, elements: !667)
!667 = !{!668, !669, !670, !671}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "nbobjs", scope: !666, file: !522, line: 94, baseType: !34, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !666, file: !522, line: 95, baseType: !531, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !666, file: !522, line: 96, baseType: !532, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !666, file: !522, line: 96, baseType: !532, size: 64, offset: 192)
!672 = !{!673}
!673 = !DISubrange(count: 6)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_cpuset", scope: !521, file: !522, line: 99, baseType: !444, size: 64, offset: 3520)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_nodeset", scope: !521, file: !522, line: 100, baseType: !444, size: 64, offset: 3584)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "binding_hooks", scope: !521, file: !522, line: 136, baseType: !677, size: 1536, offset: 3648)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_binding_hooks", file: !522, line: 102, size: 1536, elements: !678)
!678 = !{!679, !687, !691, !692, !693, !697, !701, !707, !711, !712, !713, !714, !720, !725, !726, !727, !731, !735, !741, !745, !749, !753, !757, !761}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_cpubind", scope: !677, file: !522, line: 104, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!81, !519, !683, !81}
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_const_cpuset_t", file: !33, line: 142, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_const_bitmap_t", file: !445, line: 70, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_cpubind", scope: !677, file: !522, line: 105, baseType: !688, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!81, !519, !632, !81}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_cpubind", scope: !677, file: !522, line: 106, baseType: !680, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_cpubind", scope: !677, file: !522, line: 107, baseType: !688, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_cpubind", scope: !677, file: !522, line: 108, baseType: !694, size: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!81, !519, !657, !683, !81}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_cpubind", scope: !677, file: !522, line: 109, baseType: !698, size: 64, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!81, !519, !657, !632, !81}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "set_thread_cpubind", scope: !677, file: !522, line: 111, baseType: !702, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!81, !519, !705, !683, !81}
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !706, line: 27, baseType: !436)
!706 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!707 = !DIDerivedType(tag: DW_TAG_member, name: "get_thread_cpubind", scope: !677, file: !522, line: 112, baseType: !708, size: 64, offset: 448)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!81, !519, !705, !632, !81}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_last_cpu_location", scope: !677, file: !522, line: 115, baseType: !688, size: 64, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_last_cpu_location", scope: !677, file: !522, line: 116, baseType: !688, size: 64, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_last_cpu_location", scope: !677, file: !522, line: 117, baseType: !698, size: 64, offset: 640)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_membind", scope: !677, file: !522, line: 119, baseType: !715, size: 64, offset: 704)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!81, !519, !718, !719, !81}
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_const_nodeset_t", file: !33, line: 160, baseType: !684)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_membind_policy_t", file: !33, line: 1446, baseType: !80)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_membind", scope: !677, file: !522, line: 120, baseType: !721, size: 64, offset: 768)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!81, !519, !635, !724, !81}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_membind", scope: !677, file: !522, line: 121, baseType: !715, size: 64, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_membind", scope: !677, file: !522, line: 122, baseType: !721, size: 64, offset: 896)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_membind", scope: !677, file: !522, line: 123, baseType: !728, size: 64, offset: 960)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!81, !519, !657, !718, !719, !81}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_membind", scope: !677, file: !522, line: 124, baseType: !732, size: 64, offset: 1024)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!81, !519, !657, !635, !724, !81}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "set_area_membind", scope: !677, file: !522, line: 125, baseType: !736, size: 64, offset: 1088)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!81, !519, !739, !441, !718, !719, !81}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_membind", scope: !677, file: !522, line: 126, baseType: !742, size: 64, offset: 1152)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!81, !519, !739, !441, !635, !724, !81}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_memlocation", scope: !677, file: !522, line: 127, baseType: !746, size: 64, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!81, !519, !739, !441, !635, !81}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !677, file: !522, line: 129, baseType: !750, size: 64, offset: 1280)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!440, !519, !441}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_membind", scope: !677, file: !522, line: 132, baseType: !754, size: 64, offset: 1344)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!440, !519, !441, !718, !719, !81}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "free_membind", scope: !677, file: !522, line: 133, baseType: !758, size: 64, offset: 1408)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!81, !519, !440, !441}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "get_allowed_resources", scope: !677, file: !522, line: 135, baseType: !762, size: 64, offset: 1472)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "support", scope: !521, file: !522, line: 138, baseType: !764, size: 256, offset: 5184)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_support", file: !33, line: 2215, size: 256, elements: !765)
!765 = !{!766, !776, !791, !810}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "discovery", scope: !764, file: !33, line: 2216, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_discovery_support", file: !33, line: 2119, size: 48, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pu", scope: !768, file: !33, line: 2121, baseType: !571, size: 8)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "numa", scope: !768, file: !33, line: 2123, baseType: !571, size: 8, offset: 8)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "numa_memory", scope: !768, file: !33, line: 2125, baseType: !571, size: 8, offset: 16)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "disallowed_pu", scope: !768, file: !33, line: 2127, baseType: !571, size: 8, offset: 24)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "disallowed_numa", scope: !768, file: !33, line: 2129, baseType: !571, size: 8, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cpukind_efficiency", scope: !768, file: !33, line: 2131, baseType: !571, size: 8, offset: 40)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "cpubind", scope: !764, file: !33, line: 2217, baseType: !777, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_cpubind_support", file: !33, line: 2139, size: 88, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_cpubind", scope: !778, file: !33, line: 2141, baseType: !571, size: 8)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_cpubind", scope: !778, file: !33, line: 2143, baseType: !571, size: 8, offset: 8)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_cpubind", scope: !778, file: !33, line: 2145, baseType: !571, size: 8, offset: 16)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_cpubind", scope: !778, file: !33, line: 2147, baseType: !571, size: 8, offset: 24)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_cpubind", scope: !778, file: !33, line: 2149, baseType: !571, size: 8, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_cpubind", scope: !778, file: !33, line: 2151, baseType: !571, size: 8, offset: 40)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "set_thread_cpubind", scope: !778, file: !33, line: 2153, baseType: !571, size: 8, offset: 48)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "get_thread_cpubind", scope: !778, file: !33, line: 2155, baseType: !571, size: 8, offset: 56)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_last_cpu_location", scope: !778, file: !33, line: 2157, baseType: !571, size: 8, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_last_cpu_location", scope: !778, file: !33, line: 2159, baseType: !571, size: 8, offset: 72)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_last_cpu_location", scope: !778, file: !33, line: 2161, baseType: !571, size: 8, offset: 80)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "membind", scope: !764, file: !33, line: 2218, baseType: !792, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_membind_support", file: !33, line: 2169, size: 120, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisproc_membind", scope: !793, file: !33, line: 2171, baseType: !571, size: 8)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisproc_membind", scope: !793, file: !33, line: 2173, baseType: !571, size: 8, offset: 8)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "set_proc_membind", scope: !793, file: !33, line: 2175, baseType: !571, size: 8, offset: 16)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "get_proc_membind", scope: !793, file: !33, line: 2177, baseType: !571, size: 8, offset: 24)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "set_thisthread_membind", scope: !793, file: !33, line: 2179, baseType: !571, size: 8, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "get_thisthread_membind", scope: !793, file: !33, line: 2181, baseType: !571, size: 8, offset: 40)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "set_area_membind", scope: !793, file: !33, line: 2183, baseType: !571, size: 8, offset: 48)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_membind", scope: !793, file: !33, line: 2185, baseType: !571, size: 8, offset: 56)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_membind", scope: !793, file: !33, line: 2187, baseType: !571, size: 8, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "firsttouch_membind", scope: !793, file: !33, line: 2189, baseType: !571, size: 8, offset: 72)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bind_membind", scope: !793, file: !33, line: 2191, baseType: !571, size: 8, offset: 80)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_membind", scope: !793, file: !33, line: 2193, baseType: !571, size: 8, offset: 88)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "nexttouch_membind", scope: !793, file: !33, line: 2195, baseType: !571, size: 8, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "migrate_membind", scope: !793, file: !33, line: 2197, baseType: !571, size: 8, offset: 104)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "get_area_memlocation", scope: !793, file: !33, line: 2199, baseType: !571, size: 8, offset: 112)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !764, file: !33, line: 2219, baseType: !811, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_misc_support", file: !33, line: 2204, size: 8, elements: !813)
!813 = !{!814}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "imported_support", scope: !812, file: !33, line: 2206, baseType: !571, size: 8)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "userdata_export_cb", scope: !521, file: !522, line: 140, baseType: !816, size: 64, offset: 5440)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !440, !520, !532}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "userdata_import_cb", scope: !521, file: !522, line: 141, baseType: !820, size: 64, offset: 5504)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !520, !532, !356, !739, !441}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "userdata_not_decoded", scope: !521, file: !522, line: 142, baseType: !81, size: 32, offset: 5568)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "first_dist", scope: !521, file: !522, line: 176, baseType: !825, size: 64, offset: 5632)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_distances_s", file: !522, line: 144, size: 704, elements: !827)
!827 = !{!828, !829, !830, !831, !833, !834, !836, !837, !838, !839, !842, !843}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !826, file: !522, line: 145, baseType: !352, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !826, file: !522, line: 147, baseType: !34, size: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "unique_type", scope: !826, file: !522, line: 154, baseType: !452, size: 32, offset: 96)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "different_types", scope: !826, file: !522, line: 155, baseType: !832, size: 64, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "nbobjs", scope: !826, file: !522, line: 158, baseType: !34, size: 32, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !826, file: !522, line: 159, baseType: !835, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !826, file: !522, line: 163, baseType: !835, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !826, file: !522, line: 166, baseType: !436, size: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", scope: !826, file: !522, line: 170, baseType: !34, size: 32, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !826, file: !522, line: 173, baseType: !840, size: 64, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_obj_t", file: !33, line: 596, baseType: !532)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !826, file: !522, line: 175, baseType: !825, size: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !826, file: !522, line: 175, baseType: !825, size: 64, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "last_dist", scope: !521, file: !522, line: 176, baseType: !825, size: 64, offset: 5696)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "next_dist_id", scope: !521, file: !522, line: 177, baseType: !34, size: 32, offset: 5760)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "nr_memattrs", scope: !521, file: !522, line: 180, baseType: !34, size: 32, offset: 5792)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "memattrs", scope: !521, file: !522, line: 208, baseType: !848, size: 64, offset: 5824)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_memattr_s", file: !522, line: 181, size: 256, elements: !850)
!850 = !{!851, !852, !853, !854, !855}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !849, file: !522, line: 183, baseType: !352, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !849, file: !522, line: 184, baseType: !436, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", scope: !849, file: !522, line: 188, baseType: !34, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "nr_targets", scope: !849, file: !522, line: 191, baseType: !34, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !849, file: !522, line: 207, baseType: !856, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_memattr_target_s", file: !522, line: 192, size: 384, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !857, file: !522, line: 194, baseType: !841, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !857, file: !522, line: 195, baseType: !452, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "os_index", scope: !857, file: !522, line: 196, baseType: !34, size: 32, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gp_index", scope: !857, file: !522, line: 197, baseType: !458, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "noinitiator_value", scope: !857, file: !522, line: 200, baseType: !458, size: 64, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "nr_initiators", scope: !857, file: !522, line: 202, baseType: !34, size: 32, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "initiators", scope: !857, file: !522, line: 206, baseType: !866, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_memattr_initiator_s", file: !522, line: 203, size: 320, elements: !868)
!868 = !{!869, !883}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "initiator", scope: !867, file: !522, line: 204, baseType: !870, size: 256)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_location_s", file: !522, line: 45, size: 256, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !870, file: !522, line: 46, baseType: !89, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !870, file: !522, line: 54, baseType: !874, size: 192, offset: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !870, file: !522, line: 47, size: 192, elements: !875)
!875 = !{!876, !882}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !874, file: !522, line: 52, baseType: !877, size: 192)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !874, file: !522, line: 48, size: 192, elements: !878)
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !877, file: !522, line: 49, baseType: !841, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gp_index", scope: !877, file: !522, line: 50, baseType: !453, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !877, file: !522, line: 51, baseType: !452, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !874, file: !522, line: 53, baseType: !632, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !867, file: !522, line: 205, baseType: !458, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpukinds", scope: !521, file: !522, line: 211, baseType: !34, size: 32, offset: 5888)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpukinds_allocated", scope: !521, file: !522, line: 212, baseType: !34, size: 32, offset: 5920)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "cpukinds", scope: !521, file: !522, line: 221, baseType: !887, size: 64, offset: 5952)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_internal_cpukind_s", file: !522, line: 213, size: 320, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !888, file: !522, line: 214, baseType: !632, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "efficiency", scope: !888, file: !522, line: 216, baseType: !81, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "forced_efficiency", scope: !888, file: !522, line: 217, baseType: !81, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ranking_value", scope: !888, file: !522, line: 218, baseType: !458, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nr_infos", scope: !888, file: !522, line: 219, baseType: !34, size: 32, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "infos", scope: !888, file: !522, line: 220, baseType: !638, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !521, file: !522, line: 223, baseType: !81, size: 32, offset: 6016)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_verbose", scope: !521, file: !522, line: 224, baseType: !81, size: 32, offset: 6048)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_nbaccuracies", scope: !521, file: !522, line: 225, baseType: !34, size: 32, offset: 6080)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_accuracies", scope: !521, file: !522, line: 226, baseType: !900, size: 160, offset: 6112)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 160, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 5)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "grouping_next_subkind", scope: !521, file: !522, line: 227, baseType: !34, size: 32, offset: 6272)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "backends", scope: !521, file: !522, line: 230, baseType: !905, size: 64, offset: 6336)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_backend", file: !95, line: 189, size: 704, elements: !907)
!907 = !{!908, !922, !923, !924, !925, !926, !927, !928, !929, !933, !944}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "component", scope: !906, file: !95, line: 191, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_disc_component", file: !95, line: 41, size: 320, elements: !911)
!911 = !{!912, !913, !914, !915, !919, !920, !921}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !910, file: !95, line: 45, baseType: !356, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "phases", scope: !910, file: !95, line: 50, baseType: !34, size: 32, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_phases", scope: !910, file: !95, line: 60, baseType: !34, size: 32, offset: 96)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "instantiate", scope: !910, file: !95, line: 65, baseType: !916, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!905, !520, !909, !34, !739, !739, !739}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !910, file: !95, line: 79, baseType: !34, size: 32, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "enabled_by_default", scope: !910, file: !95, line: 84, baseType: !34, size: 32, offset: 224)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !910, file: !95, line: 90, baseType: !909, size: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "topology", scope: !906, file: !95, line: 193, baseType: !520, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "envvar_forced", scope: !906, file: !95, line: 195, baseType: !81, size: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !906, file: !95, line: 197, baseType: !905, size: 64, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "phases", scope: !906, file: !95, line: 202, baseType: !34, size: 32, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !906, file: !95, line: 205, baseType: !436, size: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "is_thissystem", scope: !906, file: !95, line: 213, baseType: !81, size: 32, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !906, file: !95, line: 216, baseType: !440, size: 64, offset: 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !906, file: !95, line: 220, baseType: !930, size: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !905}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "discover", scope: !906, file: !95, line: 227, baseType: !934, size: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!81, !905, !937}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_disc_status", file: !95, line: 156, size: 128, elements: !939)
!939 = !{!940, !942, !943}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !938, file: !95, line: 160, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "hwloc_disc_phase_t", file: !95, line: 143, baseType: !94)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_phases", scope: !938, file: !95, line: 165, baseType: !34, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !938, file: !95, line: 168, baseType: !436, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "get_pci_busid_cpuset", scope: !906, file: !95, line: 233, baseType: !945, size: 64, offset: 640)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!81, !905, !948, !444}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "get_pci_busid_cpuset_backend", scope: !521, file: !522, line: 231, baseType: !905, size: 64, offset: 6400)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "backend_phases", scope: !521, file: !522, line: 232, baseType: !34, size: 32, offset: 6464)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "backend_excluded_phases", scope: !521, file: !522, line: 233, baseType: !34, size: 32, offset: 6496)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "tma", scope: !521, file: !522, line: 236, baseType: !953, size: 64, offset: 6528)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_tma", file: !522, line: 493, size: 192, elements: !955)
!955 = !{!956, !960, !961}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !954, file: !522, line: 494, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!440, !953, !441}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !954, file: !522, line: 495, baseType: !440, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "dontfree", scope: !954, file: !522, line: 496, baseType: !81, size: 32, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "machine_memory", scope: !521, file: !522, line: 252, baseType: !545, size: 192, offset: 6592)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pci_has_forced_locality", scope: !521, file: !522, line: 255, baseType: !81, size: 32, offset: 6784)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pci_forced_locality_nr", scope: !521, file: !522, line: 256, baseType: !34, size: 32, offset: 6816)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pci_forced_locality", scope: !521, file: !522, line: 261, baseType: !966, size: 64, offset: 6848)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_pci_forced_locality_s", file: !522, line: 257, size: 192, elements: !968)
!968 = !{!969, !970, !971, !972}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !967, file: !522, line: 258, baseType: !34, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "bus_first", scope: !967, file: !522, line: 259, baseType: !34, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "bus_last", scope: !967, file: !522, line: 259, baseType: !34, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !967, file: !522, line: 260, baseType: !444, size: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "pci_locality_quirks", scope: !521, file: !522, line: 262, baseType: !458, size: 64, offset: 6912)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "nr_blacklisted_components", scope: !521, file: !522, line: 265, baseType: !34, size: 32, offset: 6976)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "blacklisted_components", scope: !521, file: !522, line: 269, baseType: !976, size: 64, offset: 7040)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_topology_forced_component_s", file: !522, line: 266, size: 128, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "component", scope: !977, file: !522, line: 267, baseType: !909, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "phases", scope: !977, file: !522, line: 268, baseType: !34, size: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "first_pci_locality", scope: !521, file: !522, line: 279, baseType: !982, size: 64, offset: 7104)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwloc_pci_locality_s", file: !522, line: 272, size: 384, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !983, file: !522, line: 273, baseType: !34, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "bus_min", scope: !983, file: !522, line: 274, baseType: !34, size: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "bus_max", scope: !983, file: !522, line: 275, baseType: !34, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "cpuset", scope: !983, file: !522, line: 276, baseType: !444, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !983, file: !522, line: 277, baseType: !841, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !983, file: !522, line: 278, baseType: !982, size: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !983, file: !522, line: 278, baseType: !982, size: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "last_pci_locality", scope: !521, file: !522, line: 279, baseType: !982, size: 64, offset: 7168)
!993 = !{!994, !995, !996, !997, !1000, !1010, !1011}
!994 = !DILocalVariable(name: "topology", arg: 1, scope: !516, file: !2, line: 905, type: !519)
!995 = !DILocalVariable(name: "nr_cpus", scope: !516, file: !2, line: 908, type: !81)
!996 = !DILocalVariable(name: "possible_bitmap", scope: !516, file: !2, line: 909, type: !444)
!997 = !DILocalVariable(name: "max_possible", scope: !998, file: !2, line: 929, type: !81)
!998 = distinct !DILexicalBlock(scope: !999, file: !2, line: 928, column: 24)
!999 = distinct !DILexicalBlock(scope: !516, file: !2, line: 928, column: 7)
!1000 = !DILocalVariable(name: "set", scope: !1001, file: !2, line: 937, type: !1002)
!1001 = distinct !DILexicalBlock(scope: !516, file: !2, line: 936, column: 13)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpu_set_t", file: !435, line: 42, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 39, size: 1024, elements: !1005)
!1005 = !{!1006}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "__bits", scope: !1004, file: !435, line: 41, baseType: !1007, size: 1024)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 1024, elements: !1008)
!1008 = !{!1009}
!1009 = !DISubrange(count: 16)
!1010 = !DILocalVariable(name: "setsize", scope: !1001, file: !2, line: 938, type: !441)
!1011 = !DILocalVariable(name: "err", scope: !1001, file: !2, line: 939, type: !81)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !2, line: 927, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 33)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1086, type: !1019, isLocal: true, isDefinition: true)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !1020)
!1020 = !{!1021}
!1021 = !DISubrange(count: 14)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1088, type: !1024, isLocal: true, isDefinition: true)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !1008)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1060, type: !1027, isLocal: true, isDefinition: true)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 2)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1060, type: !1032, isLocal: true, isDefinition: true)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 3)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1324, type: !1037, isLocal: true, isDefinition: true)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 728, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 91)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !1042, isLocal: true, isDefinition: true)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !1043)
!1043 = !{!1044}
!1044 = !DISubrange(count: 11)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !1047, isLocal: true, isDefinition: true)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 680, elements: !1048)
!1048 = !{!1049}
!1049 = !DISubrange(count: 85)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "preferred_many_notsupported", scope: !1052, file: !2, line: 1804, type: !81, isLocal: true, isDefinition: true)
!1052 = distinct !DISubprogram(name: "hwloc_linux_set_thisthread_membind", scope: !2, file: !2, line: 1800, type: !716, scopeLine: 1801, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !30, retainedNodes: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1065, !1066}
!1054 = !DILocalVariable(name: "topology", arg: 1, scope: !1052, file: !2, line: 1800, type: !519)
!1055 = !DILocalVariable(name: "nodeset", arg: 2, scope: !1052, file: !2, line: 1800, type: !718)
!1056 = !DILocalVariable(name: "policy", arg: 3, scope: !1052, file: !2, line: 1800, type: !719)
!1057 = !DILocalVariable(name: "flags", arg: 4, scope: !1052, file: !2, line: 1800, type: !81)
!1058 = !DILocalVariable(name: "max_os_index", scope: !1052, file: !2, line: 1802, type: !34)
!1059 = !DILocalVariable(name: "linuxmask", scope: !1052, file: !2, line: 1803, type: !490)
!1060 = !DILocalVariable(name: "linuxpolicy", scope: !1052, file: !2, line: 1805, type: !81)
!1061 = !DILocalVariable(name: "err", scope: !1052, file: !2, line: 1806, type: !81)
!1062 = !DILocalVariable(name: "fullmask", scope: !1063, file: !2, line: 1833, type: !490)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !2, line: 1832, column: 38)
!1064 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 1832, column: 7)
!1065 = !DILabel(scope: !1052, name: "out_with_mask", file: !2, line: 1867)
!1066 = !DILabel(scope: !1052, name: "out", file: !2, line: 1869)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1855, type: !1069, isLocal: true, isDefinition: true)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 680, elements: !1048)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "_max_numnodes", scope: !1072, file: !2, line: 1882, type: !81, isLocal: true, isDefinition: true)
!1072 = distinct !DISubprogram(name: "hwloc_linux_find_kernel_max_numnodes", scope: !2, file: !2, line: 1880, type: !517, scopeLine: 1881, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !30, retainedNodes: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1080, !1082}
!1074 = !DILocalVariable(name: "topology", arg: 1, scope: !1072, file: !2, line: 1880, type: !519)
!1075 = !DILocalVariable(name: "linuxpolicy", scope: !1072, file: !2, line: 1883, type: !81)
!1076 = !DILocalVariable(name: "possible_bitmap", scope: !1072, file: !2, line: 1884, type: !444)
!1077 = !DILocalVariable(name: "max_possible", scope: !1078, file: !2, line: 1896, type: !81)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 1895, column: 24)
!1079 = distinct !DILexicalBlock(scope: !1072, file: !2, line: 1895, column: 7)
!1080 = !DILocalVariable(name: "mask", scope: !1081, file: !2, line: 1904, type: !490)
!1081 = distinct !DILexicalBlock(scope: !1072, file: !2, line: 1903, column: 13)
!1082 = !DILocalVariable(name: "err", scope: !1081, file: !2, line: 1905, type: !81)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(name: "max_numnodes", scope: !1072, file: !2, line: 1882, type: !81, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1894, type: !1087, isLocal: true, isDefinition: true)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1088)
!1088 = !{!1089}
!1089 = !DISubrange(count: 34)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(name: "preferred_many_notsupported", scope: !1092, file: !2, line: 1712, type: !81, isLocal: true, isDefinition: true)
!1092 = distinct !DISubprogram(name: "hwloc_linux_set_area_membind", scope: !2, file: !2, line: 1707, type: !737, scopeLine: 1708, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !30, retainedNodes: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107}
!1094 = !DILocalVariable(name: "topology", arg: 1, scope: !1092, file: !2, line: 1707, type: !519)
!1095 = !DILocalVariable(name: "addr", arg: 2, scope: !1092, file: !2, line: 1707, type: !739)
!1096 = !DILocalVariable(name: "len", arg: 3, scope: !1092, file: !2, line: 1707, type: !441)
!1097 = !DILocalVariable(name: "nodeset", arg: 4, scope: !1092, file: !2, line: 1707, type: !718)
!1098 = !DILocalVariable(name: "policy", arg: 5, scope: !1092, file: !2, line: 1707, type: !719)
!1099 = !DILocalVariable(name: "flags", arg: 6, scope: !1092, file: !2, line: 1707, type: !81)
!1100 = !DILocalVariable(name: "max_os_index", scope: !1092, file: !2, line: 1709, type: !34)
!1101 = !DILocalVariable(name: "linuxmask", scope: !1092, file: !2, line: 1710, type: !490)
!1102 = !DILocalVariable(name: "remainder", scope: !1092, file: !2, line: 1711, type: !441)
!1103 = !DILocalVariable(name: "linuxpolicy", scope: !1092, file: !2, line: 1713, type: !81)
!1104 = !DILocalVariable(name: "linuxflags", scope: !1092, file: !2, line: 1714, type: !34)
!1105 = !DILocalVariable(name: "err", scope: !1092, file: !2, line: 1715, type: !81)
!1106 = !DILabel(scope: !1092, name: "out_with_mask", file: !2, line: 1774)
!1107 = !DILabel(scope: !1092, name: "out", file: !2, line: 1776)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2120, type: !1110, isLocal: true, isDefinition: true)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !1111)
!1111 = !{!1112}
!1112 = !DISubrange(count: 13)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2122, type: !1027, isLocal: true, isDefinition: true)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2146, type: !1117, isLocal: true, isDefinition: true)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !1118)
!1118 = !{!1119}
!1119 = !DISubrange(count: 12)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5453, type: !1122, isLocal: true, isDefinition: true)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !901)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5454, type: !1122, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2233, type: !20, isLocal: true, isDefinition: true)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2236, type: !1027, isLocal: true, isDefinition: true)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2239, type: !1110, isLocal: true, isDefinition: true)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2261, type: !1133, isLocal: true, isDefinition: true)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !1134)
!1134 = !{!1135}
!1135 = !DISubrange(count: 8)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2264, type: !1014, isLocal: true, isDefinition: true)
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2266, type: !1140, isLocal: true, isDefinition: true)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !1141)
!1141 = !{!1142}
!1142 = !DISubrange(count: 22)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2276, type: !1145, isLocal: true, isDefinition: true)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !1146)
!1146 = !{!1147}
!1147 = !DISubrange(count: 46)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2277, type: !1027, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2278, type: !1152, isLocal: true, isDefinition: true)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !1153)
!1153 = !{!1154}
!1154 = !DISubrange(count: 7)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2284, type: !1157, isLocal: true, isDefinition: true)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !1158)
!1158 = !{!1159}
!1159 = !DISubrange(count: 40)
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2290, type: !1145, isLocal: true, isDefinition: true)
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2294, type: !1164, isLocal: true, isDefinition: true)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1165)
!1165 = !{!1166}
!1166 = !DISubrange(count: 32)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2299, type: !1152, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2305, type: !1027, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2308, type: !1173, isLocal: true, isDefinition: true)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !1174)
!1174 = !{!1175}
!1175 = !DISubrange(count: 9)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2314, type: !1178, isLocal: true, isDefinition: true)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1179)
!1179 = !{!1180}
!1180 = !DISubrange(count: 52)
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2319, type: !1157, isLocal: true, isDefinition: true)
!1183 = !DIGlobalVariableExpression(var: !1184, expr: !DIExpression())
!1184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2348, type: !1185, isLocal: true, isDefinition: true)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !1186)
!1186 = !{!1187}
!1187 = !DISubrange(count: 18)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2351, type: !1024, isLocal: true, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2359, type: !1192, isLocal: true, isDefinition: true)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !1193)
!1193 = !{!1194}
!1194 = !DISubrange(count: 24)
!1195 = !DIGlobalVariableExpression(var: !1196, expr: !DIExpression())
!1196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2365, type: !1185, isLocal: true, isDefinition: true)
!1197 = !DIGlobalVariableExpression(var: !1198, expr: !DIExpression())
!1198 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2368, type: !1024, isLocal: true, isDefinition: true)
!1199 = !DIGlobalVariableExpression(var: !1200, expr: !DIExpression())
!1200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2380, type: !1173, isLocal: true, isDefinition: true)
!1201 = !DIGlobalVariableExpression(var: !1202, expr: !DIExpression())
!1202 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2382, type: !1032, isLocal: true, isDefinition: true)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2392, type: !1192, isLocal: true, isDefinition: true)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2399, type: !1032, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2399, type: !1209, isLocal: true, isDefinition: true)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !1210)
!1210 = !{!1211}
!1211 = !DISubrange(count: 27)
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2418, type: !1214, isLocal: true, isDefinition: true)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !1215)
!1215 = !{!1216}
!1216 = !DISubrange(count: 25)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2419, type: !1087, isLocal: true, isDefinition: true)
!1219 = !DIGlobalVariableExpression(var: !1220, expr: !DIExpression())
!1220 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2423, type: !20, isLocal: true, isDefinition: true)
!1221 = !DIGlobalVariableExpression(var: !1222, expr: !DIExpression())
!1222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2424, type: !1087, isLocal: true, isDefinition: true)
!1223 = !DIGlobalVariableExpression(var: !1224, expr: !DIExpression())
!1224 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2428, type: !1133, isLocal: true, isDefinition: true)
!1225 = !DIGlobalVariableExpression(var: !1226, expr: !DIExpression())
!1226 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2429, type: !1014, isLocal: true, isDefinition: true)
!1227 = !DIGlobalVariableExpression(var: !1228, expr: !DIExpression())
!1228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2435, type: !1229, isLocal: true, isDefinition: true)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !1230)
!1230 = !{!1231}
!1231 = !DISubrange(count: 43)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(scope: null, file: !2, line: 7274, type: !1234, isLocal: true, isDefinition: true)
!1234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !672)
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(scope: null, file: !2, line: 7245, type: !1192, isLocal: true, isDefinition: true)
!1237 = !DIGlobalVariableExpression(var: !1238, expr: !DIExpression())
!1238 = distinct !DIGlobalVariable(scope: null, file: !2, line: 7247, type: !1239, isLocal: true, isDefinition: true)
!1239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4872, elements: !1240)
!1240 = !{!1241}
!1241 = !DISubrange(count: 609)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(scope: null, file: !2, line: 7252, type: !1214, isLocal: true, isDefinition: true)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !2, line: 7120, type: !1246, isLocal: true, isDefinition: true)
