; ModuleID = 'samples/687.bc'
source_filename = "cram/cram_index.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__kstring_t = type { i64, i64, ptr }
%struct.cram_index = type { i32, i32, ptr, i32, i32, i32, i32, i32, i32, i64 }
%struct.cram_fd = type { ptr, i32, i32, ptr, ptr, ptr, i32, i32, i32, ptr, i32, i32, ptr, ptr, ptr, i32, i32, i32, ptr, i32, [7 x ptr], i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.cram_range, [4096 x i32], [4096 x i32], [256 x i8], [256 x i8], [32 x [32 x i8]], i32, ptr, i64, i32, i32, i32, i32, i32, i32, ptr, ptr, %union.pthread_mutex_t, %union.pthread_mutex_t, ptr, %union.pthread_mutex_t, ptr, i32 }
%struct.cram_range = type { i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.hFILE = type { ptr, ptr, ptr, ptr, ptr, i64, i8, i32 }
%struct.cram_container = type { i32, i32, i32, i32, i32, i64, i32, i32, i32, ptr, i64, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

!65 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !104, globals: !116, splitDebugInlining: false, nameTableKind: None)
!66 = !{!67, !75, !84, !97}
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cram_block_method", file: !68, line: 147, baseType: !69, size: 32, elements: !70)
!68 = !DIFile(filename: "./cram/cram_structs.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "26f5f6b71da317ccea50cc4377b5fde6")
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "BM_ERROR", value: -1)
!72 = !DIEnumerator(name: "RAW", value: 0)
!73 = !DIEnumerator(name: "GZIP", value: 1)
!74 = !DIEnumerator(name: "BZIP2", value: 2)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cram_content_type", file: !68, line: 154, baseType: !69, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83}
!77 = !DIEnumerator(name: "CT_ERROR", value: -1)
!78 = !DIEnumerator(name: "FILE_HEADER", value: 0)
!79 = !DIEnumerator(name: "COMPRESSION_HEADER", value: 1)
!80 = !DIEnumerator(name: "MAPPED_SLICE", value: 2)
!81 = !DIEnumerator(name: "UNMAPPED_SLICE", value: 3)
!82 = !DIEnumerator(name: "EXTERNAL", value: 4)
!83 = !DIEnumerator(name: "CORE", value: 5)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cram_encoding", file: !68, line: 113, baseType: !85, size: 32, elements: !86)
!85 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!87 = !DIEnumerator(name: "E_NULL", value: 0)
!88 = !DIEnumerator(name: "E_EXTERNAL", value: 1)
!89 = !DIEnumerator(name: "E_GOLOMB", value: 2)
!90 = !DIEnumerator(name: "E_HUFFMAN", value: 3)
!91 = !DIEnumerator(name: "E_BYTE_ARRAY_LEN", value: 4)
!92 = !DIEnumerator(name: "E_BYTE_ARRAY_STOP", value: 5)
!93 = !DIEnumerator(name: "E_BETA", value: 6)
!94 = !DIEnumerator(name: "E_SUBEXP", value: 7)
!95 = !DIEnumerator(name: "E_GOLOMB_RICE", value: 8)
!96 = !DIEnumerator(name: "E_GAMMA", value: 9)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cram_external_type", file: !68, line: 126, baseType: !85, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103}
!99 = !DIEnumerator(name: "E_INT", value: 1)
!100 = !DIEnumerator(name: "E_LONG", value: 2)
!101 = !DIEnumerator(name: "E_BYTE", value: 3)
!102 = !DIEnumerator(name: "E_BYTE_ARRAY", value: 4)
!103 = !DIEnumerator(name: "E_BYTE_ARRAY_BLOCK", value: 5)
!104 = !{!105, !107, !69, !108, !113}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uc", file: !68, line: 69, baseType: !106)
!106 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !109, line: 27, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !111, line: 44, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!112 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !114, line: 77, baseType: !115)
!114 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !111, line: 194, baseType: !112)
!116 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !53, !58, !60}
!117 = !{i32 7, !"Dwarf Version", i32 5}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = !{i32 1, !"wchar_size", i32 4}
!120 = !{i32 8, !"PIC Level", i32 2}
!121 = !{i32 7, !"PIE Level", i32 2}
!122 = !{i32 7, !"uwtable", i32 2}
!123 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!124 = distinct !DISubprogram(name: "cram_index_load", scope: !2, file: !2, line: 95, type: !125, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !65, retainedNodes: !1102)
!125 = !DISubroutineType(types: !126)
!126 = !{!69, !127, !276}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_fd", file: !68, line: 694, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cram_fd", file: !68, line: 622, size: 277952, elements: !130)
!130 = !{!131, !150, !151, !152, !167, !313, !314, !315, !316, !317, !807, !808, !809, !927, !928, !929, !930, !931, !932, !933, !934, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !962, !966, !967, !971, !972, !975, !976, !992, !993, !994, !995, !996, !997, !998, !999, !1086, !1089, !1090, !1091, !1099, !1100, !1101}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !129, file: !68, line: 623, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_FILE", file: !68, line: 85, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hFILE", file: !135, line: 42, size: 448, elements: !136)
!135 = !DIFile(filename: "./htslib/hfile.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "3de0564fb68f92a6cbdbd3661c50be4f")
!136 = !{!137, !138, !139, !140, !141, !145, !148, !149}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !134, file: !135, line: 43, baseType: !107, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !134, file: !135, line: 43, baseType: !107, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !134, file: !135, line: 43, baseType: !107, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !134, file: !135, line: 43, baseType: !107, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !134, file: !135, line: 44, baseType: !142, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "hFILE_backend", file: !135, line: 41, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !134, file: !135, line: 45, baseType: !146, size: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !114, line: 63, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 152, baseType: !112)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "at_eof", scope: !134, file: !135, line: 46, baseType: !69, size: 1, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "has_errno", scope: !134, file: !135, line: 47, baseType: !69, size: 32, offset: 416)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !129, file: !68, line: 624, baseType: !69, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !129, file: !68, line: 625, baseType: !69, size: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "file_def", scope: !129, file: !68, line: 626, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_file_def", file: !68, line: 140, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 135, size: 208, elements: !156)
!156 = !{!157, !161, !165, !166}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !155, file: !68, line: 136, baseType: !158, size: 32)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 4)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "major_version", scope: !155, file: !68, line: 137, baseType: !162, size: 8, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !163, line: 24, baseType: !164)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !111, line: 38, baseType: !106)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "minor_version", scope: !155, file: !68, line: 138, baseType: !162, size: 8, offset: 40)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "file_id", scope: !155, file: !68, line: 139, baseType: !34, size: 160, offset: 48)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !129, file: !68, line: 627, baseType: !168, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "SAM_hdr", file: !170, line: 213, baseType: !171)
!170 = !DIFile(filename: "./cram/sam_header.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "eceb4414916c32b1602bfba25324383a")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 183, size: 9408, elements: !172)
!172 = !{!173, !184, !218, !233, !250, !251, !252, !263, !279, !280, !290, !291, !292, !293, !294, !305, !306, !307, !311, !312}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !171, file: !170, line: 184, baseType: !174, size: 192)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "kstring_t", file: !175, line: 19, baseType: !176)
!175 = !DIFile(filename: "./htslib/hts.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "01f4720bfa3058148c5f4bac8317f59d")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kstring_t", file: !175, line: 16, size: 192, elements: !177)
!177 = !{!178, !182, !183}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !176, file: !175, line: 17, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !180, line: 70, baseType: !181)
!180 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!181 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !176, file: !175, line: 17, baseType: !179, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !176, file: !175, line: 18, baseType: !107, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !171, file: !170, line: 185, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_sam_hdr_t", file: !170, line: 168, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 168, size: 320, elements: !188)
!188 = !{!189, !193, !194, !195, !196, !198, !199}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !187, file: !170, line: 168, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !191, line: 152, baseType: !192)
!191 = !DIFile(filename: "./htslib/khash.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "f198587301b07372c22d55a1bc46dccc")
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !191, line: 135, baseType: !85)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !187, file: !170, line: 168, baseType: !190, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !187, file: !170, line: 168, baseType: !190, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !187, file: !170, line: 168, baseType: !190, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !187, file: !170, line: 168, baseType: !197, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !187, file: !170, line: 168, baseType: !197, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !187, file: !170, line: 168, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "SAM_hdr_type", file: !170, line: 139, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SAM_hdr_item_s", file: !170, line: 134, size: 256, elements: !204)
!204 = !{!205, !207, !208, !217}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !170, line: 135, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !203, file: !170, line: 136, baseType: !206, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !203, file: !170, line: 137, baseType: !209, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "SAM_hdr_tag", file: !170, line: 117, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SAM_hdr_tag_s", file: !170, line: 113, size: 192, elements: !212)
!212 = !{!213, !215, !216}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !170, line: 114, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !211, file: !170, line: 115, baseType: !107, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !211, file: !170, line: 116, baseType: !69, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !203, file: !170, line: 138, baseType: !69, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "str_pool", scope: !171, file: !170, line: 186, baseType: !219, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "string_alloc_t", file: !221, line: 56, baseType: !222)
!221 = !DIFile(filename: "./cram/string_alloc.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "52eee84334c24075686868ec49e8d98f")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 52, size: 192, elements: !223)
!223 = !{!224, !225, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !222, file: !221, line: 53, baseType: !179, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nstrings", scope: !222, file: !221, line: 54, baseType: !179, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !222, file: !221, line: 55, baseType: !227, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "string_t", file: !221, line: 50, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 47, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !229, file: !221, line: 48, baseType: !107, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !229, file: !221, line: 49, baseType: !179, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type_pool", scope: !171, file: !170, line: 187, baseType: !234, size: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "pool_alloc_t", file: !236, line: 48, baseType: !237)
!236 = !DIFile(filename: "./cram/pooled_alloc.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "02093bf30c2a3a10578025c13ec6132d")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 43, size: 256, elements: !238)
!238 = !{!239, !240, !241, !249}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !237, file: !236, line: 44, baseType: !179, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "npools", scope: !237, file: !236, line: 45, baseType: !179, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !237, file: !236, line: 46, baseType: !242, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "pool_t", file: !236, line: 41, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 38, size: 128, elements: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !244, file: !236, line: 39, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !244, file: !236, line: 40, baseType: !179, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !237, file: !236, line: 47, baseType: !247, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tag_pool", scope: !171, file: !170, line: 188, baseType: !234, size: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nref", scope: !171, file: !170, line: 191, baseType: !69, size: 32, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !171, file: !170, line: 192, baseType: !253, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "SAM_SQ", file: !170, line: 147, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 142, size: 256, elements: !256)
!256 = !{!257, !258, !261, !262}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !255, file: !170, line: 143, baseType: !107, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !255, file: !170, line: 144, baseType: !259, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !163, line: 26, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !111, line: 42, baseType: !85)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !255, file: !170, line: 145, baseType: !201, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !255, file: !170, line: 146, baseType: !209, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ref_hash", scope: !171, file: !170, line: 193, baseType: !264, size: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_m_s2i_t", file: !170, line: 169, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 169, size: 320, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !277}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !266, file: !170, line: 169, baseType: !190, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !266, file: !170, line: 169, baseType: !190, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !266, file: !170, line: 169, baseType: !190, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !266, file: !170, line: 169, baseType: !190, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !266, file: !170, line: 169, baseType: !197, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !266, file: !170, line: 169, baseType: !274, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_cstr_t", file: !191, line: 601, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !266, file: !170, line: 169, baseType: !278, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nrg", scope: !171, file: !170, line: 196, baseType: !69, size: 32, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rg", scope: !171, file: !170, line: 197, baseType: !281, size: 64, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "SAM_RG", file: !170, line: 156, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 150, size: 256, elements: !284)
!284 = !{!285, !286, !287, !288, !289}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !283, file: !170, line: 151, baseType: !107, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !283, file: !170, line: 152, baseType: !201, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !283, file: !170, line: 153, baseType: !209, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "name_len", scope: !283, file: !170, line: 154, baseType: !69, size: 32, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !283, file: !170, line: 155, baseType: !69, size: 32, offset: 224)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rg_hash", scope: !171, file: !170, line: 198, baseType: !264, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "npg", scope: !171, file: !170, line: 201, baseType: !69, size: 32, offset: 832)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "npg_end", scope: !171, file: !170, line: 202, baseType: !69, size: 32, offset: 864)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "npg_end_alloc", scope: !171, file: !170, line: 203, baseType: !69, size: 32, offset: 896)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pg", scope: !171, file: !170, line: 204, baseType: !295, size: 64, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "SAM_PG", file: !170, line: 166, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 159, size: 320, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !170, line: 160, baseType: !107, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !297, file: !170, line: 161, baseType: !201, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !297, file: !170, line: 162, baseType: !209, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name_len", scope: !297, file: !170, line: 163, baseType: !69, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !297, file: !170, line: 164, baseType: !69, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "prev_id", scope: !297, file: !170, line: 165, baseType: !69, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pg_hash", scope: !171, file: !170, line: 205, baseType: !264, size: 64, offset: 1024)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pg_end", scope: !171, file: !170, line: 206, baseType: !278, size: 64, offset: 1088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ID_buf", scope: !171, file: !170, line: 209, baseType: !308, size: 8192, offset: 1152)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 1024)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ID_cnt", scope: !171, file: !170, line: 210, baseType: !69, size: 32, offset: 9344)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !171, file: !170, line: 211, baseType: !69, size: 32, offset: 9376)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !129, file: !68, line: 629, baseType: !107, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "record_counter", scope: !129, file: !68, line: 630, baseType: !69, size: 32, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "slice_num", scope: !129, file: !68, line: 631, baseType: !69, size: 32, offset: 352)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !129, file: !68, line: 632, baseType: !69, size: 32, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !129, file: !68, line: 639, baseType: !318, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_container", file: !68, line: 368, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 295, size: 3456, elements: !321)
!321 = !{!322, !325, !326, !327, !328, !329, !330, !331, !332, !333, !335, !336, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !746, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !806}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !320, file: !68, line: 296, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !109, line: 26, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !111, line: 41, baseType: !69)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ref_seq_id", scope: !320, file: !68, line: 297, baseType: !323, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ref_seq_start", scope: !320, file: !68, line: 298, baseType: !323, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ref_seq_span", scope: !320, file: !68, line: 299, baseType: !323, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "record_counter", scope: !320, file: !68, line: 300, baseType: !323, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "num_bases", scope: !320, file: !68, line: 301, baseType: !108, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_records", scope: !320, file: !68, line: 302, baseType: !323, size: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !320, file: !68, line: 303, baseType: !323, size: 32, offset: 288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "num_landmarks", scope: !320, file: !68, line: 304, baseType: !323, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "landmark", scope: !320, file: !68, line: 305, baseType: !334, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !320, file: !68, line: 308, baseType: !179, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "comp_hdr", scope: !320, file: !68, line: 311, baseType: !337, size: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_block_compression_hdr", file: !68, line: 258, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 195, size: 7296, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !357, !374, !375, !377, !378, !379, !397, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ref_seq_id", scope: !339, file: !68, line: 196, baseType: !323, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ref_seq_start", scope: !339, file: !68, line: 197, baseType: !323, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ref_seq_span", scope: !339, file: !68, line: 198, baseType: !323, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "num_records", scope: !339, file: !68, line: 199, baseType: !323, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "num_landmarks", scope: !339, file: !68, line: 200, baseType: !323, size: 32, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "landmark", scope: !339, file: !68, line: 201, baseType: !334, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_qs_included", scope: !339, file: !68, line: 204, baseType: !69, size: 32, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "unmapped_qs_included", scope: !339, file: !68, line: 205, baseType: !69, size: 32, offset: 288)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "unmapped_placed", scope: !339, file: !68, line: 206, baseType: !69, size: 32, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "qs_included", scope: !339, file: !68, line: 207, baseType: !69, size: 32, offset: 352)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "read_names_included", scope: !339, file: !68, line: 208, baseType: !69, size: 32, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "AP_delta", scope: !339, file: !68, line: 209, baseType: !69, size: 32, offset: 416)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "substitution_matrix", scope: !339, file: !68, line: 211, baseType: !354, size: 160, offset: 448)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !355)
!355 = !{!356, !160}
!356 = !DISubrange(count: 5)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "TD_blk", scope: !339, file: !68, line: 214, baseType: !358, size: 64, offset: 640)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_block", file: !68, line: 186, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 173, size: 512, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !371, !372, !373}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !360, file: !68, line: 174, baseType: !67, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "orig_method", scope: !360, file: !68, line: 174, baseType: !67, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !360, file: !68, line: 175, baseType: !75, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "content_id", scope: !360, file: !68, line: 176, baseType: !323, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !360, file: !68, line: 177, baseType: !323, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "uncomp_size", scope: !360, file: !68, line: 178, baseType: !323, size: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !360, file: !68, line: 179, baseType: !323, size: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !360, file: !68, line: 180, baseType: !370, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !360, file: !68, line: 183, baseType: !179, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "byte", scope: !360, file: !68, line: 184, baseType: !179, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !360, file: !68, line: 185, baseType: !69, size: 32, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nTL", scope: !339, file: !68, line: 215, baseType: !69, size: 32, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "TL", scope: !339, file: !68, line: 216, baseType: !376, size: 64, offset: 768)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "TD_hash", scope: !339, file: !68, line: 217, baseType: !264, size: 64, offset: 832)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "TD_keys", scope: !339, file: !68, line: 218, baseType: !219, size: 64, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "preservation_map", scope: !339, file: !68, line: 220, baseType: !380, size: 64, offset: 960)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_map_t", file: !68, line: 82, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 82, size: 320, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !389, !390}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !382, file: !68, line: 82, baseType: !190, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !382, file: !68, line: 82, baseType: !190, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !382, file: !68, line: 82, baseType: !190, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !382, file: !68, line: 82, baseType: !190, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !382, file: !68, line: 82, baseType: !197, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !382, file: !68, line: 82, baseType: !274, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !382, file: !68, line: 82, baseType: !391, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "pmap_t", file: !68, line: 77, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !68, line: 74, size: 64, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !393, file: !68, line: 75, baseType: !69, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !393, file: !68, line: 76, baseType: !107, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rec_encoding_map", scope: !339, file: !68, line: 221, baseType: !398, size: 2048, offset: 1024)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 2048, elements: !20)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cram_map", file: !68, line: 260, size: 256, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !657}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !400, file: !68, line: 261, baseType: !69, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !400, file: !68, line: 262, baseType: !84, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !400, file: !68, line: 263, baseType: !69, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !400, file: !68, line: 264, baseType: !69, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !400, file: !68, line: 265, baseType: !407, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cram_codec", file: !409, line: 109, size: 4544, elements: !410)
!409 = !DIFile(filename: "./cram/cram_codecs.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "109a66833002163bbe6edd1820a5a240")
!410 = !{!411, !412, !416, !576, !580, !584}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !408, file: !409, line: 110, baseType: !84, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !408, file: !409, line: 111, baseType: !413, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !407}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !408, file: !409, line: 112, baseType: !417, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!69, !420, !407, !358, !107, !278}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_slice", file: !68, line: 543, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cram_slice", file: !68, line: 490, size: 1536, elements: !423)
!423 = !{!424, !443, !444, !446, !447, !448, !449, !452, !485, !487, !488, !489, !490, !491, !492, !493, !494, !495, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !422, file: !68, line: 491, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_block_slice_hdr", file: !68, line: 282, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 270, size: 512, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !427, file: !68, line: 271, baseType: !75, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ref_seq_id", scope: !427, file: !68, line: 272, baseType: !323, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ref_seq_start", scope: !427, file: !68, line: 273, baseType: !323, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ref_seq_span", scope: !427, file: !68, line: 274, baseType: !323, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "num_records", scope: !427, file: !68, line: 275, baseType: !323, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "record_counter", scope: !427, file: !68, line: 276, baseType: !323, size: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !427, file: !68, line: 277, baseType: !323, size: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num_content_ids", scope: !427, file: !68, line: 278, baseType: !323, size: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "block_content_ids", scope: !427, file: !68, line: 279, baseType: !334, size: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ref_base_id", scope: !427, file: !68, line: 280, baseType: !323, size: 32, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "md5", scope: !427, file: !68, line: 281, baseType: !440, size: 128, offset: 352)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 128, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 16)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_block", scope: !422, file: !68, line: 492, baseType: !358, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !422, file: !68, line: 493, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "block_by_id", scope: !422, file: !68, line: 494, baseType: !445, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "last_apos", scope: !422, file: !68, line: 497, baseType: !69, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "max_apos", scope: !422, file: !68, line: 497, baseType: !69, size: 32, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !422, file: !68, line: 500, baseType: !450, size: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !163, line: 27, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !111, line: 45, baseType: !181)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "crecs", scope: !422, file: !68, line: 503, baseType: !453, size: 64, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_record", file: !68, line: 410, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 373, size: 896, elements: !456)
!456 = !{!457, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !455, file: !68, line: 374, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !455, file: !68, line: 376, baseType: !323, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !68, line: 377, baseType: !323, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "cram_flags", scope: !455, file: !68, line: 378, baseType: !323, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !455, file: !68, line: 379, baseType: !323, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "apos", scope: !455, file: !68, line: 380, baseType: !323, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rg", scope: !455, file: !68, line: 381, baseType: !323, size: 32, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !455, file: !68, line: 382, baseType: !323, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "name_len", scope: !455, file: !68, line: 383, baseType: !323, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mate_line", scope: !455, file: !68, line: 384, baseType: !323, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mate_ref_id", scope: !455, file: !68, line: 385, baseType: !323, size: 32, offset: 352)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mate_pos", scope: !455, file: !68, line: 386, baseType: !323, size: 32, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !455, file: !68, line: 387, baseType: !323, size: 32, offset: 416)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ntags", scope: !455, file: !68, line: 390, baseType: !323, size: 32, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !455, file: !68, line: 391, baseType: !323, size: 32, offset: 480)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "aux_size", scope: !455, file: !68, line: 392, baseType: !323, size: 32, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tn", scope: !455, file: !68, line: 396, baseType: !323, size: 32, offset: 544)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "TL", scope: !455, file: !68, line: 398, baseType: !69, size: 32, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !455, file: !68, line: 400, baseType: !323, size: 32, offset: 608)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !455, file: !68, line: 401, baseType: !323, size: 32, offset: 640)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "cigar", scope: !455, file: !68, line: 402, baseType: !323, size: 32, offset: 672)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ncigar", scope: !455, file: !68, line: 403, baseType: !323, size: 32, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "aend", scope: !455, file: !68, line: 404, baseType: !323, size: 32, offset: 736)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mqual", scope: !455, file: !68, line: 405, baseType: !323, size: 32, offset: 768)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "feature", scope: !455, file: !68, line: 407, baseType: !323, size: 32, offset: 800)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "nfeature", scope: !455, file: !68, line: 408, baseType: !323, size: 32, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mate_flags", scope: !455, file: !68, line: 409, baseType: !323, size: 32, offset: 864)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "cigar", scope: !422, file: !68, line: 508, baseType: !486, size: 64, offset: 448)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cigar_alloc", scope: !422, file: !68, line: 509, baseType: !259, size: 32, offset: 512)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ncigar", scope: !422, file: !68, line: 510, baseType: !259, size: 32, offset: 544)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "name_blk", scope: !422, file: !68, line: 511, baseType: !358, size: 64, offset: 576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "seqs_blk", scope: !422, file: !68, line: 512, baseType: !358, size: 64, offset: 640)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "qual_blk", scope: !422, file: !68, line: 513, baseType: !358, size: 64, offset: 704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "aux_blk", scope: !422, file: !68, line: 514, baseType: !358, size: 64, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "base_blk", scope: !422, file: !68, line: 515, baseType: !358, size: 64, offset: 832)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "soft_blk", scope: !422, file: !68, line: 516, baseType: !358, size: 64, offset: 896)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !422, file: !68, line: 518, baseType: !496, size: 64, offset: 960)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_feature", file: !68, line: 483, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 427, size: 128, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, scope: !498, file: !68, line: 428, baseType: !501, size: 128)
!501 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !498, file: !68, line: 428, size: 128, elements: !502)
!502 = !{!503, !509, !516, !522, !529, !536, !542, !548, !554, !560}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !501, file: !68, line: 433, baseType: !504, size: 96)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !68, line: 429, size: 96, elements: !505)
!505 = !{!506, !507, !508}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !504, file: !68, line: 430, baseType: !69, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !504, file: !68, line: 431, baseType: !69, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !504, file: !68, line: 432, baseType: !69, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !501, file: !68, line: 439, baseType: !510, size: 128)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !68, line: 434, size: 128, elements: !511)
!511 = !{!512, !513, !514, !515}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !510, file: !68, line: 435, baseType: !69, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !510, file: !68, line: 436, baseType: !69, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !510, file: !68, line: 437, baseType: !69, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !510, file: !68, line: 438, baseType: !69, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !501, file: !68, line: 444, baseType: !517, size: 96)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !68, line: 440, size: 96, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !517, file: !68, line: 441, baseType: !69, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !517, file: !68, line: 442, baseType: !69, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !517, file: !68, line: 443, baseType: !69, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "S", scope: !501, file: !68, line: 450, baseType: !523, size: 128)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !68, line: 445, size: 128, elements: !524)
!524 = !{!525, !526, !527, !528}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !523, file: !68, line: 446, baseType: !69, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !523, file: !68, line: 447, baseType: !69, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !523, file: !68, line: 448, baseType: !69, size: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "seq_idx", scope: !523, file: !68, line: 449, baseType: !69, size: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "I", scope: !501, file: !68, line: 456, baseType: !530, size: 128)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !68, line: 451, size: 128, elements: !531)
!531 = !{!532, !533, !534, !535}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !530, file: !68, line: 452, baseType: !69, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !530, file: !68, line: 453, baseType: !69, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !530, file: !68, line: 454, baseType: !69, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "seq_idx", scope: !530, file: !68, line: 455, baseType: !69, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !501, file: !68, line: 461, baseType: !537, size: 96)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !68, line: 457, size: 96, elements: !538)
!538 = !{!539, !540, !541}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !537, file: !68, line: 458, baseType: !69, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !537, file: !68, line: 459, baseType: !69, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !537, file: !68, line: 460, baseType: !69, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !501, file: !68, line: 466, baseType: !543, size: 96)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !68, line: 462, size: 96, elements: !544)
!544 = !{!545, !546, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !543, file: !68, line: 463, baseType: !69, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !543, file: !68, line: 464, baseType: !69, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !543, file: !68, line: 465, baseType: !69, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !501, file: !68, line: 471, baseType: !549, size: 96)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !68, line: 467, size: 96, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !549, file: !68, line: 468, baseType: !69, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !549, file: !68, line: 469, baseType: !69, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !549, file: !68, line: 470, baseType: !69, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !501, file: !68, line: 476, baseType: !555, size: 96)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !68, line: 472, size: 96, elements: !556)
!556 = !{!557, !558, !559}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !555, file: !68, line: 473, baseType: !69, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !555, file: !68, line: 474, baseType: !69, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !555, file: !68, line: 475, baseType: !69, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "H", scope: !501, file: !68, line: 481, baseType: !561, size: 96)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !68, line: 477, size: 96, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !561, file: !68, line: 478, baseType: !69, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !561, file: !68, line: 479, baseType: !69, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !561, file: !68, line: 480, baseType: !69, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nfeatures", scope: !422, file: !68, line: 519, baseType: !69, size: 32, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "afeatures", scope: !422, file: !68, line: 520, baseType: !69, size: 32, offset: 1056)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tn_blk", scope: !422, file: !68, line: 527, baseType: !358, size: 64, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tn_id", scope: !422, file: !68, line: 528, baseType: !69, size: 32, offset: 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pair_keys", scope: !422, file: !68, line: 531, baseType: !219, size: 64, offset: 1216)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !422, file: !68, line: 532, baseType: !264, size: 64, offset: 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !422, file: !68, line: 534, baseType: !107, size: 64, offset: 1344)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ref_start", scope: !422, file: !68, line: 535, baseType: !69, size: 32, offset: 1408)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ref_end", scope: !422, file: !68, line: 536, baseType: !69, size: 32, offset: 1440)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !422, file: !68, line: 542, baseType: !69, size: 32, offset: 1472)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !408, file: !409, line: 114, baseType: !577, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!69, !420, !407, !358, !107, !69}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !408, file: !409, line: 116, baseType: !581, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!69, !407, !358, !107, !69}
!584 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !409, line: 118, baseType: !585, size: 4224, offset: 320)
!585 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !409, line: 118, size: 4224, elements: !586)
!586 = !{!587, !601, !607, !613, !618, !624, !630, !636, !646, !647, !648, !656}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "huffman", scope: !585, file: !409, line: 119, baseType: !588, size: 128)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_huffman_decoder", file: !409, line: 61, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 58, size: 128, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ncodes", scope: !589, file: !409, line: 59, baseType: !69, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "codes", scope: !589, file: !409, line: 60, baseType: !593, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_huffman_code", file: !409, line: 56, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 51, size: 128, elements: !596)
!596 = !{!597, !598, !599, !600}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !595, file: !409, line: 52, baseType: !323, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !595, file: !409, line: 53, baseType: !323, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !595, file: !409, line: 54, baseType: !323, size: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !595, file: !409, line: 55, baseType: !323, size: 32, offset: 96)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !585, file: !409, line: 120, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_external_decoder", file: !409, line: 87, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 84, size: 64, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "content_id", scope: !603, file: !409, line: 85, baseType: !323, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !603, file: !409, line: 86, baseType: !97, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !585, file: !409, line: 121, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_beta_decoder", file: !409, line: 73, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 70, size: 64, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !609, file: !409, line: 71, baseType: !323, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !609, file: !409, line: 72, baseType: !323, size: 32, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !585, file: !409, line: 122, baseType: !614, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_gamma_decoder", file: !409, line: 77, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 75, size: 32, elements: !616)
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !615, file: !409, line: 76, baseType: !323, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "subexp", scope: !585, file: !409, line: 123, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_subexp_decoder", file: !409, line: 82, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 79, size: 64, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !620, file: !409, line: 80, baseType: !323, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !620, file: !409, line: 81, baseType: !323, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "byte_array_len", scope: !585, file: !409, line: 124, baseType: !625, size: 128)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_byte_array_len_decoder", file: !409, line: 92, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 89, size: 128, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "len_codec", scope: !626, file: !409, line: 90, baseType: !407, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "value_codec", scope: !626, file: !409, line: 91, baseType: !407, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "byte_array_stop", scope: !585, file: !409, line: 125, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_byte_array_stop_decoder", file: !409, line: 97, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 94, size: 64, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !632, file: !409, line: 95, baseType: !106, size: 8)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "content_id", scope: !632, file: !409, line: 96, baseType: !323, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "e_huffman", scope: !585, file: !409, line: 127, baseType: !637, size: 4224)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_huffman_encoder", file: !409, line: 68, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 64, size: 4224, elements: !639)
!639 = !{!640, !641, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "codes", scope: !638, file: !409, line: 65, baseType: !593, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "nvals", scope: !638, file: !409, line: 66, baseType: !69, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "val2code", scope: !638, file: !409, line: 67, baseType: !643, size: 4128, offset: 96)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 4128, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 129)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "e_external", scope: !585, file: !409, line: 128, baseType: !602, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "e_byte_array_stop", scope: !585, file: !409, line: 129, baseType: !631, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "e_byte_array_len", scope: !585, file: !409, line: 130, baseType: !649, size: 256)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_byte_array_len_encoder", file: !409, line: 104, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 99, size: 256, elements: !651)
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "len_len", scope: !650, file: !409, line: 100, baseType: !259, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "len_dat", scope: !650, file: !409, line: 101, baseType: !370, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "val_len", scope: !650, file: !409, line: 102, baseType: !259, size: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "val_dat", scope: !650, file: !409, line: 103, baseType: !370, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "e_beta", scope: !585, file: !409, line: 131, baseType: !608, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !68, line: 266, baseType: !399, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "tag_encoding_map", scope: !339, file: !68, line: 222, baseType: !398, size: 2048, offset: 3072)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "BF_codec", scope: !339, file: !68, line: 224, baseType: !407, size: 64, offset: 5120)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "CF_codec", scope: !339, file: !68, line: 225, baseType: !407, size: 64, offset: 5184)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RL_codec", scope: !339, file: !68, line: 226, baseType: !407, size: 64, offset: 5248)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "AP_codec", scope: !339, file: !68, line: 227, baseType: !407, size: 64, offset: 5312)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RG_codec", scope: !339, file: !68, line: 228, baseType: !407, size: 64, offset: 5376)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "MF_codec", scope: !339, file: !68, line: 229, baseType: !407, size: 64, offset: 5440)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "NS_codec", scope: !339, file: !68, line: 230, baseType: !407, size: 64, offset: 5504)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "NP_codec", scope: !339, file: !68, line: 231, baseType: !407, size: 64, offset: 5568)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "TS_codec", scope: !339, file: !68, line: 232, baseType: !407, size: 64, offset: 5632)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "NF_codec", scope: !339, file: !68, line: 233, baseType: !407, size: 64, offset: 5696)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "TC_codec", scope: !339, file: !68, line: 234, baseType: !407, size: 64, offset: 5760)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "TN_codec", scope: !339, file: !68, line: 235, baseType: !407, size: 64, offset: 5824)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "TL_codec", scope: !339, file: !68, line: 236, baseType: !407, size: 64, offset: 5888)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "FN_codec", scope: !339, file: !68, line: 237, baseType: !407, size: 64, offset: 5952)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "FC_codec", scope: !339, file: !68, line: 238, baseType: !407, size: 64, offset: 6016)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "FP_codec", scope: !339, file: !68, line: 239, baseType: !407, size: 64, offset: 6080)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "BS_codec", scope: !339, file: !68, line: 240, baseType: !407, size: 64, offset: 6144)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "IN_codec", scope: !339, file: !68, line: 241, baseType: !407, size: 64, offset: 6208)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "SC_codec", scope: !339, file: !68, line: 242, baseType: !407, size: 64, offset: 6272)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "DL_codec", scope: !339, file: !68, line: 243, baseType: !407, size: 64, offset: 6336)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "BA_codec", scope: !339, file: !68, line: 244, baseType: !407, size: 64, offset: 6400)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RS_codec", scope: !339, file: !68, line: 245, baseType: !407, size: 64, offset: 6464)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "PD_codec", scope: !339, file: !68, line: 246, baseType: !407, size: 64, offset: 6528)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "HC_codec", scope: !339, file: !68, line: 247, baseType: !407, size: 64, offset: 6592)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "MQ_codec", scope: !339, file: !68, line: 248, baseType: !407, size: 64, offset: 6656)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "RN_codec", scope: !339, file: !68, line: 249, baseType: !407, size: 64, offset: 6720)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "QS_codec", scope: !339, file: !68, line: 250, baseType: !407, size: 64, offset: 6784)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Qs_codec", scope: !339, file: !68, line: 251, baseType: !407, size: 64, offset: 6848)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RI_codec", scope: !339, file: !68, line: 252, baseType: !407, size: 64, offset: 6912)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "TM_codec", scope: !339, file: !68, line: 253, baseType: !407, size: 64, offset: 6976)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "TV_codec", scope: !339, file: !68, line: 254, baseType: !407, size: 64, offset: 7040)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "uncomp", scope: !339, file: !68, line: 256, baseType: !107, size: 64, offset: 7104)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "uncomp_size", scope: !339, file: !68, line: 257, baseType: !179, size: 64, offset: 7168)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "uncomp_alloc", scope: !339, file: !68, line: 257, baseType: !179, size: 64, offset: 7232)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "comp_hdr_block", scope: !320, file: !68, line: 312, baseType: !358, size: 64, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice", scope: !320, file: !68, line: 315, baseType: !69, size: 32, offset: 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "curr_slice", scope: !320, file: !68, line: 315, baseType: !69, size: 32, offset: 672)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "max_rec", scope: !320, file: !68, line: 316, baseType: !69, size: 32, offset: 704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "curr_rec", scope: !320, file: !68, line: 316, baseType: !69, size: 32, offset: 736)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "max_c_rec", scope: !320, file: !68, line: 317, baseType: !69, size: 32, offset: 768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "curr_c_rec", scope: !320, file: !68, line: 317, baseType: !69, size: 32, offset: 800)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "slice_rec", scope: !320, file: !68, line: 318, baseType: !69, size: 32, offset: 832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "curr_ref", scope: !320, file: !68, line: 319, baseType: !69, size: 32, offset: 864)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !320, file: !68, line: 320, baseType: !69, size: 32, offset: 896)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !320, file: !68, line: 321, baseType: !704, size: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !320, file: !68, line: 321, baseType: !458, size: 64, offset: 1024)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pos_sorted", scope: !320, file: !68, line: 322, baseType: !69, size: 32, offset: 1088)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "max_apos", scope: !320, file: !68, line: 323, baseType: !69, size: 32, offset: 1120)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "last_slice", scope: !320, file: !68, line: 324, baseType: !69, size: 32, offset: 1152)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "multi_seq", scope: !320, file: !68, line: 325, baseType: !69, size: 32, offset: 1184)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "unsorted", scope: !320, file: !68, line: 326, baseType: !69, size: 32, offset: 1216)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ref_start", scope: !320, file: !68, line: 329, baseType: !69, size: 32, offset: 1248)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "first_base", scope: !320, file: !68, line: 329, baseType: !69, size: 32, offset: 1280)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "last_base", scope: !320, file: !68, line: 329, baseType: !69, size: 32, offset: 1312)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !320, file: !68, line: 329, baseType: !69, size: 32, offset: 1344)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ref_end", scope: !320, file: !68, line: 329, baseType: !69, size: 32, offset: 1376)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !320, file: !68, line: 330, baseType: !107, size: 64, offset: 1408)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "bams", scope: !320, file: !68, line: 334, baseType: !718, size: 64, offset: 1472)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "bam_seq_t", file: !721, line: 75, baseType: !722)
!721 = !DIFile(filename: "./cram/cram_samtools.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "8e2242983ee4148bfb80f0b0f767ae01")
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "bam1_t", file: !723, line: 152, baseType: !724)
!723 = !DIFile(filename: "./htslib/sam.h", directory: "/local-ssd/star-s7gfyo2prvaki7w6cr7mtqgyaudishwq-build/aidengro/spack-stage-star-2.7.10b-s7gfyo2prvaki7w6cr7mtqgyaudishwq/spack-src/source/htslib", checksumkind: CSK_MD5, checksum: "10249196401e59aa212c294be0dde90b")
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !723, line: 145, size: 448, elements: !725)
!725 = !{!726, !741, !742, !743, !745}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !724, file: !723, line: 146, baseType: !727, size: 256)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "bam1_core_t", file: !723, line: 128, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !723, line: 119, size: 256, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !728, file: !723, line: 120, baseType: !323, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !728, file: !723, line: 121, baseType: !323, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bin", scope: !728, file: !723, line: 122, baseType: !259, size: 16, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !728, file: !723, line: 122, baseType: !259, size: 8, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "l_qname", scope: !728, file: !723, line: 122, baseType: !259, size: 8, offset: 88, flags: DIFlagBitField, extraData: i64 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !728, file: !723, line: 123, baseType: !259, size: 16, offset: 96, flags: DIFlagBitField, extraData: i64 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "n_cigar", scope: !728, file: !723, line: 123, baseType: !259, size: 16, offset: 112, flags: DIFlagBitField, extraData: i64 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "l_qseq", scope: !728, file: !723, line: 124, baseType: !323, size: 32, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mtid", scope: !728, file: !723, line: 125, baseType: !323, size: 32, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mpos", scope: !728, file: !723, line: 126, baseType: !323, size: 32, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "isize", scope: !728, file: !723, line: 127, baseType: !323, size: 32, offset: 224)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "l_data", scope: !724, file: !723, line: 147, baseType: !69, size: 32, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "m_data", scope: !724, file: !723, line: 147, baseType: !69, size: 32, offset: 288)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !724, file: !723, line: 148, baseType: !744, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !724, file: !723, line: 150, baseType: !450, size: 64, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "TS_stats", scope: !320, file: !68, line: 337, baseType: !747, size: 64, offset: 1536)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "cram_stats", file: !68, line: 110, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 105, size: 32896, elements: !750)
!750 = !{!751, !753, !765, !766}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "freqs", scope: !749, file: !68, line: 106, baseType: !752, size: 32768)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 32768, elements: !309)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !749, file: !68, line: 107, baseType: !754, size: 64, offset: 32768)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_m_i2i_t", file: !68, line: 63, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 63, size: 320, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !756, file: !68, line: 63, baseType: !190, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !756, file: !68, line: 63, baseType: !190, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !756, file: !68, line: 63, baseType: !190, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !756, file: !68, line: 63, baseType: !190, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !756, file: !68, line: 63, baseType: !197, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !756, file: !68, line: 63, baseType: !197, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !756, file: !68, line: 63, baseType: !278, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "nsamp", scope: !749, file: !68, line: 108, baseType: !69, size: 32, offset: 32832)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "nvals", scope: !749, file: !68, line: 109, baseType: !69, size: 32, offset: 32864)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "RG_stats", scope: !320, file: !68, line: 338, baseType: !747, size: 64, offset: 1600)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "FP_stats", scope: !320, file: !68, line: 339, baseType: !747, size: 64, offset: 1664)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "NS_stats", scope: !320, file: !68, line: 340, baseType: !747, size: 64, offset: 1728)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "RN_stats", scope: !320, file: !68, line: 341, baseType: !747, size: 64, offset: 1792)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "CF_stats", scope: !320, file: !68, line: 342, baseType: !747, size: 64, offset: 1856)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "TN_stats", scope: !320, file: !68, line: 343, baseType: !747, size: 64, offset: 1920)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "BA_stats", scope: !320, file: !68, line: 344, baseType: !747, size: 64, offset: 1984)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "TV_stats", scope: !320, file: !68, line: 345, baseType: !747, size: 64, offset: 2048)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "BS_stats", scope: !320, file: !68, line: 346, baseType: !747, size: 64, offset: 2112)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "FC_stats", scope: !320, file: !68, line: 347, baseType: !747, size: 64, offset: 2176)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "BF_stats", scope: !320, file: !68, line: 348, baseType: !747, size: 64, offset: 2240)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "AP_stats", scope: !320, file: !68, line: 349, baseType: !747, size: 64, offset: 2304)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "NF_stats", scope: !320, file: !68, line: 350, baseType: !747, size: 64, offset: 2368)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "MF_stats", scope: !320, file: !68, line: 351, baseType: !747, size: 64, offset: 2432)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "FN_stats", scope: !320, file: !68, line: 352, baseType: !747, size: 64, offset: 2496)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "RL_stats", scope: !320, file: !68, line: 353, baseType: !747, size: 64, offset: 2560)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "DL_stats", scope: !320, file: !68, line: 354, baseType: !747, size: 64, offset: 2624)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "TC_stats", scope: !320, file: !68, line: 355, baseType: !747, size: 64, offset: 2688)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "TL_stats", scope: !320, file: !68, line: 356, baseType: !747, size: 64, offset: 2752)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "MQ_stats", scope: !320, file: !68, line: 357, baseType: !747, size: 64, offset: 2816)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "TM_stats", scope: !320, file: !68, line: 358, baseType: !747, size: 64, offset: 2880)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "QS_stats", scope: !320, file: !68, line: 359, baseType: !747, size: 64, offset: 2944)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "NP_stats", scope: !320, file: !68, line: 360, baseType: !747, size: 64, offset: 3008)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "RI_stats", scope: !320, file: !68, line: 361, baseType: !747, size: 64, offset: 3072)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "RS_stats", scope: !320, file: !68, line: 362, baseType: !747, size: 64, offset: 3136)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "PD_stats", scope: !320, file: !68, line: 363, baseType: !747, size: 64, offset: 3200)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "HC_stats", scope: !320, file: !68, line: 364, baseType: !747, size: 64, offset: 3264)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tags_used", scope: !320, file: !68, line: 366, baseType: !795, size: 64, offset: 3328)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_s_i2i_t", file: !68, line: 66, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 66, size: 320, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !797, file: !68, line: 66, baseType: !190, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !797, file: !68, line: 66, baseType: !190, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !797, file: !68, line: 66, baseType: !190, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !797, file: !68, line: 66, baseType: !190, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !797, file: !68, line: 66, baseType: !197, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !797, file: !68, line: 66, baseType: !197, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !797, file: !68, line: 66, baseType: !107, size: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "refs_used", scope: !320, file: !68, line: 367, baseType: !278, size: 64, offset: 3392)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "first_base", scope: !129, file: !68, line: 642, baseType: !69, size: 32, offset: 512)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "last_base", scope: !129, file: !68, line: 642, baseType: !69, size: 32, offset: 544)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !129, file: !68, line: 645, baseType: !810, size: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "refs_t", file: !68, line: 578, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 563, size: 896, elements: !813)
!813 = !{!814, !815, !840, !841, !842, !843, !894, !895, !925, !926}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !812, file: !68, line: 564, baseType: !219, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "h_meta", scope: !812, file: !68, line: 566, baseType: !816, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_refs_t", file: !68, line: 560, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 560, size: 320, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !818, file: !68, line: 560, baseType: !190, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !818, file: !68, line: 560, baseType: !190, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !818, file: !68, line: 560, baseType: !190, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !818, file: !68, line: 560, baseType: !190, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !818, file: !68, line: 560, baseType: !197, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !818, file: !68, line: 560, baseType: !274, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !818, file: !68, line: 560, baseType: !827, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ref_entry", file: !68, line: 558, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ref_entry", file: !68, line: 549, size: 448, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !830, file: !68, line: 550, baseType: !107, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !830, file: !68, line: 551, baseType: !107, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !830, file: !68, line: 552, baseType: !108, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !830, file: !68, line: 553, baseType: !108, size: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "bases_per_line", scope: !830, file: !68, line: 554, baseType: !69, size: 32, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !830, file: !68, line: 555, baseType: !69, size: 32, offset: 288)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !830, file: !68, line: 556, baseType: !108, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !830, file: !68, line: 557, baseType: !107, size: 64, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !812, file: !68, line: 567, baseType: !827, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "nref", scope: !812, file: !68, line: 568, baseType: !69, size: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !812, file: !68, line: 570, baseType: !107, size: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !812, file: !68, line: 571, baseType: !844, size: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !846, line: 7, baseType: !847)
!846 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !848, line: 49, size: 1728, elements: !849)
!848 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !865, !867, !868, !869, !870, !872, !874, !878, !881, !883, !886, !889, !890, !891, !892, !893}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !847, file: !848, line: 51, baseType: !69, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !847, file: !848, line: 54, baseType: !107, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !847, file: !848, line: 55, baseType: !107, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !847, file: !848, line: 56, baseType: !107, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !847, file: !848, line: 57, baseType: !107, size: 64, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !847, file: !848, line: 58, baseType: !107, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !847, file: !848, line: 59, baseType: !107, size: 64, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !847, file: !848, line: 60, baseType: !107, size: 64, offset: 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !847, file: !848, line: 61, baseType: !107, size: 64, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !847, file: !848, line: 64, baseType: !107, size: 64, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !847, file: !848, line: 65, baseType: !107, size: 64, offset: 640)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !847, file: !848, line: 66, baseType: !107, size: 64, offset: 704)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !847, file: !848, line: 68, baseType: !863, size: 64, offset: 768)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !848, line: 36, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !847, file: !848, line: 70, baseType: !866, size: 64, offset: 832)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !847, file: !848, line: 72, baseType: !69, size: 32, offset: 896)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !847, file: !848, line: 73, baseType: !69, size: 32, offset: 928)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !847, file: !848, line: 74, baseType: !147, size: 64, offset: 960)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !847, file: !848, line: 77, baseType: !871, size: 16, offset: 1024)
!871 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !847, file: !848, line: 78, baseType: !873, size: 8, offset: 1040)
!873 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !847, file: !848, line: 79, baseType: !875, size: 8, offset: 1048)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 1)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !847, file: !848, line: 81, baseType: !879, size: 64, offset: 1088)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !848, line: 43, baseType: null)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !847, file: !848, line: 89, baseType: !882, size: 64, offset: 1152)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 153, baseType: !112)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !847, file: !848, line: 91, baseType: !884, size: 64, offset: 1216)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !848, line: 37, flags: DIFlagFwdDecl)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !847, file: !848, line: 92, baseType: !887, size: 64, offset: 1280)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !848, line: 38, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !847, file: !848, line: 93, baseType: !866, size: 64, offset: 1344)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !847, file: !848, line: 94, baseType: !247, size: 64, offset: 1408)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !847, file: !848, line: 95, baseType: !179, size: 64, offset: 1472)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !847, file: !848, line: 96, baseType: !69, size: 32, offset: 1536)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !847, file: !848, line: 98, baseType: !34, size: 160, offset: 1568)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !812, file: !68, line: 573, baseType: !69, size: 32, offset: 384)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !812, file: !68, line: 575, baseType: !896, size: 320, offset: 448)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !897, line: 72, baseType: !898)
!897 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !897, line: 67, size: 320, elements: !899)
!899 = !{!900, !920, !924}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !898, file: !897, line: 69, baseType: !901, size: 320)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !902, line: 22, size: 320, elements: !903)
!902 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!903 = !{!904, !905, !906, !907, !908, !909, !911, !912}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !901, file: !902, line: 24, baseType: !69, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !901, file: !902, line: 25, baseType: !85, size: 32, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !901, file: !902, line: 26, baseType: !69, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !901, file: !902, line: 28, baseType: !85, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !901, file: !902, line: 32, baseType: !69, size: 32, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !901, file: !902, line: 34, baseType: !910, size: 16, offset: 160)
!910 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !901, file: !902, line: 35, baseType: !910, size: 16, offset: 176)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !901, file: !902, line: 36, baseType: !913, size: 128, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !914, line: 55, baseType: !915)
!914 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !914, line: 51, size: 128, elements: !916)
!916 = !{!917, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !915, file: !914, line: 53, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !915, file: !914, line: 54, baseType: !918, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !898, file: !897, line: 70, baseType: !921, size: 320)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 40)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !898, file: !897, line: 71, baseType: !112, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !812, file: !68, line: 576, baseType: !828, size: 64, offset: 768)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !812, file: !68, line: 577, baseType: !69, size: 32, offset: 832)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !129, file: !68, line: 646, baseType: !107, size: 64, offset: 640)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ref_free", scope: !129, file: !68, line: 646, baseType: !107, size: 64, offset: 704)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !129, file: !68, line: 647, baseType: !69, size: 32, offset: 768)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ref_start", scope: !129, file: !68, line: 648, baseType: !69, size: 32, offset: 800)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ref_end", scope: !129, file: !68, line: 649, baseType: !69, size: 32, offset: 832)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ref_fn", scope: !129, file: !68, line: 650, baseType: !107, size: 64, offset: 896)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !129, file: !68, line: 653, baseType: !69, size: 32, offset: 960)
