; ModuleID = 'samples/696.bc'
source_filename = "src/extended/luaserialize.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"!err || !gt_error_is_set(err)\00", align 1, !dbg !7
@__func__.gt_lua_table_to_str = private unnamed_addr constant [20 x i8] c"gt_lua_table_to_str\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [28 x i8] c"src/extended/luaserialize.c\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [34 x i8] c"L && out && lua_istable(L, index)\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [28 x i8] c"lua_gettop(L) == stack_size\00", align 1, !dbg !28

!197 = !DIFile(filename: "src/core/str_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "654ceffd2f9ff17a42a8522fe21401e1")
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStr", file: !197, line: 27, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !201, line: 44, baseType: !202)
!201 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !201, line: 44, flags: DIFlagFwdDecl)
!203 = !{!204, !205, !206, !207, !208, !209}
!204 = !DILocalVariable(name: "L", arg: 1, scope: !187, file: !2, line: 111, type: !191)
!205 = !DILocalVariable(name: "out", arg: 2, scope: !187, file: !2, line: 111, type: !195)
!206 = !DILocalVariable(name: "index", arg: 3, scope: !187, file: !2, line: 111, type: !190)
!207 = !DILocalVariable(name: "err", arg: 4, scope: !187, file: !2, line: 111, type: !199)
!208 = !DILocalVariable(name: "had_err", scope: !187, file: !2, line: 113, type: !190)
!209 = !DILocalVariable(name: "stack_size", scope: !187, file: !2, line: 115, type: !190)
!210 = !{!211, !211, i64 0}
!211 = !{!"any pointer", !212, i64 0}
!212 = !{!"omnipotent char", !213, i64 0}
!213 = !{!"Simple C/C++ TBAA"}
!214 = !DILocation(line: 111, column: 36, scope: !187)
!215 = !DILocation(line: 111, column: 46, scope: !187)
!216 = !{!217, !217, i64 0}
!217 = !{!"int", !212, i64 0}
!218 = !DILocation(line: 111, column: 55, scope: !187)
!219 = !DILocation(line: 111, column: 71, scope: !187)
!220 = !DILocation(line: 113, column: 3, scope: !187)
!221 = !DILocation(line: 113, column: 7, scope: !187)
!222 = !DILocation(line: 115, column: 3, scope: !187)
!223 = !DILocation(line: 115, column: 7, scope: !187)
!224 = !DILocation(line: 115, column: 31, scope: !187)
!225 = !DILocation(line: 115, column: 20, scope: !187)
!226 = !DILocation(line: 117, column: 3, scope: !187)
!227 = !DILocation(line: 117, column: 3, scope: !228)
!228 = distinct !DILexicalBlock(scope: !229, file: !2, line: 117, column: 3)
!229 = distinct !DILexicalBlock(scope: !187, file: !2, line: 117, column: 3)
!230 = !DILocation(line: 117, column: 3, scope: !229)
!231 = !DILocation(line: 117, column: 3, scope: !232)
!232 = distinct !DILexicalBlock(scope: !228, file: !2, line: 117, column: 3)
!233 = !DILocation(line: 118, column: 3, scope: !187)
!234 = !DILocation(line: 118, column: 3, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !2, line: 118, column: 3)
!236 = distinct !DILexicalBlock(scope: !187, file: !2, line: 118, column: 3)
!237 = !DILocation(line: 118, column: 3, scope: !236)
!238 = !DILocation(line: 118, column: 3, scope: !239)
!239 = distinct !DILexicalBlock(scope: !235, file: !2, line: 118, column: 3)
!240 = !DILocation(line: 119, column: 25, scope: !187)
!241 = !DILocation(line: 119, column: 28, scope: !187)
!242 = !DILocation(line: 119, column: 33, scope: !187)
!243 = !DILocation(line: 119, column: 43, scope: !187)
!244 = !DILocation(line: 119, column: 13, scope: !187)
!245 = !DILocation(line: 119, column: 11, scope: !187)
!246 = !DILocation(line: 120, column: 3, scope: !187)
!247 = !DILocation(line: 120, column: 3, scope: !248)
!248 = distinct !DILexicalBlock(scope: !249, file: !2, line: 120, column: 3)
!249 = distinct !DILexicalBlock(scope: !187, file: !2, line: 120, column: 3)
!250 = !DILocation(line: 120, column: 3, scope: !249)
!251 = !DILocation(line: 120, column: 3, scope: !252)
!252 = distinct !DILexicalBlock(scope: !248, file: !2, line: 120, column: 3)
!253 = !DILocation(line: 121, column: 10, scope: !187)
!254 = !DILocation(line: 122, column: 1, scope: !187)
!255 = !DILocation(line: 121, column: 3, scope: !187)
!256 = !DISubprogram(name: "lua_gettop", scope: !193, file: !193, line: 121, type: !257, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!257 = !DISubroutineType(types: !258)
!258 = !{!190, !191}
!259 = !DISubprogram(name: "gt_error_is_set", scope: !201, file: !201, line: 64, type: !260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !263}
!262 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!265 = !DISubprogram(name: "fprintf", scope: !266, file: !266, line: 350, type: !267, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!266 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!267 = !DISubroutineType(types: !268)
!268 = !{!190, !269, !328, null}
!269 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !272, line: 7, baseType: !273)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !274, line: 49, size: 1728, elements: !275)
!274 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!275 = !{!276, !277, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !292, !294, !295, !296, !300, !302, !304, !308, !311, !313, !316, !319, !320, !322, !326, !327}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !273, file: !274, line: 51, baseType: !190, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !273, file: !274, line: 54, baseType: !278, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !273, file: !274, line: 55, baseType: !278, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !273, file: !274, line: 56, baseType: !278, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !273, file: !274, line: 57, baseType: !278, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !273, file: !274, line: 58, baseType: !278, size: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !273, file: !274, line: 59, baseType: !278, size: 64, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !273, file: !274, line: 60, baseType: !278, size: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !273, file: !274, line: 61, baseType: !278, size: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !273, file: !274, line: 64, baseType: !278, size: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !273, file: !274, line: 65, baseType: !278, size: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !273, file: !274, line: 66, baseType: !278, size: 64, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !273, file: !274, line: 68, baseType: !290, size: 64, offset: 768)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !274, line: 36, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !273, file: !274, line: 70, baseType: !293, size: 64, offset: 832)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !273, file: !274, line: 72, baseType: !190, size: 32, offset: 896)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !273, file: !274, line: 73, baseType: !190, size: 32, offset: 928)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !273, file: !274, line: 74, baseType: !297, size: 64, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !298, line: 152, baseType: !299)
!298 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!299 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !273, file: !274, line: 77, baseType: !301, size: 16, offset: 1024)
!301 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !273, file: !274, line: 78, baseType: !303, size: 8, offset: 1040)
!303 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !273, file: !274, line: 79, baseType: !305, size: 8, offset: 1048)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 1)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !273, file: !274, line: 81, baseType: !309, size: 64, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !274, line: 43, baseType: null)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !273, file: !274, line: 89, baseType: !312, size: 64, offset: 1152)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !298, line: 153, baseType: !299)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !273, file: !274, line: 91, baseType: !314, size: 64, offset: 1216)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !274, line: 37, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !273, file: !274, line: 92, baseType: !317, size: 64, offset: 1280)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !274, line: 38, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !273, file: !274, line: 93, baseType: !293, size: 64, offset: 1344)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !273, file: !274, line: 94, baseType: !321, size: 64, offset: 1408)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !273, file: !274, line: 95, baseType: !323, size: 64, offset: 1472)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !324, line: 70, baseType: !325)
!324 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!325 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !273, file: !274, line: 96, baseType: !190, size: 32, offset: 1536)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !273, file: !274, line: 98, baseType: !89, size: 160, offset: 1568)
!328 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!330 = !DISubprogram(name: "abort", scope: !331, file: !331, line: 598, type: !332, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!331 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!332 = !DISubroutineType(types: !333)
!333 = !{null}
!334 = !DISubprogram(name: "lua_type", scope: !193, file: !193, line: 140, type: !335, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!335 = !DISubroutineType(types: !336)
!336 = !{!190, !191, !190}
!337 = distinct !DISubprogram(name: "parse_table", scope: !2, file: !2, line: 76, type: !338, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !179, retainedNodes: !340)
!338 = !DISubroutineType(types: !339)
!339 = !{!190, !191, !195, !190, !190, !199}
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348}
!341 = !DILocalVariable(name: "L", arg: 1, scope: !337, file: !2, line: 76, type: !191)
!342 = !DILocalVariable(name: "out", arg: 2, scope: !337, file: !2, line: 76, type: !195)
!343 = !DILocalVariable(name: "index", arg: 3, scope: !337, file: !2, line: 76, type: !190)
!344 = !DILocalVariable(name: "level", arg: 4, scope: !337, file: !2, line: 76, type: !190)
!345 = !DILocalVariable(name: "err", arg: 5, scope: !337, file: !2, line: 77, type: !199)
!346 = !DILocalVariable(name: "rval", scope: !337, file: !2, line: 79, type: !190)
!347 = !DILocalVariable(name: "had_err", scope: !337, file: !2, line: 79, type: !190)
!348 = !DILocalVariable(name: "i", scope: !349, file: !2, line: 87, type: !190)
!349 = distinct !DILexicalBlock(scope: !337, file: !2, line: 86, column: 3)
!350 = !DILocation(line: 76, column: 35, scope: !337)
!351 = !DILocation(line: 76, column: 45, scope: !337)
!352 = !DILocation(line: 76, column: 54, scope: !337)
!353 = !DILocation(line: 76, column: 65, scope: !337)
!354 = !DILocation(line: 77, column: 33, scope: !337)
!355 = !DILocation(line: 79, column: 3, scope: !337)
!356 = !DILocation(line: 79, column: 17, scope: !337)
!357 = !DILocation(line: 79, column: 23, scope: !337)
!358 = !DILocation(line: 80, column: 3, scope: !337)
!359 = !DILocation(line: 80, column: 3, scope: !360)
!360 = distinct !DILexicalBlock(scope: !361, file: !2, line: 80, column: 3)
!361 = distinct !DILexicalBlock(scope: !337, file: !2, line: 80, column: 3)
!362 = !DILocation(line: 80, column: 3, scope: !361)
!363 = !DILocation(line: 80, column: 3, scope: !364)
!364 = distinct !DILexicalBlock(scope: !360, file: !2, line: 80, column: 3)
!365 = !DILocation(line: 81, column: 3, scope: !337)
!366 = !DILocation(line: 81, column: 3, scope: !367)
!367 = distinct !DILexicalBlock(scope: !368, file: !2, line: 81, column: 3)
!368 = distinct !DILexicalBlock(scope: !337, file: !2, line: 81, column: 3)
!369 = !DILocation(line: 81, column: 3, scope: !368)
!370 = !DILocation(line: 81, column: 3, scope: !371)
!371 = distinct !DILexicalBlock(scope: !367, file: !2, line: 81, column: 3)
!372 = !DILocation(line: 82, column: 15, scope: !337)
!373 = !DILocation(line: 82, column: 3, scope: !337)
!374 = !DILocation(line: 83, column: 7, scope: !375)
!375 = distinct !DILexicalBlock(scope: !337, file: !2, line: 83, column: 7)
!376 = !DILocation(line: 83, column: 13, scope: !375)
!377 = !DILocation(line: 83, column: 7, scope: !337)
!378 = !DILocation(line: 84, column: 10, scope: !375)
!379 = !DILocation(line: 84, column: 5, scope: !375)
!380 = !DILocation(line: 85, column: 3, scope: !337)
!381 = !DILocation(line: 85, column: 11, scope: !337)
!382 = !DILocation(line: 85, column: 19, scope: !337)
!383 = !DILocation(line: 85, column: 32, scope: !337)
