; ModuleID = 'samples/709.bc'
source_filename = "check-tool.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.isc_logcategory = type { ptr, i32 }
%struct.dns_master_style = type opaque
%union.isc_logdestination = type { %struct.isc_logfile }
%struct.isc_logfile = type { ptr, ptr, i32, i32, i64, i8 }
%struct.isc_textregion = type { ptr, i32 }
%struct.isc_buffer = type { i32, ptr, i32, i32, i32, i32, %struct.anon, ptr, i8 }
%struct.anon = type { ptr, ptr }
%struct.dns_fixedname = type { %struct.dns_name, [128 x i8], %struct.isc_buffer, [255 x i8] }
%struct.dns_name = type { i32, ptr, i32, i32, i32, ptr, ptr, %struct.anon.0, %struct.anon.1 }
%struct.anon.0 = type { ptr, ptr }
%struct.anon.1 = type { ptr, ptr }
%union.anon = type { ptr }
%union.anon.7 = type { ptr }
%struct.addrinfo = type { i32, i32, i32, i32, i32, ptr, ptr, ptr }
%struct.dns_rdata = type { ptr, i32, i16, i16, i32, %struct.anon.8 }
%struct.anon.8 = type { ptr, ptr }
%struct.dns_rdataset = type { i32, ptr, %struct.anon.9, i16, i16, i32, i32, i16, i16, i32, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr }
%struct.anon.9 = type { ptr, ptr }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon.10 }
%union.anon.10 = type { [4 x i32] }

!139 = !DIEnumerator(name: "dns_rdatatype_afsdb", value: 18)
!140 = !DIEnumerator(name: "dns_rdatatype_x25", value: 19)
!141 = !DIEnumerator(name: "dns_rdatatype_isdn", value: 20)
!142 = !DIEnumerator(name: "dns_rdatatype_rt", value: 21)
!143 = !DIEnumerator(name: "dns_rdatatype_nsap", value: 22)
!144 = !DIEnumerator(name: "dns_rdatatype_nsap_ptr", value: 23)
!145 = !DIEnumerator(name: "dns_rdatatype_sig", value: 24)
!146 = !DIEnumerator(name: "dns_rdatatype_key", value: 25)
!147 = !DIEnumerator(name: "dns_rdatatype_px", value: 26)
!148 = !DIEnumerator(name: "dns_rdatatype_gpos", value: 27)
!149 = !DIEnumerator(name: "dns_rdatatype_aaaa", value: 28)
!150 = !DIEnumerator(name: "dns_rdatatype_loc", value: 29)
!151 = !DIEnumerator(name: "dns_rdatatype_nxt", value: 30)
!152 = !DIEnumerator(name: "dns_rdatatype_eid", value: 31)
!153 = !DIEnumerator(name: "dns_rdatatype_nimloc", value: 32)
!154 = !DIEnumerator(name: "dns_rdatatype_srv", value: 33)
!155 = !DIEnumerator(name: "dns_rdatatype_atma", value: 34)
!156 = !DIEnumerator(name: "dns_rdatatype_naptr", value: 35)
!157 = !DIEnumerator(name: "dns_rdatatype_kx", value: 36)
!158 = !DIEnumerator(name: "dns_rdatatype_cert", value: 37)
!159 = !DIEnumerator(name: "dns_rdatatype_a6", value: 38)
!160 = !DIEnumerator(name: "dns_rdatatype_dname", value: 39)
!161 = !DIEnumerator(name: "dns_rdatatype_sink", value: 40)
!162 = !DIEnumerator(name: "dns_rdatatype_opt", value: 41)
!163 = !DIEnumerator(name: "dns_rdatatype_apl", value: 42)
!164 = !DIEnumerator(name: "dns_rdatatype_ds", value: 43)
!165 = !DIEnumerator(name: "dns_rdatatype_sshfp", value: 44)
!166 = !DIEnumerator(name: "dns_rdatatype_ipseckey", value: 45)
!167 = !DIEnumerator(name: "dns_rdatatype_rrsig", value: 46)
!168 = !DIEnumerator(name: "dns_rdatatype_nsec", value: 47)
!169 = !DIEnumerator(name: "dns_rdatatype_dnskey", value: 48)
!170 = !DIEnumerator(name: "dns_rdatatype_dhcid", value: 49)
!171 = !DIEnumerator(name: "dns_rdatatype_nsec3", value: 50)
!172 = !DIEnumerator(name: "dns_rdatatype_nsec3param", value: 51)
!173 = !DIEnumerator(name: "dns_rdatatype_tlsa", value: 52)
!174 = !DIEnumerator(name: "dns_rdatatype_smimea", value: 53)
!175 = !DIEnumerator(name: "dns_rdatatype_hip", value: 55)
!176 = !DIEnumerator(name: "dns_rdatatype_ninfo", value: 56)
!177 = !DIEnumerator(name: "dns_rdatatype_rkey", value: 57)
!178 = !DIEnumerator(name: "dns_rdatatype_talink", value: 58)
!179 = !DIEnumerator(name: "dns_rdatatype_cds", value: 59)
!180 = !DIEnumerator(name: "dns_rdatatype_cdnskey", value: 60)
!181 = !DIEnumerator(name: "dns_rdatatype_openpgpkey", value: 61)
!182 = !DIEnumerator(name: "dns_rdatatype_csync", value: 62)
!183 = !DIEnumerator(name: "dns_rdatatype_zonemd", value: 63)
!184 = !DIEnumerator(name: "dns_rdatatype_spf", value: 99)
!185 = !DIEnumerator(name: "dns_rdatatype_nid", value: 104)
!186 = !DIEnumerator(name: "dns_rdatatype_l32", value: 105)
!187 = !DIEnumerator(name: "dns_rdatatype_l64", value: 106)
!188 = !DIEnumerator(name: "dns_rdatatype_lp", value: 107)
!189 = !DIEnumerator(name: "dns_rdatatype_eui48", value: 108)
!190 = !DIEnumerator(name: "dns_rdatatype_eui64", value: 109)
!191 = !DIEnumerator(name: "dns_rdatatype_tkey", value: 249)
!192 = !DIEnumerator(name: "dns_rdatatype_tsig", value: 250)
!193 = !DIEnumerator(name: "dns_rdatatype_uri", value: 256)
!194 = !DIEnumerator(name: "dns_rdatatype_caa", value: 257)
!195 = !DIEnumerator(name: "dns_rdatatype_avc", value: 258)
!196 = !DIEnumerator(name: "dns_rdatatype_doa", value: 259)
!197 = !DIEnumerator(name: "dns_rdatatype_amtrelay", value: 260)
!198 = !DIEnumerator(name: "dns_rdatatype_ta", value: 32768)
!199 = !DIEnumerator(name: "dns_rdatatype_dlv", value: 32769)
!200 = !DIEnumerator(name: "dns_rdatatype_keydata", value: 65533)
!201 = !DIEnumerator(name: "dns_rdatatype_ixfr", value: 251)
!202 = !DIEnumerator(name: "dns_rdatatype_axfr", value: 252)
!203 = !DIEnumerator(name: "dns_rdatatype_mailb", value: 253)
!204 = !DIEnumerator(name: "dns_rdatatype_maila", value: 254)
!205 = !DIEnumerator(name: "dns_rdatatype_any", value: 255)
!206 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 164, baseType: !7, size: 32, elements: !207)
!207 = !{!208}
!208 = !DIEnumerator(name: "dns_hash_sha1", value: 1)
!209 = !{!210, !211, !216, !222, !242}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!215 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatatype_t", file: !45, line: 126, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !218, line: 25, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !220, line: 40, baseType: !221)
!220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!221 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !82, line: 245, size: 128, elements: !224)
!224 = !{!225, !228, !230, !237}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !223, file: !82, line: 247, baseType: !226, size: 16)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !227, line: 28, baseType: !221)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !223, file: !82, line: 248, baseType: !229, size: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !82, line: 123, baseType: !217)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !223, file: !82, line: 249, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !82, line: 31, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !231, file: !82, line: 33, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !82, line: 30, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !218, line: 26, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !220, line: 42, baseType: !7)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !223, file: !82, line: 252, baseType: !238, size: 64, offset: 64)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 64, elements: !240)
!239 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!240 = !{!241}
!241 = !DISubrange(count: 8)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !82, line: 260, size: 224, elements: !244)
!244 = !{!245, !246, !247, !248, !266}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !243, file: !82, line: 262, baseType: !226, size: 16)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !243, file: !82, line: 263, baseType: !229, size: 16, offset: 16)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !243, file: !82, line: 264, baseType: !235, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !243, file: !82, line: 265, baseType: !249, size: 128, offset: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !82, line: 219, size: 128, elements: !250)
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !249, file: !82, line: 226, baseType: !252, size: 128)
!252 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !82, line: 221, size: 128, elements: !253)
!253 = !{!254, !260, !262}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !252, file: !82, line: 223, baseType: !255, size: 128)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 128, elements: !258)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !218, line: 24, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !220, line: 38, baseType: !239)
!258 = !{!259}
!259 = !DISubrange(count: 16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !252, file: !82, line: 224, baseType: !261, size: 128)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 128, elements: !240)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !252, file: !82, line: 225, baseType: !263, size: 128)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 128, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 4)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !243, file: !82, line: 266, baseType: !235, size: 32, offset: 192)
!267 = !{!0, !268, !270, !273, !275, !277, !279, !282, !287, !292, !297, !302, !307, !309, !314, !319, !322, !327, !332, !337, !342, !347, !352, !361, !363, !366, !368, !373, !378, !383, !388, !432, !437, !442, !444, !446, !451, !456, !458, !463, !465, !470, !475, !480}
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "journal", scope: !2, file: !3, line: 84, type: !213, isLocal: false, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "nomerge", scope: !2, file: !3, line: 85, type: !272, isLocal: false, isDefinition: true)
!272 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "docheckmx", scope: !2, file: !3, line: 87, type: !272, isLocal: false, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "dochecksrv", scope: !2, file: !3, line: 88, type: !272, isLocal: false, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "docheckns", scope: !2, file: !3, line: 89, type: !272, isLocal: false, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "zone_options", scope: !2, file: !3, line: 95, type: !281, isLocal: false, isDefinition: true)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_zoneopt_t", file: !6, line: 86, baseType: !5)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !3, line: 538, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 104, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 13)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !3, line: 538, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 352, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 44)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !3, line: 550, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 56, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 7)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !3, line: 550, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 568, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 71)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !3, line: 554, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 552, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 69)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !3, line: 656, type: !289, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !3, line: 659, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 280, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 35)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !3, line: 725, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 24, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 3)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !3, line: 725, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 32, elements: !264)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !3, line: 728, type: !324, isLocal: true, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 16, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 2)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !3, line: 729, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 176, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 22)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !3, line: 732, type: !334, isLocal: true, isDefinition: true)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 112, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 14)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !3, line: 739, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 360, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 45)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !3, line: 111, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 8, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !3, line: 112, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 80, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 10)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "categories", scope: !2, file: !3, line: 110, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 384, elements: !317)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_logcategory_t", file: !356, line: 56, baseType: !357)
!356 = !DIFile(filename: "lib/isc/include/isc/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "6a355582c4f962c465b18bab43b68c96")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_logcategory", file: !40, line: 104, size: 128, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !357, file: !40, line: 105, baseType: !213, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !357, file: !40, line: 106, baseType: !7, size: 32, offset: 64)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !3, line: 81, type: !321, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "dbtype", scope: !2, file: !3, line: 81, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 64, elements: !345)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !3, line: 389, type: !324, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !3, line: 412, type: !370, isLocal: true, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 408, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 51)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !3, line: 432, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 496, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 62)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !3, line: 443, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 216, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 27)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "symtab", scope: !2, file: !3, line: 116, type: !385, isLocal: true, isDefinition: true)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_symtab_t", file: !356, line: 76, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_symtab", file: !356, line: 76, flags: DIFlagFwdDecl)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "sym_mctx", scope: !2, file: !3, line: 117, type: !390, isLocal: true, isDefinition: true)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mem_t", file: !356, line: 59, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mem", file: !393, line: 191, size: 128, elements: !394)
!393 = !DIFile(filename: "lib/isc/include/isc/mem.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "587a841195795b087519b89f298822b2")
!394 = !{!395, !396, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !392, file: !393, line: 192, baseType: !7, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !392, file: !393, line: 193, baseType: !7, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !392, file: !393, line: 194, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_memmethods_t", file: !393, line: 180, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_memmethods", file: !393, line: 170, size: 448, elements: !401)
!401 = !{!402, !409, !413, !418, !419, !423, !428}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "memget", scope: !400, file: !393, line: 171, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!210, !390, !406, !213, !7}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !407, line: 70, baseType: !408)
!407 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!408 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "memput", scope: !400, file: !393, line: 172, baseType: !410, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !390, !210, !406, !213, !7}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "memputanddetach", scope: !400, file: !393, line: 173, baseType: !414, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !417, !210, !406, !213, !7}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "memallocate", scope: !400, file: !393, line: 175, baseType: !403, size: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "memreallocate", scope: !400, file: !393, line: 176, baseType: !420, size: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!210, !390, !210, !406, !213, !7}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "memstrdup", scope: !400, file: !393, line: 178, baseType: !424, size: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!427, !390, !213, !213, !7}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "memfree", scope: !400, file: !393, line: 179, baseType: !429, size: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !390, !210, !213, !7}
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !3, line: 184, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 784, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 98)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !3, line: 186, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 880, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 110)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !3, line: 223, type: !370, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !3, line: 238, type: !375, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !3, line: 275, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 288, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 36)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !3, line: 305, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 312, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 39)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !3, line: 329, type: !324, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !3, line: 334, type: !460, isLocal: true, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 40, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 5)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !3, line: 352, type: !453, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !3, line: 493, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 416, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 52)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !3, line: 513, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 504, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 63)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !3, line: 577, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 136, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 17)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !3, line: 608, type: !448, isLocal: true, isDefinition: true)
!482 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!483 = !{i32 7, !"Dwarf Version", i32 5}
!484 = !{i32 2, !"Debug Info Version", i32 3}
!485 = !{i32 1, !"wchar_size", i32 4}
!486 = !{i32 8, !"PIC Level", i32 2}
!487 = !{i32 7, !"uwtable", i32 2}
!488 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!489 = distinct !DISubprogram(name: "setup_logging", scope: !3, file: !3, line: 533, type: !490, scopeLine: 533, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !549)
!490 = !DISubroutineType(types: !491)
!491 = !{!492, !390, !493, !545}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_result_t", file: !356, line: 67, baseType: !7)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !495, line: 7, baseType: !496)
!495 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !497, line: 49, size: 1728, elements: !498)
!497 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !514, !516, !517, !518, !521, !522, !524, !526, !529, !531, !534, !537, !538, !539, !540, !541}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !496, file: !497, line: 51, baseType: !482, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !496, file: !497, line: 54, baseType: !427, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !496, file: !497, line: 55, baseType: !427, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !496, file: !497, line: 56, baseType: !427, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !496, file: !497, line: 57, baseType: !427, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !496, file: !497, line: 58, baseType: !427, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !496, file: !497, line: 59, baseType: !427, size: 64, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !496, file: !497, line: 60, baseType: !427, size: 64, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !496, file: !497, line: 61, baseType: !427, size: 64, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !496, file: !497, line: 64, baseType: !427, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !496, file: !497, line: 65, baseType: !427, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !496, file: !497, line: 66, baseType: !427, size: 64, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !496, file: !497, line: 68, baseType: !512, size: 64, offset: 768)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !497, line: 36, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !496, file: !497, line: 70, baseType: !515, size: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !496, file: !497, line: 72, baseType: !482, size: 32, offset: 896)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !496, file: !497, line: 73, baseType: !482, size: 32, offset: 928)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !496, file: !497, line: 74, baseType: !519, size: 64, offset: 960)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !220, line: 152, baseType: !520)
!520 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !496, file: !497, line: 77, baseType: !221, size: 16, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !496, file: !497, line: 78, baseType: !523, size: 8, offset: 1040)
!523 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !496, file: !497, line: 79, baseType: !525, size: 8, offset: 1048)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 8, elements: !345)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !496, file: !497, line: 81, baseType: !527, size: 64, offset: 1088)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !497, line: 43, baseType: null)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !496, file: !497, line: 89, baseType: !530, size: 64, offset: 1152)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !220, line: 153, baseType: !520)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !496, file: !497, line: 91, baseType: !532, size: 64, offset: 1216)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !497, line: 37, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !496, file: !497, line: 92, baseType: !535, size: 64, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !497, line: 38, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !496, file: !497, line: 93, baseType: !515, size: 64, offset: 1344)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !496, file: !497, line: 94, baseType: !210, size: 64, offset: 1408)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !496, file: !497, line: 95, baseType: !406, size: 64, offset: 1472)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !496, file: !497, line: 96, baseType: !482, size: 32, offset: 1536)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !496, file: !497, line: 98, baseType: !542, size: 160, offset: 1568)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 160, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 20)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_log_t", file: !356, line: 55, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_log", file: !356, line: 55, flags: DIFlagFwdDecl)
!549 = !{!550, !551, !552, !553, !573, !577}
!550 = !DILocalVariable(name: "mctx", arg: 1, scope: !489, file: !3, line: 533, type: !390)
!551 = !DILocalVariable(name: "errout", arg: 2, scope: !489, file: !3, line: 533, type: !493)
!552 = !DILocalVariable(name: "logp", arg: 3, scope: !489, file: !3, line: 533, type: !545)
!553 = !DILocalVariable(name: "destination", scope: !489, file: !3, line: 534, type: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_logdestination_t", file: !40, line: 151, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "isc_logdestination", file: !40, line: 148, size: 320, elements: !556)
!556 = !{!557, !572}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !555, file: !40, line: 149, baseType: !558, size: 320)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_logfile_t", file: !40, line: 142, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_logfile", file: !40, line: 128, size: 320, elements: !560)
!560 = !{!561, !562, !563, !564, !566, !571}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !559, file: !40, line: 129, baseType: !493, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !559, file: !40, line: 130, baseType: !213, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "versions", scope: !559, file: !40, line: 131, baseType: !482, size: 32, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !559, file: !40, line: 132, baseType: !565, size: 32, offset: 160)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_log_rollsuffix_t", file: !40, line: 94, baseType: !39)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_size", scope: !559, file: !40, line: 140, baseType: !567, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_offset_t", file: !568, line: 24, baseType: !569)
!568 = !DIFile(filename: "../../lib/isc/unix/include/isc/offset.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/bin/check", checksumkind: CSK_MD5, checksum: "bcf92adabe55bfd4bb2a4ec0fa8b7b63")
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !570, line: 63, baseType: !519)
!570 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!571 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_reached", scope: !559, file: !40, line: 141, baseType: !272, size: 8, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "facility", scope: !555, file: !40, line: 150, baseType: !482, size: 32)
!573 = !DILocalVariable(name: "logconfig", scope: !489, file: !3, line: 535, type: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_logconfig_t", file: !356, line: 57, baseType: !576)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_logconfig", file: !356, line: 57, flags: DIFlagFwdDecl)
!577 = !DILocalVariable(name: "log", scope: !489, file: !3, line: 536, type: !546)
!578 = !DILocation(line: 533, column: 26, scope: !489)
!579 = !DILocation(line: 533, column: 38, scope: !489)
!580 = !DILocation(line: 533, column: 58, scope: !489)
!581 = !DILocation(line: 534, column: 2, scope: !489)
!582 = !DILocation(line: 534, column: 23, scope: !489)
!583 = !DILocation(line: 535, column: 2, scope: !489)
!584 = !DILocation(line: 535, column: 19, scope: !489)
!585 = !DILocation(line: 536, column: 2, scope: !489)
!586 = !DILocation(line: 536, column: 13, scope: !489)
!587 = !DILocation(line: 538, column: 2, scope: !489)
!588 = !DILocation(line: 539, column: 29, scope: !489)
!589 = !DILocation(line: 539, column: 2, scope: !489)
!590 = !DILocation(line: 540, column: 21, scope: !489)
!591 = !DILocation(line: 540, column: 2, scope: !489)
!592 = !DILocation(line: 541, column: 15, scope: !489)
!593 = !DILocation(line: 541, column: 2, scope: !489)
!594 = !DILocation(line: 542, column: 21, scope: !489)
!595 = !DILocation(line: 542, column: 2, scope: !489)
!596 = !DILocation(line: 543, column: 15, scope: !489)
!597 = !DILocation(line: 543, column: 2, scope: !489)
!598 = !DILocation(line: 544, column: 14, scope: !489)
!599 = !DILocation(line: 544, column: 2, scope: !489)
!600 = !DILocation(line: 546, column: 28, scope: !489)
!601 = !DILocation(line: 546, column: 19, scope: !489)
!602 = !DILocation(line: 546, column: 26, scope: !489)
!603 = !DILocation(line: 547, column: 19, scope: !489)
!604 = !DILocation(line: 547, column: 24, scope: !489)
!605 = !DILocation(line: 548, column: 19, scope: !489)
!606 = !DILocation(line: 548, column: 28, scope: !489)
!607 = !DILocation(line: 549, column: 19, scope: !489)
!608 = !DILocation(line: 549, column: 32, scope: !489)
!609 = !DILocation(line: 550, column: 2, scope: !489)
!610 = !DILocation(line: 554, column: 2, scope: !489)
!611 = !DILocation(line: 557, column: 10, scope: !489)
!612 = !DILocation(line: 557, column: 3, scope: !489)
!613 = !DILocation(line: 557, column: 8, scope: !489)
!614 = !DILocation(line: 559, column: 1, scope: !489)
!615 = !DILocation(line: 558, column: 2, scope: !489)
!616 = !DISubprogram(name: "isc_log_create", scope: !40, file: !40, line: 185, type: !617, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!617 = !DISubroutineType(types: !618)
!618 = !{!492, !390, !545, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!620 = !DISubprogram(name: "isc_error_runtimecheck", scope: !621, file: !621, line: 49, type: !622, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!621 = !DIFile(filename: "lib/isc/include/isc/error.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "e90b8298ea6c947397fab383c61a094d")
!622 = !DISubroutineType(types: !623)
!623 = !{null, !213, !482, !213}
!624 = !DISubprogram(name: "isc_log_registercategories", scope: !40, file: !40, line: 334, type: !625, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !546, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!628 = !DISubprogram(name: "isc_log_setcontext", scope: !40, file: !40, line: 868, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !546}
!631 = !DISubprogram(name: "dns_log_init", scope: !632, file: !632, line: 85, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!632 = !DIFile(filename: "lib/dns/include/dns/log.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "a1fcabf1d990e4dcfc8018b99f6db47c")
!633 = !DISubprogram(name: "dns_log_setcontext", scope: !632, file: !632, line: 101, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!634 = !DISubprogram(name: "cfg_log_init", scope: !635, file: !635, line: 31, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!635 = !DIFile(filename: "lib/isccfg/include/isccfg/log.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "c81f0e1f0f40c29aa1b8b2e2bb01501f")
!636 = !DISubprogram(name: "ns_log_init", scope: !637, file: !637, line: 48, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!637 = !DIFile(filename: "lib/ns/include/ns/log.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "d4b08e0ce0798c43f8faa6a5f8af455e")
!638 = !DISubprogram(name: "isc_log_createchannel", scope: !40, file: !40, line: 410, type: !639, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!639 = !DISubroutineType(types: !640)
!640 = !{!492, !574, !213, !7, !482, !641, !7}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!643 = !DISubprogram(name: "isc_log_usechannel", scope: !40, file: !40, line: 479, type: !644, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!644 = !DISubroutineType(types: !645)
!645 = !{!492, !574, !213, !646, !648}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_logmodule_t", file: !356, line: 58, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_logmodule", file: !40, line: 112, size: 128, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !40, line: 113, baseType: !213, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !651, file: !40, line: 114, baseType: !7, size: 32, offset: 64)
!655 = distinct !DISubprogram(name: "load_zone", scope: !3, file: !3, line: 644, type: !656, scopeLine: 647, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !664)
!656 = !DISubroutineType(types: !657)
!657 = !{!492, !390, !213, !213, !658, !213, !659, !660}
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_masterformat_t", file: !45, line: 218, baseType: !44)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_ttl_t", file: !45, line: 144, baseType: !235)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_zone_t", file: !45, line: 149, baseType: !663)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_zone", file: !45, line: 149, flags: DIFlagFwdDecl)
!664 = !{!665, !666, !667, !668, !669, !670, !671, !672, !673, !675, !682, !701, !1020, !1021, !1022, !1028, !1034}
!665 = !DILocalVariable(name: "mctx", arg: 1, scope: !655, file: !3, line: 644, type: !390)
!666 = !DILocalVariable(name: "zonename", arg: 2, scope: !655, file: !3, line: 644, type: !213)
!667 = !DILocalVariable(name: "filename", arg: 3, scope: !655, file: !3, line: 644, type: !213)
!668 = !DILocalVariable(name: "fileformat", arg: 4, scope: !655, file: !3, line: 645, type: !658)
!669 = !DILocalVariable(name: "classname", arg: 5, scope: !655, file: !3, line: 645, type: !213)
!670 = !DILocalVariable(name: "maxttl", arg: 6, scope: !655, file: !3, line: 646, type: !659)
!671 = !DILocalVariable(name: "zonep", arg: 7, scope: !655, file: !3, line: 646, type: !660)
!672 = !DILocalVariable(name: "result", scope: !655, file: !3, line: 648, type: !492)
!673 = !DILocalVariable(name: "rdclass", scope: !655, file: !3, line: 649, type: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataclass_t", file: !45, line: 121, baseType: !217)
!675 = !DILocalVariable(name: "region", scope: !655, file: !3, line: 650, type: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_textregion_t", file: !356, line: 80, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_textregion", file: !678, line: 26, size: 128, elements: !679)
!678 = !DIFile(filename: "lib/isc/include/isc/region.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "2ed4a07dc05ddbd48f51e2dc9be9f317")
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !677, file: !678, line: 27, baseType: !427, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !677, file: !678, line: 28, baseType: !7, size: 32, offset: 64)
!682 = !DILocalVariable(name: "buffer", scope: !655, file: !3, line: 651, type: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_buffer_t", file: !356, line: 35, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_buffer", file: !685, line: 173, size: 512, elements: !686)
!685 = !DIFile(filename: "lib/isc/include/isc/buffer.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "feec9784066f3891a27281dd5bdccd55")
!686 = !{!687, !688, !689, !690, !691, !692, !693, !699, !700}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !684, file: !685, line: 174, baseType: !7, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !684, file: !685, line: 175, baseType: !210, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !684, file: !685, line: 178, baseType: !7, size: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !684, file: !685, line: 179, baseType: !7, size: 32, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !684, file: !685, line: 180, baseType: !7, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !684, file: !685, line: 181, baseType: !7, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !684, file: !685, line: 184, baseType: !694, size: 128, offset: 256)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !684, file: !685, line: 184, size: 128, elements: !695)
!695 = !{!696, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !694, file: !685, line: 184, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !694, file: !685, line: 184, baseType: !697, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !684, file: !685, line: 186, baseType: !390, size: 64, offset: 384)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "autore", scope: !684, file: !685, line: 188, baseType: !272, size: 8, offset: 448)
!701 = !DILocalVariable(name: "fixorigin", scope: !655, file: !3, line: 652, type: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_fixedname_t", file: !45, line: 87, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_fixedname", file: !704, line: 61, size: 4224, elements: !705)
!704 = !DIFile(filename: "lib/dns/include/dns/fixedname.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "0de03067a9d468538b5b154e7da6cb18")
!705 = !{!706, !1010, !1015, !1016}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !703, file: !704, line: 62, baseType: !707, size: 640)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_name_t", file: !45, line: 107, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_name", file: !709, line: 104, size: 640, elements: !710)
!709 = !DIFile(filename: "lib/dns/include/dns/name.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "ec64c9a43875cd86cb4b0e37c1191a89")
!710 = !{!711, !712, !714, !715, !716, !717, !718, !719, !725}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !708, file: !709, line: 105, baseType: !7, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ndata", scope: !708, file: !709, line: 106, baseType: !713, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !708, file: !709, line: 107, baseType: !7, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !708, file: !709, line: 108, baseType: !7, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !708, file: !709, line: 109, baseType: !7, size: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !708, file: !709, line: 110, baseType: !713, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !708, file: !709, line: 111, baseType: !697, size: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !708, file: !709, line: 112, baseType: !720, size: 128, offset: 384)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !709, line: 112, size: 128, elements: !721)
!721 = !{!722, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !720, file: !709, line: 112, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !709, line: 112, baseType: !723, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !708, file: !709, line: 113, baseType: !726, size: 128, offset: 512)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !709, line: 113, size: 128, elements: !727)
!727 = !{!728, !1009}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !726, file: !709, line: 113, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataset_t", file: !45, line: 123, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdataset", file: !732, line: 107, size: 960, elements: !733)
!732 = !DIFile(filename: "lib/dns/include/dns/rdataset.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "a2414fd23f718a363582354673aed6a8")
!733 = !{!734, !735, !986, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1002, !1003, !1004, !1005, !1006, !1007, !1008}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !731, file: !732, line: 108, baseType: !7, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !731, file: !732, line: 109, baseType: !736, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetmethods_t", file: !732, line: 96, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetmethods", file: !732, line: 64, size: 1024, elements: !739)
!739 = !{!740, !744, !748, !749, !768, !772, !776, !782, !786, !787, !788, !793, !794, !795, !799, !805}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "disassociate", scope: !738, file: !732, line: 65, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !729}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !738, file: !732, line: 66, baseType: !745, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!492, !729}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !738, file: !732, line: 67, baseType: !745, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !738, file: !732, line: 68, baseType: !750, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !729, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdata_t", file: !45, line: 119, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdata", file: !756, line: 112, size: 320, elements: !757)
!756 = !DIFile(filename: "lib/dns/include/dns/rdata.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "e790fb4f336bc4fdcd566550403b32a6")
!757 = !{!758, !759, !760, !761, !762, !763}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !755, file: !756, line: 113, baseType: !713, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !755, file: !756, line: 114, baseType: !7, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !755, file: !756, line: 115, baseType: !674, size: 16, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !755, file: !756, line: 116, baseType: !216, size: 16, offset: 112)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !755, file: !756, line: 117, baseType: !7, size: 32, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !755, file: !756, line: 118, baseType: !764, size: 128, offset: 192)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !755, file: !756, line: 118, size: 128, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !764, file: !756, line: 118, baseType: !753, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !764, file: !756, line: 118, baseType: !753, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !738, file: !732, line: 70, baseType: !769, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !729, !729}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !738, file: !732, line: 72, baseType: !773, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!7, !729}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "addnoqname", scope: !738, file: !732, line: 73, baseType: !777, size: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!492, !729, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getnoqname", scope: !738, file: !732, line: 75, baseType: !783, size: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!492, !729, !723, !729, !729}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "addclosest", scope: !738, file: !732, line: 79, baseType: !777, size: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getclosest", scope: !738, file: !732, line: 81, baseType: !783, size: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "settrust", scope: !738, file: !732, line: 85, baseType: !789, size: 64, offset: 640)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !729, !792}
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_trust_t", file: !45, line: 140, baseType: !217)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !738, file: !732, line: 87, baseType: !741, size: 64, offset: 704)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "clearprefetch", scope: !738, file: !732, line: 88, baseType: !741, size: 64, offset: 768)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "setownercase", scope: !738, file: !732, line: 89, baseType: !796, size: 64, offset: 832)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !729, !780}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "getownercase", scope: !738, file: !732, line: 91, baseType: !800, size: 64, offset: 896)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !803, !723}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "addglue", scope: !738, file: !732, line: 93, baseType: !806, size: 64, offset: 960)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!492, !729, !809, !811}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbversion_t", file: !45, line: 61, baseType: null)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_message_t", file: !45, line: 103, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_message", file: !814, line: 197, size: 3840, elements: !815)
!814 = !DIFile(filename: "lib/dns/include/dns/message.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "6416f0e57c4314c86bb1ccbb29bdbc0d")
!815 = !{!816, !817, !819, !820, !822, !824, !825, !827, !834, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !889, !890, !897, !898, !904, !905, !913, !918, !923, !928, !936, !937, !938, !939, !940, !944, !949, !950, !951, !952, !956, !957, !958, !959, !968}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !813, file: !814, line: 199, baseType: !7, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !813, file: !814, line: 201, baseType: !818, size: 16, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_messageid_t", file: !45, line: 104, baseType: !217)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !813, file: !814, line: 202, baseType: !7, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !813, file: !814, line: 203, baseType: !821, size: 16, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rcode_t", file: !45, line: 118, baseType: !217)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !813, file: !814, line: 204, baseType: !823, size: 16, offset: 112)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_opcode_t", file: !45, line: 111, baseType: !217)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !813, file: !814, line: 205, baseType: !674, size: 16, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !813, file: !814, line: 208, baseType: !826, size: 128, offset: 160)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !264)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sections", scope: !813, file: !814, line: 211, baseType: !828, size: 512, offset: 320)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 512, elements: !264)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_namelist_t", file: !45, line: 108, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 108, size: 128, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !830, file: !45, line: 108, baseType: !723, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !830, file: !45, line: 108, baseType: !723, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "cursors", scope: !813, file: !814, line: 212, baseType: !835, size: 256, offset: 832)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 256, elements: !264)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !813, file: !814, line: 213, baseType: !729, size: 64, offset: 1088)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "sig0", scope: !813, file: !814, line: 214, baseType: !729, size: 64, offset: 1152)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tsig", scope: !813, file: !814, line: 215, baseType: !729, size: 64, offset: 1216)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !813, file: !814, line: 217, baseType: !482, size: 32, offset: 1280)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "from_to_wire", scope: !813, file: !814, line: 218, baseType: !7, size: 2, offset: 1312, flags: DIFlagBitField, extraData: i64 1312)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "header_ok", scope: !813, file: !814, line: 219, baseType: !7, size: 1, offset: 1314, flags: DIFlagBitField, extraData: i64 1312)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "question_ok", scope: !813, file: !814, line: 220, baseType: !7, size: 1, offset: 1315, flags: DIFlagBitField, extraData: i64 1312)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_continuation", scope: !813, file: !814, line: 221, baseType: !7, size: 1, offset: 1316, flags: DIFlagBitField, extraData: i64 1312)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "verified_sig", scope: !813, file: !814, line: 222, baseType: !7, size: 1, offset: 1317, flags: DIFlagBitField, extraData: i64 1312)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "verify_attempted", scope: !813, file: !814, line: 223, baseType: !7, size: 1, offset: 1318, flags: DIFlagBitField, extraData: i64 1312)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "free_query", scope: !813, file: !814, line: 224, baseType: !7, size: 1, offset: 1319, flags: DIFlagBitField, extraData: i64 1312)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "free_saved", scope: !813, file: !814, line: 225, baseType: !7, size: 1, offset: 1320, flags: DIFlagBitField, extraData: i64 1312)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "cc_ok", scope: !813, file: !814, line: 226, baseType: !7, size: 1, offset: 1321, flags: DIFlagBitField, extraData: i64 1312)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "cc_bad", scope: !813, file: !814, line: 227, baseType: !7, size: 1, offset: 1322, flags: DIFlagBitField, extraData: i64 1312)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tkey", scope: !813, file: !814, line: 228, baseType: !7, size: 1, offset: 1323, flags: DIFlagBitField, extraData: i64 1312)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass_set", scope: !813, file: !814, line: 229, baseType: !7, size: 1, offset: 1324, flags: DIFlagBitField, extraData: i64 1312)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "opt_reserved", scope: !813, file: !814, line: 231, baseType: !7, size: 32, offset: 1344)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sig_reserved", scope: !813, file: !814, line: 232, baseType: !7, size: 32, offset: 1376)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !813, file: !814, line: 233, baseType: !7, size: 32, offset: 1408)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !813, file: !814, line: 235, baseType: !217, size: 16, offset: 1440)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "padding_off", scope: !813, file: !814, line: 236, baseType: !7, size: 32, offset: 1472)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !813, file: !814, line: 238, baseType: !697, size: 64, offset: 1536)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cctx", scope: !813, file: !814, line: 239, baseType: !859, size: 64, offset: 1600)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compress_t", file: !45, line: 53, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compress", file: !862, line: 66, size: 18688, elements: !863)
!862 = !DIFile(filename: "lib/dns/include/dns/compress.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "ae360072e6dd15c4fe76c4efa2dcea4c")
!863 = !{!864, !865, !866, !867, !885, !887, !888}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !861, file: !862, line: 67, baseType: !7, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !861, file: !862, line: 68, baseType: !7, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "edns", scope: !861, file: !862, line: 69, baseType: !482, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !861, file: !862, line: 71, baseType: !868, size: 4096, offset: 128)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 4096, elements: !883)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compressnode_t", file: !862, line: 56, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compressnode", file: !862, line: 58, size: 896, elements: !872)
!872 = !{!873, !874, !875, !876, !882}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !871, file: !862, line: 59, baseType: !869, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !871, file: !862, line: 60, baseType: !217, size: 16, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !871, file: !862, line: 61, baseType: !217, size: 16, offset: 80)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !871, file: !862, line: 62, baseType: !877, size: 128, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_region_t", file: !356, line: 65, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_region", file: !678, line: 21, size: 128, elements: !879)
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !878, file: !678, line: 22, baseType: !713, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !878, file: !678, line: 23, baseType: !7, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !871, file: !862, line: 63, baseType: !707, size: 640, offset: 256)
!883 = !{!884}
!884 = !DISubrange(count: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "initialnodes", scope: !861, file: !862, line: 73, baseType: !886, size: 14336, offset: 4224)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 14336, elements: !258)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !861, file: !862, line: 74, baseType: !217, size: 16, offset: 18560)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !861, file: !862, line: 75, baseType: !390, size: 64, offset: 18624)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !813, file: !814, line: 241, baseType: !390, size: 64, offset: 1664)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "namepool", scope: !813, file: !814, line: 242, baseType: !891, size: 64, offset: 1728)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mempool_t", file: !356, line: 60, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mempool", file: !393, line: 205, size: 64, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !893, file: !393, line: 206, baseType: !7, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !893, file: !393, line: 207, baseType: !7, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "rdspool", scope: !813, file: !814, line: 243, baseType: !891, size: 64, offset: 1792)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "scratchpad", scope: !813, file: !814, line: 245, baseType: !899, size: 128, offset: 1856)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_bufferlist_t", file: !356, line: 36, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 36, size: 128, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !900, file: !356, line: 36, baseType: !697, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !900, file: !356, line: 36, baseType: !697, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !813, file: !814, line: 246, baseType: !899, size: 128, offset: 1984)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rdatas", scope: !813, file: !814, line: 248, baseType: !906, size: 128, offset: 2112)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !814, line: 248, size: 128, elements: !907)
!907 = !{!908, !912}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !906, file: !814, line: 248, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_msgblock_t", file: !814, line: 189, baseType: !911)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_msgblock", file: !814, line: 189, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !906, file: !814, line: 248, baseType: !909, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rdatalists", scope: !813, file: !814, line: 249, baseType: !914, size: 128, offset: 2240)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !814, line: 249, size: 128, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !914, file: !814, line: 249, baseType: !909, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !914, file: !814, line: 249, baseType: !909, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !813, file: !814, line: 250, baseType: !919, size: 128, offset: 2368)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !814, line: 250, size: 128, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !919, file: !814, line: 250, baseType: !909, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !919, file: !814, line: 250, baseType: !909, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "freerdata", scope: !813, file: !814, line: 252, baseType: !924, size: 128, offset: 2496)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !814, line: 252, size: 128, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !924, file: !814, line: 252, baseType: !753, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !924, file: !814, line: 252, baseType: !753, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "freerdatalist", scope: !813, file: !814, line: 253, baseType: !929, size: 128, offset: 2624)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !814, line: 253, size: 128, elements: !930)
!930 = !{!931, !935}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !929, file: !814, line: 253, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatalist_t", file: !45, line: 122, baseType: !934)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatalist", file: !45, line: 122, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !929, file: !814, line: 253, baseType: !932, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "tsigstatus", scope: !813, file: !814, line: 255, baseType: !821, size: 16, offset: 2752)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "querytsigstatus", scope: !813, file: !814, line: 256, baseType: !821, size: 16, offset: 2768)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "tsigname", scope: !813, file: !814, line: 257, baseType: !723, size: 64, offset: 2816)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "querytsig", scope: !813, file: !814, line: 258, baseType: !729, size: 64, offset: 2880)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "tsigkey", scope: !813, file: !814, line: 259, baseType: !941, size: 64, offset: 2944)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_tsigkey_t", file: !45, line: 143, baseType: !943)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_tsigkey", file: !45, line: 143, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tsigctx", scope: !813, file: !814, line: 260, baseType: !945, size: 64, offset: 3008)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_context_t", file: !947, line: 45, baseType: !948)
!947 = !DIFile(filename: "lib/dns/include/dst/dst.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "10e76bcacbe005e6cc7dee2ac6ffac9a")
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_context", file: !947, line: 45, flags: DIFlagFwdDecl)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "sigstart", scope: !813, file: !814, line: 261, baseType: !482, size: 32, offset: 3072)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "timeadjust", scope: !813, file: !814, line: 262, baseType: !482, size: 32, offset: 3104)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "sig0name", scope: !813, file: !814, line: 264, baseType: !723, size: 64, offset: 3136)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "sig0key", scope: !813, file: !814, line: 265, baseType: !953, size: 64, offset: 3200)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_key_t", file: !947, line: 44, baseType: !955)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_key", file: !947, line: 44, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "sig0status", scope: !813, file: !814, line: 266, baseType: !821, size: 16, offset: 3264)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !813, file: !814, line: 267, baseType: !877, size: 128, offset: 3328)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !813, file: !814, line: 268, baseType: !877, size: 128, offset: 3456)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !813, file: !814, line: 270, baseType: !960, size: 64, offset: 3584)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetorderfunc_t", file: !45, line: 415, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!482, !964, !966}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "order_arg", scope: !813, file: !814, line: 271, baseType: !969, size: 192, offset: 3648)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_sortlist_arg_t", file: !45, line: 134, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_sortlist_arg", file: !814, line: 191, size: 192, elements: !971)
!971 = !{!972, !976, !981}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !970, file: !814, line: 192, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclenv_t", file: !45, line: 32, baseType: !975)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclenv", file: !45, line: 32, flags: DIFlagFwdDecl)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !970, file: !814, line: 193, baseType: !977, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_acl_t", file: !45, line: 30, baseType: !980)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_acl", file: !45, line: 30, flags: DIFlagFwdDecl)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !970, file: !814, line: 194, baseType: !982, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclelement_t", file: !45, line: 31, baseType: !985)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclelement", file: !45, line: 31, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !731, file: !732, line: 110, baseType: !987, size: 128, offset: 128)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !731, file: !732, line: 110, size: 128, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !987, file: !732, line: 110, baseType: !729, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !987, file: !732, line: 110, baseType: !729, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !731, file: !732, line: 117, baseType: !674, size: 16, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !731, file: !732, line: 118, baseType: !216, size: 16, offset: 272)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !731, file: !732, line: 119, baseType: !659, size: 32, offset: 288)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "stale_ttl", scope: !731, file: !732, line: 124, baseType: !659, size: 32, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !731, file: !732, line: 125, baseType: !792, size: 16, offset: 352)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "covers", scope: !731, file: !732, line: 126, baseType: !216, size: 16, offset: 368)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !731, file: !732, line: 131, baseType: !7, size: 32, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !731, file: !732, line: 139, baseType: !235, size: 32, offset: 416)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "resign", scope: !731, file: !732, line: 145, baseType: !1000, size: 32, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_stdtime_t", file: !1001, line: 26, baseType: !235)
!1001 = !DIFile(filename: "../../lib/isc/unix/include/isc/stdtime.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/bin/check", checksumkind: CSK_MD5, checksum: "b8868fded6c0eb282ad50986c628a693")
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !731, file: !732, line: 152, baseType: !210, size: 64, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !731, file: !732, line: 153, baseType: !210, size: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !731, file: !732, line: 154, baseType: !210, size: 64, offset: 640)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "privateuint4", scope: !731, file: !732, line: 155, baseType: !7, size: 32, offset: 704)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !731, file: !732, line: 156, baseType: !210, size: 64, offset: 768)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !731, file: !732, line: 157, baseType: !966, size: 64, offset: 832)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "private7", scope: !731, file: !732, line: 158, baseType: !966, size: 64, offset: 896)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !726, file: !709, line: 113, baseType: !729, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !703, file: !704, line: 63, baseType: !1011, size: 1024, offset: 640)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_offsets_t", file: !45, line: 112, baseType: !1012)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 1024, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !703, file: !704, line: 64, baseType: !683, size: 512, offset: 1664)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !703, file: !704, line: 65, baseType: !1017, size: 2040, offset: 2176)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 2040, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 255)
!1020 = !DILocalVariable(name: "origin", scope: !655, file: !3, line: 653, type: !723)
!1021 = !DILocalVariable(name: "zone", scope: !655, file: !3, line: 654, type: !661)
!1022 = !DILocalVariable(name: "_deconst", scope: !1023, file: !3, line: 666, type: !1024)
!1023 = distinct !DILexicalBlock(scope: !655, file: !3, line: 666, column: 2)
!1024 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !655, file: !3, line: 666, size: 64, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_var", scope: !1024, file: !3, line: 666, baseType: !210, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_const", scope: !1024, file: !3, line: 666, baseType: !966, size: 64)
!1028 = !DILocalVariable(name: "_u", scope: !1029, file: !3, line: 677, type: !1030)
!1029 = distinct !DILexicalBlock(scope: !655, file: !3, line: 677, column: 2)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !655, file: !3, line: 677, size: 64, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1030, file: !3, line: 677, baseType: !966, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1030, file: !3, line: 677, baseType: !210, size: 64)
!1034 = !DILabel(scope: !655, name: "cleanup", file: !3, line: 709)
!1035 = !DILocation(line: 644, column: 22, scope: !655)
!1036 = !DILocation(line: 644, column: 40, scope: !655)
!1037 = !DILocation(line: 644, column: 62, scope: !655)
!1038 = !DILocation(line: 645, column: 23, scope: !655)
!1039 = !DILocation(line: 645, column: 47, scope: !655)
!1040 = !DILocation(line: 646, column: 14, scope: !655)
!1041 = !DILocation(line: 646, column: 35, scope: !655)
!1042 = !DILocation(line: 648, column: 2, scope: !655)
!1043 = !DILocation(line: 648, column: 15, scope: !655)
!1044 = !DILocation(line: 649, column: 2, scope: !655)
!1045 = !DILocation(line: 649, column: 19, scope: !655)
!1046 = !DILocation(line: 650, column: 2, scope: !655)
!1047 = !DILocation(line: 650, column: 19, scope: !655)
!1048 = !DILocation(line: 651, column: 2, scope: !655)
!1049 = !DILocation(line: 651, column: 15, scope: !655)
!1050 = !DILocation(line: 652, column: 2, scope: !655)
!1051 = !DILocation(line: 652, column: 18, scope: !655)
!1052 = !DILocation(line: 653, column: 2, scope: !655)
!1053 = !DILocation(line: 653, column: 14, scope: !655)
!1054 = !DILocation(line: 654, column: 2, scope: !655)
!1055 = !DILocation(line: 654, column: 14, scope: !655)
!1056 = !DILocation(line: 656, column: 2, scope: !655)
!1057 = !DILocation(line: 658, column: 6, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !655, file: !3, line: 658, column: 6)
!1059 = !DILocation(line: 658, column: 6, scope: !655)
!1060 = !DILocation(line: 659, column: 11, scope: !1058)
!1061 = !DILocation(line: 660, column: 4, scope: !1058)
!1062 = !DILocation(line: 660, column: 14, scope: !1058)
!1063 = !DILocation(line: 660, column: 24, scope: !1058)
!1064 = !DILocation(line: 659, column: 3, scope: !1058)
!1065 = !DILocation(line: 662, column: 2, scope: !655)
!1066 = !DILocation(line: 662, column: 2, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !655, file: !3, line: 662, column: 2)
!1068 = !DILocation(line: 662, column: 2, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 662, column: 2)
!1070 = !DILocation(line: 664, column: 19, scope: !655)
!1071 = !DILocation(line: 664, column: 2, scope: !655)
!1072 = !DILocation(line: 666, column: 2, scope: !655)
!1073 = !DILocation(line: 666, column: 2, scope: !1023)
!1074 = !DILocation(line: 666, column: 2, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 666, column: 2)
!1076 = !DILocation(line: 666, column: 2, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 666, column: 2)
!1078 = !DILocation(line: 667, column: 2, scope: !655)
!1079 = !DILocation(line: 667, column: 2, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !655, file: !3, line: 667, column: 2)
!1081 = !DILocation(line: 668, column: 11, scope: !655)
!1082 = !DILocation(line: 668, column: 9, scope: !655)
!1083 = !DILocation(line: 669, column: 2, scope: !655)
!1084 = !DILocation(line: 669, column: 2, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !655, file: !3, line: 669, column: 2)
!1086 = !DILocation(line: 669, column: 2, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 669, column: 2)
!1088 = !DILocation(line: 670, column: 2, scope: !655)
!1089 = !DILocation(line: 670, column: 2, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !655, file: !3, line: 670, column: 2)
!1091 = !DILocation(line: 670, column: 2, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 670, column: 2)
!1093 = !DILocation(line: 671, column: 2, scope: !655)
!1094 = !DILocation(line: 671, column: 2, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !655, file: !3, line: 671, column: 2)
!1096 = !DILocation(line: 671, column: 2, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 671, column: 2)
!1098 = !DILocation(line: 672, column: 2, scope: !655)
!1099 = !DILocation(line: 672, column: 2, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !655, file: !3, line: 672, column: 2)
!1101 = !DILocation(line: 672, column: 2, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 672, column: 2)
!1103 = !DILocation(line: 674, column: 6, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !655, file: !3, line: 674, column: 6)
!1105 = !DILocation(line: 674, column: 14, scope: !1104)
!1106 = !DILocation(line: 674, column: 6, scope: !655)
!1107 = !DILocation(line: 675, column: 3, scope: !1104)
!1108 = !DILocation(line: 675, column: 3, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 675, column: 3)
!1110 = !DILocation(line: 675, column: 3, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 675, column: 3)
!1112 = !DILocation(line: 677, column: 2, scope: !655)
!1113 = !DILocation(line: 677, column: 2, scope: !1029)
!1114 = !DILocation(line: 678, column: 25, scope: !655)
!1115 = !DILocation(line: 678, column: 18, scope: !655)
!1116 = !DILocation(line: 678, column: 9, scope: !655)
!1117 = !DILocation(line: 678, column: 16, scope: !655)
!1118 = !DILocation(line: 679, column: 2, scope: !655)
!1119 = !DILocation(line: 679, column: 2, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !655, file: !3, line: 679, column: 2)
!1121 = !DILocation(line: 679, column: 2, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 679, column: 2)
!1123 = !DILocation(line: 681, column: 20, scope: !655)
!1124 = !DILocation(line: 681, column: 26, scope: !655)
!1125 = !DILocation(line: 681, column: 2, scope: !655)
!1126 = !DILocation(line: 682, column: 21, scope: !655)
!1127 = !DILocation(line: 682, column: 27, scope: !655)
!1128 = !DILocation(line: 682, column: 2, scope: !655)
!1129 = !DILocation(line: 683, column: 21, scope: !655)
!1130 = !DILocation(line: 683, column: 48, scope: !655)
!1131 = !{i8 0, i8 2}
!1132 = !{}
!1133 = !DILocation(line: 683, column: 2, scope: !655)
!1134 = !DILocation(line: 685, column: 21, scope: !655)
!1135 = !DILocation(line: 685, column: 27, scope: !655)
!1136 = !DILocation(line: 685, column: 2, scope: !655)
!1137 = !DILocation(line: 687, column: 6, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !655, file: !3, line: 687, column: 6)
!1139 = !DILocation(line: 687, column: 6, scope: !655)
!1140 = !DILocation(line: 688, column: 23, scope: !1138)
!1141 = !DILocation(line: 688, column: 3, scope: !1138)
!1142 = !DILocation(line: 689, column: 6, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !655, file: !3, line: 689, column: 6)
!1144 = !DILocation(line: 689, column: 6, scope: !655)
!1145 = !DILocation(line: 690, column: 23, scope: !1143)
!1146 = !DILocation(line: 690, column: 3, scope: !1143)
!1147 = !DILocation(line: 691, column: 6, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !655, file: !3, line: 691, column: 6)
!1149 = !DILocation(line: 691, column: 6, scope: !655)
!1150 = !DILocation(line: 692, column: 24, scope: !1148)
!1151 = !DILocation(line: 692, column: 3, scope: !1148)
!1152 = !DILocation(line: 694, column: 2, scope: !655)
!1153 = !DILocation(line: 694, column: 2, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !655, file: !3, line: 694, column: 2)
!1155 = !DILocation(line: 694, column: 2, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1154, file: !3, line: 694, column: 2)
!1157 = !DILocation(line: 700, column: 6, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !655, file: !3, line: 700, column: 6)
!1159 = !DILocation(line: 700, column: 17, scope: !1158)
!1160 = !DILocation(line: 700, column: 41, scope: !1158)
!1161 = !DILocation(line: 700, column: 44, scope: !1158)
!1162 = !DILocation(line: 700, column: 51, scope: !1158)
!1163 = !DILocation(line: 700, column: 6, scope: !655)
!1164 = !DILocation(line: 701, column: 3, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 700, column: 57)
!1166 = !DILocation(line: 701, column: 3, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 701, column: 3)
!1168 = !DILocation(line: 701, column: 3, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 701, column: 3)
!1170 = !DILocation(line: 702, column: 2, scope: !1165)
!1171 = !DILocation(line: 704, column: 6, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !655, file: !3, line: 704, column: 6)
!1173 = !DILocation(line: 704, column: 12, scope: !1172)
!1174 = !DILocation(line: 704, column: 6, scope: !655)
!1175 = !DILocation(line: 705, column: 12, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1172, file: !3, line: 704, column: 21)
!1177 = !DILocation(line: 705, column: 4, scope: !1176)
!1178 = !DILocation(line: 705, column: 10, scope: !1176)
!1179 = !DILocation(line: 706, column: 8, scope: !1176)
!1180 = !DILocation(line: 707, column: 2, scope: !1176)
!1181 = !DILocation(line: 704, column: 15, scope: !1172)
!1182 = !DILocation(line: 709, column: 2, scope: !655)
!1183 = !DILocation(line: 710, column: 6, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !655, file: !3, line: 710, column: 6)
!1185 = !DILocation(line: 710, column: 11, scope: !1184)
!1186 = !DILocation(line: 710, column: 6, scope: !655)
!1187 = !DILocation(line: 711, column: 3, scope: !1184)
!1188 = !DILocation(line: 712, column: 10, scope: !655)
!1189 = !DILocation(line: 713, column: 1, scope: !655)
!1190 = !DILocation(line: 712, column: 2, scope: !655)
!1191 = !DISubprogram(name: "isc_assertion_failed", scope: !52, file: !52, line: 37, type: !1192, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{null, !213, !482, !1194, !213}
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_assertiontype_t", file: !52, line: 30, baseType: !51)
!1195 = !DISubprogram(name: "fprintf", scope: !570, file: !570, line: 350, type: !1196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!482, !1198, !1199, null}
!1198 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !493)
!1199 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !213)
!1200 = !DISubprogram(name: "dns_zone_create", scope: !6, file: !6, line: 130, type: !1201, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!492, !660, !390}
!1203 = !DISubprogram(name: "dns_zone_settype", scope: !6, file: !6, line: 185, type: !1204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{null, !661, !1206}
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_zonetype_t", file: !6, line: 47, baseType: !58)
!1207 = !DISubprogram(name: "strlen", scope: !1208, file: !1208, line: 407, type: !1209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1208 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!408, !213}
!1211 = !DISubprogram(name: "dns_fixedname_initname", scope: !704, file: !704, line: 80, type: !1212, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!723, !1214}
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!1215 = !DISubprogram(name: "dns_name_fromtext", scope: !709, file: !709, line: 784, type: !1216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!492, !723, !697, !780, !7, !697}
!1218 = !DISubprogram(name: "dns_zone_setorigin", scope: !6, file: !6, line: 236, type: !1219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!492, !661, !780}
!1221 = !DISubprogram(name: "dns_zone_setdbtype", scope: !6, file: !6, line: 487, type: !1222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!492, !661, !7, !211}
!1224 = !DISubprogram(name: "dns_zone_setfile", scope: !6, file: !6, line: 259, type: !1225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!492, !661, !213, !658, !1227}
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_master_style_t", file: !1230, line: 32, baseType: !1231)
!1230 = !DIFile(filename: "lib/dns/include/dns/masterdump.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "ca71d9f8f00020df7306dd98e6970576")
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_master_style", file: !1230, line: 32, flags: DIFlagFwdDecl)
!1232 = !DISubprogram(name: "dns_zone_setjournal", scope: !6, file: !6, line: 1262, type: !1233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!492, !661, !213}
!1235 = !DISubprogram(name: "dns_rdataclass_fromtext", scope: !1236, file: !1236, line: 25, type: !1237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1236 = !DIFile(filename: "lib/dns/include/dns/rdataclass.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "ea79dedb4935b282d4502bc127f702d6")
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!492, !1239, !1240}
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!1241 = !DISubprogram(name: "dns_zone_setclass", scope: !6, file: !6, line: 148, type: !1242, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{null, !661, !674}
