; ModuleID = 'samples/719.bc'
source_filename = "src/http/ngx_http_file_cache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_rbtree_s = type { ptr, ptr, ptr }
%struct.ngx_http_request_s = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct.ngx_http_headers_in_t, %struct.ngx_http_headers_out_t, ptr, i64, i64, i64, i64, i64, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, i64, ptr, i64, i64, i64, i64, i64, ptr, ptr, ptr, ptr, i112, i64, i64, i64, [32 x i8], ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct.ngx_http_headers_in_t = type { %struct.ngx_list_t, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct.ngx_array_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_array_t, %struct.ngx_str_t, i64, i64, i16 }
%struct.ngx_list_t = type { ptr, %struct.ngx_list_part_s, i64, i64, ptr }
%struct.ngx_list_part_s = type { ptr, i64, ptr }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/http/ngx_http_file_cache.c", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "4994bc7e3a745fc568c4f3e2c58d3806")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 5)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 7)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 71, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 8)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 72, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 6)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 9)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 74, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 12)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 4)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "ngx_http_cache_status", scope: !39, file: !2, line: 68, type: !2166, isLocal: false, isDefinition: true)
!39 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !40, globals: !1946, splitDebugInlining: false, nameTableKind: None)
!40 = !{!41, !47, !48, !74, !42, !90, !92, !94, !95, !60, !97, !101, !279, !280, !286, !716, !1945, !141, !596, !54}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !43, line: 33, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !45, line: 31, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_header_t", file: !50, line: 142, baseType: !51)
!50 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "04ea2ebc84c597718a4782ab3cabf19d")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 126, size: 2688, elements: !52)
!52 = !{!53, !59, !64, !65, !66, !67, !68, !73, !77, !78, !79, !80, !84, !85, !86}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !51, file: !50, line: 127, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !55, line: 79, baseType: !56)
!55 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !57, line: 90, baseType: !58)
!57 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!58 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !51, file: !50, line: 128, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !61, line: 10, baseType: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !45, line: 160, baseType: !63)
!63 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !51, file: !50, line: 129, baseType: !60, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !51, file: !50, line: 130, baseType: !60, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !51, file: !50, line: 131, baseType: !60, size: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !51, file: !50, line: 132, baseType: !60, size: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !51, file: !50, line: 133, baseType: !69, size: 32, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !70, line: 26, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !45, line: 42, baseType: !72)
!72 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !51, file: !50, line: 134, baseType: !74, size: 16, offset: 416)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !43, line: 34, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !45, line: 32, baseType: !76)
!76 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !51, file: !50, line: 135, baseType: !74, size: 16, offset: 432)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !51, file: !50, line: 136, baseType: !74, size: 16, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "etag_len", scope: !51, file: !50, line: 137, baseType: !42, size: 8, offset: 464)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !51, file: !50, line: 138, baseType: !81, size: 1024, offset: 472)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1024, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "vary_len", scope: !51, file: !50, line: 139, baseType: !42, size: 8, offset: 1496)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !51, file: !50, line: 140, baseType: !81, size: 1024, offset: 1504)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !51, file: !50, line: 141, baseType: !87, size: 128, offset: 2528)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 128, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 16)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !93, line: 29, baseType: !58)
!93 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!94 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !43, line: 108, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !45, line: 194, baseType: !63)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !98, line: 16, baseType: !99)
!98 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !100, line: 16, baseType: !54)
!100 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ee5b3151c1c48b156833d321f8e1946a")
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !103, line: 22, baseType: !104)
!103 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 16, size: 320, elements: !105)
!105 = !{!106, !107, !108, !109, !110}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !104, file: !103, line: 17, baseType: !47, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !104, file: !103, line: 18, baseType: !54, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !103, line: 19, baseType: !92, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !104, file: !103, line: 20, baseType: !54, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !104, file: !103, line: 21, baseType: !111, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !113, line: 18, baseType: !114)
!113 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1c4d8383f329aa1de050d17038ecb169")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !115, line: 57, size: 640, elements: !116)
!115 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!116 = !{!117, !125, !126, !127, !259, !266, !278}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !114, file: !115, line: 58, baseType: !118, size: 256)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !115, line: 54, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 49, size: 256, elements: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !119, file: !115, line: 50, baseType: !41, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !119, file: !115, line: 51, baseType: !41, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !115, line: 52, baseType: !111, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !119, file: !115, line: 53, baseType: !54, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !114, file: !115, line: 59, baseType: !92, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !114, file: !115, line: 60, baseType: !111, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !114, file: !115, line: 61, baseType: !128, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !113, line: 19, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !131, line: 59, size: 128, elements: !132)
!131 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6fc45f3cccbbf41b239dcfa9e2c5b7b1")
!132 = !{!133, !258}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !130, file: !131, line: 60, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !131, line: 18, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !131, line: 20, size: 640, elements: !137)
!137 = !{!138, !139, !140, !143, !144, !145, !146, !148, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !136, file: !131, line: 21, baseType: !41, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !136, file: !131, line: 22, baseType: !41, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !136, file: !131, line: 23, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !43, line: 87, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !45, line: 153, baseType: !63)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !136, file: !131, line: 24, baseType: !141, size: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !136, file: !131, line: 26, baseType: !41, size: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !136, file: !131, line: 27, baseType: !41, size: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !136, file: !131, line: 28, baseType: !147, size: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !131, line: 16, baseType: !47)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !136, file: !131, line: 29, baseType: !149, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !113, line: 23, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !152, line: 16, size: 1600, elements: !153)
!152 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!153 = !{!154, !157, !164, !202, !203, !204, !243, !244}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !151, file: !152, line: 17, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !156, line: 16, baseType: !94)
!156 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "7b9a751e8c1ad1afef5467d60ed94e69")
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !152, line: 18, baseType: !158, size: 128, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !159, line: 19, baseType: !160)
!159 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "aecf67ab89c624000ba2e2684dbcfdc8")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !159, line: 16, size: 128, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !160, file: !159, line: 17, baseType: !92, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !159, line: 18, baseType: !41, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !151, file: !152, line: 19, baseType: !165, size: 1152, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !156, line: 17, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !167, line: 26, size: 1152, elements: !168)
!167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!168 = !{!169, !171, !173, !175, !177, !179, !181, !182, !183, !185, !187, !189, !196, !197, !198}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !166, file: !167, line: 31, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !45, line: 145, baseType: !58)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !166, file: !167, line: 36, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !45, line: 148, baseType: !58)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !166, file: !167, line: 44, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !45, line: 151, baseType: !58)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !166, file: !167, line: 45, baseType: !176, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !45, line: 150, baseType: !72)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !166, file: !167, line: 47, baseType: !178, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !45, line: 146, baseType: !72)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !166, file: !167, line: 48, baseType: !180, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !45, line: 147, baseType: !72)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !166, file: !167, line: 50, baseType: !94, size: 32, offset: 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !166, file: !167, line: 52, baseType: !170, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !166, file: !167, line: 57, baseType: !184, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !45, line: 152, baseType: !63)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !166, file: !167, line: 61, baseType: !186, size: 64, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !45, line: 175, baseType: !63)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !166, file: !167, line: 63, baseType: !188, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !45, line: 180, baseType: !63)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !166, file: !167, line: 74, baseType: !190, size: 128, offset: 576)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !191, line: 11, size: 128, elements: !192)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !190, file: !191, line: 16, baseType: !62, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !190, file: !191, line: 21, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !45, line: 197, baseType: !63)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !166, file: !167, line: 75, baseType: !190, size: 128, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !166, file: !167, line: 76, baseType: !190, size: 128, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !166, file: !167, line: 89, baseType: !199, size: 192, offset: 960)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 192, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 3)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !151, file: !152, line: 21, baseType: !141, size: 64, offset: 1344)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !151, file: !152, line: 22, baseType: !141, size: 64, offset: 1408)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !151, file: !152, line: 24, baseType: !205, size: 64, offset: 1472)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !113, line: 20, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !208, line: 50, size: 640, elements: !209)
!208 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f35895306f847777914ce99ffeccfabd")
!209 = !{!210, !211, !224, !227, !228, !233, !234, !239, !240, !242}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !207, file: !208, line: 51, baseType: !54, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !207, file: !208, line: 52, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !113, line: 21, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !215, line: 89, size: 320, elements: !216)
!215 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6ae6b72e2fd6bbb6ecc9de2e6386072c")
!216 = !{!217, !218, !219, !223}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !214, file: !215, line: 90, baseType: !155, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !215, line: 91, baseType: !158, size: 128, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !214, file: !215, line: 93, baseType: !220, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !212, !205}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !215, line: 94, baseType: !47, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !207, file: !208, line: 54, baseType: !225, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !226, line: 98, baseType: !58)
!226 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "eac8f0294f941da9268c3a72c9fca0e1")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !207, file: !208, line: 56, baseType: !60, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !207, file: !208, line: 58, baseType: !229, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !208, line: 45, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!41, !205, !41, !92}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !208, line: 59, baseType: !47, size: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !207, file: !208, line: 61, baseType: !235, size: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !208, line: 46, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !205, !54, !41, !92}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !207, file: !208, line: 62, baseType: !47, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !207, file: !208, line: 70, baseType: !241, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !208, line: 72, baseType: !205, size: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !151, file: !152, line: 37, baseType: !72, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !151, file: !152, line: 38, baseType: !72, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !136, file: !131, line: 30, baseType: !134, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !136, file: !131, line: 34, baseType: !72, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !136, file: !131, line: 40, baseType: !72, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !136, file: !131, line: 43, baseType: !72, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !136, file: !131, line: 45, baseType: !72, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !136, file: !131, line: 46, baseType: !72, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !136, file: !131, line: 47, baseType: !72, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !136, file: !131, line: 48, baseType: !72, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !136, file: !131, line: 49, baseType: !72, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !136, file: !131, line: 50, baseType: !72, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !136, file: !131, line: 52, baseType: !72, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !136, file: !131, line: 53, baseType: !72, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !136, file: !131, line: 55, baseType: !94, size: 32, offset: 608)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !131, line: 61, baseType: !128, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !114, file: !115, line: 62, baseType: !260, size: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !115, line: 41, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !115, line: 43, size: 128, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !262, file: !115, line: 44, baseType: !260, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !262, file: !115, line: 45, baseType: !47, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !114, file: !115, line: 63, baseType: !267, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !115, line: 32, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !115, line: 34, size: 192, elements: !270)
!270 = !{!271, !276, !277}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !269, file: !115, line: 35, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !115, line: 30, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !47}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !115, line: 36, baseType: !47, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !115, line: 37, baseType: !267, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !114, file: !115, line: 64, baseType: !205, size: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !98, line: 17, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !100, line: 17, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !55, line: 78, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !284, line: 267, baseType: !285)
!284 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !45, line: 207, baseType: !63)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_log_ctx_t", file: !288, line: 20, baseType: !289)
!288 = !DIFile(filename: "src/http/ngx_http.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "936639e5730ac898b9486f4f53b5f2f5")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_log_ctx_s", file: !288, line: 52, size: 192, elements: !290)
!290 = !{!291, !525, !1944}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !289, file: !288, line: 53, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !113, line: 26, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !295, line: 124, size: 1920, elements: !296)
!295 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf513a87e959064e14502903e9282b0e")
!296 = !{!297, !298, !353, !354, !357, !363, !365, !370, !375, !450, !451, !452, !453, !454, !455, !456, !457, !458, !463, !501, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !295, line: 125, baseType: !47, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !294, file: !295, line: 126, baseType: !299, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !113, line: 24, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !302, line: 30, size: 768, elements: !303)
!302 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c79f651cc4aca504d9d912404beb8bf3")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !332, !333, !334, !345}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !302, line: 31, baseType: !47, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !301, file: !302, line: 33, baseType: !72, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !301, file: !302, line: 35, baseType: !72, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !301, file: !302, line: 38, baseType: !72, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !301, file: !302, line: 44, baseType: !72, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !301, file: !302, line: 46, baseType: !72, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !301, file: !302, line: 49, baseType: !72, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !301, file: !302, line: 51, baseType: !72, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !301, file: !302, line: 54, baseType: !72, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !301, file: !302, line: 56, baseType: !72, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !301, file: !302, line: 57, baseType: !72, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !301, file: !302, line: 59, baseType: !72, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !301, file: !302, line: 60, baseType: !72, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !301, file: !302, line: 62, baseType: !72, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !301, file: !302, line: 64, baseType: !72, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !301, file: !302, line: 67, baseType: !72, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !301, file: !302, line: 69, baseType: !72, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !301, file: !302, line: 71, baseType: !72, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !301, file: !302, line: 74, baseType: !72, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !301, file: !302, line: 75, baseType: !72, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "skip_socket_leak_check", scope: !301, file: !302, line: 77, baseType: !72, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !301, file: !302, line: 80, baseType: !72, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !301, file: !302, line: 110, baseType: !72, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !301, file: !302, line: 113, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !113, line: 32, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !299}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !301, file: !302, line: 120, baseType: !54, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !301, file: !302, line: 122, baseType: !205, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !301, file: !302, line: 124, baseType: !335, size: 320, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !100, line: 20, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !100, line: 22, size: 320, elements: !337)
!337 = !{!338, !339, !341, !342, !343, !344}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !336, file: !100, line: 23, baseType: !99, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !336, file: !100, line: 24, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !336, file: !100, line: 25, baseType: !340, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !336, file: !100, line: 26, baseType: !340, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !336, file: !100, line: 27, baseType: !42, size: 8, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !336, file: !100, line: 28, baseType: !42, size: 8, offset: 264)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !301, file: !302, line: 127, baseType: !346, size: 128, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !347, line: 16, baseType: !348)
!347 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !347, line: 18, size: 128, elements: !349)
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !348, file: !347, line: 19, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !347, line: 20, baseType: !351, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !294, file: !295, line: 127, baseType: !299, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !294, file: !295, line: 129, baseType: !355, size: 32, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !356, line: 17, baseType: !94)
!356 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ad64fd7b9f2b4876e8c9dcdeeb2305ce")
!357 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !294, file: !295, line: 131, baseType: !358, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !359, line: 19, baseType: !360)
!359 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!95, !292, !41, !92}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !294, file: !295, line: 132, baseType: !364, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !359, line: 22, baseType: !360)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !294, file: !295, line: 133, baseType: !366, size: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !359, line: 20, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!95, !292, !128, !141}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !294, file: !295, line: 134, baseType: !371, size: 64, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !359, line: 23, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!128, !292, !128, !141}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !294, file: !295, line: 136, baseType: !376, size: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !295, line: 16, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !295, line: 18, size: 2432, elements: !379)
!379 = !{!380, !381, !393, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !410, !411, !412, !413, !414, !415, !416, !417, !418, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !378, file: !295, line: 19, baseType: !355, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !378, file: !295, line: 21, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !384, line: 180, size: 128, elements: !385)
!384 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!385 = !{!386, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !383, file: !384, line: 182, baseType: !387, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !388, line: 28, baseType: !76)
!388 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !383, file: !384, line: 183, baseType: !390, size: 112, offset: 16)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 14)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !378, file: !295, line: 22, baseType: !394, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !284, line: 274, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !45, line: 210, baseType: !72)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !378, file: !295, line: 23, baseType: !92, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !378, file: !295, line: 24, baseType: !158, size: 128, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !378, file: !295, line: 26, baseType: !94, size: 32, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !378, file: !295, line: 28, baseType: !94, size: 32, offset: 416)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !378, file: !295, line: 29, baseType: !94, size: 32, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !378, file: !295, line: 30, baseType: !94, size: 32, offset: 480)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !378, file: !295, line: 32, baseType: !94, size: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !378, file: !295, line: 33, baseType: !94, size: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !378, file: !295, line: 34, baseType: !94, size: 32, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !378, file: !295, line: 38, baseType: !406, size: 64, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !113, line: 33, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !292}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !378, file: !295, line: 40, baseType: !47, size: 64, offset: 704)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !378, file: !295, line: 42, baseType: !206, size: 640, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !378, file: !295, line: 43, baseType: !205, size: 64, offset: 1408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !378, file: !295, line: 45, baseType: !92, size: 64, offset: 1472)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !378, file: !295, line: 47, baseType: !92, size: 64, offset: 1536)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !378, file: !295, line: 49, baseType: !97, size: 64, offset: 1600)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !378, file: !295, line: 51, baseType: !376, size: 64, offset: 1664)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !378, file: !295, line: 52, baseType: !292, size: 64, offset: 1728)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !378, file: !295, line: 54, baseType: !419, size: 192, offset: 1792)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !100, line: 32, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !100, line: 37, size: 192, elements: !421)
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !420, file: !100, line: 38, baseType: !340, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !420, file: !100, line: 39, baseType: !340, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !420, file: !100, line: 40, baseType: !425, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !100, line: 34, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !340, !340, !340}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !378, file: !295, line: 55, baseType: !335, size: 320, offset: 1984)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !378, file: !295, line: 57, baseType: !54, size: 64, offset: 2304)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !378, file: !295, line: 59, baseType: !72, size: 1, offset: 2368, flags: DIFlagBitField, extraData: i64 2368)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !378, file: !295, line: 60, baseType: !72, size: 1, offset: 2369, flags: DIFlagBitField, extraData: i64 2368)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !378, file: !295, line: 61, baseType: !72, size: 1, offset: 2370, flags: DIFlagBitField, extraData: i64 2368)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !378, file: !295, line: 63, baseType: !72, size: 1, offset: 2371, flags: DIFlagBitField, extraData: i64 2368)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !378, file: !295, line: 64, baseType: !72, size: 1, offset: 2372, flags: DIFlagBitField, extraData: i64 2368)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !378, file: !295, line: 65, baseType: !72, size: 1, offset: 2373, flags: DIFlagBitField, extraData: i64 2368)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !378, file: !295, line: 66, baseType: !72, size: 1, offset: 2374, flags: DIFlagBitField, extraData: i64 2368)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !378, file: !295, line: 67, baseType: !72, size: 1, offset: 2375, flags: DIFlagBitField, extraData: i64 2368)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !378, file: !295, line: 68, baseType: !72, size: 1, offset: 2376, flags: DIFlagBitField, extraData: i64 2368)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !378, file: !295, line: 69, baseType: !72, size: 1, offset: 2377, flags: DIFlagBitField, extraData: i64 2368)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !378, file: !295, line: 70, baseType: !72, size: 1, offset: 2378, flags: DIFlagBitField, extraData: i64 2368)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !378, file: !295, line: 73, baseType: !72, size: 1, offset: 2379, flags: DIFlagBitField, extraData: i64 2368)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !378, file: !295, line: 75, baseType: !72, size: 1, offset: 2380, flags: DIFlagBitField, extraData: i64 2368)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !378, file: !295, line: 76, baseType: !72, size: 1, offset: 2381, flags: DIFlagBitField, extraData: i64 2368)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !378, file: !295, line: 77, baseType: !72, size: 2, offset: 2382, flags: DIFlagBitField, extraData: i64 2368)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !378, file: !295, line: 79, baseType: !72, size: 1, offset: 2384, flags: DIFlagBitField, extraData: i64 2368)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !378, file: !295, line: 80, baseType: !72, size: 1, offset: 2385, flags: DIFlagBitField, extraData: i64 2368)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !378, file: !295, line: 81, baseType: !72, size: 1, offset: 2386, flags: DIFlagBitField, extraData: i64 2368)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !378, file: !295, line: 90, baseType: !94, size: 32, offset: 2400)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !294, file: !295, line: 138, baseType: !141, size: 64, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !294, file: !295, line: 140, baseType: !205, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !294, file: !295, line: 142, baseType: !111, size: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !294, file: !295, line: 144, baseType: !94, size: 32, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !294, file: !295, line: 146, baseType: !382, size: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !294, file: !295, line: 147, baseType: !394, size: 32, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !294, file: !295, line: 148, baseType: !158, size: 128, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !294, file: !295, line: 150, baseType: !158, size: 128, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !294, file: !295, line: 151, baseType: !459, size: 16, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !460, line: 123, baseType: !461)
!460 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !70, line: 25, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !45, line: 40, baseType: !76)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !294, file: !295, line: 154, baseType: !464, size: 64, offset: 1280)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !113, line: 29, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !467, line: 74, size: 704, elements: !468)
!467 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "51639b814b1b55c5b35047c033281672")
!468 = !{!469, !474, !478, !479, !480, !481, !482, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !466, file: !467, line: 75, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !472, line: 184, baseType: !473)
!472 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !472, line: 184, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !466, file: !467, line: 76, baseType: !475, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !472, line: 185, baseType: !477)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !472, line: 185, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !466, file: !467, line: 78, baseType: !282, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !466, file: !467, line: 79, baseType: !134, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !466, file: !467, line: 80, baseType: !92, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !466, file: !467, line: 82, baseType: !406, size: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !466, file: !467, line: 84, baseType: !483, size: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !485, line: 231, baseType: !486)
!485 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "848d42aedd0da44ffda19088217823c7")
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !485, line: 231, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !466, file: !467, line: 85, baseType: !406, size: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !466, file: !467, line: 87, baseType: !328, size: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !466, file: !467, line: 88, baseType: !328, size: 64, offset: 576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !466, file: !467, line: 90, baseType: !42, size: 8, offset: 640)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !466, file: !467, line: 92, baseType: !72, size: 1, offset: 648, flags: DIFlagBitField, extraData: i64 648)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !466, file: !467, line: 93, baseType: !72, size: 1, offset: 649, flags: DIFlagBitField, extraData: i64 648)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !466, file: !467, line: 94, baseType: !72, size: 1, offset: 650, flags: DIFlagBitField, extraData: i64 648)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !466, file: !467, line: 95, baseType: !72, size: 1, offset: 651, flags: DIFlagBitField, extraData: i64 648)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !466, file: !467, line: 96, baseType: !72, size: 1, offset: 652, flags: DIFlagBitField, extraData: i64 648)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !466, file: !467, line: 97, baseType: !72, size: 1, offset: 653, flags: DIFlagBitField, extraData: i64 648)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !466, file: !467, line: 98, baseType: !72, size: 1, offset: 654, flags: DIFlagBitField, extraData: i64 648)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !466, file: !467, line: 99, baseType: !72, size: 1, offset: 655, flags: DIFlagBitField, extraData: i64 648)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !466, file: !467, line: 100, baseType: !72, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 648)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !466, file: !467, line: 101, baseType: !72, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 648)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !294, file: !295, line: 157, baseType: !502, size: 64, offset: 1344)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !113, line: 30, baseType: !504)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !113, line: 30, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !294, file: !295, line: 159, baseType: !382, size: 64, offset: 1408)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !294, file: !295, line: 160, baseType: !394, size: 32, offset: 1472)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !294, file: !295, line: 162, baseType: !134, size: 64, offset: 1536)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !294, file: !295, line: 164, baseType: !346, size: 128, offset: 1600)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !294, file: !295, line: 166, baseType: !225, size: 64, offset: 1728)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !294, file: !295, line: 168, baseType: !54, size: 64, offset: 1792)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !294, file: !295, line: 170, baseType: !72, size: 8, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !294, file: !295, line: 172, baseType: !72, size: 3, offset: 1864, flags: DIFlagBitField, extraData: i64 1856)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !294, file: !295, line: 174, baseType: !72, size: 1, offset: 1867, flags: DIFlagBitField, extraData: i64 1856)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !294, file: !295, line: 175, baseType: !72, size: 1, offset: 1868, flags: DIFlagBitField, extraData: i64 1856)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !294, file: !295, line: 176, baseType: !72, size: 1, offset: 1869, flags: DIFlagBitField, extraData: i64 1856)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !294, file: !295, line: 178, baseType: !72, size: 1, offset: 1870, flags: DIFlagBitField, extraData: i64 1856)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !294, file: !295, line: 179, baseType: !72, size: 1, offset: 1871, flags: DIFlagBitField, extraData: i64 1856)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !294, file: !295, line: 180, baseType: !72, size: 1, offset: 1872, flags: DIFlagBitField, extraData: i64 1856)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !294, file: !295, line: 181, baseType: !72, size: 1, offset: 1873, flags: DIFlagBitField, extraData: i64 1856)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !294, file: !295, line: 183, baseType: !72, size: 1, offset: 1874, flags: DIFlagBitField, extraData: i64 1856)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !294, file: !295, line: 184, baseType: !72, size: 1, offset: 1875, flags: DIFlagBitField, extraData: i64 1856)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !294, file: !295, line: 185, baseType: !72, size: 2, offset: 1876, flags: DIFlagBitField, extraData: i64 1856)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !294, file: !295, line: 186, baseType: !72, size: 2, offset: 1878, flags: DIFlagBitField, extraData: i64 1856)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !294, file: !295, line: 188, baseType: !72, size: 1, offset: 1880, flags: DIFlagBitField, extraData: i64 1856)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !289, file: !288, line: 54, baseType: !526, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !288, line: 16, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !529, line: 371, size: 11456, elements: !530)
!529 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1757f93ddb5cd3c545713a957f23192d")
!530 = !{!531, !532, !533, !535, !536, !537, !538, !543, !544, !755, !1488, !1489, !1490, !1491, !1533, !1565, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1611, !1622, !1629, !1630, !1632, !1633, !1646, !1647, !1648, !1649, !1650, !1651, !1837, !1841, !1846, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !528, file: !529, line: 372, baseType: !69, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !528, file: !529, line: 374, baseType: !292, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !528, file: !529, line: 376, baseType: !534, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !528, file: !529, line: 377, baseType: !534, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !528, file: !529, line: 378, baseType: !534, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !528, file: !529, line: 379, baseType: !534, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !528, file: !529, line: 381, baseType: !539, size: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !529, line: 368, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !526}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !528, file: !529, line: 382, baseType: !539, size: 64, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !528, file: !529, line: 385, baseType: !545, size: 64, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !288, line: 18, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !50, line: 65, size: 4800, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !715, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !547, file: !50, line: 66, baseType: !150, size: 1600)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !547, file: !50, line: 67, baseType: !102, size: 320, offset: 1600)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !547, file: !50, line: 68, baseType: !69, size: 32, offset: 1920)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !547, file: !50, line: 69, baseType: !87, size: 128, offset: 1952)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !547, file: !50, line: 70, baseType: !87, size: 128, offset: 2080)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !547, file: !50, line: 72, baseType: !555, size: 64, offset: 2240)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !156, line: 18, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !43, line: 49, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !45, line: 149, baseType: !58)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !547, file: !50, line: 73, baseType: !60, size: 64, offset: 2304)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !547, file: !50, line: 74, baseType: !60, size: 64, offset: 2368)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !547, file: !50, line: 75, baseType: !60, size: 64, offset: 2432)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !547, file: !50, line: 76, baseType: !60, size: 64, offset: 2496)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !547, file: !50, line: 77, baseType: !60, size: 64, offset: 2560)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !547, file: !50, line: 79, baseType: !158, size: 128, offset: 2624)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !547, file: !50, line: 80, baseType: !158, size: 128, offset: 2752)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !547, file: !50, line: 81, baseType: !87, size: 128, offset: 2880)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !547, file: !50, line: 83, baseType: !92, size: 64, offset: 3008)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !547, file: !50, line: 84, baseType: !92, size: 64, offset: 3072)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !547, file: !50, line: 85, baseType: !141, size: 64, offset: 3136)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !547, file: !50, line: 86, baseType: !141, size: 64, offset: 3200)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !547, file: !50, line: 88, baseType: !54, size: 64, offset: 3264)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !547, file: !50, line: 89, baseType: !54, size: 64, offset: 3328)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !547, file: !50, line: 90, baseType: !54, size: 64, offset: 3392)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !547, file: !50, line: 91, baseType: !54, size: 64, offset: 3456)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !547, file: !50, line: 93, baseType: !134, size: 64, offset: 3520)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !547, file: !50, line: 95, baseType: !576, size: 64, offset: 3584)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !288, line: 19, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !50, line: 157, size: 1088, elements: !579)
!579 = !{!580, !595, !656, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !714}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !578, file: !50, line: 158, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !50, line: 154, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 145, size: 960, elements: !584)
!584 = !{!585, !586, !587, !588, !591, !592, !593, !594}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !583, file: !50, line: 146, baseType: !419, size: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !583, file: !50, line: 147, baseType: !335, size: 320, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !583, file: !50, line: 148, baseType: !346, size: 128, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !583, file: !50, line: 149, baseType: !589, size: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !226, line: 106, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !225)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !583, file: !50, line: 150, baseType: !589, size: 64, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !583, file: !50, line: 151, baseType: !141, size: 64, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !583, file: !50, line: 152, baseType: !54, size: 64, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !583, file: !50, line: 153, baseType: !54, size: 64, offset: 896)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !578, file: !50, line: 159, baseType: !596, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !598, line: 59, baseType: !599)
!598 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6137611cd598fa2ecc498e6967a03177")
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !598, line: 34, size: 1600, elements: !600)
!600 = !{!601, !608, !609, !610, !618, !619, !620, !629, !630, !631, !632, !651, !652, !653, !654, !655}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !599, file: !598, line: 35, baseType: !602, size: 128)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !603, line: 21, baseType: !604)
!603 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "56a332e5761f46e2bb83cbdaf8b18a9f")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 16, size: 128, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !604, file: !603, line: 17, baseType: !589, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !604, file: !603, line: 19, baseType: !589, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !599, file: !598, line: 37, baseType: !92, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !599, file: !598, line: 38, baseType: !92, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !599, file: !598, line: 40, baseType: !611, size: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !598, line: 16, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !598, line: 18, size: 192, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !613, file: !598, line: 19, baseType: !56, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !613, file: !598, line: 20, baseType: !611, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !613, file: !598, line: 21, baseType: !56, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !599, file: !598, line: 41, baseType: !611, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !599, file: !598, line: 42, baseType: !612, size: 192, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !599, file: !598, line: 44, baseType: !621, size: 64, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !598, line: 31, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !598, line: 25, size: 256, elements: !624)
!624 = !{!625, !626, !627, !628}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !623, file: !598, line: 26, baseType: !54, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !623, file: !598, line: 27, baseType: !54, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !623, file: !598, line: 29, baseType: !54, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !623, file: !598, line: 30, baseType: !54, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !599, file: !598, line: 45, baseType: !54, size: 64, offset: 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !599, file: !598, line: 47, baseType: !41, size: 64, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !599, file: !598, line: 48, baseType: !41, size: 64, offset: 768)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !599, file: !598, line: 50, baseType: !633, size: 512, offset: 832)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !603, line: 37, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 24, size: 512, elements: !635)
!635 = !{!636, !638, !639, !640, !650}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !634, file: !603, line: 26, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !634, file: !603, line: 28, baseType: !637, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !634, file: !603, line: 29, baseType: !54, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !634, file: !603, line: 30, baseType: !641, size: 256, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !642, line: 39, baseType: !643)
!642 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !642, line: 35, size: 256, elements: !644)
!644 = !{!645, !649}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !643, file: !642, line: 37, baseType: !646, size: 256)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !643, file: !642, line: 38, baseType: !63, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !634, file: !603, line: 36, baseType: !54, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !599, file: !598, line: 52, baseType: !41, size: 64, offset: 1344)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !599, file: !598, line: 53, baseType: !42, size: 8, offset: 1408)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !599, file: !598, line: 55, baseType: !72, size: 1, offset: 1416, flags: DIFlagBitField, extraData: i64 1416)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !599, file: !598, line: 57, baseType: !47, size: 64, offset: 1472)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !599, file: !598, line: 58, baseType: !47, size: 64, offset: 1536)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !578, file: !50, line: 161, baseType: !657, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !152, line: 62, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 50, size: 768, elements: !660)
!660 = !{!661, !662, !663, !665, !670, !672, !674, !675, !676}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !659, file: !152, line: 51, baseType: !158, size: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !659, file: !152, line: 52, baseType: !92, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !659, file: !152, line: 53, baseType: !664, size: 192, offset: 192)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 192, elements: !200)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !659, file: !152, line: 55, baseType: !666, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !152, line: 45, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!97, !47}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !659, file: !152, line: 56, baseType: !671, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !152, line: 46, baseType: !667)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !659, file: !152, line: 57, baseType: !673, size: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !152, line: 47, baseType: !273)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !659, file: !152, line: 58, baseType: !47, size: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !659, file: !152, line: 60, baseType: !41, size: 64, offset: 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !659, file: !152, line: 61, baseType: !54, size: 64, offset: 704)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !578, file: !50, line: 163, baseType: !141, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !578, file: !50, line: 164, baseType: !92, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !578, file: !50, line: 166, baseType: !60, size: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !578, file: !50, line: 168, baseType: !60, size: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !578, file: !50, line: 170, baseType: !54, size: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !578, file: !50, line: 171, baseType: !54, size: 64, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !578, file: !50, line: 172, baseType: !97, size: 64, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !578, file: !50, line: 173, baseType: !97, size: 64, offset: 640)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !578, file: !50, line: 174, baseType: !97, size: 64, offset: 704)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !578, file: !50, line: 176, baseType: !54, size: 64, offset: 768)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !578, file: !50, line: 177, baseType: !97, size: 64, offset: 832)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !578, file: !50, line: 178, baseType: !97, size: 64, offset: 896)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !578, file: !50, line: 180, baseType: !690, size: 64, offset: 960)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !692, line: 31, baseType: !693)
!692 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "084646d0d3ecf791b89c14281fd46376")
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !692, line: 37, size: 704, elements: !694)
!694 = !{!695, !696, !706, !711, !712, !713}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !693, file: !692, line: 38, baseType: !47, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !693, file: !692, line: 39, baseType: !697, size: 384, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !698, line: 22, baseType: !699)
!698 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf27d4781f3b25ce5eb9a764f55ea2d4")
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 16, size: 384, elements: !700)
!700 = !{!701, !702, !703, !704, !705}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !699, file: !698, line: 17, baseType: !41, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !699, file: !698, line: 18, baseType: !92, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !699, file: !698, line: 19, baseType: !158, size: 128, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !699, file: !698, line: 20, baseType: !205, size: 64, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !699, file: !698, line: 21, baseType: !54, size: 64, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !693, file: !692, line: 40, baseType: !707, size: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !692, line: 33, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!282, !690, !47}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !693, file: !692, line: 41, baseType: !47, size: 64, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !693, file: !692, line: 42, baseType: !47, size: 64, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !693, file: !692, line: 43, baseType: !54, size: 64, offset: 640)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !578, file: !50, line: 182, baseType: !54, size: 64, offset: 1024)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !547, file: !50, line: 96, baseType: !716, size: 64, offset: 3648)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !50, line: 62, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 39, size: 960, elements: !719)
!719 = !{!720, !721, !722, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !718, file: !50, line: 40, baseType: !335, size: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !718, file: !50, line: 41, baseType: !346, size: 128, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !718, file: !50, line: 43, baseType: !723, size: 64, offset: 448)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64, elements: !15)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !718, file: !50, line: 46, baseType: !72, size: 20, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !718, file: !50, line: 47, baseType: !72, size: 10, offset: 532, flags: DIFlagBitField, extraData: i64 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !718, file: !50, line: 48, baseType: !72, size: 10, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !718, file: !50, line: 49, baseType: !72, size: 10, offset: 554, flags: DIFlagBitField, extraData: i64 544)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !718, file: !50, line: 50, baseType: !72, size: 1, offset: 564, flags: DIFlagBitField, extraData: i64 544)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !718, file: !50, line: 51, baseType: !72, size: 1, offset: 565, flags: DIFlagBitField, extraData: i64 544)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !718, file: !50, line: 52, baseType: !72, size: 1, offset: 566, flags: DIFlagBitField, extraData: i64 544)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !718, file: !50, line: 53, baseType: !72, size: 1, offset: 567, flags: DIFlagBitField, extraData: i64 544)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !718, file: !50, line: 56, baseType: !555, size: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !718, file: !50, line: 57, baseType: !60, size: 64, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !718, file: !50, line: 58, baseType: !60, size: 64, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !718, file: !50, line: 59, baseType: !92, size: 64, offset: 768)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !718, file: !50, line: 60, baseType: !141, size: 64, offset: 832)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !718, file: !50, line: 61, baseType: !97, size: 64, offset: 896)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !547, file: !50, line: 102, baseType: !97, size: 64, offset: 3712)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !547, file: !50, line: 103, baseType: !97, size: 64, offset: 3776)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !547, file: !50, line: 104, baseType: !97, size: 64, offset: 3840)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !547, file: !50, line: 105, baseType: !97, size: 64, offset: 3904)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !547, file: !50, line: 107, baseType: !300, size: 768, offset: 3968)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !547, file: !50, line: 109, baseType: !72, size: 1, offset: 4736, flags: DIFlagBitField, extraData: i64 4736)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !547, file: !50, line: 110, baseType: !72, size: 1, offset: 4737, flags: DIFlagBitField, extraData: i64 4736)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !547, file: !50, line: 112, baseType: !72, size: 1, offset: 4738, flags: DIFlagBitField, extraData: i64 4736)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !547, file: !50, line: 113, baseType: !72, size: 1, offset: 4739, flags: DIFlagBitField, extraData: i64 4736)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !547, file: !50, line: 114, baseType: !72, size: 1, offset: 4740, flags: DIFlagBitField, extraData: i64 4736)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !547, file: !50, line: 115, baseType: !72, size: 1, offset: 4741, flags: DIFlagBitField, extraData: i64 4736)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !547, file: !50, line: 116, baseType: !72, size: 1, offset: 4742, flags: DIFlagBitField, extraData: i64 4736)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !547, file: !50, line: 117, baseType: !72, size: 1, offset: 4743, flags: DIFlagBitField, extraData: i64 4736)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !547, file: !50, line: 118, baseType: !72, size: 1, offset: 4744, flags: DIFlagBitField, extraData: i64 4736)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !547, file: !50, line: 119, baseType: !72, size: 1, offset: 4745, flags: DIFlagBitField, extraData: i64 4736)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !547, file: !50, line: 121, baseType: !72, size: 1, offset: 4746, flags: DIFlagBitField, extraData: i64 4736)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !547, file: !50, line: 122, baseType: !72, size: 1, offset: 4747, flags: DIFlagBitField, extraData: i64 4736)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !528, file: !529, line: 388, baseType: !756, size: 64, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !288, line: 17, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !759, line: 319, size: 8960, elements: !760)
!759 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c0fceda7aff0a351f062ef07edbc2de2")
!760 = !{!761, !766, !767, !816, !895, !896, !918, !927, !1205, !1206, !1207, !1208, !1209, !1210, !1250, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1429, !1433, !1434, !1438, !1439, !1440, !1441, !1442, !1446, !1450, !1454, !1455, !1469, !1470, !1471, !1472, !1473, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !758, file: !759, line: 320, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !759, line: 315, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !526, !756}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !758, file: !759, line: 321, baseType: !762, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !758, file: !759, line: 323, baseType: !768, size: 1024, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !769, line: 22, baseType: !770)
!769 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ac5aedde14d2cb26bc31b0019c79e36b")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !769, line: 36, size: 1024, elements: !771)
!771 = !{!772, !773, !774, !775, !777, !778, !779, !785, !790, !792, !793, !795, !800, !809, !810, !811, !812, !813, !814, !815}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !770, file: !769, line: 37, baseType: !292, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !770, file: !769, line: 39, baseType: !382, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !770, file: !769, line: 40, baseType: !394, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !770, file: !769, line: 41, baseType: !776, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !770, file: !769, line: 43, baseType: !54, size: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !770, file: !769, line: 44, baseType: !97, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !770, file: !769, line: 46, baseType: !780, size: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !769, line: 24, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!282, !784, !47}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !770, file: !769, line: 47, baseType: !786, size: 64, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !769, line: 26, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !784, !47, !54}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !770, file: !769, line: 48, baseType: !791, size: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !769, line: 28, baseType: !787)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !770, file: !769, line: 49, baseType: !47, size: 64, offset: 576)
