; ModuleID = 'samples/737.bc'
source_filename = "sparse_matrix_utils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.double_matrix_t = type { i64, i64, ptr }
%struct.sparse_matrix_t = type { i32, i32, ptr, ptr, ptr }
%struct.uint32_array = type { i64, i64, ptr }
%struct.kh_int_uint32_t = type { i32, i32, i32, i32, ptr, ptr, ptr }
%struct.kh_int_set_t = type { i32, i32, i32, i32, ptr, ptr, ptr }

; Function Attrs: nounwind uwtable
define dso_local ptr @sparse_matrix_new_from_matrix(ptr noundef %matrix) #0 !dbg !40 {
entry:
  %matrix.addr = alloca ptr, align 8
  %sparse = alloca ptr, align 8
  %i = alloca i64, align 8
  %cleanup.dest.slot = alloca i32, align 4
  %j = alloca i64, align 8
  %value = alloca double, align 8
  store ptr %matrix, ptr %matrix.addr, align 8, !tbaa !91
  tail call void @llvm.dbg.declare(metadata ptr %matrix.addr, metadata !80, metadata !DIExpression()), !dbg !95
  call void @llvm.lifetime.start.p0(i64 8, ptr %sparse) #10, !dbg !96
  tail call void @llvm.dbg.declare(metadata ptr %sparse, metadata !81, metadata !DIExpression()), !dbg !97
  %0 = load ptr, ptr %matrix.addr, align 8, !dbg !98, !tbaa !91
  %m = getelementptr inbounds %struct.double_matrix_t, ptr %0, i32 0, i32 0, !dbg !99
  %1 = load i64, ptr %m, align 8, !dbg !99, !tbaa !100
  %2 = load ptr, ptr %matrix.addr, align 8, !dbg !103, !tbaa !91

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, globals: !28, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "sparse_matrix_utils.c", directory: "/local-ssd/libpostal-ynvflsfumrraceljqaz5ddb4gjwgve42-build/aidengro/spack-stage-libpostal-1.1-ynvflsfumrraceljqaz5ddb4gjwgve42/spack-src/src", checksumkind: CSK_MD5, checksum: "f72b1a242f60699f56d3a399cb0b1edb")
!2 = !{!3, !8, !10, !11, !12, !13, !14}
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !4, line: 26, baseType: !5)
!4 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !6, line: 42, baseType: !7)
!6 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !9, line: 126, baseType: !10)
!9 = !DIFile(filename: "./klib/khash.h", directory: "/local-ssd/libpostal-ynvflsfumrraceljqaz5ddb4gjwgve42-build/aidengro/spack-stage-libpostal-1.1-ynvflsfumrraceljqaz5ddb4gjwgve42/spack-src/src", checksumkind: CSK_MD5, checksum: "a08c5bfc047e663a6c069980bdbb6dd8")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !9, line: 103, baseType: !7)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_int_set_t", file: !16, line: 37, baseType: !17)
!16 = !DIFile(filename: "./collections.h", directory: "/local-ssd/libpostal-ynvflsfumrraceljqaz5ddb4gjwgve42-build/aidengro/spack-stage-libpostal-1.1-ynvflsfumrraceljqaz5ddb4gjwgve42/spack-src/src", checksumkind: CSK_MD5, checksum: "be7bcb6b300ff5896c58c67efa7d2993")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 37, size: 320, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !17, file: !16, line: 37, baseType: !8, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !16, line: 37, baseType: !8, size: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !17, file: !16, line: 37, baseType: !8, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !17, file: !16, line: 37, baseType: !8, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !16, line: 37, baseType: !11, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !17, file: !16, line: 37, baseType: !11, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !17, file: !16, line: 37, baseType: !26, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !{!29}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression(DW_OP_constu, 4605110762971426980, DW_OP_stack_value))
!30 = distinct !DIGlobalVariable(name: "__ac_HASH_UPPER", scope: !0, file: !9, line: 156, type: !31, isLocal: true, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!33 = !{i32 7, !"Dwarf Version", i32 5}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{i32 1, !"wchar_size", i32 4}
!36 = !{i32 8, !"PIC Level", i32 2}
!37 = !{i32 7, !"PIE Level", i32 2}
!38 = !{i32 7, !"uwtable", i32 2}
!39 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!40 = distinct !DISubprogram(name: "sparse_matrix_new_from_matrix", scope: !1, file: !1, line: 6, type: !41, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !79)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !71}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "sparse_matrix_t", file: !45, line: 55, baseType: !46)
!45 = !DIFile(filename: "./sparse_matrix.h", directory: "/local-ssd/libpostal-ynvflsfumrraceljqaz5ddb4gjwgve42-build/aidengro/spack-stage-libpostal-1.1-ynvflsfumrraceljqaz5ddb4gjwgve42/spack-src/src", checksumkind: CSK_MD5, checksum: "8fc87a69d693f4a70dbdd81f79584fe9")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 49, size: 256, elements: !47)
!47 = !{!48, !49, !50, !61, !62}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !46, file: !45, line: 50, baseType: !3, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !46, file: !45, line: 51, baseType: !3, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "indptr", scope: !46, file: !45, line: 52, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_array", file: !16, line: 44, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 44, size: 192, elements: !54)
!54 = !{!55, !59, !60}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !53, file: !16, line: 44, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !57, line: 70, baseType: !58)
!57 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!58 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !53, file: !16, line: 44, baseType: !56, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !53, file: !16, line: 44, baseType: !13, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !46, file: !45, line: 53, baseType: !51, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !45, line: 54, baseType: !63, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_array", file: !16, line: 48, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 48, size: 192, elements: !66)
!66 = !{!67, !68, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !65, file: !16, line: 48, baseType: !56, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !65, file: !16, line: 48, baseType: !56, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !65, file: !16, line: 48, baseType: !70, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_matrix_t", file: !73, line: 445, baseType: !74)
!73 = !DIFile(filename: "./matrix.h", directory: "/local-ssd/libpostal-ynvflsfumrraceljqaz5ddb4gjwgve42-build/aidengro/spack-stage-libpostal-1.1-ynvflsfumrraceljqaz5ddb4gjwgve42/spack-src/src", checksumkind: CSK_MD5, checksum: "4542bc027f82c0fc701d31ecb50748db")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 445, size: 192, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !74, file: !73, line: 445, baseType: !56, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !74, file: !73, line: 445, baseType: !56, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !74, file: !73, line: 445, baseType: !70, size: 64, offset: 128)
!79 = !{!80, !81, !82, !84, !88}
!80 = !DILocalVariable(name: "matrix", arg: 1, scope: !40, file: !1, line: 6, type: !71)
!81 = !DILocalVariable(name: "sparse", scope: !40, file: !1, line: 7, type: !43)
!82 = !DILocalVariable(name: "i", scope: !83, file: !1, line: 9, type: !56)
!83 = distinct !DILexicalBlock(scope: !40, file: !1, line: 9, column: 5)
!84 = !DILocalVariable(name: "j", scope: !85, file: !1, line: 10, type: !56)
!85 = distinct !DILexicalBlock(scope: !86, file: !1, line: 10, column: 9)
!86 = distinct !DILexicalBlock(scope: !87, file: !1, line: 9, column: 44)
!87 = distinct !DILexicalBlock(scope: !83, file: !1, line: 9, column: 5)
!88 = !DILocalVariable(name: "value", scope: !89, file: !1, line: 11, type: !32)
!89 = distinct !DILexicalBlock(scope: !90, file: !1, line: 10, column: 48)
!90 = distinct !DILexicalBlock(scope: !85, file: !1, line: 10, column: 9)
!91 = !{!92, !92, i64 0}
!92 = !{!"any pointer", !93, i64 0}
!93 = !{!"omnipotent char", !94, i64 0}
!94 = !{!"Simple C/C++ TBAA"}
!95 = !DILocation(line: 6, column: 65, scope: !40)
!96 = !DILocation(line: 7, column: 5, scope: !40)
!97 = !DILocation(line: 7, column: 22, scope: !40)
!98 = !DILocation(line: 7, column: 55, scope: !40)
!99 = !DILocation(line: 7, column: 63, scope: !40)
!100 = !{!101, !102, i64 0}
!101 = !{!"", !102, i64 0, !102, i64 8, !92, i64 16}
!102 = !{!"long", !93, i64 0}
!103 = !DILocation(line: 7, column: 66, scope: !40)
!104 = !DILocation(line: 7, column: 74, scope: !40)
!105 = !{!101, !102, i64 8}
!106 = !DILocation(line: 7, column: 31, scope: !40)
!107 = !DILocation(line: 9, column: 10, scope: !83)
!108 = !DILocation(line: 9, column: 17, scope: !83)
!109 = !{!102, !102, i64 0}
!110 = !DILocation(line: 9, column: 24, scope: !87)
!111 = !DILocation(line: 9, column: 28, scope: !87)
!112 = !DILocation(line: 9, column: 36, scope: !87)
!113 = !DILocation(line: 9, column: 26, scope: !87)
!114 = !DILocation(line: 9, column: 5, scope: !83)
!115 = !DILocation(line: 9, column: 5, scope: !87)
!116 = !DILocation(line: 10, column: 14, scope: !85)
!117 = !DILocation(line: 10, column: 21, scope: !85)
!118 = !DILocation(line: 10, column: 28, scope: !90)
!119 = !DILocation(line: 10, column: 32, scope: !90)
!120 = !DILocation(line: 10, column: 40, scope: !90)
!121 = !DILocation(line: 10, column: 30, scope: !90)
!122 = !DILocation(line: 10, column: 9, scope: !85)
!123 = !DILocation(line: 10, column: 9, scope: !90)
!124 = !DILocation(line: 11, column: 13, scope: !89)
!125 = !DILocation(line: 11, column: 20, scope: !89)
!126 = !DILocation(line: 11, column: 46, scope: !89)
!127 = !DILocation(line: 11, column: 54, scope: !89)
!128 = !DILocation(line: 11, column: 57, scope: !89)
!129 = !DILocation(line: 11, column: 28, scope: !89)
!130 = !{!131, !131, i64 0}
!131 = !{!"double", !93, i64 0}
!132 = !DILocation(line: 12, column: 32, scope: !133)
!133 = distinct !DILexicalBlock(scope: !89, file: !1, line: 12, column: 17)
!134 = !DILocation(line: 12, column: 18, scope: !133)
!135 = !DILocation(line: 12, column: 17, scope: !89)
!136 = !DILocation(line: 13, column: 38, scope: !137)
!137 = distinct !DILexicalBlock(scope: !133, file: !1, line: 12, column: 45)
!138 = !DILocation(line: 13, column: 46, scope: !137)
!139 = !DILocation(line: 13, column: 49, scope: !137)
!140 = !DILocation(line: 13, column: 17, scope: !137)
!141 = !DILocation(line: 14, column: 13, scope: !137)
!142 = !DILocation(line: 15, column: 9, scope: !90)
!143 = !DILocation(line: 15, column: 9, scope: !89)
!144 = !DILocation(line: 10, column: 44, scope: !90)
!145 = distinct !{!145, !122, !146, !147}
!146 = !DILocation(line: 15, column: 9, scope: !85)
!147 = !{!"llvm.loop.mustprogress"}
!148 = !DILocation(line: 16, column: 36, scope: !86)
!149 = !DILocation(line: 16, column: 9, scope: !86)
!150 = !DILocation(line: 17, column: 5, scope: !86)
!151 = !DILocation(line: 9, column: 40, scope: !87)
!152 = distinct !{!152, !114, !153, !147}
!153 = !DILocation(line: 17, column: 5, scope: !83)
!154 = !DILocation(line: 18, column: 12, scope: !40)
!155 = !DILocation(line: 19, column: 1, scope: !40)
!156 = !DILocation(line: 18, column: 5, scope: !40)
!157 = !DISubprogram(name: "sparse_matrix_new_shape", scope: !45, file: !45, line: 59, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{!43, !56, !56}
!160 = distinct !DISubprogram(name: "double_matrix_get", scope: !73, file: !73, line: 445, type: !161, scopeLine: 445, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !163)
!161 = !DISubroutineType(types: !162)
!162 = !{!32, !71, !56, !56}
!163 = !{!164, !165, !166, !167}
!164 = !DILocalVariable(name: "self", arg: 1, scope: !160, file: !73, line: 445, type: !71)
!165 = !DILocalVariable(name: "row_index", arg: 2, scope: !160, file: !73, line: 445, type: !56)
!166 = !DILocalVariable(name: "col_index", arg: 3, scope: !160, file: !73, line: 445, type: !56)
!167 = !DILocalVariable(name: "index", scope: !160, file: !73, line: 445, type: !56)
!168 = !DILocation(line: 445, column: 1, scope: !160)
!169 = !{!101, !92, i64 16}
!170 = !DISubprogram(name: "double_equals", scope: !171, file: !171, line: 13, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!171 = !DIFile(filename: "./float_utils.h", directory: "/local-ssd/libpostal-ynvflsfumrraceljqaz5ddb4gjwgve42-build/aidengro/spack-stage-libpostal-1.1-ynvflsfumrraceljqaz5ddb4gjwgve42/spack-src/src", checksumkind: CSK_MD5, checksum: "1ebd4673f25917332dff04f6c1540126")
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !32, !32}
!174 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!175 = !DISubprogram(name: "sparse_matrix_append", scope: !45, file: !45, line: 64, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !43, !3, !32}
!178 = !DISubprogram(name: "sparse_matrix_finalize_row", scope: !45, file: !45, line: 67, type: !179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !43}
!181 = distinct !DISubprogram(name: "sparse_matrix_add_unique_columns", scope: !1, file: !1, line: 22, type: !182, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !195)
!182 = !DISubroutineType(types: !183)
!183 = !{!174, !43, !184, !51}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_int_uint32_t", file: !16, line: 20, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 20, size: 320, elements: !187)
!187 = !{!188, !189, !190, !191, !192, !193, !194}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !186, file: !16, line: 20, baseType: !8, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !186, file: !16, line: 20, baseType: !8, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !186, file: !16, line: 20, baseType: !8, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !186, file: !16, line: 20, baseType: !8, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !186, file: !16, line: 20, baseType: !11, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !186, file: !16, line: 20, baseType: !11, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !186, file: !16, line: 20, baseType: !13, size: 64, offset: 256)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !204, !208, !210, !213, !214, !215, !216}
!196 = !DILocalVariable(name: "matrix", arg: 1, scope: !181, file: !1, line: 22, type: !43)
!197 = !DILocalVariable(name: "unique_columns", arg: 2, scope: !181, file: !1, line: 22, type: !184)
!198 = !DILocalVariable(name: "array", arg: 3, scope: !181, file: !1, line: 22, type: !51)
!199 = !DILocalVariable(name: "n", scope: !181, file: !1, line: 23, type: !56)
!200 = !DILocalVariable(name: "indices", scope: !181, file: !1, line: 24, type: !13)
!201 = !DILocalVariable(name: "i", scope: !181, file: !1, line: 28, type: !56)
!202 = !DILocalVariable(name: "k", scope: !181, file: !1, line: 29, type: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "khiter_t", file: !9, line: 127, baseType: !8)
!204 = !DILocalVariable(name: "col", scope: !205, file: !1, line: 32, type: !3)
!205 = distinct !DILexicalBlock(scope: !206, file: !1, line: 31, column: 29)
!206 = distinct !DILexicalBlock(scope: !207, file: !1, line: 31, column: 5)
!207 = distinct !DILexicalBlock(scope: !181, file: !1, line: 31, column: 5)
!208 = !DILocalVariable(name: "ret", scope: !205, file: !1, line: 34, type: !209)
!209 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!210 = !DILocalVariable(name: "next_id", scope: !211, file: !1, line: 37, type: !3)
!211 = distinct !DILexicalBlock(scope: !212, file: !1, line: 36, column: 42)
!212 = distinct !DILexicalBlock(scope: !205, file: !1, line: 36, column: 13)
!213 = !DILocalVariable(name: "key", scope: !181, file: !1, line: 53, type: !8)
!214 = !DILocalVariable(name: "batch", scope: !181, file: !1, line: 55, type: !13)
!215 = !DILocalVariable(name: "col_id", scope: !181, file: !1, line: 56, type: !3)
!216 = !DILocalVariable(name: "__i", scope: !217, file: !1, line: 58, type: !8)
!217 = distinct !DILexicalBlock(scope: !181, file: !1, line: 58, column: 5)
!218 = !DILocation(line: 22, column: 56, scope: !181)
!219 = !DILocation(line: 22, column: 85, scope: !181)
!220 = !DILocation(line: 22, column: 115, scope: !181)
!221 = !DILocation(line: 23, column: 5, scope: !181)
!222 = !DILocation(line: 23, column: 12, scope: !181)
!223 = !DILocation(line: 23, column: 16, scope: !181)
!224 = !DILocation(line: 23, column: 24, scope: !181)
!225 = !{!226, !92, i64 16}
!226 = !{!"", !227, i64 0, !227, i64 4, !92, i64 8, !92, i64 16, !92, i64 24}
!227 = !{!"int", !93, i64 0}
!228 = !DILocation(line: 23, column: 33, scope: !181)
!229 = !DILocation(line: 24, column: 5, scope: !181)
!230 = !DILocation(line: 24, column: 15, scope: !181)
!231 = !DILocation(line: 24, column: 25, scope: !181)
!232 = !DILocation(line: 24, column: 33, scope: !181)
!233 = !DILocation(line: 24, column: 42, scope: !181)
!234 = !DILocation(line: 26, column: 5, scope: !181)
!235 = !DILocation(line: 28, column: 5, scope: !181)
!236 = !DILocation(line: 28, column: 12, scope: !181)
!237 = !DILocation(line: 29, column: 5, scope: !181)
!238 = !DILocation(line: 29, column: 14, scope: !181)
!239 = !DILocation(line: 31, column: 12, scope: !207)
!240 = !DILocation(line: 31, column: 10, scope: !207)
!241 = !DILocation(line: 31, column: 17, scope: !206)
!242 = !DILocation(line: 31, column: 21, scope: !206)
!243 = !DILocation(line: 31, column: 19, scope: !206)
!244 = !DILocation(line: 31, column: 5, scope: !207)
!245 = !DILocation(line: 32, column: 9, scope: !205)
!246 = !DILocation(line: 32, column: 18, scope: !205)
!247 = !DILocation(line: 32, column: 24, scope: !205)
!248 = !DILocation(line: 32, column: 32, scope: !205)
!249 = !{!227, !227, i64 0}
!250 = !DILocation(line: 34, column: 9, scope: !205)
!251 = !DILocation(line: 34, column: 13, scope: !205)
!252 = !DILocation(line: 35, column: 13, scope: !205)
!253 = !DILocation(line: 35, column: 11, scope: !205)
!254 = !DILocation(line: 36, column: 13, scope: !212)
!255 = !DILocation(line: 36, column: 18, scope: !212)
