; ModuleID = 'samples/749.bc'
source_filename = "controlconf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.isc_logcategory = type { ptr, i32 }
%struct.in6_addr = type { %union.anon.4 }
%union.anon.4 = type { [4 x i32] }
%struct.cfg_type = type opaque
%struct.named_controls = type { ptr, %struct.controllistenerlist_t, i8, ptr }
%struct.controllistenerlist_t = type { ptr, ptr }
%struct.controllistener = type { ptr, ptr, ptr, %struct.isc_sockaddr, ptr, ptr, i8, i8, %struct.controlkeylist_t, %struct.controlconnectionlist_t, i32, i32, i32, i32, i8, %struct.anon.6 }
%struct.isc_sockaddr = type { %union.anon, i32, %struct.anon.5 }
%union.anon = type { %struct.sockaddr_storage }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct.anon.5 = type { ptr, ptr }
%struct.controlkeylist_t = type { ptr, ptr }
%struct.controlconnectionlist_t = type { ptr, ptr }
%struct.anon.6 = type { ptr, ptr }
%struct.in_addr = type { i32 }
%struct.isc_logmodule = type { ptr, i32 }
%struct.named_server = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8, ptr, i8, ptr, ptr, ptr, %struct.dns_viewlist_t, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, %union.pthread_mutex_t, ptr, i8, i8, %struct.named_cachelist_t, ptr, ptr, ptr, ptr, i32, %struct.named_dispatchlist_t, %struct.named_statschannellist_t, ptr, ptr, ptr, i32, i16, i8, [32 x i8], i32, ptr, ptr }

!298 = !DIEnumerator(name: "isc_fuzz_client", value: 1)
!299 = !DIEnumerator(name: "isc_fuzz_tcpclient", value: 2)
!300 = !DIEnumerator(name: "isc_fuzz_resolver", value: 3)
!301 = !DIEnumerator(name: "isc_fuzz_http", value: 4)
!302 = !DIEnumerator(name: "isc_fuzz_rndc", value: 5)
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !304, line: 213, baseType: !279, size: 32, elements: !305)
!304 = !DIFile(filename: "lib/dns/include/dns/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "f35a187441d60b1b4301c816339e75b0")
!305 = !{!306, !307, !308, !309}
!306 = !DIEnumerator(name: "dns_masterformat_none", value: 0)
!307 = !DIEnumerator(name: "dns_masterformat_text", value: 1)
!308 = !DIEnumerator(name: "dns_masterformat_raw", value: 2)
!309 = !DIEnumerator(name: "dns_masterformat_map", value: 3)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !304, line: 164, baseType: !279, size: 32, elements: !311)
!311 = !{!312}
!312 = !DIEnumerator(name: "dns_hash_sha1", value: 1)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 242, baseType: !279, size: 32, elements: !315)
!314 = !DIFile(filename: "lib/isc/include/isc/socket.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "839d8202853f11cf2eee5c6ae0e29df0")
!315 = !{!316, !317, !318, !319}
!316 = !DIEnumerator(name: "isc_sockettype_udp", value: 1)
!317 = !DIEnumerator(name: "isc_sockettype_tcp", value: 2)
!318 = !DIEnumerator(name: "isc_sockettype_unix", value: 3)
!319 = !DIEnumerator(name: "isc_sockettype_raw", value: 4)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 25, baseType: !279, size: 32, elements: !322)
!321 = !DIFile(filename: "lib/isc/include/isc/assertions.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "d437064b1a440cf5712e89d244b6208d")
!322 = !{!323, !324, !325, !326}
!323 = !DIEnumerator(name: "isc_assertiontype_require", value: 0)
!324 = !DIEnumerator(name: "isc_assertiontype_ensure", value: 1)
!325 = !DIEnumerator(name: "isc_assertiontype_insist", value: 2)
!326 = !DIEnumerator(name: "isc_assertiontype_invariant", value: 3)
!327 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 85, baseType: !279, size: 32, elements: !328)
!328 = !{!329}
!329 = !DIEnumerator(name: "ISC_SOCKET_REUSEADDRESS", value: 1)
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !331, line: 83, baseType: !332, size: 32, elements: !333)
!331 = !DIFile(filename: "lib/isc/include/isc/timer.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "fb32aeeb353e38cff055b720a3f7e611")
!332 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!333 = !{!334, !335, !336, !337, !338}
!334 = !DIEnumerator(name: "isc_timertype_undefined", value: -1)
!335 = !DIEnumerator(name: "isc_timertype_ticker", value: 0)
!336 = !DIEnumerator(name: "isc_timertype_once", value: 1)
!337 = !DIEnumerator(name: "isc_timertype_limited", value: 2)
!338 = !DIEnumerator(name: "isc_timertype_inactive", value: 3)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 184, baseType: !279, size: 32, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348}
!341 = !DIEnumerator(name: "ISC_SOCKEVENTATTR_ATTACHED", value: 268435456)
!342 = !DIEnumerator(name: "ISC_SOCKEVENTATTR_TRUNC", value: 8388608)
!343 = !DIEnumerator(name: "ISC_SOCKEVENTATTR_CTRUNC", value: 4194304)
!344 = !DIEnumerator(name: "ISC_SOCKEVENTATTR_TIMESTAMP", value: 2097152)
!345 = !DIEnumerator(name: "ISC_SOCKEVENTATTR_PKTINFO", value: 1048576)
!346 = !DIEnumerator(name: "ISC_SOCKEVENTATTR_MULTICAST", value: 524288)
!347 = !DIEnumerator(name: "ISC_SOCKEVENTATTR_DSCP", value: 262144)
!348 = !DIEnumerator(name: "ISC_SOCKEVENTATTR_USEMINMTU", value: 131072)
!349 = !{!350, !351, !357, !511, !279, !512, !462, !513, !422}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !352, line: 30, baseType: !353)
!352 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !354, line: 26, baseType: !355)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !356, line: 42, baseType: !279)
!356 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_socket_newconnev_t", file: !314, line: 216, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_socket_newconnev", file: !314, line: 217, size: 2176, elements: !360)
!360 = !{!361, !365, !366, !367, !370, !407, !408, !409, !410, !411, !416, !421, !428, !430}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ev_size", scope: !359, file: !314, line: 218, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !363, line: 70, baseType: !364)
!363 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!364 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ev_attributes", scope: !359, file: !314, line: 218, baseType: !279, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ev_tag", scope: !359, file: !314, line: 218, baseType: !350, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ev_type", scope: !359, file: !314, line: 218, baseType: !368, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_eventtype_t", file: !369, line: 43, baseType: !279)
!369 = !DIFile(filename: "lib/isc/include/isc/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "6a355582c4f962c465b18bab43b68c96")
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ev_action", scope: !359, file: !314, line: 218, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_taskaction_t", file: !369, line: 85, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375, !378}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_task_t", file: !369, line: 77, baseType: !377)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_task", file: !369, line: 77, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_event_t", file: !369, line: 41, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_event", file: !381, line: 75, size: 832, elements: !382)
!381 = !DIFile(filename: "lib/isc/include/isc/event.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "d58366ca324676a5c39720df6fa77dae")
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !395, !396, !402}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ev_size", scope: !380, file: !381, line: 76, baseType: !362, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ev_attributes", scope: !380, file: !381, line: 76, baseType: !279, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ev_tag", scope: !380, file: !381, line: 76, baseType: !350, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ev_type", scope: !380, file: !381, line: 76, baseType: !368, size: 32, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ev_action", scope: !380, file: !381, line: 76, baseType: !371, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ev_arg", scope: !380, file: !381, line: 76, baseType: !350, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ev_sender", scope: !380, file: !381, line: 76, baseType: !350, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ev_destroy", scope: !380, file: !381, line: 76, baseType: !391, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_eventdestructor_t", file: !381, line: 25, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !378}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ev_destroy_arg", scope: !380, file: !381, line: 76, baseType: !350, size: 64, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ev_link", scope: !380, file: !381, line: 76, baseType: !397, size: 128, offset: 576)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !381, line: 76, size: 128, elements: !398)
!398 = !{!399, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !397, file: !381, line: 76, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !381, line: 76, baseType: !400, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ratelink", scope: !380, file: !381, line: 76, baseType: !403, size: 128, offset: 704)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !381, line: 76, size: 128, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !403, file: !381, line: 76, baseType: !400, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !403, file: !381, line: 76, baseType: !400, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ev_arg", scope: !359, file: !314, line: 218, baseType: !350, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ev_sender", scope: !359, file: !314, line: 218, baseType: !350, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ev_destroy", scope: !359, file: !314, line: 218, baseType: !391, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ev_destroy_arg", scope: !359, file: !314, line: 218, baseType: !350, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ev_link", scope: !359, file: !314, line: 218, baseType: !412, size: 128, offset: 576)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !314, line: 218, size: 128, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !412, file: !314, line: 218, baseType: !357, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !314, line: 218, baseType: !357, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ratelink", scope: !359, file: !314, line: 218, baseType: !417, size: 128, offset: 704)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !314, line: 218, size: 128, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !314, line: 218, baseType: !357, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !314, line: 218, baseType: !357, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "newsocket", scope: !359, file: !314, line: 219, baseType: !422, size: 64, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_socket_t", file: !369, line: 71, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_socket", file: !314, line: 306, size: 64, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !424, file: !314, line: 307, baseType: !279, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !424, file: !314, line: 308, baseType: !279, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !359, file: !314, line: 220, baseType: !429, size: 32, offset: 896)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_result_t", file: !369, line: 67, baseType: !279)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !359, file: !314, line: 221, baseType: !431, size: 1216, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_sockaddr_t", file: !369, line: 69, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_sockaddr", file: !433, line: 27, size: 1216, elements: !434)
!433 = !DIFile(filename: "lib/isc/include/isc/sockaddr.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "b46a0f057942d922d0824c5621821d46")
!434 = !{!435, !504, !505}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !433, line: 36, baseType: !436, size: 1024)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !432, file: !433, line: 28, size: 1024, elements: !437)
!437 = !{!438, !448, !463, !486, !495}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !436, file: !433, line: 29, baseType: !439, size: 128)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !440, line: 180, size: 128, elements: !441)
!440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!441 = !{!442, !446}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !439, file: !440, line: 182, baseType: !443, size: 16)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !444, line: 28, baseType: !445)
!444 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!445 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !439, file: !440, line: 183, baseType: !447, size: 112, offset: 16)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 112, elements: !26)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !436, file: !433, line: 30, baseType: !449, size: 128)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !352, line: 245, size: 128, elements: !450)
!450 = !{!451, !452, !456, !460}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !449, file: !352, line: 247, baseType: !443, size: 16)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !449, file: !352, line: 248, baseType: !453, size: 16, offset: 16)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !352, line: 123, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !354, line: 25, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !356, line: 40, baseType: !445)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !449, file: !352, line: 249, baseType: !457, size: 32, offset: 32)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !352, line: 31, size: 32, elements: !458)
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !457, file: !352, line: 33, baseType: !351, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !449, file: !352, line: 252, baseType: !461, size: 64, offset: 64)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 64, elements: !16)
!462 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !436, file: !433, line: 31, baseType: !464, size: 224)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !352, line: 260, size: 224, elements: !465)
!465 = !{!466, !467, !468, !469, !485}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !464, file: !352, line: 262, baseType: !443, size: 16)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !464, file: !352, line: 263, baseType: !453, size: 16, offset: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !464, file: !352, line: 264, baseType: !353, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !464, file: !352, line: 265, baseType: !470, size: 128, offset: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !352, line: 219, size: 128, elements: !471)
!471 = !{!472}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !470, file: !352, line: 226, baseType: !473, size: 128)
!473 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !470, file: !352, line: 221, size: 128, elements: !474)
!474 = !{!475, !481, !483}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !473, file: !352, line: 223, baseType: !476, size: 128)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 128, elements: !479)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !354, line: 24, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !356, line: 38, baseType: !462)
!479 = !{!480}
!480 = !DISubrange(count: 16)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !473, file: !352, line: 224, baseType: !482, size: 128)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 128, elements: !16)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !473, file: !352, line: 225, baseType: !484, size: 128)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 128, elements: !159)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !464, file: !352, line: 266, baseType: !353, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !436, file: !433, line: 32, baseType: !487, size: 1024)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !440, line: 193, size: 1024, elements: !488)
!488 = !{!489, !490, !494}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !487, file: !440, line: 195, baseType: !443, size: 16)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !487, file: !440, line: 196, baseType: !491, size: 944, offset: 16)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 944, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 118)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !487, file: !440, line: 197, baseType: !364, size: 64, offset: 960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sunix", scope: !436, file: !433, line: 34, baseType: !496, size: 880)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !497, line: 29, size: 880, elements: !498)
!497 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !496, file: !497, line: 31, baseType: !443, size: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !496, file: !497, line: 32, baseType: !501, size: 864, offset: 16)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 864, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 108)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !432, file: !433, line: 37, baseType: !279, size: 32, offset: 1024)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !432, file: !433, line: 38, baseType: !506, size: 128, offset: 1088)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !433, line: 38, size: 128, elements: !507)
!507 = !{!508, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !506, file: !433, line: 38, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !433, line: 38, baseType: !509, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_socketevent_t", file: !369, line: 72, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_socketevent", file: !314, line: 200, size: 2688, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !531, !536, !537, !538, !539, !540, !547, !548, !555, !560, !562, !563}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ev_size", scope: !515, file: !314, line: 201, baseType: !362, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ev_attributes", scope: !515, file: !314, line: 201, baseType: !279, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ev_tag", scope: !515, file: !314, line: 201, baseType: !350, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ev_type", scope: !515, file: !314, line: 201, baseType: !368, size: 32, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ev_action", scope: !515, file: !314, line: 201, baseType: !371, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ev_arg", scope: !515, file: !314, line: 201, baseType: !350, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ev_sender", scope: !515, file: !314, line: 201, baseType: !350, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ev_destroy", scope: !515, file: !314, line: 201, baseType: !391, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ev_destroy_arg", scope: !515, file: !314, line: 201, baseType: !350, size: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ev_link", scope: !515, file: !314, line: 201, baseType: !527, size: 128, offset: 576)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !515, file: !314, line: 201, size: 128, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !527, file: !314, line: 201, baseType: !513, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !527, file: !314, line: 201, baseType: !513, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ratelink", scope: !515, file: !314, line: 201, baseType: !532, size: 128, offset: 704)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !515, file: !314, line: 201, size: 128, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !532, file: !314, line: 201, baseType: !513, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !532, file: !314, line: 201, baseType: !513, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !515, file: !314, line: 202, baseType: !429, size: 32, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !515, file: !314, line: 203, baseType: !279, size: 32, offset: 864)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !515, file: !314, line: 204, baseType: !279, size: 32, offset: 896)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !515, file: !314, line: 205, baseType: !279, size: 32, offset: 928)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !515, file: !314, line: 206, baseType: !541, size: 128, offset: 960)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_region_t", file: !369, line: 65, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_region", file: !543, line: 21, size: 128, elements: !544)
!543 = !DIFile(filename: "lib/isc/include/isc/region.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "2ed4a07dc05ddbd48f51e2dc9be9f317")
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !542, file: !543, line: 22, baseType: !511, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !542, file: !543, line: 23, baseType: !279, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !515, file: !314, line: 207, baseType: !431, size: 1216, offset: 1088)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !515, file: !314, line: 208, baseType: !549, size: 64, offset: 2304)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_time_t", file: !369, line: 81, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_time", file: !551, line: 86, size: 64, elements: !552)
!551 = !DIFile(filename: "../../lib/isc/unix/include/isc/time.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/bin/named", checksumkind: CSK_MD5, checksum: "a0595c59a7eba4194a4b687b13cdc892")
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !550, file: !551, line: 87, baseType: !279, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nanoseconds", scope: !550, file: !551, line: 88, baseType: !279, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pktinfo", scope: !515, file: !314, line: 209, baseType: !556, size: 160, offset: 2368)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_pktinfo", file: !352, line: 544, size: 160, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ipi6_addr", scope: !556, file: !352, line: 546, baseType: !470, size: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ipi6_ifindex", scope: !556, file: !352, line: 547, baseType: !279, size: 32, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !515, file: !314, line: 210, baseType: !561, size: 32, offset: 2528)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_sockeventattr_t", file: !314, line: 193, baseType: !339)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !515, file: !314, line: 212, baseType: !391, size: 64, offset: 2560)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dscp", scope: !515, file: !314, line: 213, baseType: !279, size: 32, offset: 2624)
!564 = !{!0, !8, !13, !18, !23, !28, !33, !35, !37, !39, !41, !43, !48, !53, !58, !63, !65, !67, !69, !74, !79, !81, !83, !85, !90, !95, !100, !102, !104, !106, !108, !113, !118, !123, !128, !133, !135, !137, !139, !144, !149, !154, !156, !161, !166, !171, !173, !175, !177, !179, !184, !189, !194, !199, !204, !209, !214, !216, !221, !223, !225, !230, !232, !234, !239, !241, !243, !245, !247, !249, !251, !253, !255, !257, !259, !261, !266, !271, !273}
!565 = !{i32 7, !"Dwarf Version", i32 5}
!566 = !{i32 2, !"Debug Info Version", i32 3}
!567 = !{i32 1, !"wchar_size", i32 4}
!568 = !{i32 8, !"PIC Level", i32 2}
!569 = !{i32 7, !"uwtable", i32 2}
!570 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!571 = distinct !DISubprogram(name: "named_controls_shutdown", scope: !2, file: !2, line: 685, type: !572, scopeLine: 685, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !275, retainedNodes: !1672)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "named_controls_t", file: !576, line: 24, baseType: !577)
!576 = !DIFile(filename: "./include/named/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/bin/named", checksumkind: CSK_MD5, checksum: "10261bb0a5a535c3531ce24c2fbc481e")
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_controls", file: !2, line: 107, size: 320, elements: !578)
!578 = !{!579, !1580, !1666, !1667}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !577, file: !2, line: 108, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "named_server_t", file: !576, line: 21, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_server", file: !583, line: 46, size: 3392, elements: !584)
!583 = !DIFile(filename: "./include/named/server.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/bin/named", checksumkind: CSK_MD5, checksum: "092f587cc43b48ab53d3523be40a56dc")
!584 = !{!585, !586, !626, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1159, !1163, !1169, !1173, !1488, !1495, !1496, !1497, !1498, !1499, !1500, !1532, !1533, !1534, !1535, !1544, !1545, !1546, !1547, !1548, !1549, !1558, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1579}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !582, file: !583, line: 47, baseType: !279, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !582, file: !583, line: 48, baseType: !587, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mem_t", file: !369, line: 59, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mem", file: !590, line: 191, size: 128, elements: !591)
!590 = !DIFile(filename: "lib/isc/include/isc/mem.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "587a841195795b087519b89f298822b2")
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !589, file: !590, line: 192, baseType: !279, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !589, file: !590, line: 193, baseType: !279, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !589, file: !590, line: 194, baseType: !595, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_memmethods_t", file: !590, line: 180, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_memmethods", file: !590, line: 170, size: 448, elements: !598)
!598 = !{!599, !604, !608, !613, !614, !618, !622}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "memget", scope: !597, file: !590, line: 171, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!350, !587, !362, !603, !279}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "memput", scope: !597, file: !590, line: 172, baseType: !605, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !587, !350, !362, !603, !279}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "memputanddetach", scope: !597, file: !590, line: 173, baseType: !609, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !612, !350, !362, !603, !279}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "memallocate", scope: !597, file: !590, line: 175, baseType: !600, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "memreallocate", scope: !597, file: !590, line: 176, baseType: !615, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!350, !587, !350, !362, !603, !279}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "memstrdup", scope: !597, file: !590, line: 178, baseType: !619, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!512, !587, !603, !603, !279}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "memfree", scope: !597, file: !590, line: 179, baseType: !623, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !587, !350, !603, !279}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "sctx", scope: !582, file: !583, line: 50, baseType: !627, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_server_t", file: !278, line: 26, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ns_server", file: !630, line: 75, size: 2816, elements: !631)
!630 = !DIFile(filename: "lib/ns/include/ns/server.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "084f652828816dc138a60eb3ef03eaca")
!631 = !{!632, !633, !634, !642, !644, !646, !662, !664, !672, !673, !674, !675, !676, !677, !678, !679, !680, !1080, !1081, !1082, !1083, !1084, !1088, !1089, !1094, !1096, !1101, !1124, !1128, !1132, !1133, !1134, !1138, !1139, !1140, !1141, !1142, !1143, !1144}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !629, file: !630, line: 76, baseType: !279, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !629, file: !630, line: 77, baseType: !587, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !629, file: !630, line: 79, baseType: !635, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_refcount_t", file: !636, line: 33, baseType: !637)
!636 = !DIFile(filename: "lib/isc/include/isc/refcount.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "91efe302f7658e72e20c0f8ed1bea09f")
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_uint_fast32_t", file: !638, line: 123, baseType: !639)
!638 = !DIFile(filename: "/usr/lib/clang/18/include/stdatomic.h", directory: "", checksumkind: CSK_MD5, checksum: "1c2aee2a953dfc5407753d1f439b6977")
!639 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !641, line: 74, baseType: !364)
!641 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!642 = !DIDerivedType(tag: DW_TAG_member, name: "secret", scope: !629, file: !630, line: 82, baseType: !643, size: 256, offset: 192)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 256, elements: !51)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cookiealg", scope: !629, file: !630, line: 83, baseType: !645, size: 32, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_cookiealg_t", file: !278, line: 34, baseType: !277)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "altsecrets", scope: !629, file: !630, line: 84, baseType: !647, size: 128, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_altsecretlist_t", file: !278, line: 18, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 18, size: 128, elements: !649)
!649 = !{!650, !661}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !648, file: !278, line: 18, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_altsecret_t", file: !278, line: 17, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ns_altsecret", file: !630, line: 136, size: 384, elements: !654)
!654 = !{!655, !660}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !653, file: !630, line: 137, baseType: !656, size: 128)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !653, file: !630, line: 137, size: 128, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !656, file: !630, line: 137, baseType: !651, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !656, file: !630, line: 137, baseType: !651, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "secret", scope: !653, file: !630, line: 138, baseType: !643, size: 256, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !648, file: !278, line: 18, baseType: !651, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "answercookie", scope: !629, file: !630, line: 85, baseType: !663, size: 8, offset: 640)
!663 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "recursionquota", scope: !629, file: !630, line: 88, baseType: !665, size: 192, offset: 704)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_quota_t", file: !369, line: 63, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_quota", file: !667, line: 45, size: 192, elements: !668)
!667 = !DIFile(filename: "lib/isc/include/isc/quota.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "08fac01d96524b90a5cd1eebb02bedf2")
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !666, file: !667, line: 46, baseType: !637, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !666, file: !667, line: 47, baseType: !637, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !666, file: !667, line: 48, baseType: !637, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tcpquota", scope: !629, file: !630, line: 89, baseType: !665, size: 192, offset: 896)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "xfroutquota", scope: !629, file: !630, line: 90, baseType: !665, size: 192, offset: 1088)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !629, file: !630, line: 93, baseType: !353, size: 32, offset: 1280)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !629, file: !630, line: 94, baseType: !279, size: 32, offset: 1312)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "initialtimo", scope: !629, file: !630, line: 96, baseType: !279, size: 32, offset: 1344)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "idletimo", scope: !629, file: !630, line: 97, baseType: !279, size: 32, offset: 1376)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "keepalivetimo", scope: !629, file: !630, line: 98, baseType: !279, size: 32, offset: 1408)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "advertisedtimo", scope: !629, file: !630, line: 99, baseType: !279, size: 32, offset: 1440)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "blackholeacl", scope: !629, file: !630, line: 101, baseType: !681, size: 64, offset: 1472)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_acl_t", file: !304, line: 30, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_acl", file: !286, line: 76, size: 640, elements: !684)
!684 = !{!685, !686, !687, !688, !744, !1071, !1072, !1073, !1074, !1075}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !683, file: !286, line: 77, baseType: !279, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !683, file: !286, line: 78, baseType: !587, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !683, file: !286, line: 79, baseType: !635, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "iptable", scope: !683, file: !286, line: 80, baseType: !689, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_iptable_t", file: !304, line: 92, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_iptable", file: !692, line: 24, size: 384, elements: !693)
!692 = !DIFile(filename: "lib/dns/include/dns/iptable.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "44ddbfe18541d6c9d7b36fcfec983270")
!693 = !{!694, !695, !696, !697, !739}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !691, file: !692, line: 25, baseType: !279, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !691, file: !692, line: 26, baseType: !587, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !691, file: !692, line: 27, baseType: !635, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "radix", scope: !691, file: !692, line: 28, baseType: !698, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_radix_tree_t", file: !700, line: 108, baseType: !701)
!700 = !DIFile(filename: "lib/isc/include/isc/radix.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "349efdba94ad90663f1e49de2024c1c4")
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_radix_tree", file: !700, line: 101, size: 320, elements: !702)
!702 = !{!703, !704, !705, !736, !737, !738}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !701, file: !700, line: 102, baseType: !279, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !701, file: !700, line: 103, baseType: !587, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !701, file: !700, line: 104, baseType: !706, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_radix_node_t", file: !700, line: 96, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_radix_node", file: !700, line: 87, size: 576, elements: !709)
!709 = !{!710, !711, !712, !726, !728, !729, !730, !734}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !708, file: !700, line: 88, baseType: !587, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !708, file: !700, line: 89, baseType: !353, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !708, file: !700, line: 90, baseType: !713, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_prefix_t", file: !700, line: 54, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_prefix", file: !700, line: 45, size: 320, elements: !716)
!716 = !{!717, !718, !719, !720, !721}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !715, file: !700, line: 46, baseType: !587, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !715, file: !700, line: 47, baseType: !279, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bitlen", scope: !715, file: !700, line: 48, baseType: !279, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !715, file: !700, line: 49, baseType: !635, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !715, file: !700, line: 53, baseType: !722, size: 128, offset: 192)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !715, file: !700, line: 50, size: 128, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !722, file: !700, line: 51, baseType: !457, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !722, file: !700, line: 52, baseType: !470, size: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !708, file: !700, line: 91, baseType: !727, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !708, file: !700, line: 91, baseType: !727, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !708, file: !700, line: 92, baseType: !727, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !708, file: !700, line: 93, baseType: !731, size: 128, offset: 384)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 128, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 2)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "node_num", scope: !708, file: !700, line: 94, baseType: !735, size: 64, offset: 512)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 64, elements: !732)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "maxbits", scope: !701, file: !700, line: 105, baseType: !353, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "num_active_node", scope: !701, file: !700, line: 106, baseType: !332, size: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "num_added_node", scope: !701, file: !700, line: 107, baseType: !332, size: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "nextincache", scope: !691, file: !692, line: 29, baseType: !740, size: 128, offset: 256)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !691, file: !692, line: 29, size: 128, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !740, file: !692, line: 29, baseType: !689, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !740, file: !692, line: 29, baseType: !689, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !683, file: !286, line: 82, baseType: !745, size: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclelement_t", file: !304, line: 31, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclelement", file: !286, line: 65, size: 832, elements: !748)
!748 = !{!749, !751, !752, !1069, !1070}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !747, file: !286, line: 66, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclelementtype_t", file: !286, line: 56, baseType: !285)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !747, file: !286, line: 67, baseType: !663, size: 8, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "keyname", scope: !747, file: !286, line: 68, baseType: !753, size: 640, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_name_t", file: !304, line: 107, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_name", file: !755, line: 104, size: 640, elements: !756)
!755 = !DIFile(filename: "lib/dns/include/dns/name.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "ec64c9a43875cd86cb4b0e37c1191a89")
!756 = !{!757, !758, !759, !760, !761, !762, !763, !782, !788}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !754, file: !755, line: 105, baseType: !279, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ndata", scope: !754, file: !755, line: 106, baseType: !511, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !754, file: !755, line: 107, baseType: !279, size: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !754, file: !755, line: 108, baseType: !279, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !754, file: !755, line: 109, baseType: !279, size: 32, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !754, file: !755, line: 110, baseType: !511, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !754, file: !755, line: 111, baseType: !764, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_buffer_t", file: !369, line: 35, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_buffer", file: !767, line: 173, size: 512, elements: !768)
!767 = !DIFile(filename: "lib/isc/include/isc/buffer.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "feec9784066f3891a27281dd5bdccd55")
!768 = !{!769, !770, !771, !772, !773, !774, !775, !780, !781}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !766, file: !767, line: 174, baseType: !279, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !766, file: !767, line: 175, baseType: !350, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !766, file: !767, line: 178, baseType: !279, size: 32, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !766, file: !767, line: 179, baseType: !279, size: 32, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !766, file: !767, line: 180, baseType: !279, size: 32, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !766, file: !767, line: 181, baseType: !279, size: 32, offset: 224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !766, file: !767, line: 184, baseType: !776, size: 128, offset: 256)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !766, file: !767, line: 184, size: 128, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !776, file: !767, line: 184, baseType: !764, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !776, file: !767, line: 184, baseType: !764, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !766, file: !767, line: 186, baseType: !587, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "autore", scope: !766, file: !767, line: 188, baseType: !663, size: 8, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !754, file: !755, line: 112, baseType: !783, size: 128, offset: 384)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !754, file: !755, line: 112, size: 128, elements: !784)
!784 = !{!785, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !783, file: !755, line: 112, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !783, file: !755, line: 112, baseType: !786, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !754, file: !755, line: 113, baseType: !789, size: 128, offset: 512)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !754, file: !755, line: 113, size: 128, elements: !790)
!790 = !{!791, !1068}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !789, file: !755, line: 113, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataset_t", file: !304, line: 123, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdataset", file: !795, line: 107, size: 960, elements: !796)
!795 = !DIFile(filename: "lib/dns/include/dns/rdataset.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "a2414fd23f718a363582354673aed6a8")
!796 = !{!797, !798, !1044, !1049, !1050, !1051, !1053, !1054, !1055, !1056, !1057, !1058, !1061, !1062, !1063, !1064, !1065, !1066, !1067}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !794, file: !795, line: 108, baseType: !279, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !794, file: !795, line: 109, baseType: !799, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetmethods_t", file: !795, line: 96, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetmethods", file: !795, line: 64, size: 1024, elements: !802)
!802 = !{!803, !807, !811, !812, !833, !837, !841, !847, !851, !852, !853, !858, !859, !860, !864, !870}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "disassociate", scope: !801, file: !795, line: 65, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !792}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !801, file: !795, line: 66, baseType: !808, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!429, !792}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !795, line: 67, baseType: !808, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !801, file: !795, line: 68, baseType: !813, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !792, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdata_t", file: !304, line: 119, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdata", file: !819, line: 112, size: 320, elements: !820)
!819 = !DIFile(filename: "lib/dns/include/dns/rdata.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "e790fb4f336bc4fdcd566550403b32a6")
!820 = !{!821, !822, !823, !825, !827, !828}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !818, file: !819, line: 113, baseType: !511, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !818, file: !819, line: 114, baseType: !279, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !818, file: !819, line: 115, baseType: !824, size: 16, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataclass_t", file: !304, line: 121, baseType: !454)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !818, file: !819, line: 116, baseType: !826, size: 16, offset: 112)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatatype_t", file: !304, line: 126, baseType: !454)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !818, file: !819, line: 117, baseType: !279, size: 32, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !818, file: !819, line: 118, baseType: !829, size: 128, offset: 192)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !818, file: !819, line: 118, size: 128, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !829, file: !819, line: 118, baseType: !816, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !829, file: !819, line: 118, baseType: !816, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !801, file: !795, line: 70, baseType: !834, size: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !792, !792}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !801, file: !795, line: 72, baseType: !838, size: 64, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!279, !792}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "addnoqname", scope: !801, file: !795, line: 73, baseType: !842, size: 64, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!429, !792, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "getnoqname", scope: !801, file: !795, line: 75, baseType: !848, size: 64, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!429, !792, !786, !792, !792}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "addclosest", scope: !801, file: !795, line: 79, baseType: !842, size: 64, offset: 512)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getclosest", scope: !801, file: !795, line: 81, baseType: !848, size: 64, offset: 576)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "settrust", scope: !801, file: !795, line: 85, baseType: !854, size: 64, offset: 640)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !792, !857}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_trust_t", file: !304, line: 140, baseType: !454)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !801, file: !795, line: 87, baseType: !804, size: 64, offset: 704)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "clearprefetch", scope: !801, file: !795, line: 88, baseType: !804, size: 64, offset: 768)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "setownercase", scope: !801, file: !795, line: 89, baseType: !861, size: 64, offset: 832)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !792, !845}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "getownercase", scope: !801, file: !795, line: 91, baseType: !865, size: 64, offset: 896)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !868, !786}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "addglue", scope: !801, file: !795, line: 93, baseType: !871, size: 64, offset: 960)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!429, !792, !874, !876}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbversion_t", file: !304, line: 61, baseType: null)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_message_t", file: !304, line: 103, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_message", file: !879, line: 197, size: 3840, elements: !880)
!879 = !DIFile(filename: "lib/dns/include/dns/message.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "6416f0e57c4314c86bb1ccbb29bdbc0d")
!880 = !{!881, !882, !884, !885, !887, !889, !890, !892, !899, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !947, !948, !955, !956, !962, !963, !971, !976, !981, !986, !994, !995, !996, !997, !998, !1002, !1007, !1008, !1009, !1010, !1014, !1015, !1016, !1017, !1026}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !878, file: !879, line: 199, baseType: !279, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !878, file: !879, line: 201, baseType: !883, size: 16, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_messageid_t", file: !304, line: 104, baseType: !454)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !878, file: !879, line: 202, baseType: !279, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !878, file: !879, line: 203, baseType: !886, size: 16, offset: 96)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rcode_t", file: !304, line: 118, baseType: !454)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !878, file: !879, line: 204, baseType: !888, size: 16, offset: 112)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_opcode_t", file: !304, line: 111, baseType: !454)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !878, file: !879, line: 205, baseType: !824, size: 16, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !878, file: !879, line: 208, baseType: !891, size: 128, offset: 160)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, elements: !159)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "sections", scope: !878, file: !879, line: 211, baseType: !893, size: 512, offset: 320)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 512, elements: !159)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_namelist_t", file: !304, line: 108, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 108, size: 128, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !895, file: !304, line: 108, baseType: !786, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !895, file: !304, line: 108, baseType: !786, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "cursors", scope: !878, file: !879, line: 212, baseType: !900, size: 256, offset: 832)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 256, elements: !159)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !878, file: !879, line: 213, baseType: !792, size: 64, offset: 1088)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "sig0", scope: !878, file: !879, line: 214, baseType: !792, size: 64, offset: 1152)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tsig", scope: !878, file: !879, line: 215, baseType: !792, size: 64, offset: 1216)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !878, file: !879, line: 217, baseType: !332, size: 32, offset: 1280)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "from_to_wire", scope: !878, file: !879, line: 218, baseType: !279, size: 2, offset: 1312, flags: DIFlagBitField, extraData: i64 1312)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "header_ok", scope: !878, file: !879, line: 219, baseType: !279, size: 1, offset: 1314, flags: DIFlagBitField, extraData: i64 1312)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "question_ok", scope: !878, file: !879, line: 220, baseType: !279, size: 1, offset: 1315, flags: DIFlagBitField, extraData: i64 1312)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_continuation", scope: !878, file: !879, line: 221, baseType: !279, size: 1, offset: 1316, flags: DIFlagBitField, extraData: i64 1312)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "verified_sig", scope: !878, file: !879, line: 222, baseType: !279, size: 1, offset: 1317, flags: DIFlagBitField, extraData: i64 1312)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "verify_attempted", scope: !878, file: !879, line: 223, baseType: !279, size: 1, offset: 1318, flags: DIFlagBitField, extraData: i64 1312)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "free_query", scope: !878, file: !879, line: 224, baseType: !279, size: 1, offset: 1319, flags: DIFlagBitField, extraData: i64 1312)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "free_saved", scope: !878, file: !879, line: 225, baseType: !279, size: 1, offset: 1320, flags: DIFlagBitField, extraData: i64 1312)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "cc_ok", scope: !878, file: !879, line: 226, baseType: !279, size: 1, offset: 1321, flags: DIFlagBitField, extraData: i64 1312)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "cc_bad", scope: !878, file: !879, line: 227, baseType: !279, size: 1, offset: 1322, flags: DIFlagBitField, extraData: i64 1312)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "tkey", scope: !878, file: !879, line: 228, baseType: !279, size: 1, offset: 1323, flags: DIFlagBitField, extraData: i64 1312)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass_set", scope: !878, file: !879, line: 229, baseType: !279, size: 1, offset: 1324, flags: DIFlagBitField, extraData: i64 1312)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "opt_reserved", scope: !878, file: !879, line: 231, baseType: !279, size: 32, offset: 1344)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sig_reserved", scope: !878, file: !879, line: 232, baseType: !279, size: 32, offset: 1376)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !878, file: !879, line: 233, baseType: !279, size: 32, offset: 1408)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !878, file: !879, line: 235, baseType: !454, size: 16, offset: 1440)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "padding_off", scope: !878, file: !879, line: 236, baseType: !279, size: 32, offset: 1472)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !878, file: !879, line: 238, baseType: !764, size: 64, offset: 1536)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cctx", scope: !878, file: !879, line: 239, baseType: !924, size: 64, offset: 1600)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compress_t", file: !304, line: 53, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compress", file: !927, line: 66, size: 18688, elements: !928)
!927 = !DIFile(filename: "lib/dns/include/dns/compress.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "ae360072e6dd15c4fe76c4efa2dcea4c")
!928 = !{!929, !930, !931, !932, !943, !945, !946}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !926, file: !927, line: 67, baseType: !279, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !926, file: !927, line: 68, baseType: !279, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "edns", scope: !926, file: !927, line: 69, baseType: !332, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !926, file: !927, line: 71, baseType: !933, size: 4096, offset: 128)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 4096, elements: !147)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compressnode_t", file: !927, line: 56, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compressnode", file: !927, line: 58, size: 896, elements: !937)
!937 = !{!938, !939, !940, !941, !942}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !927, line: 59, baseType: !934, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !936, file: !927, line: 60, baseType: !454, size: 16, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !936, file: !927, line: 61, baseType: !454, size: 16, offset: 80)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !936, file: !927, line: 62, baseType: !541, size: 128, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !927, line: 63, baseType: !753, size: 640, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "initialnodes", scope: !926, file: !927, line: 73, baseType: !944, size: 14336, offset: 4224)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 14336, elements: !479)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !926, file: !927, line: 74, baseType: !454, size: 16, offset: 18560)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !926, file: !927, line: 75, baseType: !587, size: 64, offset: 18624)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !878, file: !879, line: 241, baseType: !587, size: 64, offset: 1664)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "namepool", scope: !878, file: !879, line: 242, baseType: !949, size: 64, offset: 1728)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mempool_t", file: !369, line: 60, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mempool", file: !590, line: 205, size: 64, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !951, file: !590, line: 206, baseType: !279, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !951, file: !590, line: 207, baseType: !279, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rdspool", scope: !878, file: !879, line: 243, baseType: !949, size: 64, offset: 1792)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "scratchpad", scope: !878, file: !879, line: 245, baseType: !957, size: 128, offset: 1856)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_bufferlist_t", file: !369, line: 36, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 36, size: 128, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !958, file: !369, line: 36, baseType: !764, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !958, file: !369, line: 36, baseType: !764, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !878, file: !879, line: 246, baseType: !957, size: 128, offset: 1984)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "rdatas", scope: !878, file: !879, line: 248, baseType: !964, size: 128, offset: 2112)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !879, line: 248, size: 128, elements: !965)
!965 = !{!966, !970}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !964, file: !879, line: 248, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_msgblock_t", file: !879, line: 189, baseType: !969)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_msgblock", file: !879, line: 189, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !964, file: !879, line: 248, baseType: !967, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "rdatalists", scope: !878, file: !879, line: 249, baseType: !972, size: 128, offset: 2240)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !879, line: 249, size: 128, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !972, file: !879, line: 249, baseType: !967, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !972, file: !879, line: 249, baseType: !967, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !878, file: !879, line: 250, baseType: !977, size: 128, offset: 2368)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !879, line: 250, size: 128, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !977, file: !879, line: 250, baseType: !967, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !977, file: !879, line: 250, baseType: !967, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "freerdata", scope: !878, file: !879, line: 252, baseType: !982, size: 128, offset: 2496)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !879, line: 252, size: 128, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !982, file: !879, line: 252, baseType: !816, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !982, file: !879, line: 252, baseType: !816, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "freerdatalist", scope: !878, file: !879, line: 253, baseType: !987, size: 128, offset: 2624)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !879, line: 253, size: 128, elements: !988)
!988 = !{!989, !993}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !987, file: !879, line: 253, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatalist_t", file: !304, line: 122, baseType: !992)
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatalist", file: !304, line: 122, flags: DIFlagFwdDecl)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !987, file: !879, line: 253, baseType: !990, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "tsigstatus", scope: !878, file: !879, line: 255, baseType: !886, size: 16, offset: 2752)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "querytsigstatus", scope: !878, file: !879, line: 256, baseType: !886, size: 16, offset: 2768)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "tsigname", scope: !878, file: !879, line: 257, baseType: !786, size: 64, offset: 2816)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "querytsig", scope: !878, file: !879, line: 258, baseType: !792, size: 64, offset: 2880)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tsigkey", scope: !878, file: !879, line: 259, baseType: !999, size: 64, offset: 2944)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_tsigkey_t", file: !304, line: 143, baseType: !1001)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_tsigkey", file: !304, line: 143, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "tsigctx", scope: !878, file: !879, line: 260, baseType: !1003, size: 64, offset: 3008)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_context_t", file: !1005, line: 45, baseType: !1006)
!1005 = !DIFile(filename: "lib/dns/include/dst/dst.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "10e76bcacbe005e6cc7dee2ac6ffac9a")
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_context", file: !1005, line: 45, flags: DIFlagFwdDecl)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "sigstart", scope: !878, file: !879, line: 261, baseType: !332, size: 32, offset: 3072)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "timeadjust", scope: !878, file: !879, line: 262, baseType: !332, size: 32, offset: 3104)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "sig0name", scope: !878, file: !879, line: 264, baseType: !786, size: 64, offset: 3136)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "sig0key", scope: !878, file: !879, line: 265, baseType: !1011, size: 64, offset: 3200)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_key_t", file: !1005, line: 44, baseType: !1013)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_key", file: !1005, line: 44, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sig0status", scope: !878, file: !879, line: 266, baseType: !886, size: 16, offset: 3264)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !878, file: !879, line: 267, baseType: !541, size: 128, offset: 3328)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !878, file: !879, line: 268, baseType: !541, size: 128, offset: 3456)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !878, file: !879, line: 270, baseType: !1018, size: 64, offset: 3584)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetorderfunc_t", file: !304, line: 415, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!332, !1022, !1024}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "order_arg", scope: !878, file: !879, line: 271, baseType: !1027, size: 192, offset: 3648)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_sortlist_arg_t", file: !304, line: 134, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_sortlist_arg", file: !879, line: 191, size: 192, elements: !1029)
!1029 = !{!1030, !1038, !1041}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !1028, file: !879, line: 192, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclenv_t", file: !304, line: 32, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclenv", file: !286, line: 90, size: 192, elements: !1034)
!1034 = !{!1035, !1036, !1037}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "localhost", scope: !1033, file: !286, line: 91, baseType: !681, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "localnets", scope: !1033, file: !286, line: 92, baseType: !681, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "match_mapped", scope: !1033, file: !286, line: 93, baseType: !663, size: 8, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !1028, file: !879, line: 193, baseType: !1039, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !1028, file: !879, line: 194, baseType: !1042, size: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !794, file: !795, line: 110, baseType: !1045, size: 128, offset: 128)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !794, file: !795, line: 110, size: 128, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1045, file: !795, line: 110, baseType: !792, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1045, file: !795, line: 110, baseType: !792, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !794, file: !795, line: 117, baseType: !824, size: 16, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !794, file: !795, line: 118, baseType: !826, size: 16, offset: 272)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !794, file: !795, line: 119, baseType: !1052, size: 32, offset: 288)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_ttl_t", file: !304, line: 144, baseType: !353)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "stale_ttl", scope: !794, file: !795, line: 124, baseType: !1052, size: 32, offset: 320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !794, file: !795, line: 125, baseType: !857, size: 16, offset: 352)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "covers", scope: !794, file: !795, line: 126, baseType: !826, size: 16, offset: 368)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !794, file: !795, line: 131, baseType: !279, size: 32, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !794, file: !795, line: 139, baseType: !353, size: 32, offset: 416)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "resign", scope: !794, file: !795, line: 145, baseType: !1059, size: 32, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_stdtime_t", file: !1060, line: 26, baseType: !353)
!1060 = !DIFile(filename: "../../lib/isc/unix/include/isc/stdtime.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/bin/named", checksumkind: CSK_MD5, checksum: "b8868fded6c0eb282ad50986c628a693")
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !794, file: !795, line: 152, baseType: !350, size: 64, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !794, file: !795, line: 153, baseType: !350, size: 64, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !794, file: !795, line: 154, baseType: !350, size: 64, offset: 640)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "privateuint4", scope: !794, file: !795, line: 155, baseType: !279, size: 32, offset: 704)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !794, file: !795, line: 156, baseType: !350, size: 64, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !794, file: !795, line: 157, baseType: !1024, size: 64, offset: 832)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "private7", scope: !794, file: !795, line: 158, baseType: !1024, size: 64, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !789, file: !755, line: 113, baseType: !792, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "nestedacl", scope: !747, file: !286, line: 72, baseType: !681, size: 64, offset: 704)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "node_num", scope: !747, file: !286, line: 73, baseType: !332, size: 32, offset: 768)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "has_negatives", scope: !683, file: !286, line: 83, baseType: !663, size: 8, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !683, file: !286, line: 84, baseType: !279, size: 32, offset: 352)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !683, file: !286, line: 85, baseType: !279, size: 32, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !683, file: !286, line: 86, baseType: !512, size: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "nextincache", scope: !683, file: !286, line: 87, baseType: !1076, size: 128, offset: 512)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !286, line: 87, size: 128, elements: !1077)
!1077 = !{!1078, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1076, file: !286, line: 87, baseType: !681, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1076, file: !286, line: 87, baseType: !681, size: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "keepresporder", scope: !629, file: !630, line: 102, baseType: !681, size: 64, offset: 1536)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "udpsize", scope: !629, file: !630, line: 103, baseType: !454, size: 16, offset: 1600)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_tcp_message_size", scope: !629, file: !630, line: 104, baseType: !454, size: 16, offset: 1616)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "interface_auto", scope: !629, file: !630, line: 105, baseType: !663, size: 8, offset: 1632)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "tkeyctx", scope: !629, file: !630, line: 106, baseType: !1085, size: 64, offset: 1664)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_tkeyctx_t", file: !304, line: 139, baseType: !1087)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_tkeyctx", file: !304, line: 139, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "server_id", scope: !629, file: !630, line: 109, baseType: !512, size: 64, offset: 1728)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "gethostname", scope: !629, file: !630, line: 110, baseType: !1090, size: 64, offset: 1792)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_hostnamecb_t", file: !630, line: 55, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!429, !512, !362}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "fuzztype", scope: !629, file: !630, line: 113, baseType: !1095, size: 32, offset: 1856)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_fuzztype_t", file: !295, line: 22, baseType: !294)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "fuzznotify", scope: !629, file: !630, line: 114, baseType: !1097, size: 64, offset: 1920)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_fuzzcb_t", file: !630, line: 62, baseType: !1098)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{null}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "matchingview", scope: !629, file: !630, line: 117, baseType: !1102, size: 64, offset: 1984)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_matchview_t", file: !630, line: 68, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!429, !1106, !1106, !876, !1031, !1119, !1120}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_netaddr_t", file: !369, line: 61, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_netaddr", file: !1109, line: 32, size: 928, elements: !1110)
!1109 = !DIFile(filename: "lib/isc/include/isc/netaddr.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "32c674d5a712846b6ad38c7272a5fe0e")
!1110 = !{!1111, !1112, !1118}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1108, file: !1109, line: 33, baseType: !279, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1108, file: !1109, line: 40, baseType: !1113, size: 864, offset: 32)
!1113 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1108, file: !1109, line: 34, size: 864, elements: !1114)
!1114 = !{!1115, !1116, !1117}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1113, file: !1109, line: 35, baseType: !457, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !1113, file: !1109, line: 36, baseType: !470, size: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !1113, file: !1109, line: 38, baseType: !501, size: 864)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "zone", scope: !1108, file: !1109, line: 41, baseType: !353, size: 32, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_view_t", file: !304, line: 147, baseType: !1123)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_view", file: !304, line: 147, flags: DIFlagFwdDecl)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "nsstats", scope: !629, file: !630, line: 120, baseType: !1125, size: 64, offset: 2048)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_stats_t", file: !278, line: 27, baseType: !1127)
!1127 = !DICompositeType(tag: DW_TAG_structure_type, name: "ns_stats", file: !278, line: 27, flags: DIFlagFwdDecl)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "rcvquerystats", scope: !629, file: !630, line: 121, baseType: !1129, size: 64, offset: 2112)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_stats_t", file: !304, line: 137, baseType: !1131)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_stats", file: !304, line: 137, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "opcodestats", scope: !629, file: !630, line: 122, baseType: !1129, size: 64, offset: 2176)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "rcodestats", scope: !629, file: !630, line: 123, baseType: !1129, size: 64, offset: 2240)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "udpinstats4", scope: !629, file: !630, line: 125, baseType: !1135, size: 64, offset: 2304)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_stats_t", file: !369, line: 74, baseType: !1137)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_stats", file: !369, line: 74, flags: DIFlagFwdDecl)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "udpoutstats4", scope: !629, file: !630, line: 126, baseType: !1135, size: 64, offset: 2368)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "udpinstats6", scope: !629, file: !630, line: 127, baseType: !1135, size: 64, offset: 2432)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "udpoutstats6", scope: !629, file: !630, line: 128, baseType: !1135, size: 64, offset: 2496)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "tcpinstats4", scope: !629, file: !630, line: 130, baseType: !1135, size: 64, offset: 2560)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "tcpoutstats4", scope: !629, file: !630, line: 131, baseType: !1135, size: 64, offset: 2624)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "tcpinstats6", scope: !629, file: !630, line: 132, baseType: !1135, size: 64, offset: 2688)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "tcpoutstats6", scope: !629, file: !630, line: 133, baseType: !1135, size: 64, offset: 2752)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !582, file: !583, line: 52, baseType: !375, size: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "statsfile", scope: !582, file: !583, line: 54, baseType: !512, size: 64, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "dumpfile", scope: !582, file: !583, line: 55, baseType: !512, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "secrootsfile", scope: !582, file: !583, line: 56, baseType: !512, size: 64, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "bindkeysfile", scope: !582, file: !583, line: 57, baseType: !512, size: 64, offset: 448)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "recfile", scope: !582, file: !583, line: 58, baseType: !512, size: 64, offset: 512)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "version_set", scope: !582, file: !583, line: 59, baseType: !663, size: 8, offset: 576)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !582, file: !583, line: 60, baseType: !512, size: 64, offset: 640)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "hostname_set", scope: !582, file: !583, line: 61, baseType: !663, size: 8, offset: 704)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !582, file: !583, line: 62, baseType: !512, size: 64, offset: 768)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "loadmgr", scope: !582, file: !583, line: 65, baseType: !1156, size: 64, offset: 832)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_loadmgr_t", file: !304, line: 100, baseType: !1158)
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_loadmgr", file: !304, line: 100, flags: DIFlagFwdDecl)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "zonemgr", scope: !582, file: !583, line: 66, baseType: !1160, size: 64, offset: 896)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_zonemgr_t", file: !304, line: 151, baseType: !1162)
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_zonemgr", file: !304, line: 151, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "viewlist", scope: !582, file: !583, line: 67, baseType: !1164, size: 128, offset: 960)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_viewlist_t", file: !304, line: 148, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 148, size: 128, elements: !1166)
!1166 = !{!1167, !1168}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1165, file: !304, line: 148, baseType: !1121, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1165, file: !304, line: 148, baseType: !1121, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "interfacemgr", scope: !582, file: !583, line: 68, baseType: !1170, size: 64, offset: 1088)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_interfacemgr_t", file: !278, line: 24, baseType: !1172)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ns_interfacemgr", file: !278, line: 24, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "in_roothints", scope: !582, file: !583, line: 69, baseType: !1174, size: 64, offset: 1152)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_db_t", file: !304, line: 54, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_db", file: !1177, line: 223, size: 1024, elements: !1178)
!1177 = !DIFile(filename: "lib/dns/include/dns/db.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "f7341a6445a0da00d6edbc7f74bf2ce5")
!1178 = !{!1179, !1180, !1181, !1464, !1465, !1466, !1467, !1468}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1176, file: !1177, line: 224, baseType: !279, size: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !1176, file: !1177, line: 225, baseType: !279, size: 32, offset: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !1176, file: !1177, line: 226, baseType: !1182, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbmethods_t", file: !1177, line: 200, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_dbmethods", file: !1177, line: 71, size: 3072, elements: !1185)
