; ModuleID = 'samples/750.bc'
source_filename = "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q/spack-src/src/mod_userdir.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.config_plugin_keys_t = type { ptr, i8, i8, i8 }
%struct.plugin = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr }
%struct.plugin_data = type { i32, i32, ptr, ptr, %struct.plugin_config, %struct.plugin_config, [2 x i64], [2 x %struct.buffer], [2 x %struct.buffer] }
%struct.plugin_config = type { ptr, ptr, ptr, ptr, i16, i16 }
%struct.buffer = type { ptr, i32, i32 }
%struct.request_st = type { i32, i32, i32, i32, i32, i32, i16, i8, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr, %struct.request_config, i32, i64, %struct.array, %struct.request_uri, %struct.physical, %struct.array, i64, i64, i64, ptr, ptr, %struct.buffer, %struct.buffer, %struct.buffer, %struct.buffer, i32, i64, %struct.array, i8, i8, i8, i8, i8, i8, i8, i8, ptr, ptr, i64, i64, %struct.timespec, i32, i32, %struct.chunkqueue, %struct.chunkqueue, %struct.chunkqueue, ptr, i32, i32 }
%struct.request_config = type { ptr, i32, i32, ptr, ptr, ptr, ptr, i32, i16, i16, i16, i16, i16, i16, i24, i32, i32, ptr, ptr, ptr, ptr, ptr }

!26 = distinct !DICompileUnit(language: DW_LANG_C11, file: !27, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !28, retainedTypes: !182, globals: !221, splitDebugInlining: false, nameTableKind: None)
!27 = !DIFile(filename: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q/spack-src/src/mod_userdir.c", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q/spack-build-rpmcfxe/build", checksumkind: CSK_MD5, checksum: "f4ef39291792b85ad0d08dd299cf1c3b")
!28 = !{!14, !29, !43, !88, !94, !121, !129, !166}
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 108, baseType: !15, size: 32, elements: !31)
!30 = !DIFile(filename: "spack-src/src/request.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "416cbf9145278ec22de51666187d6d5a")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!32 = !DIEnumerator(name: "CON_STATE_CONNECT", value: 0)
!33 = !DIEnumerator(name: "CON_STATE_REQUEST_START", value: 1)
!34 = !DIEnumerator(name: "CON_STATE_READ", value: 2)
!35 = !DIEnumerator(name: "CON_STATE_REQUEST_END", value: 3)
!36 = !DIEnumerator(name: "CON_STATE_READ_POST", value: 4)
!37 = !DIEnumerator(name: "CON_STATE_HANDLE_REQUEST", value: 5)
!38 = !DIEnumerator(name: "CON_STATE_RESPONSE_START", value: 6)
!39 = !DIEnumerator(name: "CON_STATE_WRITE", value: 7)
!40 = !DIEnumerator(name: "CON_STATE_RESPONSE_END", value: 8)
!41 = !DIEnumerator(name: "CON_STATE_ERROR", value: 9)
!42 = !DIEnumerator(name: "CON_STATE_CLOSE", value: 10)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 17, baseType: !45, size: 32, elements: !46)
!44 = !DIFile(filename: "spack-src/src/http_kv.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "839af8f5796c73517231eb7758755092")
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!47 = !DIEnumerator(name: "HTTP_METHOD_PRI", value: -2)
!48 = !DIEnumerator(name: "HTTP_METHOD_UNSET", value: -1)
!49 = !DIEnumerator(name: "HTTP_METHOD_GET", value: 0)
!50 = !DIEnumerator(name: "HTTP_METHOD_HEAD", value: 1)
!51 = !DIEnumerator(name: "HTTP_METHOD_QUERY", value: 2)
!52 = !DIEnumerator(name: "HTTP_METHOD_POST", value: 3)
!53 = !DIEnumerator(name: "HTTP_METHOD_PUT", value: 4)
!54 = !DIEnumerator(name: "HTTP_METHOD_DELETE", value: 5)
!55 = !DIEnumerator(name: "HTTP_METHOD_CONNECT", value: 6)
!56 = !DIEnumerator(name: "HTTP_METHOD_OPTIONS", value: 7)
!57 = !DIEnumerator(name: "HTTP_METHOD_TRACE", value: 8)
!58 = !DIEnumerator(name: "HTTP_METHOD_ACL", value: 9)
!59 = !DIEnumerator(name: "HTTP_METHOD_BASELINE_CONTROL", value: 10)
!60 = !DIEnumerator(name: "HTTP_METHOD_BIND", value: 11)
!61 = !DIEnumerator(name: "HTTP_METHOD_CHECKIN", value: 12)
!62 = !DIEnumerator(name: "HTTP_METHOD_CHECKOUT", value: 13)
!63 = !DIEnumerator(name: "HTTP_METHOD_COPY", value: 14)
!64 = !DIEnumerator(name: "HTTP_METHOD_LABEL", value: 15)
!65 = !DIEnumerator(name: "HTTP_METHOD_LINK", value: 16)
!66 = !DIEnumerator(name: "HTTP_METHOD_LOCK", value: 17)
!67 = !DIEnumerator(name: "HTTP_METHOD_MERGE", value: 18)
!68 = !DIEnumerator(name: "HTTP_METHOD_MKACTIVITY", value: 19)
!69 = !DIEnumerator(name: "HTTP_METHOD_MKCALENDAR", value: 20)
!70 = !DIEnumerator(name: "HTTP_METHOD_MKCOL", value: 21)
!71 = !DIEnumerator(name: "HTTP_METHOD_MKREDIRECTREF", value: 22)
!72 = !DIEnumerator(name: "HTTP_METHOD_MKWORKSPACE", value: 23)
!73 = !DIEnumerator(name: "HTTP_METHOD_MOVE", value: 24)
!74 = !DIEnumerator(name: "HTTP_METHOD_ORDERPATCH", value: 25)
!75 = !DIEnumerator(name: "HTTP_METHOD_PATCH", value: 26)
!76 = !DIEnumerator(name: "HTTP_METHOD_PROPFIND", value: 27)
!77 = !DIEnumerator(name: "HTTP_METHOD_PROPPATCH", value: 28)
!78 = !DIEnumerator(name: "HTTP_METHOD_REBIND", value: 29)
!79 = !DIEnumerator(name: "HTTP_METHOD_REPORT", value: 30)
!80 = !DIEnumerator(name: "HTTP_METHOD_SEARCH", value: 31)
!81 = !DIEnumerator(name: "HTTP_METHOD_UNBIND", value: 32)
!82 = !DIEnumerator(name: "HTTP_METHOD_UNCHECKOUT", value: 33)
!83 = !DIEnumerator(name: "HTTP_METHOD_UNLINK", value: 34)
!84 = !DIEnumerator(name: "HTTP_METHOD_UNLOCK", value: 35)
!85 = !DIEnumerator(name: "HTTP_METHOD_UPDATE", value: 36)
!86 = !DIEnumerator(name: "HTTP_METHOD_UPDATEREDIRECTREF", value: 37)
!87 = !DIEnumerator(name: "HTTP_METHOD_VERSION_CONTROL", value: 38)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 61, baseType: !45, size: 32, elements: !89)
!89 = !{!90, !91, !92, !93}
!90 = !DIEnumerator(name: "HTTP_VERSION_UNSET", value: -1)
!91 = !DIEnumerator(name: "HTTP_VERSION_1_0", value: 0)
!92 = !DIEnumerator(name: "HTTP_VERSION_1_1", value: 1)
!93 = !DIEnumerator(name: "HTTP_VERSION_2", value: 2)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !96, file: !95, line: 9, baseType: !15, size: 32, elements: !116)
!95 = !DIFile(filename: "spack-src/src/fdlog.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "1dfced3d6e6326ccc981df3627f31bb1")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fdlog_st", file: !95, line: 8, size: 256, elements: !97)
!97 = !{!98, !99, !100, !113}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !96, file: !95, line: 9, baseType: !94, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !96, file: !95, line: 10, baseType: !45, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !96, file: !95, line: 11, baseType: !101, size: 128, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "buffer", file: !102, line: 29, baseType: !103)
!102 = !DIFile(filename: "spack-src/src/buffer.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "83c8b506d008193bd35bbe68f14e1c2a")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 22, size: 128, elements: !104)
!104 = !{!105, !107, !112}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !103, file: !102, line: 23, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !103, file: !102, line: 26, baseType: !108, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !109, line: 26, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !111, line: 42, baseType: !15)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !102, line: 28, baseType: !108, size: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !96, file: !95, line: 12, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!116 = !{!117, !118, !119, !120}
!117 = !DIEnumerator(name: "FDLOG_FILE", value: 0)
!118 = !DIEnumerator(name: "FDLOG_FD", value: 1)
!119 = !DIEnumerator(name: "FDLOG_SYSLOG", value: 2)
!120 = !DIEnumerator(name: "FDLOG_PIPE", value: 3)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !122, line: 15, baseType: !15, size: 32, elements: !123)
!122 = !DIFile(filename: "spack-src/src/array.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "1cf4a1ef37ac70f79ceaa3d29a995d97")
!123 = !{!124, !125, !126, !127, !128}
!124 = !DIEnumerator(name: "TYPE_STRING", value: 0)
!125 = !DIEnumerator(name: "TYPE_ARRAY", value: 1)
!126 = !DIEnumerator(name: "TYPE_INTEGER", value: 2)
!127 = !DIEnumerator(name: "TYPE_CONFIG", value: 3)
!128 = !DIEnumerator(name: "TYPE_OTHER", value: 4)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !131, file: !130, line: 22, baseType: !15, size: 32, elements: !163)
!130 = !DIFile(filename: "spack-src/src/chunk.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "68721e47e09305b31f90225c328df0d0")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chunk", file: !130, line: 20, size: 576, elements: !132)
!132 = !{!133, !135, !136, !138, !143}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !130, line: 21, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !130, line: 22, baseType: !129, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !131, file: !130, line: 24, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !131, file: !130, line: 30, baseType: !139, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !140, line: 87, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 153, baseType: !142)
!142 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !131, file: !130, line: 43, baseType: !144, size: 320, offset: 256)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !131, file: !130, line: 32, size: 320, elements: !145)
!145 = !{!146, !147, !148, !149, !158, !159}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !144, file: !130, line: 34, baseType: !139, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !144, file: !130, line: 36, baseType: !45, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "is_temp", scope: !144, file: !130, line: 37, baseType: !45, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !144, file: !130, line: 39, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_file_view", file: !130, line: 18, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chunk_file_view", file: !130, line: 13, size: 256, elements: !153)
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mptr", scope: !152, file: !130, line: 14, baseType: !106, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "mlen", scope: !152, file: !130, line: 15, baseType: !139, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "foff", scope: !152, file: !130, line: 16, baseType: !139, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !152, file: !130, line: 17, baseType: !45, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !144, file: !130, line: 41, baseType: !25, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "refchg", scope: !144, file: !130, line: 42, baseType: !160, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !25, !45}
!163 = !{!164, !165}
!164 = !DIEnumerator(name: "MEM_CHUNK", value: 0)
!165 = !DIEnumerator(name: "FILE_CHUNK", value: 1)
!166 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !167, line: 89, baseType: !15, size: 32, elements: !168)
!167 = !DIFile(filename: "spack-src/src/plugin_config.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "b826c888c36ea41e9e12a5dcb73a23da")
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181}
!169 = !DIEnumerator(name: "T_CONFIG_UNSET", value: 0)
!170 = !DIEnumerator(name: "T_CONFIG_STRING", value: 1)
!171 = !DIEnumerator(name: "T_CONFIG_SHORT", value: 2)
!172 = !DIEnumerator(name: "T_CONFIG_INT", value: 3)
!173 = !DIEnumerator(name: "T_CONFIG_BOOL", value: 4)
!174 = !DIEnumerator(name: "T_CONFIG_ARRAY", value: 5)
!175 = !DIEnumerator(name: "T_CONFIG_ARRAY_KVANY", value: 6)
!176 = !DIEnumerator(name: "T_CONFIG_ARRAY_KVARRAY", value: 7)
!177 = !DIEnumerator(name: "T_CONFIG_ARRAY_KVSTRING", value: 8)
!178 = !DIEnumerator(name: "T_CONFIG_ARRAY_VLIST", value: 9)
!179 = !DIEnumerator(name: "T_CONFIG_LOCAL", value: 10)
!180 = !DIEnumerator(name: "T_CONFIG_DEPRECATED", value: 11)
!181 = !DIEnumerator(name: "T_CONFIG_UNSUPPORTED", value: 12)
!182 = !{!25, !183, !108, !186, !45}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !184, line: 70, baseType: !185)
!184 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!185 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "data_string", file: !122, line: 37, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 33, size: 384, elements: !190)
!190 = !{!191, !192, !218, !219, !220}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !189, file: !122, line: 34, baseType: !101, size: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !189, file: !122, line: 34, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "data_methods", file: !122, line: 9, size: 192, elements: !196)
!196 = !{!197, !210, !214}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !195, file: !122, line: 10, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !208}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "data_unset", file: !122, line: 21, size: 256, elements: !203)
!203 = !{!204, !205, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !202, file: !122, line: 22, baseType: !101, size: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !202, file: !122, line: 22, baseType: !193, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !202, file: !122, line: 22, baseType: !207, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "data_type_t", file: !122, line: 15, baseType: !121)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !195, file: !122, line: 11, baseType: !211, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !201}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "insert_dup", scope: !195, file: !122, line: 12, baseType: !215, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !201, !201}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !122, line: 34, baseType: !207, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !189, file: !122, line: 35, baseType: !45, size: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !189, file: !122, line: 36, baseType: !101, size: 128, offset: 256)
!221 = !{!0, !222, !227, !232, !234, !239, !244, !7, !249}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 92, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 13)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 21)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !2, line: 98, type: !229, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 17)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 20)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 15)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !2, line: 116, type: !251, isLocal: true, isDefinition: true)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 12)
!254 = !{!255, !256, !257, !598, !600, !603}
!255 = !DILocalVariable(name: "srv", arg: 1, scope: !9, file: !2, line: 90, type: !22)
!256 = !DILocalVariable(name: "p_d", arg: 2, scope: !9, file: !2, line: 90, type: !25)
!257 = !DILocalVariable(name: "p", scope: !9, file: !2, line: 115, type: !258)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "plugin_data", file: !2, line: 37, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 30, size: 1472, elements: !262)
!262 = !{!263, !264, !265, !304, !582, !592, !593, !595, !597}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !261, file: !2, line: 31, baseType: !45, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nconfig", scope: !261, file: !2, line: 31, baseType: !45, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "cvlist", scope: !261, file: !2, line: 31, baseType: !266, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_plugin_value_t", file: !167, line: 124, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config_plugin_value", file: !167, line: 110, size: 128, elements: !269)
!269 = !{!270, !271, !273}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "k_id", scope: !268, file: !167, line: 111, baseType: !45, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !268, file: !167, line: 112, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_values_type_t", file: !167, line: 102, baseType: !166)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !268, file: !167, line: 123, baseType: !274, size: 64, offset: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "v_u", file: !167, line: 113, size: 64, elements: !275)
!275 = !{!276, !277, !290, !293, !294, !295, !297, !299, !300}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !274, file: !167, line: 114, baseType: !25, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !274, file: !167, line: 115, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "array", file: !122, line: 31, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 25, size: 192, elements: !282)
!282 = !{!283, !287, !288, !289}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !281, file: !122, line: 26, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "data_unset", file: !122, line: 23, baseType: !202)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !281, file: !122, line: 27, baseType: !284, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !281, file: !122, line: 29, baseType: !108, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !281, file: !122, line: 30, baseType: !108, size: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !274, file: !167, line: 116, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !274, file: !167, line: 117, baseType: !114, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !274, file: !167, line: 118, baseType: !15, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "shrt", scope: !274, file: !167, line: 119, baseType: !296, size: 16)
!296 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !274, file: !167, line: 120, baseType: !298, size: 64)
!298 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !274, file: !167, line: 121, baseType: !139, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "u2", scope: !274, file: !167, line: 122, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 2)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !261, file: !2, line: 31, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin", file: !307, line: 44, size: 1600, elements: !308)
!307 = !DIFile(filename: "spack-src/src/plugin.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "192af98aba6a36b0ed1725683acdb1fd")
!308 = !{!309, !310, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !557, !558, !559, !561, !562, !568, !572, !573, !574, !575, !579, !580, !581}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !307, line: 45, baseType: !25, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "handle_uri_raw", scope: !306, file: !307, line: 47, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!12, !314, !25}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_st", file: !13, line: 19, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request_st", file: !30, line: 122, size: 6400, elements: !317)
!317 = !{!318, !320, !321, !322, !323, !327, !328, !332, !336, !338, !340, !344, !346, !350, !351, !360, !371, !372, !417, !418, !421, !422, !430, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !468, !469, !470, !480, !481, !482, !494, !495, !496, !542, !543}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !316, file: !30, line: 123, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_state_t", file: !30, line: 120, baseType: !29)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "http_status", scope: !316, file: !30, line: 124, baseType: !45, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "h2state", scope: !316, file: !30, line: 125, baseType: !108, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "h2id", scope: !316, file: !30, line: 126, baseType: !108, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "h2_rwin", scope: !316, file: !30, line: 127, baseType: !324, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !325, line: 26, baseType: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !111, line: 41, baseType: !45)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "h2_swin", scope: !316, file: !30, line: 128, baseType: !324, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "h2_rwin_fudge", scope: !316, file: !30, line: 129, baseType: !329, size: 16, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !325, line: 25, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !111, line: 39, baseType: !331)
!331 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "h2_prio", scope: !316, file: !30, line: 130, baseType: !333, size: 8, offset: 208)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !109, line: 24, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !111, line: 38, baseType: !335)
!335 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "http_method", scope: !316, file: !30, line: 132, baseType: !337, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_method_t", file: !44, line: 59, baseType: !43)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "http_version", scope: !316, file: !30, line: 133, baseType: !339, size: 32, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_version_t", file: !44, line: 61, baseType: !88)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "handler_module", scope: !316, file: !30, line: 135, baseType: !341, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "plugin", file: !13, line: 16, baseType: !306)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_ctx", scope: !316, file: !30, line: 136, baseType: !345, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "con", scope: !316, file: !30, line: 137, baseType: !347, size: 64, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "connection", file: !13, line: 10, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "connection", file: !13, line: 9, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "conditional_is_valid", scope: !316, file: !30, line: 140, baseType: !108, size: 32, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cond_cache", scope: !316, file: !30, line: 141, baseType: !352, size: 64, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cond_cache_t", file: !167, line: 164, size: 16, elements: !354)
!354 = !{!355, !359}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !353, file: !167, line: 166, baseType: !356, size: 8)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !325, line: 24, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !111, line: 37, baseType: !358)
!358 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "local_result", scope: !353, file: !167, line: 168, baseType: !356, size: 8, offset: 8)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cond_match", scope: !316, file: !30, line: 142, baseType: !361, size: 64, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cond_match_t", file: !167, line: 175, size: 256, elements: !364)
!364 = !{!365, !366, !369, !370}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "comp_value", scope: !363, file: !167, line: 176, baseType: !291, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "match_data", scope: !363, file: !167, line: 178, baseType: !367, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcre2_real_match_data_8", file: !167, line: 172, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "captures", scope: !363, file: !167, line: 180, baseType: !45, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !363, file: !167, line: 181, baseType: !25, size: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "cond_match_data", scope: !316, file: !30, line: 143, baseType: !362, size: 64, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !316, file: !30, line: 145, baseType: !373, size: 960, offset: 768)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_config", file: !30, line: 78, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request_config", file: !30, line: 18, size: 960, elements: !375)
!375 = !{!376, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !413, !414, !415, !416}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "errh", scope: !374, file: !30, line: 19, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "fdlog_st", file: !13, line: 28, baseType: !96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "http_parseopts", scope: !374, file: !30, line: 20, baseType: !15, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_field_size", scope: !374, file: !30, line: 21, baseType: !108, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mimetypes", scope: !374, file: !30, line: 22, baseType: !278, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "document_root", scope: !374, file: !30, line: 25, baseType: !291, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !374, file: !30, line: 26, baseType: !291, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !374, file: !30, line: 27, baseType: !291, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_size", scope: !374, file: !30, line: 29, baseType: !15, size: 32, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "max_keep_alive_requests", scope: !374, file: !30, line: 30, baseType: !296, size: 16, offset: 416)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "max_keep_alive_idle", scope: !374, file: !30, line: 31, baseType: !296, size: 16, offset: 432)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "max_read_idle", scope: !374, file: !30, line: 32, baseType: !296, size: 16, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "max_write_idle", scope: !374, file: !30, line: 33, baseType: !296, size: 16, offset: 464)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "stream_request_body", scope: !374, file: !30, line: 34, baseType: !296, size: 16, offset: 480)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "stream_response_body", scope: !374, file: !30, line: 35, baseType: !296, size: 16, offset: 496)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "high_precision_timestamps", scope: !374, file: !30, line: 36, baseType: !15, size: 1, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "allow_http11", scope: !374, file: !30, line: 37, baseType: !15, size: 1, offset: 513, flags: DIFlagBitField, extraData: i64 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "range_requests", scope: !374, file: !30, line: 38, baseType: !15, size: 1, offset: 514, flags: DIFlagBitField, extraData: i64 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "follow_symlink", scope: !374, file: !30, line: 39, baseType: !15, size: 1, offset: 515, flags: DIFlagBitField, extraData: i64 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "etag_flags", scope: !374, file: !30, line: 40, baseType: !15, size: 3, offset: 516, flags: DIFlagBitField, extraData: i64 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "use_xattr", scope: !374, file: !30, line: 41, baseType: !15, size: 1, offset: 519, flags: DIFlagBitField, extraData: i64 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "force_lowercase_filenames", scope: !374, file: !30, line: 42, baseType: !15, size: 2, offset: 520, flags: DIFlagBitField, extraData: i64 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "error_intercept", scope: !374, file: !30, line: 43, baseType: !15, size: 1, offset: 522, flags: DIFlagBitField, extraData: i64 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "h2proto", scope: !374, file: !30, line: 45, baseType: !15, size: 2, offset: 523, flags: DIFlagBitField, extraData: i64 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "log_request_handling", scope: !374, file: !30, line: 48, baseType: !15, size: 1, offset: 525, flags: DIFlagBitField, extraData: i64 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "log_state_handling", scope: !374, file: !30, line: 49, baseType: !15, size: 1, offset: 526, flags: DIFlagBitField, extraData: i64 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "log_condition_handling", scope: !374, file: !30, line: 50, baseType: !15, size: 1, offset: 527, flags: DIFlagBitField, extraData: i64 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "log_response_header", scope: !374, file: !30, line: 51, baseType: !15, size: 1, offset: 528, flags: DIFlagBitField, extraData: i64 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "log_request_header", scope: !374, file: !30, line: 52, baseType: !15, size: 1, offset: 529, flags: DIFlagBitField, extraData: i64 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "log_request_header_on_error", scope: !374, file: !30, line: 53, baseType: !15, size: 1, offset: 530, flags: DIFlagBitField, extraData: i64 512)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "log_file_not_found", scope: !374, file: !30, line: 54, baseType: !15, size: 1, offset: 531, flags: DIFlagBitField, extraData: i64 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "log_timeouts", scope: !374, file: !30, line: 55, baseType: !15, size: 1, offset: 532, flags: DIFlagBitField, extraData: i64 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_second", scope: !374, file: !30, line: 57, baseType: !15, size: 32, offset: 544)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "global_bytes_per_second", scope: !374, file: !30, line: 58, baseType: !15, size: 32, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "global_bytes_per_second_cnt_ptr", scope: !374, file: !30, line: 72, baseType: !412, size: 64, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "error_handler", scope: !374, file: !30, line: 74, baseType: !291, size: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "error_handler_404", scope: !374, file: !30, line: 75, baseType: !291, size: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "errorfile_prefix", scope: !374, file: !30, line: 76, baseType: !291, size: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "serrh", scope: !374, file: !30, line: 77, baseType: !377, size: 64, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rqst_header_len", scope: !316, file: !30, line: 148, baseType: !108, size: 32, offset: 1728)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rqst_htags", scope: !316, file: !30, line: 149, baseType: !419, size: 64, offset: 1792)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !109, line: 27, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !111, line: 45, baseType: !185)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rqst_headers", scope: !316, file: !30, line: 150, baseType: !280, size: 192, offset: 1856)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !316, file: !30, line: 152, baseType: !423, size: 512, offset: 2048)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_uri", file: !30, line: 89, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 80, size: 512, elements: !425)
!425 = !{!426, !427, !428, !429}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !424, file: !30, line: 81, baseType: !101, size: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !424, file: !30, line: 84, baseType: !101, size: 128, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !424, file: !30, line: 87, baseType: !101, size: 128, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !424, file: !30, line: 88, baseType: !101, size: 128, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "physical", scope: !316, file: !30, line: 153, baseType: !431, size: 512, offset: 2560)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "physical", file: !30, line: 97, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 91, size: 512, elements: !433)
!433 = !{!434, !435, !436, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !432, file: !30, line: 92, baseType: !101, size: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "basedir", scope: !432, file: !30, line: 93, baseType: !101, size: 128, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "doc_root", scope: !432, file: !30, line: 95, baseType: !101, size: 128, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rel_path", scope: !432, file: !30, line: 96, baseType: !101, size: 128, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !316, file: !30, line: 154, baseType: !280, size: 192, offset: 3072)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reqbody_length", scope: !316, file: !30, line: 156, baseType: !139, size: 64, offset: 3264)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "te_chunked", scope: !316, file: !30, line: 157, baseType: !139, size: 64, offset: 3328)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "resp_body_scratchpad", scope: !316, file: !30, line: 158, baseType: !139, size: 64, offset: 3392)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "http_host", scope: !316, file: !30, line: 160, baseType: !137, size: 64, offset: 3456)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !316, file: !30, line: 161, baseType: !291, size: 64, offset: 3520)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !316, file: !30, line: 163, baseType: !101, size: 128, offset: 3584)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "target_orig", scope: !316, file: !30, line: 164, baseType: !101, size: 128, offset: 3712)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pathinfo", scope: !316, file: !30, line: 166, baseType: !101, size: 128, offset: 3840)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "server_name_buf", scope: !316, file: !30, line: 167, baseType: !101, size: 128, offset: 3968)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "resp_header_len", scope: !316, file: !30, line: 170, baseType: !108, size: 32, offset: 4096)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "resp_htags", scope: !316, file: !30, line: 171, baseType: !419, size: 64, offset: 4160)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "resp_headers", scope: !316, file: !30, line: 172, baseType: !280, size: 192, offset: 4224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "resp_body_finished", scope: !316, file: !30, line: 173, baseType: !4, size: 8, offset: 4416)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "resp_body_started", scope: !316, file: !30, line: 174, baseType: !4, size: 8, offset: 4424)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "resp_send_chunked", scope: !316, file: !30, line: 175, baseType: !4, size: 8, offset: 4432)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "resp_decode_chunked", scope: !316, file: !30, line: 176, baseType: !4, size: 8, offset: 4440)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "resp_header_repeated", scope: !316, file: !30, line: 177, baseType: !4, size: 8, offset: 4448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "loops_per_request", scope: !316, file: !30, line: 179, baseType: !4, size: 8, offset: 4456)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !316, file: !30, line: 180, baseType: !356, size: 8, offset: 4464)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "async_callback", scope: !316, file: !30, line: 181, baseType: !4, size: 8, offset: 4472)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !316, file: !30, line: 183, baseType: !137, size: 64, offset: 4480)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "gw_dechunk", scope: !316, file: !30, line: 184, baseType: !461, size: 64, offset: 4544)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "response_dechunk", file: !30, line: 103, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 99, size: 256, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gw_chunked", scope: !463, file: !30, line: 100, baseType: !139, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !463, file: !30, line: 101, baseType: !101, size: 128, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !463, file: !30, line: 102, baseType: !45, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written_ckpt", scope: !316, file: !30, line: 186, baseType: !139, size: 64, offset: 4608)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read_ckpt", scope: !316, file: !30, line: 187, baseType: !139, size: 64, offset: 4672)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "start_hp", scope: !316, file: !30, line: 188, baseType: !471, size: 128, offset: 4736)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "unix_timespec64_t", file: !472, line: 135, baseType: !473)
!472 = !DIFile(filename: "spack-src/src/first.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "db942007b87b5a60f6bd859b991a2b7a")
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !474, line: 11, size: 128, elements: !475)
!474 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!475 = !{!476, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !473, file: !474, line: 16, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !111, line: 160, baseType: !142)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !473, file: !474, line: 21, baseType: !479, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !111, line: 197, baseType: !142)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "error_handler_saved_status", scope: !316, file: !30, line: 190, baseType: !45, size: 32, offset: 4864)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "error_handler_saved_method", scope: !316, file: !30, line: 191, baseType: !337, size: 32, offset: 4896)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !316, file: !30, line: 193, baseType: !483, size: 448, offset: 4928)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chunkqueue", file: !130, line: 46, size: 448, elements: !484)
!484 = !{!485, !488, !489, !490, !491, !492, !493}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !483, file: !130, line: 47, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk", file: !130, line: 44, baseType: !131)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !483, file: !130, line: 48, baseType: !486, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in", scope: !483, file: !130, line: 50, baseType: !139, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_out", scope: !483, file: !130, line: 50, baseType: !139, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tempdirs", scope: !483, file: !130, line: 52, baseType: !278, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "upload_temp_file_size", scope: !483, file: !130, line: 53, baseType: !139, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tempdir_idx", scope: !483, file: !130, line: 54, baseType: !15, size: 32, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "read_queue", scope: !316, file: !30, line: 194, baseType: !483, size: 448, offset: 5376)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reqbody_queue", scope: !316, file: !30, line: 195, baseType: !483, size: 448, offset: 5824)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_sce", scope: !316, file: !30, line: 197, baseType: !497, size: 64, offset: 6272)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat_cache_entry", file: !499, line: 14, size: 1728, elements: !500)
!499 = !DIFile(filename: "spack-src/src/stat_cache.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "e4866da9655f8a910e91fd853f8cc12f")
!500 = !{!501, !502, !506, !507, !508, !509, !510, !511}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !498, file: !499, line: 15, baseType: !101, size: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ts", scope: !498, file: !499, line: 16, baseType: !503, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "unix_time64_t", file: !472, line: 134, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !505, line: 10, baseType: !477)
!505 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !498, file: !499, line: 17, baseType: !45, size: 32, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !498, file: !499, line: 18, baseType: !45, size: 32, offset: 224)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fam_dir", scope: !498, file: !499, line: 20, baseType: !25, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !498, file: !499, line: 22, baseType: !101, size: 128, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !498, file: !499, line: 23, baseType: !101, size: 128, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !498, file: !499, line: 24, baseType: !512, size: 1152, offset: 576)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !513, line: 26, size: 1152, elements: !514)
!513 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!514 = !{!515, !517, !519, !521, !523, !525, !527, !528, !529, !531, !533, !535, !536, !537, !538}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !512, file: !513, line: 31, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !111, line: 145, baseType: !185)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !512, file: !513, line: 36, baseType: !518, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !111, line: 148, baseType: !185)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !512, file: !513, line: 44, baseType: !520, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !111, line: 151, baseType: !185)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !512, file: !513, line: 45, baseType: !522, size: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !111, line: 150, baseType: !15)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !512, file: !513, line: 47, baseType: !524, size: 32, offset: 224)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !111, line: 146, baseType: !15)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !512, file: !513, line: 48, baseType: !526, size: 32, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !111, line: 147, baseType: !15)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !512, file: !513, line: 50, baseType: !45, size: 32, offset: 288)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !512, file: !513, line: 52, baseType: !516, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !512, file: !513, line: 57, baseType: !530, size: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 152, baseType: !142)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !512, file: !513, line: 61, baseType: !532, size: 64, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !111, line: 175, baseType: !142)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !512, file: !513, line: 63, baseType: !534, size: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !111, line: 180, baseType: !142)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !512, file: !513, line: 74, baseType: !473, size: 128, offset: 576)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !512, file: !513, line: 75, baseType: !473, size: 128, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !512, file: !513, line: 76, baseType: !473, size: 128, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !512, file: !513, line: 89, baseType: !539, size: 192, offset: 960)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 192, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 3)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cond_captures", scope: !316, file: !30, line: 198, baseType: !45, size: 32, offset: 6336)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "h2_connect_ext", scope: !316, file: !30, line: 199, baseType: !45, size: 32, offset: 6368)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "handle_uri_clean", scope: !306, file: !307, line: 48, baseType: !311, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "handle_docroot", scope: !306, file: !307, line: 49, baseType: !311, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "handle_physical", scope: !306, file: !307, line: 50, baseType: !311, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "handle_request_env", scope: !306, file: !307, line: 51, baseType: !311, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "handle_request_done", scope: !306, file: !307, line: 52, baseType: !311, size: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "handle_subrequest_start", scope: !306, file: !307, line: 53, baseType: !311, size: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "handle_subrequest", scope: !306, file: !307, line: 54, baseType: !311, size: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "handle_response_start", scope: !306, file: !307, line: 55, baseType: !311, size: 64, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "handle_request_reset", scope: !306, file: !307, line: 56, baseType: !311, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "handle_connection_accept", scope: !306, file: !307, line: 58, baseType: !554, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!12, !347, !25}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "handle_connection_shut_wr", scope: !306, file: !307, line: 59, baseType: !554, size: 64, offset: 768)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "handle_connection_close", scope: !306, file: !307, line: 60, baseType: !554, size: 64, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "handle_trigger", scope: !306, file: !307, line: 62, baseType: !560, size: 64, offset: 896)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "handle_sighup", scope: !306, file: !307, line: 63, baseType: !560, size: 64, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "handle_waitpid", scope: !306, file: !307, line: 64, baseType: !563, size: 64, offset: 1024)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!12, !22, !25, !566, !45}
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !140, line: 97, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !111, line: 154, baseType: !45)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !306, file: !307, line: 66, baseType: !569, size: 64, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!25}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "priv_defaults", scope: !306, file: !307, line: 67, baseType: !560, size: 64, offset: 1152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "set_defaults", scope: !306, file: !307, line: 68, baseType: !560, size: 64, offset: 1216)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "worker_init", scope: !306, file: !307, line: 69, baseType: !560, size: 64, offset: 1280)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !306, file: !307, line: 70, baseType: !576, size: 64, offset: 1344)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !25}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 72, baseType: !114, size: 64, offset: 1408)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !306, file: !307, line: 73, baseType: !183, size: 64, offset: 1472)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !306, file: !307, line: 74, baseType: !25, size: 64, offset: 1536)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !261, file: !2, line: 32, baseType: !583, size: 320, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "plugin_config", file: !2, line: 28, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 21, size: 320, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_user", scope: !584, file: !2, line: 22, baseType: !278, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "include_user", scope: !584, file: !2, line: 23, baseType: !278, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !584, file: !2, line: 24, baseType: !291, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "basepath", scope: !584, file: !2, line: 25, baseType: !291, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "letterhomes", scope: !584, file: !2, line: 26, baseType: !296, size: 16, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !584, file: !2, line: 27, baseType: !296, size: 16, offset: 272)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !261, file: !2, line: 33, baseType: !583, size: 320, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cache_ts", scope: !261, file: !2, line: 34, baseType: !594, size: 128, offset: 832)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 128, elements: !302)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cache_user", scope: !261, file: !2, line: 35, baseType: !596, size: 256, offset: 960)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 256, elements: !302)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cache_path", scope: !261, file: !2, line: 36, baseType: !596, size: 256, offset: 1216)
!598 = !DILocalVariable(name: "i", scope: !599, file: !2, line: 121, type: !45)
!599 = distinct !DILexicalBlock(scope: !9, file: !2, line: 121, column: 5)
!600 = !DILocalVariable(name: "cpv", scope: !601, file: !2, line: 122, type: !266)
!601 = distinct !DILexicalBlock(scope: !602, file: !2, line: 121, column: 62)
!602 = distinct !DILexicalBlock(scope: !599, file: !2, line: 121, column: 5)
!603 = !DILocalVariable(name: "cpv", scope: !604, file: !2, line: 149, type: !606)
!604 = distinct !DILexicalBlock(scope: !605, file: !2, line: 148, column: 47)
!605 = distinct !DILexicalBlock(scope: !9, file: !2, line: 148, column: 9)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 896, elements: !617)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_plugin_keys_t", file: !167, line: 132, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 126, size: 128, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !611, file: !167, line: 127, baseType: !114, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "klen", scope: !611, file: !167, line: 128, baseType: !333, size: 8, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !611, file: !167, line: 130, baseType: !333, size: 8, offset: 72)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !611, file: !167, line: 131, baseType: !333, size: 8, offset: 80)
!617 = !{!618}
!618 = !DISubrange(count: 7)
!619 = !{i32 7, !"Dwarf Version", i32 5}
!620 = !{i32 2, !"Debug Info Version", i32 3}
!621 = !{i32 1, !"wchar_size", i32 4}
!622 = !{i32 8, !"PIC Level", i32 2}
!623 = !{i32 7, !"uwtable", i32 2}
!624 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!625 = distinct !DISubprogram(name: "mod_userdir_plugin_init", scope: !2, file: !2, line: 335, type: !626, scopeLine: 335, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !629)
!626 = !DISubroutineType(types: !627)
!627 = !{!45, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!629 = !{!630}
!630 = !DILocalVariable(name: "p", arg: 1, scope: !625, file: !2, line: 335, type: !628)
!631 = !{!632, !632, i64 0}
!632 = !{!"any pointer", !633, i64 0}
!633 = !{!"omnipotent char", !634, i64 0}
!634 = !{!"Simple C/C++ TBAA"}
!635 = !DILocation(line: 335, column: 37, scope: !625)
!636 = !DILocation(line: 336, column: 2, scope: !625)
!637 = !DILocation(line: 336, column: 5, scope: !625)
!638 = !DILocation(line: 336, column: 17, scope: !625)
!639 = !{!640, !641, i64 184}
!640 = !{!"plugin", !632, i64 0, !632, i64 8, !632, i64 16, !632, i64 24, !632, i64 32, !632, i64 40, !632, i64 48, !632, i64 56, !632, i64 64, !632, i64 72, !632, i64 80, !632, i64 88, !632, i64 96, !632, i64 104, !632, i64 112, !632, i64 120, !632, i64 128, !632, i64 136, !632, i64 144, !632, i64 152, !632, i64 160, !632, i64 168, !632, i64 176, !641, i64 184, !632, i64 192}
!641 = !{!"long", !633, i64 0}
!642 = !DILocation(line: 337, column: 2, scope: !625)
!643 = !DILocation(line: 337, column: 5, scope: !625)
!644 = !DILocation(line: 337, column: 17, scope: !625)
!645 = !{!640, !632, i64 176}
!646 = !DILocation(line: 339, column: 2, scope: !625)
!647 = !DILocation(line: 339, column: 5, scope: !625)
!648 = !DILocation(line: 339, column: 20, scope: !625)
!649 = !{!640, !632, i64 136}
!650 = !DILocation(line: 340, column: 2, scope: !625)
!651 = !DILocation(line: 340, column: 5, scope: !625)
!652 = !DILocation(line: 340, column: 20, scope: !625)
!653 = !{!640, !632, i64 168}
!654 = !DILocation(line: 341, column: 2, scope: !625)
!655 = !DILocation(line: 341, column: 5, scope: !625)
!656 = !DILocation(line: 341, column: 21, scope: !625)
!657 = !{!640, !632, i64 32}
!658 = !DILocation(line: 342, column: 2, scope: !625)
!659 = !DILocation(line: 342, column: 5, scope: !625)
!660 = !DILocation(line: 342, column: 20, scope: !625)
!661 = !{!640, !632, i64 152}
!662 = !DILocation(line: 344, column: 2, scope: !625)
!663 = distinct !DISubprogram(name: "mod_userdir_init", scope: !2, file: !2, line: 39, type: !570, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !26)
!664 = !DILocation(line: 40, column: 12, scope: !663)
!665 = !DILocation(line: 40, column: 5, scope: !663)
!666 = distinct !DISubprogram(name: "mod_userdir_free", scope: !2, file: !2, line: 43, type: !577, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !667)
!667 = !{!668, !669}
!668 = !DILocalVariable(name: "p_d", arg: 1, scope: !666, file: !2, line: 43, type: !25)
!669 = !DILocalVariable(name: "p", scope: !666, file: !2, line: 44, type: !258)
!670 = !DILocation(line: 43, column: 1, scope: !666)
!671 = !DILocation(line: 44, column: 5, scope: !666)
!672 = !DILocation(line: 44, column: 25, scope: !666)
!673 = !DILocation(line: 44, column: 29, scope: !666)
!674 = !DILocation(line: 45, column: 10, scope: !666)
!675 = !DILocation(line: 45, column: 13, scope: !666)
!676 = !DILocation(line: 45, column: 27, scope: !666)
!677 = !{!678, !632, i64 0}
!678 = !{!"", !632, i64 0, !679, i64 8, !679, i64 12}
!679 = !{!"int", !633, i64 0}
!680 = !DILocation(line: 45, column: 5, scope: !666)
!681 = !DILocation(line: 46, column: 10, scope: !666)
!682 = !DILocation(line: 46, column: 13, scope: !666)
!683 = !DILocation(line: 46, column: 27, scope: !666)
!684 = !DILocation(line: 46, column: 5, scope: !666)
!685 = !DILocation(line: 47, column: 10, scope: !666)
!686 = !DILocation(line: 47, column: 13, scope: !666)
!687 = !DILocation(line: 47, column: 27, scope: !666)
!688 = !DILocation(line: 47, column: 5, scope: !666)
!689 = !DILocation(line: 48, column: 10, scope: !666)
!690 = !DILocation(line: 48, column: 13, scope: !666)
!691 = !DILocation(line: 48, column: 27, scope: !666)
!692 = !DILocation(line: 48, column: 5, scope: !666)
!693 = !DILocation(line: 49, column: 1, scope: !666)
!694 = distinct !DISubprogram(name: "mod_userdir_docroot_handler", scope: !2, file: !2, line: 280, type: !312, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !695)
!695 = !{!696, !697, !698, !699, !701, !702}
!696 = !DILocalVariable(name: "r", arg: 1, scope: !694, file: !2, line: 280, type: !314)
!697 = !DILocalVariable(name: "p_d", arg: 2, scope: !694, file: !2, line: 280, type: !25)
!698 = !DILocalVariable(name: "p", scope: !694, file: !2, line: 290, type: !258)
!699 = !DILocalVariable(name: "uptr", scope: !694, file: !2, line: 298, type: !700)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!701 = !DILocalVariable(name: "rel_url", scope: !694, file: !2, line: 299, type: !700)
!702 = !DILocalVariable(name: "ulen", scope: !694, file: !2, line: 308, type: !703)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!704 = !DILocation(line: 280, column: 1, scope: !694)
!705 = !DILocation(line: 287, column: 9, scope: !706)
!706 = distinct !DILexicalBlock(scope: !694, file: !2, line: 287, column: 9)
!707 = !DILocation(line: 287, column: 12, scope: !706)
!708 = !DILocation(line: 287, column: 16, scope: !706)
!709 = !DILocation(line: 287, column: 21, scope: !706)
!710 = !{!711, !632, i64 288}
!711 = !{!"request_st", !633, i64 0, !679, i64 4, !679, i64 8, !679, i64 12, !679, i64 16, !679, i64 20, !712, i64 24, !633, i64 26, !633, i64 28, !633, i64 32, !632, i64 40, !632, i64 48, !632, i64 56, !679, i64 64, !632, i64 72, !632, i64 80, !632, i64 88, !713, i64 96, !679, i64 216, !641, i64 224, !714, i64 232, !715, i64 256, !715, i64 320, !714, i64 384, !641, i64 408, !641, i64 416, !641, i64 424, !632, i64 432, !632, i64 440, !678, i64 448, !678, i64 464, !678, i64 480, !678, i64 496, !679, i64 512, !641, i64 520, !714, i64 528, !633, i64 552, !633, i64 553, !633, i64 554, !633, i64 555, !633, i64 556, !633, i64 557, !633, i64 558, !633, i64 559, !632, i64 560, !632, i64 568, !641, i64 576, !641, i64 584, !716, i64 592, !679, i64 608, !633, i64 612, !717, i64 616, !717, i64 672, !717, i64 728, !632, i64 784, !679, i64 792, !679, i64 796}
!712 = !{!"short", !633, i64 0}
!713 = !{!"request_config", !632, i64 0, !679, i64 8, !679, i64 12, !632, i64 16, !632, i64 24, !632, i64 32, !632, i64 40, !679, i64 48, !712, i64 52, !712, i64 54, !712, i64 56, !712, i64 58, !712, i64 60, !712, i64 62, !679, i64 64, !679, i64 64, !679, i64 64, !679, i64 64, !679, i64 64, !679, i64 64, !679, i64 65, !679, i64 65, !679, i64 65, !679, i64 65, !679, i64 65, !679, i64 65, !679, i64 66, !679, i64 66, !679, i64 66, !679, i64 66, !679, i64 66, !679, i64 68, !679, i64 72, !632, i64 80, !632, i64 88, !632, i64 96, !632, i64 104, !632, i64 112}
!714 = !{!"", !632, i64 0, !632, i64 8, !679, i64 16, !679, i64 20}
!715 = !{!"", !678, i64 0, !678, i64 16, !678, i64 32, !678, i64 48}
!716 = !{!"timespec", !641, i64 0, !641, i64 8}
!717 = !{!"chunkqueue", !632, i64 0, !632, i64 8, !641, i64 16, !641, i64 24, !632, i64 32, !641, i64 40, !679, i64 48}
!718 = !{!633, !633, i64 0}
!719 = !DILocation(line: 287, column: 28, scope: !706)
!720 = !DILocation(line: 287, column: 35, scope: !706)
!721 = !DILocation(line: 288, column: 9, scope: !706)
!722 = !DILocation(line: 288, column: 12, scope: !706)
!723 = !DILocation(line: 288, column: 16, scope: !706)
!724 = !DILocation(line: 288, column: 21, scope: !706)
!725 = !DILocation(line: 288, column: 28, scope: !706)
!726 = !DILocation(line: 287, column: 9, scope: !694)
!727 = !DILocation(line: 288, column: 36, scope: !706)
!728 = !DILocation(line: 290, column: 5, scope: !694)
!729 = !DILocation(line: 290, column: 25, scope: !694)
!730 = !DILocation(line: 290, column: 29, scope: !694)
!731 = !DILocation(line: 291, column: 30, scope: !694)
!732 = !DILocation(line: 291, column: 33, scope: !694)
!733 = !DILocation(line: 291, column: 5, scope: !694)
!734 = !DILocation(line: 296, column: 10, scope: !735)
!735 = distinct !DILexicalBlock(scope: !694, file: !2, line: 296, column: 9)
!736 = !DILocation(line: 296, column: 13, scope: !735)
!737 = !DILocation(line: 296, column: 18, scope: !735)
!738 = !{!739, !712, i64 98}
!739 = !{!"", !679, i64 0, !679, i64 4, !632, i64 8, !632, i64 16, !740, i64 24, !740, i64 64, !633, i64 104, !633, i64 120, !633, i64 152}
!740 = !{!"", !632, i64 0, !632, i64 8, !632, i64 16, !632, i64 24, !712, i64 32, !712, i64 34}
!741 = !DILocation(line: 296, column: 25, scope: !735)
!742 = !DILocation(line: 296, column: 29, scope: !735)
!743 = !DILocation(line: 296, column: 32, scope: !735)
!744 = !DILocation(line: 296, column: 37, scope: !735)
!745 = !{!739, !632, i64 80}
!746 = !DILocation(line: 296, column: 9, scope: !694)
!747 = !DILocation(line: 296, column: 43, scope: !735)
!748 = !DILocation(line: 298, column: 5, scope: !694)
!749 = !DILocation(line: 298, column: 24, scope: !694)
!750 = !DILocation(line: 298, column: 31, scope: !694)
!751 = !DILocation(line: 298, column: 34, scope: !694)
!752 = !DILocation(line: 298, column: 38, scope: !694)
!753 = !DILocation(line: 298, column: 43, scope: !694)
!754 = !DILocation(line: 298, column: 47, scope: !694)
!755 = !DILocation(line: 299, column: 5, scope: !694)
!756 = !DILocation(line: 299, column: 24, scope: !694)
!757 = !DILocation(line: 299, column: 41, scope: !694)
!758 = !DILocation(line: 299, column: 34, scope: !694)
!759 = !DILocation(line: 300, column: 17, scope: !760)
!760 = distinct !DILexicalBlock(scope: !694, file: !2, line: 300, column: 9)
!761 = !DILocation(line: 300, column: 14, scope: !760)
!762 = !DILocation(line: 300, column: 9, scope: !694)
!763 = !DILocation(line: 301, column: 15, scope: !764)
!764 = distinct !DILexicalBlock(scope: !765, file: !2, line: 301, column: 13)
!765 = distinct !DILexicalBlock(scope: !760, file: !2, line: 300, column: 26)
!766 = !DILocation(line: 301, column: 14, scope: !764)
!767 = !DILocation(line: 301, column: 13, scope: !765)
!768 = !DILocation(line: 301, column: 21, scope: !764)
!769 = !DILocation(line: 303, column: 45, scope: !765)
!770 = !DILocation(line: 303, column: 9, scope: !765)
!771 = !DILocation(line: 304, column: 9, scope: !765)
!772 = !DILocation(line: 308, column: 5, scope: !694)
!773 = !DILocation(line: 308, column: 18, scope: !694)
!774 = !DILocation(line: 308, column: 34, scope: !694)
!775 = !DILocation(line: 308, column: 44, scope: !694)
!776 = !DILocation(line: 308, column: 42, scope: !694)
!777 = !{!641, !641, i64 0}
!778 = !DILocation(line: 309, column: 14, scope: !779)
!779 = distinct !DILexicalBlock(scope: !694, file: !2, line: 309, column: 9)
!780 = !DILocation(line: 309, column: 11, scope: !779)
!781 = !DILocation(line: 309, column: 9, scope: !694)
!782 = !DILocation(line: 309, column: 20, scope: !779)
!783 = !DILocation(line: 315, column: 9, scope: !784)
!784 = distinct !DILexicalBlock(scope: !694, file: !2, line: 315, column: 9)
!785 = !DILocation(line: 315, column: 12, scope: !784)
!786 = !DILocation(line: 315, column: 17, scope: !784)
!787 = !{!739, !632, i64 64}
!788 = !DILocation(line: 315, column: 9, scope: !694)
!789 = !DILocation(line: 318, column: 14, scope: !790)
!790 = distinct !DILexicalBlock(scope: !791, file: !2, line: 318, column: 13)
!791 = distinct !DILexicalBlock(scope: !784, file: !2, line: 315, column: 31)
!792 = !DILocation(line: 318, column: 17, scope: !790)
!793 = !DILocation(line: 318, column: 22, scope: !790)
!794 = !DILocation(line: 318, column: 13, scope: !791)
!795 = !DILocation(line: 319, column: 36, scope: !790)
!796 = !DILocation(line: 319, column: 39, scope: !790)
!797 = !DILocation(line: 319, column: 44, scope: !790)
!798 = !DILocation(line: 319, column: 58, scope: !790)
!799 = !DILocation(line: 319, column: 64, scope: !790)
!800 = !DILocation(line: 319, column: 15, scope: !790)
!801 = !DILocation(line: 318, column: 13, scope: !790)
!802 = !DILocation(line: 320, column: 39, scope: !790)
!803 = !DILocation(line: 320, column: 42, scope: !790)
!804 = !DILocation(line: 320, column: 47, scope: !790)
!805 = !DILocation(line: 320, column: 61, scope: !790)
!806 = !DILocation(line: 320, column: 67, scope: !790)
!807 = !DILocation(line: 320, column: 15, scope: !790)
!808 = !DILocation(line: 321, column: 13, scope: !790)
!809 = !DILocation(line: 322, column: 5, scope: !791)
!810 = !DILocation(line: 324, column: 9, scope: !811)
!811 = distinct !DILexicalBlock(scope: !694, file: !2, line: 324, column: 9)
!812 = !DILocation(line: 324, column: 12, scope: !811)
!813 = !DILocation(line: 324, column: 17, scope: !811)
!814 = !{!739, !632, i64 72}
!815 = !DILocation(line: 324, column: 9, scope: !694)
!816 = !DILocation(line: 325, column: 35, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !2, line: 325, column: 13)
!818 = distinct !DILexicalBlock(scope: !811, file: !2, line: 324, column: 31)
!819 = !DILocation(line: 325, column: 38, scope: !817)
!820 = !DILocation(line: 325, column: 43, scope: !817)
!821 = !DILocation(line: 325, column: 57, scope: !817)
!822 = !DILocation(line: 325, column: 63, scope: !817)
!823 = !DILocation(line: 325, column: 14, scope: !817)
!824 = !DILocation(line: 325, column: 13, scope: !818)
!825 = !DILocation(line: 326, column: 13, scope: !817)
!826 = !DILocation(line: 327, column: 5, scope: !818)
!827 = !DILocation(line: 329, column: 42, scope: !694)
!828 = !DILocation(line: 329, column: 45, scope: !694)
!829 = !DILocation(line: 329, column: 48, scope: !694)
!830 = !DILocation(line: 329, column: 54, scope: !694)
!831 = !DILocation(line: 329, column: 12, scope: !694)
!832 = !DILocation(line: 329, column: 5, scope: !694)
!833 = !DILocation(line: 330, column: 1, scope: !694)
!834 = !DILocation(line: 90, column: 1, scope: !9)
!835 = !DILocation(line: 115, column: 5, scope: !9)
!836 = !DILocation(line: 115, column: 25, scope: !9)
!837 = !DILocation(line: 115, column: 29, scope: !9)
!838 = !DILocation(line: 116, column: 36, scope: !839)
!839 = distinct !DILexicalBlock(scope: !9, file: !2, line: 116, column: 9)
!840 = !DILocation(line: 116, column: 41, scope: !839)
!841 = !DILocation(line: 116, column: 10, scope: !839)
!842 = !DILocation(line: 116, column: 9, scope: !9)
!843 = !DILocation(line: 117, column: 9, scope: !839)
!844 = !DILocation(line: 121, column: 10, scope: !599)
!845 = !DILocation(line: 121, column: 14, scope: !599)
!846 = !DILocation(line: 121, column: 19, scope: !599)
!847 = !DILocation(line: 121, column: 22, scope: !599)
!848 = !{!739, !632, i64 8}
!849 = !DILocation(line: 121, column: 32, scope: !599)
!850 = !DILocation(line: 121, column: 18, scope: !599)
!851 = !{!679, !679, i64 0}
!852 = !DILocation(line: 121, column: 41, scope: !602)
!853 = !DILocation(line: 121, column: 45, scope: !602)
!854 = !DILocation(line: 121, column: 48, scope: !602)
!855 = !{!739, !679, i64 4}
!856 = !DILocation(line: 121, column: 43, scope: !602)
!857 = !DILocation(line: 121, column: 5, scope: !599)
!858 = !DILocation(line: 121, column: 5, scope: !602)
!859 = !DILocation(line: 122, column: 9, scope: !601)
!860 = !DILocation(line: 122, column: 32, scope: !601)
!861 = !DILocation(line: 122, column: 38, scope: !601)
!862 = !DILocation(line: 122, column: 41, scope: !601)
!863 = !DILocation(line: 122, column: 50, scope: !601)
!864 = !DILocation(line: 122, column: 53, scope: !601)
!865 = !DILocation(line: 122, column: 60, scope: !601)
!866 = !DILocation(line: 122, column: 63, scope: !601)
!867 = !DILocation(line: 122, column: 48, scope: !601)
!868 = !DILocation(line: 123, column: 9, scope: !601)
!869 = !DILocation(line: 123, column: 22, scope: !870)
!870 = distinct !DILexicalBlock(scope: !871, file: !2, line: 123, column: 9)
!871 = distinct !DILexicalBlock(scope: !601, file: !2, line: 123, column: 9)
!872 = !DILocation(line: 123, column: 27, scope: !870)
!873 = !{!874, !679, i64 0}
!874 = !{!"config_plugin_value", !679, i64 0, !633, i64 4, !633, i64 8}
!875 = !DILocation(line: 123, column: 19, scope: !870)
!876 = !DILocation(line: 123, column: 9, scope: !871)
!877 = !DILocation(line: 124, column: 21, scope: !878)
!878 = distinct !DILexicalBlock(scope: !870, file: !2, line: 123, column: 40)
!879 = !DILocation(line: 124, column: 26, scope: !878)
!880 = !DILocation(line: 124, column: 13, scope: !878)
!881 = !DILocation(line: 128, column: 17, scope: !882)
!882 = distinct !DILexicalBlock(scope: !878, file: !2, line: 124, column: 32)
!883 = !DILocation(line: 130, column: 37, scope: !884)
!884 = distinct !DILexicalBlock(scope: !882, file: !2, line: 130, column: 21)
!885 = !DILocation(line: 130, column: 42, scope: !884)
!886 = !DILocation(line: 130, column: 44, scope: !884)
!887 = !DILocation(line: 130, column: 21, scope: !884)
!888 = !DILocation(line: 130, column: 21, scope: !882)
!889 = !DILocation(line: 131, column: 21, scope: !884)
!890 = !DILocation(line: 131, column: 26, scope: !884)
!891 = !DILocation(line: 131, column: 30, scope: !884)
!892 = !DILocation(line: 132, column: 17, scope: !882)
!893 = !DILocation(line: 135, column: 17, scope: !882)
!894 = !DILocation(line: 137, column: 17, scope: !882)
!895 = !DILocation(line: 139, column: 9, scope: !878)
!896 = !DILocation(line: 123, column: 33, scope: !870)
!897 = !DILocation(line: 123, column: 9, scope: !870)
!898 = distinct !{!898, !876, !899, !900}
!899 = !DILocation(line: 139, column: 9, scope: !871)
!900 = !{!"llvm.loop.mustprogress"}
!901 = !DILocation(line: 140, column: 5, scope: !602)
!902 = !DILocation(line: 140, column: 5, scope: !601)
!903 = !DILocation(line: 121, column: 57, scope: !602)
!904 = distinct !{!904, !857, !905, !900}
!905 = !DILocation(line: 140, column: 5, scope: !599)
!906 = !DILocation(line: 145, column: 5, scope: !9)
!907 = !DILocation(line: 145, column: 8, scope: !9)
!908 = !DILocation(line: 145, column: 17, scope: !9)
!909 = !DILocation(line: 145, column: 24, scope: !9)
!910 = !{!739, !712, i64 58}
!911 = !DILocation(line: 148, column: 9, scope: !605)
!912 = !DILocation(line: 148, column: 12, scope: !605)
!913 = !DILocation(line: 148, column: 20, scope: !605)
!914 = !DILocation(line: 148, column: 24, scope: !605)
!915 = !DILocation(line: 148, column: 27, scope: !605)
!916 = !DILocation(line: 148, column: 30, scope: !605)
!917 = !DILocation(line: 148, column: 38, scope: !605)
!918 = !DILocation(line: 148, column: 9, scope: !9)
!919 = !DILocation(line: 149, column: 9, scope: !604)
!920 = !DILocation(line: 149, column: 38, scope: !604)
!921 = !DILocation(line: 149, column: 44, scope: !604)
!922 = !DILocation(line: 149, column: 47, scope: !604)
!923 = !DILocation(line: 149, column: 56, scope: !604)
!924 = !DILocation(line: 149, column: 59, scope: !604)
!925 = !DILocation(line: 149, column: 67, scope: !604)
!926 = !DILocation(line: 149, column: 54, scope: !604)
!927 = !DILocation(line: 150, column: 19, scope: !928)
!928 = distinct !DILexicalBlock(scope: !604, file: !2, line: 150, column: 13)
!929 = !DILocation(line: 150, column: 24, scope: !928)
!930 = !DILocation(line: 150, column: 16, scope: !928)
!931 = !DILocation(line: 150, column: 13, scope: !604)
!932 = !DILocation(line: 151, column: 39, scope: !928)
!933 = !DILocation(line: 151, column: 42, scope: !928)
!934 = !DILocation(line: 151, column: 52, scope: !928)
!935 = !DILocation(line: 151, column: 13, scope: !928)
!936 = !DILocation(line: 152, column: 5, scope: !605)
!937 = !DILocation(line: 152, column: 5, scope: !604)
!938 = !DILocation(line: 154, column: 5, scope: !9)
!939 = !DILocation(line: 155, column: 1, scope: !9)
!940 = !DISubprogram(name: "ck_calloc", scope: !941, file: !941, line: 78, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!941 = !DIFile(filename: "spack-src/src/ck.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "734bf373e0ae340c3941f9a893874c6a")
!942 = !DISubroutineType(types: !943)
!943 = !{!25, !183, !183}
!944 = !DISubprogram(name: "free", scope: !945, file: !945, line: 555, type: !577, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!945 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!946 = distinct !DISubprogram(name: "mod_userdir_patch_config", scope: !2, file: !2, line: 82, type: !947, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !950)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !949, !258}
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!950 = !{!951, !952, !953, !955}
!951 = !DILocalVariable(name: "r", arg: 1, scope: !946, file: !2, line: 82, type: !949)
!952 = !DILocalVariable(name: "p", arg: 2, scope: !946, file: !2, line: 82, type: !258)
!953 = !DILocalVariable(name: "i", scope: !954, file: !2, line: 84, type: !45)
!954 = distinct !DILexicalBlock(scope: !946, file: !2, line: 84, column: 5)
!955 = !DILocalVariable(name: "used", scope: !954, file: !2, line: 84, type: !45)
!956 = !DILocation(line: 82, column: 57, scope: !946)
!957 = !DILocation(line: 82, column: 80, scope: !946)
!958 = !DILocation(line: 83, column: 13, scope: !946)
!959 = !DILocation(line: 83, column: 16, scope: !946)
!960 = !DILocation(line: 83, column: 23, scope: !946)
!961 = !DILocation(line: 83, column: 26, scope: !946)
!962 = !DILocation(line: 83, column: 5, scope: !946)
!963 = !DILocation(line: 84, column: 10, scope: !954)
!964 = !DILocation(line: 84, column: 14, scope: !954)
!965 = !DILocation(line: 84, column: 21, scope: !954)
!966 = !DILocation(line: 84, column: 28, scope: !954)
!967 = !DILocation(line: 84, column: 31, scope: !954)
!968 = !DILocation(line: 84, column: 40, scope: !969)
!969 = distinct !DILexicalBlock(scope: !954, file: !2, line: 84, column: 5)
!970 = !DILocation(line: 84, column: 44, scope: !969)
!971 = !DILocation(line: 84, column: 42, scope: !969)
!972 = !DILocation(line: 84, column: 5, scope: !954)
!973 = !DILocation(line: 84, column: 5, scope: !969)
!974 = !DILocation(line: 85, column: 31, scope: !975)
!975 = distinct !DILexicalBlock(scope: !976, file: !2, line: 85, column: 13)
!976 = distinct !DILexicalBlock(scope: !969, file: !2, line: 84, column: 55)
!977 = !DILocation(line: 85, column: 44, scope: !975)
!978 = !DILocation(line: 85, column: 47, scope: !975)
!979 = !DILocation(line: 85, column: 54, scope: !975)
!980 = !DILocation(line: 85, column: 57, scope: !975)
!981 = !DILocation(line: 85, column: 13, scope: !975)
!982 = !DILocation(line: 85, column: 13, scope: !976)
!983 = !DILocation(line: 86, column: 39, scope: !975)
!984 = !DILocation(line: 86, column: 42, scope: !975)
!985 = !DILocation(line: 86, column: 48, scope: !975)
!986 = !DILocation(line: 86, column: 51, scope: !975)
!987 = !DILocation(line: 86, column: 60, scope: !975)
!988 = !DILocation(line: 86, column: 63, scope: !975)
!989 = !DILocation(line: 86, column: 70, scope: !975)
!990 = !DILocation(line: 86, column: 73, scope: !975)
!991 = !DILocation(line: 86, column: 58, scope: !975)
!992 = !DILocation(line: 86, column: 13, scope: !975)
!993 = !DILocation(line: 87, column: 5, scope: !976)
!994 = !DILocation(line: 84, column: 50, scope: !969)
!995 = distinct !{!995, !972, !996, !900}
!996 = !DILocation(line: 87, column: 5, scope: !954)
!997 = !DILocation(line: 88, column: 1, scope: !946)
!998 = !DISubprogram(name: "strchr", scope: !999, file: !999, line: 246, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!999 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!106, !114, !45}
!1002 = !DISubprogram(name: "http_response_redirect_to_directory", scope: !1003, file: !1003, line: 50, type: !1004, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1003 = !DIFile(filename: "spack-src/src/response.h", directory: "/local-ssd/lighttpd-rpmcfxehvwqgxadux4qnum7g77xnot3q-build/aidengro/spack-stage-lighttpd-1.4.69-rpmcfxehvwqgxadux4qnum7g77xnot3q", checksumkind: CSK_MD5, checksum: "ace3bc7588d2fb066701bb10c515f1ff")
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!45, !314, !45}
!1006 = distinct !DISubprogram(name: "mod_userdir_in_vlist", scope: !2, file: !2, line: 165, type: !1007, scopeLine: 165, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !1010)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!45, !1009, !700, !703}
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!1010 = !{!1011, !1012, !1013, !1014, !1016, !1017}
!1011 = !DILocalVariable(name: "a", arg: 1, scope: !1006, file: !2, line: 165, type: !1009)
!1012 = !DILocalVariable(name: "k", arg: 2, scope: !1006, file: !2, line: 165, type: !700)
!1013 = !DILocalVariable(name: "klen", arg: 3, scope: !1006, file: !2, line: 165, type: !703)
!1014 = !DILocalVariable(name: "i", scope: !1015, file: !2, line: 166, type: !108)
!1015 = distinct !DILexicalBlock(scope: !1006, file: !2, line: 166, column: 5)
!1016 = !DILocalVariable(name: "used", scope: !1015, file: !2, line: 166, type: !108)
!1017 = !DILocalVariable(name: "ds", scope: !1018, file: !2, line: 167, type: !1020)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !2, line: 166, column: 57)
!1019 = distinct !DILexicalBlock(scope: !1015, file: !2, line: 166, column: 5)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!1021 = !DILocation(line: 165, column: 53, scope: !1006)
!1022 = !DILocation(line: 165, column: 75, scope: !1006)
!1023 = !DILocation(line: 165, column: 91, scope: !1006)
!1024 = !DILocation(line: 166, column: 10, scope: !1015)
!1025 = !DILocation(line: 166, column: 19, scope: !1015)
!1026 = !DILocation(line: 166, column: 26, scope: !1015)
!1027 = !DILocation(line: 166, column: 33, scope: !1015)
!1028 = !DILocation(line: 166, column: 36, scope: !1015)
!1029 = !{!714, !679, i64 16}
!1030 = !DILocation(line: 166, column: 42, scope: !1019)
!1031 = !DILocation(line: 166, column: 46, scope: !1019)
!1032 = !DILocation(line: 166, column: 44, scope: !1019)
!1033 = !DILocation(line: 166, column: 5, scope: !1015)
!1034 = !DILocation(line: 167, column: 9, scope: !1018)
!1035 = !DILocation(line: 167, column: 35, scope: !1018)
!1036 = !DILocation(line: 167, column: 61, scope: !1018)
!1037 = !DILocation(line: 167, column: 64, scope: !1018)
!1038 = !{!714, !632, i64 0}
!1039 = !DILocation(line: 167, column: 69, scope: !1018)
!1040 = !DILocation(line: 168, column: 29, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1018, file: !2, line: 168, column: 13)
!1042 = !DILocation(line: 168, column: 33, scope: !1041)
!1043 = !DILocation(line: 168, column: 40, scope: !1041)
!1044 = !DILocation(line: 168, column: 43, scope: !1041)
!1045 = !DILocation(line: 168, column: 13, scope: !1041)
!1046 = !DILocation(line: 168, column: 13, scope: !1018)
!1047 = !DILocation(line: 168, column: 50, scope: !1041)
!1048 = !DILocation(line: 169, column: 5, scope: !1019)
!1049 = !DILocation(line: 169, column: 5, scope: !1018)
!1050 = !DILocation(line: 166, column: 52, scope: !1019)
!1051 = !DILocation(line: 166, column: 5, scope: !1019)
!1052 = distinct !{!1052, !1033, !1053, !900}
!1053 = !DILocation(line: 169, column: 5, scope: !1015)
!1054 = !DILocation(line: 170, column: 5, scope: !1006)
!1055 = !DILocation(line: 171, column: 1, scope: !1006)
!1056 = distinct !DISubprogram(name: "mod_userdir_in_vlist_nc", scope: !2, file: !2, line: 157, type: !1007, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1063, !1064}
!1058 = !DILocalVariable(name: "a", arg: 1, scope: !1056, file: !2, line: 157, type: !1009)
!1059 = !DILocalVariable(name: "k", arg: 2, scope: !1056, file: !2, line: 157, type: !700)
!1060 = !DILocalVariable(name: "klen", arg: 3, scope: !1056, file: !2, line: 157, type: !703)
!1061 = !DILocalVariable(name: "i", scope: !1062, file: !2, line: 158, type: !108)
!1062 = distinct !DILexicalBlock(scope: !1056, file: !2, line: 158, column: 5)
!1063 = !DILocalVariable(name: "used", scope: !1062, file: !2, line: 158, type: !108)
!1064 = !DILocalVariable(name: "ds", scope: !1065, file: !2, line: 159, type: !1020)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !2, line: 158, column: 57)
!1066 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 158, column: 5)
!1067 = !DILocation(line: 157, column: 56, scope: !1056)
!1068 = !DILocation(line: 157, column: 78, scope: !1056)
!1069 = !DILocation(line: 157, column: 94, scope: !1056)
!1070 = !DILocation(line: 158, column: 10, scope: !1062)
!1071 = !DILocation(line: 158, column: 19, scope: !1062)
!1072 = !DILocation(line: 158, column: 26, scope: !1062)
!1073 = !DILocation(line: 158, column: 33, scope: !1062)
!1074 = !DILocation(line: 158, column: 36, scope: !1062)
!1075 = !DILocation(line: 158, column: 42, scope: !1066)
!1076 = !DILocation(line: 158, column: 46, scope: !1066)
!1077 = !DILocation(line: 158, column: 44, scope: !1066)
!1078 = !DILocation(line: 158, column: 5, scope: !1062)
!1079 = !DILocation(line: 159, column: 9, scope: !1065)
!1080 = !DILocation(line: 159, column: 35, scope: !1065)
!1081 = !DILocation(line: 159, column: 61, scope: !1065)
!1082 = !DILocation(line: 159, column: 64, scope: !1065)
!1083 = !DILocation(line: 159, column: 69, scope: !1065)
!1084 = !DILocation(line: 160, column: 35, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1065, file: !2, line: 160, column: 13)
!1086 = !DILocation(line: 160, column: 39, scope: !1085)
!1087 = !DILocation(line: 160, column: 46, scope: !1085)
!1088 = !DILocation(line: 160, column: 49, scope: !1085)
!1089 = !DILocation(line: 160, column: 13, scope: !1085)
!1090 = !DILocation(line: 160, column: 13, scope: !1065)
!1091 = !DILocation(line: 160, column: 56, scope: !1085)
!1092 = !DILocation(line: 161, column: 5, scope: !1066)
!1093 = !DILocation(line: 161, column: 5, scope: !1065)
!1094 = !DILocation(line: 158, column: 52, scope: !1066)
!1095 = !DILocation(line: 158, column: 5, scope: !1066)
!1096 = distinct !{!1096, !1078, !1097, !900}
!1097 = !DILocation(line: 161, column: 5, scope: !1062)
!1098 = !DILocation(line: 162, column: 5, scope: !1056)
!1099 = !DILocation(line: 163, column: 1, scope: !1056)
!1100 = distinct !DISubprogram(name: "mod_userdir_docroot_construct", scope: !2, file: !2, line: 174, type: !1101, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !26, retainedNodes: !1103)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!12, !949, !258, !700, !703}
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1112, !1114, !1118, !1119, !1121, !1123, !1135, !1139, !1140, !1142, !1145, !1148, !1152}
!1104 = !DILocalVariable(name: "r", arg: 1, scope: !1100, file: !2, line: 174, type: !949)
!1105 = !DILocalVariable(name: "p", arg: 2, scope: !1100, file: !2, line: 174, type: !258)
!1106 = !DILocalVariable(name: "uptr", arg: 3, scope: !1100, file: !2, line: 174, type: !700)
!1107 = !DILocalVariable(name: "ulen", arg: 4, scope: !1100, file: !2, line: 174, type: !703)
!1108 = !DILocalVariable(name: "u", scope: !1100, file: !2, line: 175, type: !1109)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1110)
!1110 = !{!1111}
!1111 = !DISubrange(count: 256)
!1112 = !DILocalVariable(name: "b", scope: !1100, file: !2, line: 182, type: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!1114 = !DILocalVariable(name: "cur_ts", scope: !1115, file: !2, line: 187, type: !1117)
!1115 = distinct !DILexicalBlock(scope: !1116, file: !2, line: 184, column: 28)
!1116 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 184, column: 9)
!1117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!1118 = !DILocalVariable(name: "cached", scope: !1115, file: !2, line: 188, type: !45)
!1119 = !DILocalVariable(name: "cache_sz", scope: !1115, file: !2, line: 189, type: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!1121 = !DILocalVariable(name: "i", scope: !1122, file: !2, line: 190, type: !45)
!1122 = distinct !DILexicalBlock(scope: !1115, file: !2, line: 190, column: 9)
!1123 = !DILocalVariable(name: "pwd", scope: !1115, file: !2, line: 197, type: !1124)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !1126, line: 49, size: 384, elements: !1127)
!1126 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1134}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !1125, file: !1126, line: 51, baseType: !106, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !1125, file: !1126, line: 52, baseType: !106, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !1125, file: !1126, line: 54, baseType: !524, size: 32, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !1125, file: !1126, line: 55, baseType: !526, size: 32, offset: 160)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !1125, file: !1126, line: 56, baseType: !106, size: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !1125, file: !1126, line: 57, baseType: !106, size: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !1125, file: !1126, line: 58, baseType: !106, size: 64, offset: 320)
!1135 = !DILocalVariable(name: "plen", scope: !1136, file: !2, line: 203, type: !703)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !2, line: 202, column: 39)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !2, line: 202, column: 18)
!1138 = distinct !DILexicalBlock(scope: !1115, file: !2, line: 198, column: 13)
!1139 = !DILocalVariable(name: "cache_ts", scope: !1136, file: !2, line: 211, type: !503)
!1140 = !DILocalVariable(name: "i", scope: !1141, file: !2, line: 212, type: !45)
!1141 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 212, column: 13)
!1142 = !DILocalVariable(name: "i", scope: !1143, file: !2, line: 233, type: !183)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !2, line: 233, column: 9)
!1144 = distinct !DILexicalBlock(scope: !1116, file: !2, line: 225, column: 12)
!1145 = !DILocalVariable(name: "c", scope: !1146, file: !2, line: 234, type: !1120)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !2, line: 233, column: 43)
!1147 = distinct !DILexicalBlock(scope: !1143, file: !2, line: 233, column: 9)
!1148 = !DILocalVariable(name: "i", scope: !1149, file: !2, line: 241, type: !183)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !2, line: 241, column: 13)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !2, line: 240, column: 48)
!1151 = distinct !DILexicalBlock(scope: !1144, file: !2, line: 240, column: 13)
!1152 = !DILocalVariable(name: "rel_url", scope: !1100, file: !2, line: 272, type: !106)
!1153 = !DILocation(line: 174, column: 67, scope: !1100)
!1154 = !DILocation(line: 174, column: 90, scope: !1100)
!1155 = !DILocation(line: 174, column: 112, scope: !1100)
!1156 = !DILocation(line: 174, column: 131, scope: !1100)
!1157 = !DILocation(line: 175, column: 5, scope: !1100)
!1158 = !DILocation(line: 175, column: 10, scope: !1100)
!1159 = !DILocation(line: 176, column: 9, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 176, column: 9)
!1161 = !DILocation(line: 176, column: 14, scope: !1160)
!1162 = !DILocation(line: 176, column: 9, scope: !1100)
