; ModuleID = 'samples/752.bc'
source_filename = "syst_smpl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_t = type { i32, i32, i32, i32, i32, ptr, ptr }
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { ptr, i32, ptr, i32 }
%struct.perf_event_desc_t = type { %struct.perf_event_attr, [3 x i64], [3 x i64], ptr, i64, ptr, i64, i32, i32, i32, i32, i32, ptr }
%struct.perf_event_attr = type { i32, i32, i64, %union.anon, i64, i64, i64, %union.anon.0, i32, %union.anon.1, %union.anon.2, i64, i64, i32, i32, i64, i32, i16, i16, i32, i32, i64 }
%union.anon = type { i64 }
%union.anon.0 = type { i32 }
%union.anon.1 = type { i64 }
%union.anon.2 = type { i64 }
%struct.pollfd = type { i32, i16, i16 }
%struct.perf_event_header = type { i32, i16, i16 }

@options = internal global %struct.options_t zeroinitializer, align 8, !dbg !0
@fds = internal global ptr null, align 8, !dbg !444
@num_fds = internal global i32 0, align 4, !dbg !554
@.str = private unnamed_addr constant [24 x i8] c"cannot setup event list\00", align 1, !dbg !293
@.str.1 = private unnamed_addr constant [75 x i8] c"need to set sampling period or freq on first event, use :period= or :freq=\00", align 1, !dbg !298
@pgsz = internal global i64 0, align 8, !dbg !556

!283 = !DIEnumerator(name: "PERF_RECORD_TEXT_POKE", value: 20)
!284 = !DIEnumerator(name: "PERF_RECORD_AUX_OUTPUT_HW_ID", value: 21)
!285 = !DIEnumerator(name: "PERF_RECORD_MAX", value: 22)
!286 = !{!287, !288, !289}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!288 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!292 = !{!293, !298, !303, !308, !313, !315, !320, !325, !330, !335, !340, !345, !350, !352, !379, !384, !389, !394, !399, !402, !407, !409, !411, !413, !415, !440, !442, !444, !554, !0, !556, !558, !560, !562, !567, !569, !574, !576, !581, !586, !591, !593, !598, !601, !614, !619, !621}
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !3, line: 127, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 192, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 24)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !3, line: 130, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 600, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 75)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !3, line: 164, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 184, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 23)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !3, line: 175, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 464, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 58)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !3, line: 176, type: !305, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !3, line: 185, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 152, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 19)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !3, line: 198, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 256, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 32)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !3, line: 212, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 120, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 15)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !3, line: 213, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 96, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 12)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !3, line: 285, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 272, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 34)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !3, line: 287, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 48, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 6)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !3, line: 291, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 288, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 36)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !3, line: 297, type: !295, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "ovfl_count", scope: !354, file: !3, line: 310, type: !374, isLocal: true, isDefinition: true)
!354 = distinct !DISubprogram(name: "mainloop", scope: !3, file: !3, line: 308, type: !355, scopeLine: 309, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{!288, !289}
!357 = !{!358, !359, !370, !371, !372, !373}
!358 = !DILocalVariable(name: "arg", arg: 1, scope: !354, file: !3, line: 308, type: !289)
!359 = !DILocalVariable(name: "pollfds", scope: !354, file: !3, line: 311, type: !360)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 64, elements: !368)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !362, line: 36, size: 64, elements: !363)
!362 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!363 = !{!364, !365, !367}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !361, file: !362, line: 38, baseType: !288, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !361, file: !362, line: 39, baseType: !366, size: 16, offset: 32)
!366 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !361, file: !362, line: 40, baseType: !366, size: 16, offset: 48)
!368 = !{!369}
!369 = !DISubrange(count: 1)
!370 = !DILocalVariable(name: "ret", scope: !354, file: !3, line: 312, type: !288)
!371 = !DILocalVariable(name: "fd", scope: !354, file: !3, line: 313, type: !288)
!372 = !DILocalVariable(name: "i", scope: !354, file: !3, line: 314, type: !288)
!373 = !DILabel(scope: !354, name: "terminate_session", file: !3, line: 358)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !375, line: 27, baseType: !376)
!375 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !377, line: 45, baseType: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!378 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !3, line: 317, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 240, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 30)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !3, line: 325, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 224, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 28)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !3, line: 340, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 352, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 44)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !3, line: 368, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 480, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 60)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !3, line: 385, type: !401, isLocal: true, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 8, elements: !368)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !3, line: 390, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 104, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 13)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !3, line: 395, type: !295, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !3, line: 400, type: !295, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !3, line: 419, type: !327, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !3, line: 435, type: !347, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "jbuf", scope: !2, file: !3, line: 63, type: !417, isLocal: true, isDefinition: true)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !418, line: 32, baseType: !419)
!418 = !DIFile(filename: "/usr/include/setjmp.h", directory: "", checksumkind: CSK_MD5, checksum: "cd7862ae7ed31595227c999638ae74e7")
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 1600, elements: !368)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !421, line: 26, size: 1600, elements: !422)
!421 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct___jmp_buf_tag.h", directory: "", checksumkind: CSK_MD5, checksum: "56a90a97e853c2bec1d9e290be5e92e4")
!422 = !{!423, !430, !431}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !420, file: !421, line: 32, baseType: !424, size: 512)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !425, line: 31, baseType: !426)
!425 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "", checksumkind: CSK_MD5, checksum: "80e7796efafaf357b5e64731e4f6ac30")
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 512, elements: !428)
!427 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!428 = !{!429}
!429 = !DISubrange(count: 8)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !420, file: !421, line: 33, baseType: !288, size: 32, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !420, file: !421, line: 34, baseType: !432, size: 1024, offset: 576)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !433, line: 8, baseType: !434)
!433 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 5, size: 1024, elements: !435)
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !434, file: !433, line: 7, baseType: !437, size: 1024)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 1024, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 16)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "collected_samples", scope: !2, file: !3, line: 64, type: !374, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "lost_samples", scope: !2, file: !3, line: 64, type: !374, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "fds", scope: !2, file: !3, line: 65, type: !446, isLocal: true, isDefinition: true)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "perf_event_desc_t", file: !448, line: 46, baseType: !449)
!448 = !DIFile(filename: "./perf_util.h", directory: "/local-ssd/libpfm4-eymjeez6kzzocrqb5p6y26hpb2o7cj4q-build/aidengro/spack-stage-libpfm4-4.13.0-eymjeez6kzzocrqb5p6y26hpb2o7cj4q/spack-src/perf_examples", checksumkind: CSK_MD5, checksum: "58f19a98364ac4cdad39b353d918f35f")
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 32, size: 1920, elements: !450)
!450 = !{!451, !537, !541, !542, !543, !544, !545, !548, !549, !550, !551, !552, !553}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !449, file: !448, line: 33, baseType: !452, size: 1024)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perf_event_attr", file: !6, line: 260, size: 1024, elements: !453)
!453 = !{!454, !457, !458, !459, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !509, !510, !515, !520, !521, !522, !523, !527, !528, !529, !533, !534, !535, !536}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !452, file: !6, line: 261, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !375, line: 26, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !377, line: 42, baseType: !7)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !452, file: !6, line: 262, baseType: !455, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !452, file: !6, line: 263, baseType: !374, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !6, line: 265, baseType: !460, size: 64, offset: 128)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !6, line: 265, size: 64, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sample_period", scope: !460, file: !6, line: 266, baseType: !374, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sample_freq", scope: !460, file: !6, line: 267, baseType: !374, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sample_type", scope: !452, file: !6, line: 270, baseType: !374, size: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "read_format", scope: !452, file: !6, line: 271, baseType: !374, size: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !452, file: !6, line: 273, baseType: !374, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "inherit", scope: !452, file: !6, line: 274, baseType: !374, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pinned", scope: !452, file: !6, line: 275, baseType: !374, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "exclusive", scope: !452, file: !6, line: 276, baseType: !374, size: 1, offset: 323, flags: DIFlagBitField, extraData: i64 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_user", scope: !452, file: !6, line: 277, baseType: !374, size: 1, offset: 324, flags: DIFlagBitField, extraData: i64 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_kernel", scope: !452, file: !6, line: 278, baseType: !374, size: 1, offset: 325, flags: DIFlagBitField, extraData: i64 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_hv", scope: !452, file: !6, line: 279, baseType: !374, size: 1, offset: 326, flags: DIFlagBitField, extraData: i64 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_idle", scope: !452, file: !6, line: 280, baseType: !374, size: 1, offset: 327, flags: DIFlagBitField, extraData: i64 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !452, file: !6, line: 281, baseType: !374, size: 1, offset: 328, flags: DIFlagBitField, extraData: i64 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !452, file: !6, line: 282, baseType: !374, size: 1, offset: 329, flags: DIFlagBitField, extraData: i64 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !452, file: !6, line: 283, baseType: !374, size: 1, offset: 330, flags: DIFlagBitField, extraData: i64 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "inherit_stat", scope: !452, file: !6, line: 284, baseType: !374, size: 1, offset: 331, flags: DIFlagBitField, extraData: i64 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "enable_on_exec", scope: !452, file: !6, line: 285, baseType: !374, size: 1, offset: 332, flags: DIFlagBitField, extraData: i64 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !452, file: !6, line: 286, baseType: !374, size: 1, offset: 333, flags: DIFlagBitField, extraData: i64 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !452, file: !6, line: 287, baseType: !374, size: 1, offset: 334, flags: DIFlagBitField, extraData: i64 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "precise_ip", scope: !452, file: !6, line: 288, baseType: !374, size: 2, offset: 335, flags: DIFlagBitField, extraData: i64 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_data", scope: !452, file: !6, line: 289, baseType: !374, size: 1, offset: 337, flags: DIFlagBitField, extraData: i64 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sample_id_all", scope: !452, file: !6, line: 290, baseType: !374, size: 1, offset: 338, flags: DIFlagBitField, extraData: i64 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_host", scope: !452, file: !6, line: 291, baseType: !374, size: 1, offset: 339, flags: DIFlagBitField, extraData: i64 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_guest", scope: !452, file: !6, line: 292, baseType: !374, size: 1, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_callchain_kernel", scope: !452, file: !6, line: 293, baseType: !374, size: 1, offset: 341, flags: DIFlagBitField, extraData: i64 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_callchain_user", scope: !452, file: !6, line: 294, baseType: !374, size: 1, offset: 342, flags: DIFlagBitField, extraData: i64 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mmap2", scope: !452, file: !6, line: 295, baseType: !374, size: 1, offset: 343, flags: DIFlagBitField, extraData: i64 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "comm_exec", scope: !452, file: !6, line: 296, baseType: !374, size: 1, offset: 344, flags: DIFlagBitField, extraData: i64 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "use_clockid", scope: !452, file: !6, line: 297, baseType: !374, size: 1, offset: 345, flags: DIFlagBitField, extraData: i64 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "context_switch", scope: !452, file: !6, line: 298, baseType: !374, size: 1, offset: 346, flags: DIFlagBitField, extraData: i64 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "write_backward", scope: !452, file: !6, line: 299, baseType: !374, size: 1, offset: 347, flags: DIFlagBitField, extraData: i64 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "namespaces", scope: !452, file: !6, line: 300, baseType: !374, size: 1, offset: 348, flags: DIFlagBitField, extraData: i64 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ksymbol", scope: !452, file: !6, line: 301, baseType: !374, size: 1, offset: 349, flags: DIFlagBitField, extraData: i64 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_event", scope: !452, file: !6, line: 302, baseType: !374, size: 1, offset: 350, flags: DIFlagBitField, extraData: i64 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "aux_output", scope: !452, file: !6, line: 303, baseType: !374, size: 1, offset: 351, flags: DIFlagBitField, extraData: i64 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cgroup", scope: !452, file: !6, line: 304, baseType: !374, size: 1, offset: 352, flags: DIFlagBitField, extraData: i64 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "text_poke", scope: !452, file: !6, line: 305, baseType: !374, size: 1, offset: 353, flags: DIFlagBitField, extraData: i64 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "build_id", scope: !452, file: !6, line: 306, baseType: !374, size: 1, offset: 354, flags: DIFlagBitField, extraData: i64 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "inherit_thread", scope: !452, file: !6, line: 307, baseType: !374, size: 1, offset: 355, flags: DIFlagBitField, extraData: i64 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "remove_on_exec", scope: !452, file: !6, line: 308, baseType: !374, size: 1, offset: 356, flags: DIFlagBitField, extraData: i64 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sigtrap", scope: !452, file: !6, line: 309, baseType: !374, size: 1, offset: 357, flags: DIFlagBitField, extraData: i64 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved_1", scope: !452, file: !6, line: 310, baseType: !374, size: 26, offset: 358, flags: DIFlagBitField, extraData: i64 320)
!504 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !6, line: 312, baseType: !505, size: 32, offset: 384)
!505 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !6, line: 312, size: 32, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_events", scope: !505, file: !6, line: 313, baseType: !455, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_watermark", scope: !505, file: !6, line: 314, baseType: !455, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bp_type", scope: !452, file: !6, line: 317, baseType: !455, size: 32, offset: 416)
!510 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !6, line: 318, baseType: !511, size: 64, offset: 448)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !6, line: 318, size: 64, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bp_addr", scope: !511, file: !6, line: 319, baseType: !374, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "config1", scope: !511, file: !6, line: 320, baseType: !374, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !6, line: 322, baseType: !516, size: 64, offset: 512)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !6, line: 322, size: 64, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bp_len", scope: !516, file: !6, line: 323, baseType: !374, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "config2", scope: !516, file: !6, line: 324, baseType: !374, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "branch_sample_type", scope: !452, file: !6, line: 326, baseType: !374, size: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sample_regs_user", scope: !452, file: !6, line: 327, baseType: !374, size: 64, offset: 640)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sample_stack_user", scope: !452, file: !6, line: 328, baseType: !455, size: 32, offset: 704)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !452, file: !6, line: 329, baseType: !524, size: 32, offset: 736)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !525, line: 26, baseType: !526)
!525 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !377, line: 41, baseType: !288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sample_regs_intr", scope: !452, file: !6, line: 330, baseType: !374, size: 64, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "aux_watermark", scope: !452, file: !6, line: 331, baseType: !455, size: 32, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sample_max_stack", scope: !452, file: !6, line: 332, baseType: !530, size: 16, offset: 864)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !375, line: 25, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !377, line: 40, baseType: !532)
!532 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved_2", scope: !452, file: !6, line: 333, baseType: !530, size: 16, offset: 880)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "aux_sample_size", scope: !452, file: !6, line: 334, baseType: !455, size: 32, offset: 896)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved_3", scope: !452, file: !6, line: 335, baseType: !455, size: 32, offset: 928)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sig_data", scope: !452, file: !6, line: 336, baseType: !374, size: 64, offset: 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !449, file: !448, line: 34, baseType: !538, size: 192, offset: 1024)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 192, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 3)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "prev_values", scope: !449, file: !448, line: 35, baseType: !538, size: 192, offset: 1216)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !449, file: !448, line: 36, baseType: !290, size: 64, offset: 1408)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !449, file: !448, line: 37, baseType: !374, size: 64, offset: 1472)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !449, file: !448, line: 38, baseType: !287, size: 64, offset: 1536)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pgmsk", scope: !449, file: !448, line: 39, baseType: !546, size: 64, offset: 1600)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !547, line: 70, baseType: !378)
!547 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!548 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !449, file: !448, line: 40, baseType: !288, size: 32, offset: 1664)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !449, file: !448, line: 41, baseType: !288, size: 32, offset: 1696)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "max_fds", scope: !449, file: !448, line: 42, baseType: !288, size: 32, offset: 1728)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !449, file: !448, line: 43, baseType: !288, size: 32, offset: 1760)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !449, file: !448, line: 44, baseType: !288, size: 32, offset: 1792)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fstr", scope: !449, file: !448, line: 45, baseType: !290, size: 64, offset: 1856)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "num_fds", scope: !2, file: !3, line: 66, type: !288, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "pgsz", scope: !2, file: !3, line: 68, type: !546, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "map_size", scope: !2, file: !3, line: 69, type: !546, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !3, line: 237, type: !404, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !3, line: 237, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 16, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 2)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !3, line: 246, type: !337, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !3, line: 250, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 56, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 7)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !3, line: 252, type: !564, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !3, line: 255, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 88, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 11)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !3, line: 226, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 168, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 21)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !3, line: 94, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 160, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 20)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !3, line: 110, type: !295, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !3, line: 72, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 40, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 5)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !3, line: 73, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 64, elements: !428)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "the_options", scope: !2, file: !3, line: 71, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 768, elements: !539)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !605, line: 50, size: 256, elements: !606)
!605 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!606 = !{!607, !610, !611, !613}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !604, file: !605, line: 52, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !604, file: !605, line: 55, baseType: !288, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !604, file: !605, line: 56, baseType: !612, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !604, file: !605, line: 57, baseType: !288, size: 32, offset: 192)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !3, line: 377, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 824, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 103)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !3, line: 77, type: !588, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "gen_events", scope: !2, file: !3, line: 77, type: !608, isLocal: true, isDefinition: true)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "options_t", file: !3, line: 61, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 53, size: 320, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "opt_no_show", scope: !624, file: !3, line: 54, baseType: !288, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_pages", scope: !624, file: !3, line: 55, baseType: !288, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !624, file: !3, line: 56, baseType: !288, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !624, file: !3, line: 57, baseType: !288, size: 32, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !624, file: !3, line: 58, baseType: !288, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !624, file: !3, line: 59, baseType: !290, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cgroup", scope: !624, file: !3, line: 60, baseType: !290, size: 64, offset: 256)
!633 = !{i32 7, !"Dwarf Version", i32 5}
!634 = !{i32 2, !"Debug Info Version", i32 3}
!635 = !{i32 1, !"wchar_size", i32 4}
!636 = !{i32 8, !"PIC Level", i32 2}
!637 = !{i32 7, !"PIE Level", i32 2}
!638 = !{i32 7, !"uwtable", i32 2}
!639 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!640 = distinct !DISubprogram(name: "setup_cpu", scope: !3, file: !3, line: 117, type: !641, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{!288, !288, !288}
!643 = !{!644, !645, !646, !647, !648, !649}
!644 = !DILocalVariable(name: "cpu", arg: 1, scope: !640, file: !3, line: 117, type: !288)
!645 = !DILocalVariable(name: "fd", arg: 2, scope: !640, file: !3, line: 117, type: !288)
!646 = !DILocalVariable(name: "ret", scope: !640, file: !3, line: 119, type: !288)
!647 = !DILocalVariable(name: "flags", scope: !640, file: !3, line: 119, type: !288)
!648 = !DILocalVariable(name: "i", scope: !640, file: !3, line: 120, type: !288)
!649 = !DILocalVariable(name: "pid", scope: !640, file: !3, line: 120, type: !288)
!650 = !{!651, !651, i64 0}
!651 = !{!"int", !652, i64 0}
!652 = !{!"omnipotent char", !653, i64 0}
!653 = !{!"Simple C/C++ TBAA"}
!654 = !DILocation(line: 117, column: 15, scope: !640)
!655 = !DILocation(line: 117, column: 24, scope: !640)
!656 = !DILocation(line: 119, column: 2, scope: !640)
!657 = !DILocation(line: 119, column: 6, scope: !640)
!658 = !DILocation(line: 119, column: 11, scope: !640)
!659 = !DILocation(line: 120, column: 2, scope: !640)
!660 = !DILocation(line: 120, column: 6, scope: !640)
!661 = !DILocation(line: 120, column: 9, scope: !640)
!662 = !DILocation(line: 125, column: 39, scope: !640)
!663 = !{!664, !665, i64 24}
!664 = !{!"", !651, i64 0, !651, i64 4, !651, i64 8, !651, i64 12, !651, i64 16, !665, i64 24, !665, i64 32}
!665 = !{!"any pointer", !652, i64 0}
!666 = !DILocation(line: 125, column: 8, scope: !640)
!667 = !DILocation(line: 125, column: 6, scope: !640)
!668 = !DILocation(line: 126, column: 6, scope: !669)
!669 = distinct !DILexicalBlock(scope: !640, file: !3, line: 126, column: 6)
!670 = !DILocation(line: 126, column: 10, scope: !669)
!671 = !DILocation(line: 126, column: 14, scope: !669)
!672 = !DILocation(line: 126, column: 6, scope: !640)
!673 = !DILocation(line: 127, column: 3, scope: !669)
!674 = !DILocation(line: 129, column: 7, scope: !675)
!675 = distinct !DILexicalBlock(scope: !640, file: !3, line: 129, column: 6)
!676 = !{!665, !665, i64 0}
!677 = !DILocation(line: 129, column: 14, scope: !675)
!678 = !DILocation(line: 129, column: 17, scope: !675)
!679 = !{!652, !652, i64 0}
!680 = !DILocation(line: 129, column: 6, scope: !640)
!681 = !DILocation(line: 130, column: 3, scope: !675)
!682 = !DILocation(line: 132, column: 2, scope: !640)
!683 = !DILocation(line: 132, column: 9, scope: !640)
!684 = !DILocation(line: 132, column: 12, scope: !640)
!685 = !{!686, !651, i64 212}
!686 = !{!"", !687, i64 0, !652, i64 128, !652, i64 152, !665, i64 176, !688, i64 184, !665, i64 192, !688, i64 200, !651, i64 208, !651, i64 212, !651, i64 216, !651, i64 220, !651, i64 224, !665, i64 232}
!687 = !{!"perf_event_attr", !651, i64 0, !651, i64 4, !688, i64 8, !652, i64 16, !688, i64 24, !688, i64 32, !688, i64 40, !688, i64 40, !688, i64 40, !688, i64 40, !688, i64 40, !688, i64 40, !688, i64 40, !688, i64 40, !688, i64 41, !688, i64 41, !688, i64 41, !688, i64 41, !688, i64 41, !688, i64 41, !688, i64 41, !688, i64 41, !688, i64 42, !688, i64 42, !688, i64 42, !688, i64 42, !688, i64 42, !688, i64 42, !688, i64 42, !688, i64 43, !688, i64 43, !688, i64 43, !688, i64 43, !688, i64 43, !688, i64 43, !688, i64 43, !688, i64 43, !688, i64 44, !688, i64 44, !688, i64 44, !688, i64 44, !688, i64 44, !688, i64 44, !688, i64 44, !652, i64 48, !651, i64 52, !652, i64 56, !652, i64 64, !688, i64 72, !688, i64 80, !651, i64 88, !651, i64 92, !688, i64 96, !651, i64 104, !689, i64 108, !689, i64 110, !651, i64 112, !651, i64 116, !688, i64 120}
!688 = !{!"long", !652, i64 0}
!689 = !{!"short", !652, i64 0}
!690 = !DILocation(line: 133, column: 7, scope: !691)
!691 = distinct !DILexicalBlock(scope: !640, file: !3, line: 133, column: 2)
!692 = !DILocation(line: 133, column: 6, scope: !691)
!693 = !DILocation(line: 133, column: 11, scope: !694)
!694 = distinct !DILexicalBlock(scope: !691, file: !3, line: 133, column: 2)
!695 = !DILocation(line: 133, column: 15, scope: !694)
!696 = !DILocation(line: 133, column: 13, scope: !694)
!697 = !DILocation(line: 133, column: 2, scope: !691)
!698 = !DILocation(line: 135, column: 25, scope: !699)
!699 = distinct !DILexicalBlock(scope: !694, file: !3, line: 133, column: 29)
!700 = !DILocation(line: 135, column: 24, scope: !699)
!701 = !DILocation(line: 135, column: 3, scope: !699)
!702 = !DILocation(line: 135, column: 7, scope: !699)
!703 = !DILocation(line: 135, column: 10, scope: !699)
!704 = !DILocation(line: 135, column: 13, scope: !699)
!705 = !DILocation(line: 135, column: 22, scope: !699)
!706 = !DILocation(line: 137, column: 15, scope: !707)
!707 = distinct !DILexicalBlock(scope: !699, file: !3, line: 137, column: 7)
!708 = !{!664, !665, i64 32}
!709 = !DILocation(line: 137, column: 7, scope: !707)
!710 = !DILocation(line: 137, column: 7, scope: !699)
!711 = !DILocation(line: 138, column: 10, scope: !712)
!712 = distinct !DILexicalBlock(scope: !707, file: !3, line: 137, column: 23)
!713 = !DILocation(line: 139, column: 10, scope: !712)
!714 = !DILocation(line: 139, column: 8, scope: !712)
!715 = !DILocation(line: 140, column: 3, scope: !712)
!716 = !DILocation(line: 141, column: 10, scope: !717)
!717 = distinct !DILexicalBlock(scope: !707, file: !3, line: 140, column: 10)
!718 = !DILocation(line: 142, column: 8, scope: !717)
!719 = !DILocation(line: 145, column: 15, scope: !720)
!720 = distinct !DILexicalBlock(scope: !699, file: !3, line: 145, column: 7)
!721 = !{!664, !651, i64 12}
!722 = !DILocation(line: 145, column: 7, scope: !720)
!723 = !DILocation(line: 145, column: 7, scope: !699)
!724 = !DILocation(line: 146, column: 4, scope: !720)
!725 = !DILocation(line: 146, column: 8, scope: !720)
!726 = !DILocation(line: 146, column: 11, scope: !720)
!727 = !DILocation(line: 146, column: 14, scope: !720)
!728 = !DILocation(line: 146, column: 21, scope: !720)
!729 = !DILocation(line: 148, column: 7, scope: !730)
!730 = distinct !DILexicalBlock(scope: !699, file: !3, line: 148, column: 7)
!731 = !DILocation(line: 148, column: 11, scope: !730)
!732 = !DILocation(line: 148, column: 14, scope: !730)
!733 = !DILocation(line: 148, column: 17, scope: !730)
!734 = !DILocation(line: 148, column: 7, scope: !699)
!735 = !DILocation(line: 152, column: 8, scope: !736)
!736 = distinct !DILexicalBlock(scope: !737, file: !3, line: 152, column: 8)
!737 = distinct !DILexicalBlock(scope: !730, file: !3, line: 148, column: 32)
!738 = !DILocation(line: 152, column: 12, scope: !736)
!739 = !DILocation(line: 152, column: 15, scope: !736)
!740 = !DILocation(line: 152, column: 18, scope: !736)
!741 = !DILocation(line: 152, column: 8, scope: !737)
!742 = !DILocation(line: 153, column: 43, scope: !743)
!743 = distinct !DILexicalBlock(scope: !736, file: !3, line: 152, column: 33)
!744 = !{!664, !651, i64 4}
!745 = !DILocation(line: 153, column: 35, scope: !743)
!746 = !DILocation(line: 153, column: 54, scope: !743)
!747 = !{!688, !688, i64 0}
!748 = !DILocation(line: 153, column: 53, scope: !743)
!749 = !DILocation(line: 153, column: 60, scope: !743)
!750 = !DILocation(line: 153, column: 34, scope: !743)
!751 = !DILocation(line: 153, column: 5, scope: !743)
!752 = !DILocation(line: 153, column: 9, scope: !743)
!753 = !DILocation(line: 153, column: 12, scope: !743)
!754 = !DILocation(line: 153, column: 15, scope: !743)
!755 = !DILocation(line: 153, column: 32, scope: !743)
!756 = !DILocation(line: 154, column: 5, scope: !743)
!757 = !DILocation(line: 154, column: 9, scope: !743)
!758 = !DILocation(line: 154, column: 12, scope: !743)
!759 = !DILocation(line: 154, column: 15, scope: !743)
!760 = !DILocation(line: 154, column: 25, scope: !743)
!761 = !DILocation(line: 155, column: 4, scope: !743)
!762 = !DILocation(line: 157, column: 4, scope: !737)
!763 = !DILocation(line: 157, column: 8, scope: !737)
!764 = !DILocation(line: 157, column: 11, scope: !737)
!765 = !DILocation(line: 157, column: 14, scope: !737)
!766 = !DILocation(line: 157, column: 26, scope: !737)
!767 = !{!686, !688, i64 24}
!768 = !DILocation(line: 161, column: 8, scope: !769)
!769 = distinct !DILexicalBlock(scope: !737, file: !3, line: 161, column: 8)
!770 = !DILocation(line: 161, column: 16, scope: !769)
!771 = !DILocation(line: 161, column: 8, scope: !737)
!772 = !DILocation(line: 162, column: 5, scope: !769)
!773 = !DILocation(line: 162, column: 9, scope: !769)
!774 = !DILocation(line: 162, column: 12, scope: !769)
!775 = !DILocation(line: 162, column: 15, scope: !769)
!776 = !DILocation(line: 162, column: 27, scope: !769)
!777 = !DILocation(line: 164, column: 44, scope: !737)
!778 = !DILocation(line: 164, column: 48, scope: !737)
!779 = !DILocation(line: 164, column: 51, scope: !737)
!780 = !{!686, !665, i64 176}
!781 = !DILocation(line: 164, column: 57, scope: !737)
!782 = !DILocation(line: 164, column: 61, scope: !737)
!783 = !DILocation(line: 164, column: 64, scope: !737)
!784 = !DILocation(line: 164, column: 67, scope: !737)
!785 = !DILocation(line: 164, column: 82, scope: !737)
!786 = !DILocation(line: 164, column: 86, scope: !737)
!787 = !DILocation(line: 164, column: 89, scope: !737)
!788 = !DILocation(line: 164, column: 92, scope: !737)
!789 = !DILocation(line: 164, column: 4, scope: !737)
!790 = !DILocation(line: 166, column: 4, scope: !737)
!791 = !DILocation(line: 166, column: 8, scope: !737)
!792 = !DILocation(line: 166, column: 11, scope: !737)
!793 = !DILocation(line: 166, column: 14, scope: !737)
!794 = !DILocation(line: 166, column: 26, scope: !737)
!795 = !{!686, !688, i64 32}
!796 = !DILocation(line: 168, column: 8, scope: !797)
!797 = distinct !DILexicalBlock(scope: !737, file: !3, line: 168, column: 8)
!798 = !DILocation(line: 168, column: 12, scope: !797)
!799 = !DILocation(line: 168, column: 15, scope: !797)
!800 = !DILocation(line: 168, column: 18, scope: !797)
!801 = !DILocation(line: 168, column: 8, scope: !737)
!802 = !DILocation(line: 169, column: 5, scope: !797)
!803 = !DILocation(line: 169, column: 9, scope: !797)
!804 = !DILocation(line: 169, column: 12, scope: !797)
!805 = !DILocation(line: 169, column: 15, scope: !797)
!806 = !DILocation(line: 169, column: 27, scope: !797)
!807 = !DILocation(line: 170, column: 3, scope: !737)
!808 = !DILocation(line: 172, column: 32, scope: !699)
!809 = !DILocation(line: 172, column: 36, scope: !699)
!810 = !DILocation(line: 172, column: 39, scope: !699)
!811 = !DILocation(line: 172, column: 43, scope: !699)
!812 = !DILocation(line: 172, column: 48, scope: !699)
!813 = !DILocation(line: 172, column: 53, scope: !699)
!814 = !DILocation(line: 172, column: 60, scope: !699)
!815 = !DILocation(line: 172, column: 64, scope: !699)
!816 = !DILocation(line: 172, column: 15, scope: !699)
!817 = !DILocation(line: 172, column: 3, scope: !699)
!818 = !DILocation(line: 172, column: 7, scope: !699)
!819 = !DILocation(line: 172, column: 10, scope: !699)
!820 = !DILocation(line: 172, column: 13, scope: !699)
!821 = !DILocation(line: 173, column: 7, scope: !822)
!822 = distinct !DILexicalBlock(scope: !699, file: !3, line: 173, column: 7)
!823 = !DILocation(line: 173, column: 11, scope: !822)
!824 = !DILocation(line: 173, column: 14, scope: !822)
!825 = !DILocation(line: 173, column: 17, scope: !822)
!826 = !DILocation(line: 173, column: 7, scope: !699)
!827 = !DILocation(line: 174, column: 8, scope: !828)
!828 = distinct !DILexicalBlock(scope: !829, file: !3, line: 174, column: 8)
!829 = distinct !DILexicalBlock(scope: !822, file: !3, line: 173, column: 24)
!830 = !DILocation(line: 174, column: 12, scope: !828)
!831 = !DILocation(line: 174, column: 15, scope: !828)
!832 = !DILocation(line: 174, column: 18, scope: !828)
!833 = !DILocation(line: 174, column: 8, scope: !829)
!834 = !DILocation(line: 175, column: 73, scope: !828)
!835 = !DILocation(line: 175, column: 77, scope: !828)
!836 = !DILocation(line: 175, column: 80, scope: !828)
!837 = !DILocation(line: 175, column: 5, scope: !828)
!838 = !DILocation(line: 176, column: 37, scope: !829)
!839 = !DILocation(line: 176, column: 41, scope: !829)
!840 = !DILocation(line: 176, column: 44, scope: !829)
!841 = !DILocation(line: 176, column: 4, scope: !829)
!842 = !DILocation(line: 178, column: 2, scope: !699)
!843 = !DILocation(line: 133, column: 25, scope: !694)
!844 = !DILocation(line: 133, column: 2, scope: !694)
!845 = distinct !{!845, !697, !846, !847}
!846 = !DILocation(line: 178, column: 2, scope: !691)
!847 = !{!"llvm.loop.mustprogress"}
!848 = !DILocation(line: 183, column: 26, scope: !640)
!849 = !DILocation(line: 183, column: 70, scope: !640)
!850 = !DILocation(line: 183, column: 77, scope: !640)
!851 = !DILocation(line: 183, column: 15, scope: !640)
!852 = !DILocation(line: 183, column: 2, scope: !640)
!853 = !DILocation(line: 183, column: 9, scope: !640)
!854 = !DILocation(line: 183, column: 13, scope: !640)
!855 = !{!686, !665, i64 192}
!856 = !DILocation(line: 184, column: 6, scope: !857)
!857 = distinct !DILexicalBlock(scope: !640, file: !3, line: 184, column: 6)
!858 = !DILocation(line: 184, column: 13, scope: !857)
!859 = !DILocation(line: 184, column: 17, scope: !857)
!860 = !DILocation(line: 184, column: 6, scope: !640)
!861 = !DILocation(line: 185, column: 3, scope: !857)
!862 = !DILocation(line: 188, column: 26, scope: !640)
!863 = !DILocation(line: 188, column: 18, scope: !640)
!864 = !DILocation(line: 188, column: 37, scope: !640)
!865 = !DILocation(line: 188, column: 36, scope: !640)
!866 = !DILocation(line: 188, column: 42, scope: !640)
!867 = !DILocation(line: 188, column: 2, scope: !640)
!868 = !DILocation(line: 188, column: 9, scope: !640)
!869 = !DILocation(line: 188, column: 15, scope: !640)
!870 = !{!686, !688, i64 200}
!871 = !DILocation(line: 193, column: 9, scope: !872)
!872 = distinct !DILexicalBlock(scope: !640, file: !3, line: 193, column: 2)
!873 = !DILocation(line: 193, column: 7, scope: !872)
!874 = !DILocation(line: 193, column: 14, scope: !875)
!875 = distinct !DILexicalBlock(scope: !872, file: !3, line: 193, column: 2)
!876 = !DILocation(line: 193, column: 18, scope: !875)
!877 = !DILocation(line: 193, column: 16, scope: !875)
!878 = !DILocation(line: 193, column: 2, scope: !872)
!879 = !DILocation(line: 194, column: 8, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !3, line: 194, column: 7)
!881 = distinct !DILexicalBlock(scope: !875, file: !3, line: 193, column: 32)
!882 = !DILocation(line: 194, column: 12, scope: !880)
!883 = !DILocation(line: 194, column: 15, scope: !880)
!884 = !DILocation(line: 194, column: 18, scope: !880)
!885 = !DILocation(line: 194, column: 7, scope: !881)
!886 = !DILocation(line: 195, column: 4, scope: !880)
!887 = !DILocation(line: 196, column: 15, scope: !881)
!888 = !DILocation(line: 196, column: 19, scope: !881)
!889 = !DILocation(line: 196, column: 22, scope: !881)
!890 = !DILocation(line: 196, column: 53, scope: !881)
!891 = !DILocation(line: 196, column: 60, scope: !881)
!892 = !DILocation(line: 196, column: 9, scope: !881)
!893 = !DILocation(line: 196, column: 7, scope: !881)
!894 = !DILocation(line: 197, column: 7, scope: !895)
!895 = distinct !DILexicalBlock(scope: !881, file: !3, line: 197, column: 7)
!896 = !DILocation(line: 197, column: 7, scope: !881)
!897 = !DILocation(line: 198, column: 4, scope: !895)
!898 = !DILocation(line: 199, column: 2, scope: !881)
!899 = !DILocation(line: 193, column: 28, scope: !875)
!900 = !DILocation(line: 193, column: 2, scope: !875)
!901 = distinct !{!901, !878, !902, !847}
!902 = !DILocation(line: 199, column: 2, scope: !872)
!903 = !DILocation(line: 204, column: 6, scope: !904)
!904 = distinct !DILexicalBlock(scope: !640, file: !3, line: 204, column: 6)
!905 = !DILocation(line: 204, column: 14, scope: !904)
!906 = !DILocation(line: 204, column: 18, scope: !904)
!907 = !DILocation(line: 204, column: 21, scope: !904)
!908 = !DILocation(line: 204, column: 28, scope: !904)
!909 = !DILocation(line: 204, column: 31, scope: !904)
!910 = !DILocation(line: 204, column: 6, scope: !640)
!911 = !DILocation(line: 205, column: 9, scope: !912)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 205, column: 3)
!913 = distinct !DILexicalBlock(scope: !904, file: !3, line: 204, column: 37)
!914 = !DILocation(line: 205, column: 7, scope: !912)
!915 = !DILocation(line: 205, column: 14, scope: !916)
!916 = distinct !DILexicalBlock(scope: !912, file: !3, line: 205, column: 3)
!917 = !DILocation(line: 205, column: 18, scope: !916)
!918 = !DILocation(line: 205, column: 16, scope: !916)
!919 = !DILocation(line: 205, column: 3, scope: !912)
!920 = !DILocation(line: 210, column: 16, scope: !921)
!921 = distinct !DILexicalBlock(scope: !916, file: !3, line: 205, column: 32)
!922 = !DILocation(line: 210, column: 20, scope: !921)
!923 = !DILocation(line: 210, column: 23, scope: !921)
!924 = !DILocation(line: 210, column: 47, scope: !921)
!925 = !DILocation(line: 210, column: 51, scope: !921)
!926 = !DILocation(line: 210, column: 54, scope: !921)
!927 = !DILocation(line: 210, column: 10, scope: !921)
!928 = !DILocation(line: 210, column: 8, scope: !921)
!929 = !DILocation(line: 211, column: 8, scope: !930)
!930 = distinct !DILexicalBlock(scope: !921, file: !3, line: 211, column: 8)
!931 = !DILocation(line: 211, column: 12, scope: !930)
!932 = !DILocation(line: 211, column: 8, scope: !921)
!933 = !DILocation(line: 212, column: 5, scope: !930)
!934 = !DILocation(line: 213, column: 33, scope: !921)
!935 = !DILocation(line: 213, column: 37, scope: !921)
!936 = !DILocation(line: 213, column: 40, scope: !921)
!937 = !{!686, !688, i64 184}
!938 = !DILocation(line: 213, column: 44, scope: !921)
!939 = !DILocation(line: 213, column: 48, scope: !921)
!940 = !DILocation(line: 213, column: 51, scope: !921)
!941 = !DILocation(line: 213, column: 4, scope: !921)
!942 = !DILocation(line: 214, column: 3, scope: !921)
!943 = !DILocation(line: 205, column: 28, scope: !916)
!944 = !DILocation(line: 205, column: 3, scope: !916)
!945 = distinct !{!945, !919, !946, !847}
!946 = !DILocation(line: 214, column: 3, scope: !912)
!947 = !DILocation(line: 215, column: 2, scope: !913)
!948 = !DILocation(line: 217, column: 1, scope: !640)
!949 = !DILocation(line: 216, column: 2, scope: !640)
!950 = !DISubprogram(name: "perf_setup_list_events", scope: !448, file: !448, line: 52, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!951 = !DISubroutineType(types: !952)
!952 = !{!288, !608, !953, !612}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!954 = !DISubprogram(name: "errx", scope: !955, file: !955, line: 50, type: !956, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!955 = !DIFile(filename: "/usr/include/err.h", directory: "", checksumkind: CSK_MD5, checksum: "c1d02a7722f9cc1994ce2e5c5e6150dd")
!956 = !DISubroutineType(types: !957)
!957 = !{null, !288, !608, null}
!958 = !DISubprogram(name: "printf", scope: !959, file: !959, line: 356, type: !960, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!959 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!960 = !DISubroutineType(types: !961)
!961 = !{!288, !962, null}
!962 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !608)
!963 = distinct !DISubprogram(name: "perf_event_open", scope: !6, file: !6, line: 597, type: !964, scopeLine: 603, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !970)
!964 = !DISubroutineType(types: !965)
!965 = !{!288, !966, !967, !288, !288, !378}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !968, line: 97, baseType: !969)
!968 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !377, line: 154, baseType: !288)
!970 = !{!971, !972, !973, !974, !975}
!971 = !DILocalVariable(name: "hw_event_uptr", arg: 1, scope: !963, file: !6, line: 598, type: !966)
!972 = !DILocalVariable(name: "pid", arg: 2, scope: !963, file: !6, line: 599, type: !967)
!973 = !DILocalVariable(name: "cpu", arg: 3, scope: !963, file: !6, line: 600, type: !288)
!974 = !DILocalVariable(name: "group_fd", arg: 4, scope: !963, file: !6, line: 601, type: !288)
!975 = !DILocalVariable(name: "flags", arg: 5, scope: !963, file: !6, line: 602, type: !378)
!976 = !DILocation(line: 598, column: 27, scope: !963)
!977 = !DILocation(line: 599, column: 11, scope: !963)
!978 = !DILocation(line: 600, column: 9, scope: !963)
!979 = !DILocation(line: 601, column: 9, scope: !963)
!980 = !DILocation(line: 602, column: 18, scope: !963)
!981 = !DILocation(line: 605, column: 25, scope: !963)
!982 = !DILocation(line: 605, column: 40, scope: !963)
!983 = !DILocation(line: 605, column: 45, scope: !963)
!984 = !DILocation(line: 605, column: 50, scope: !963)
!985 = !DILocation(line: 605, column: 60, scope: !963)
!986 = !DILocation(line: 604, column: 9, scope: !963)
!987 = !DILocation(line: 604, column: 2, scope: !963)
!988 = !DISubprogram(name: "err", scope: !955, file: !955, line: 46, type: !956, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!989 = !DISubprogram(name: "mmap", scope: !990, file: !990, line: 57, type: !991, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!990 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/mman.h", directory: "", checksumkind: CSK_MD5, checksum: "93a87cc3b0558893646eb0c257165272")
!991 = !DISubroutineType(types: !992)
!992 = !{!287, !287, !546, !288, !288, !288, !993}
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !377, line: 152, baseType: !427)
!994 = !DISubprogram(name: "ioctl", scope: !995, file: !995, line: 42, type: !996, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!995 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/ioctl.h", directory: "", checksumkind: CSK_MD5, checksum: "17041ae374bfd0bee8350d01883d298c")
!996 = !DISubroutineType(types: !997)
!997 = !{!288, !288, !378, null}
!998 = distinct !DISubprogram(name: "open_cgroup", scope: !3, file: !3, line: 277, type: !999, scopeLine: 278, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1001)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!288, !290}
!1001 = !{!1002, !1003, !1007, !1008, !1009}
!1002 = !DILocalVariable(name: "name", arg: 1, scope: !998, file: !3, line: 277, type: !290)
!1003 = !DILocalVariable(name: "path", scope: !998, file: !3, line: 279, type: !1004)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 8200, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 1025)
!1007 = !DILocalVariable(name: "mnt", scope: !998, file: !3, line: 280, type: !1004)
!1008 = !DILocalVariable(name: "cfd", scope: !998, file: !3, line: 281, type: !288)
!1009 = !DILocalVariable(name: "retlen", scope: !998, file: !3, line: 282, type: !288)
!1010 = !DILocation(line: 277, column: 19, scope: !998)
!1011 = !DILocation(line: 279, column: 9, scope: !998)
!1012 = !DILocation(line: 279, column: 14, scope: !998)
!1013 = !DILocation(line: 280, column: 9, scope: !998)
!1014 = !DILocation(line: 280, column: 14, scope: !998)
!1015 = !DILocation(line: 281, column: 9, scope: !998)
!1016 = !DILocation(line: 281, column: 13, scope: !998)
!1017 = !DILocation(line: 282, column: 2, scope: !998)
!1018 = !DILocation(line: 282, column: 6, scope: !998)
!1019 = !DILocation(line: 284, column: 38, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !998, file: !3, line: 284, column: 13)
!1021 = !DILocation(line: 284, column: 13, scope: !1020)
!1022 = !DILocation(line: 284, column: 13, scope: !998)
!1023 = !DILocation(line: 285, column: 17, scope: !1020)
!1024 = !DILocation(line: 287, column: 20, scope: !998)
!1025 = !DILocation(line: 287, column: 45, scope: !998)
!1026 = !DILocation(line: 287, column: 50, scope: !998)
!1027 = !DILocation(line: 287, column: 11, scope: !998)
!1028 = !DILocation(line: 287, column: 9, scope: !998)
!1029 = !DILocation(line: 290, column: 6, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !998, file: !3, line: 290, column: 6)
!1031 = !DILocation(line: 290, column: 13, scope: !1030)
!1032 = !DILocation(line: 290, column: 18, scope: !1030)
!1033 = !DILocation(line: 290, column: 33, scope: !1030)
!1034 = !DILocation(line: 290, column: 30, scope: !1030)
!1035 = !DILocation(line: 290, column: 6, scope: !998)
!1036 = !DILocation(line: 291, column: 48, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 290, column: 41)
!1038 = !DILocation(line: 291, column: 53, scope: !1037)
!1039 = !DILocation(line: 291, column: 3, scope: !1037)
!1040 = !DILocation(line: 292, column: 10, scope: !1037)
!1041 = !DILocation(line: 292, column: 3, scope: !1037)
!1042 = !DILocation(line: 295, column: 20, scope: !998)
!1043 = !DILocation(line: 295, column: 15, scope: !998)
!1044 = !DILocation(line: 295, column: 13, scope: !998)
!1045 = !DILocation(line: 296, column: 13, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !998, file: !3, line: 296, column: 13)
!1047 = !DILocation(line: 296, column: 17, scope: !1046)
!1048 = !DILocation(line: 296, column: 13, scope: !998)
!1049 = !DILocation(line: 297, column: 50, scope: !1046)
!1050 = !DILocation(line: 297, column: 17, scope: !1046)
!1051 = !DILocation(line: 299, column: 16, scope: !998)
!1052 = !DILocation(line: 299, column: 9, scope: !998)
!1053 = !DILocation(line: 300, column: 1, scope: !998)
!1054 = distinct !DISubprogram(name: "cgroupfs_find_mountpoint", scope: !3, file: !3, line: 230, type: !1055, scopeLine: 231, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1057)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!288, !290, !546}
!1057 = !{!1058, !1059, !1060, !1107, !1108, !1109, !1110, !1111, !1112}
!1058 = !DILocalVariable(name: "buf", arg: 1, scope: !1054, file: !3, line: 230, type: !290)
!1059 = !DILocalVariable(name: "maxlen", arg: 2, scope: !1054, file: !3, line: 230, type: !546)
!1060 = !DILocalVariable(name: "fp", scope: !1054, file: !3, line: 232, type: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1063, line: 7, baseType: !1064)
!1063 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1065, line: 49, size: 1728, elements: !1066)
!1065 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1082, !1084, !1085, !1086, !1087, !1088, !1090, !1091, !1094, !1096, !1099, !1102, !1103, !1104, !1105, !1106}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1064, file: !1065, line: 51, baseType: !288, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1064, file: !1065, line: 54, baseType: !290, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1064, file: !1065, line: 55, baseType: !290, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1064, file: !1065, line: 56, baseType: !290, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1064, file: !1065, line: 57, baseType: !290, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1064, file: !1065, line: 58, baseType: !290, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1064, file: !1065, line: 59, baseType: !290, size: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1064, file: !1065, line: 60, baseType: !290, size: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1064, file: !1065, line: 61, baseType: !290, size: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1064, file: !1065, line: 64, baseType: !290, size: 64, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1064, file: !1065, line: 65, baseType: !290, size: 64, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1064, file: !1065, line: 66, baseType: !290, size: 64, offset: 704)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1064, file: !1065, line: 68, baseType: !1080, size: 64, offset: 768)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1065, line: 36, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1064, file: !1065, line: 70, baseType: !1083, size: 64, offset: 832)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1064, file: !1065, line: 72, baseType: !288, size: 32, offset: 896)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1064, file: !1065, line: 73, baseType: !288, size: 32, offset: 928)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1064, file: !1065, line: 74, baseType: !993, size: 64, offset: 960)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1064, file: !1065, line: 77, baseType: !532, size: 16, offset: 1024)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1064, file: !1065, line: 78, baseType: !1089, size: 8, offset: 1040)
!1089 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1064, file: !1065, line: 79, baseType: !401, size: 8, offset: 1048)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1064, file: !1065, line: 81, baseType: !1092, size: 64, offset: 1088)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1065, line: 43, baseType: null)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1064, file: !1065, line: 89, baseType: !1095, size: 64, offset: 1152)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !377, line: 153, baseType: !427)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1064, file: !1065, line: 91, baseType: !1097, size: 64, offset: 1216)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1065, line: 37, flags: DIFlagFwdDecl)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1064, file: !1065, line: 92, baseType: !1100, size: 64, offset: 1280)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1065, line: 38, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1064, file: !1065, line: 93, baseType: !1083, size: 64, offset: 1344)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1064, file: !1065, line: 94, baseType: !287, size: 64, offset: 1408)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1064, file: !1065, line: 95, baseType: !546, size: 64, offset: 1472)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1064, file: !1065, line: 96, baseType: !288, size: 32, offset: 1536)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1064, file: !1065, line: 98, baseType: !588, size: 160, offset: 1568)
!1107 = !DILocalVariable(name: "mountpoint", scope: !1054, file: !3, line: 233, type: !1004)
!1108 = !DILocalVariable(name: "tokens", scope: !1054, file: !3, line: 233, type: !1004)
!1109 = !DILocalVariable(name: "type", scope: !1054, file: !3, line: 233, type: !1004)
!1110 = !DILocalVariable(name: "token", scope: !1054, file: !3, line: 234, type: !290)
!1111 = !DILocalVariable(name: "saved_ptr", scope: !1054, file: !3, line: 234, type: !290)
!1112 = !DILocalVariable(name: "found", scope: !1054, file: !3, line: 235, type: !288)
!1113 = !DILocation(line: 230, column: 32, scope: !1054)
!1114 = !DILocation(line: 230, column: 44, scope: !1054)
!1115 = !DILocation(line: 232, column: 2, scope: !1054)
!1116 = !DILocation(line: 232, column: 8, scope: !1054)
!1117 = !DILocation(line: 233, column: 2, scope: !1054)
!1118 = !DILocation(line: 233, column: 7, scope: !1054)
!1119 = !DILocation(line: 233, column: 31, scope: !1054)
!1120 = !DILocation(line: 233, column: 51, scope: !1054)
!1121 = !DILocation(line: 234, column: 2, scope: !1054)
!1122 = !DILocation(line: 234, column: 8, scope: !1054)
!1123 = !DILocation(line: 234, column: 16, scope: !1054)
!1124 = !DILocation(line: 235, column: 2, scope: !1054)
!1125 = !DILocation(line: 235, column: 6, scope: !1054)
!1126 = !DILocation(line: 237, column: 7, scope: !1054)
!1127 = !DILocation(line: 237, column: 5, scope: !1054)
!1128 = !DILocation(line: 238, column: 7, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 238, column: 6)
!1130 = !DILocation(line: 238, column: 6, scope: !1054)
!1131 = !DILocation(line: 239, column: 3, scope: !1129)
!1132 = !DILocation(line: 246, column: 2, scope: !1054)
!1133 = !DILocation(line: 246, column: 16, scope: !1054)
!1134 = !DILocation(line: 248, column: 5, scope: !1054)
!1135 = !DILocation(line: 248, column: 17, scope: !1054)
!1136 = !DILocation(line: 248, column: 23, scope: !1054)
!1137 = !DILocation(line: 246, column: 9, scope: !1054)
!1138 = !DILocation(line: 248, column: 31, scope: !1054)
!1139 = !DILocation(line: 250, column: 15, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 250, column: 7)
!1141 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 248, column: 37)
!1142 = !DILocation(line: 250, column: 8, scope: !1140)
!1143 = !DILocation(line: 250, column: 7, scope: !1141)
!1144 = !DILocation(line: 252, column: 21, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 250, column: 32)
!1146 = !DILocation(line: 252, column: 12, scope: !1145)
!1147 = !DILocation(line: 252, column: 10, scope: !1145)
!1148 = !DILocation(line: 254, column: 4, scope: !1145)
!1149 = !DILocation(line: 254, column: 11, scope: !1145)
!1150 = !DILocation(line: 254, column: 17, scope: !1145)
!1151 = !DILocation(line: 255, column: 17, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 255, column: 9)
!1153 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 254, column: 26)
!1154 = !DILocation(line: 255, column: 10, scope: !1152)
!1155 = !DILocation(line: 255, column: 9, scope: !1153)
!1156 = !DILocation(line: 256, column: 12, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 255, column: 39)
!1158 = !DILocation(line: 257, column: 6, scope: !1157)
!1159 = !DILocation(line: 259, column: 13, scope: !1153)
!1160 = !DILocation(line: 259, column: 11, scope: !1153)
!1161 = distinct !{!1161, !1148, !1162, !847}
!1162 = !DILocation(line: 260, column: 4, scope: !1145)
!1163 = !DILocation(line: 261, column: 3, scope: !1145)
!1164 = !DILocation(line: 262, column: 7, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 262, column: 7)
!1166 = !DILocation(line: 262, column: 7, scope: !1141)
!1167 = !DILocation(line: 263, column: 4, scope: !1165)
!1168 = distinct !{!1168, !1132, !1169, !847}
!1169 = !DILocation(line: 264, column: 2, scope: !1054)
!1170 = !DILocation(line: 265, column: 9, scope: !1054)
!1171 = !DILocation(line: 265, column: 2, scope: !1054)
!1172 = !DILocation(line: 266, column: 7, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 266, column: 6)
!1174 = !DILocation(line: 266, column: 6, scope: !1054)
!1175 = !DILocation(line: 267, column: 3, scope: !1173)
!1176 = !DILocation(line: 269, column: 13, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 269, column: 6)
!1178 = !DILocation(line: 269, column: 6, scope: !1177)
!1179 = !DILocation(line: 269, column: 27, scope: !1177)
!1180 = !DILocation(line: 269, column: 25, scope: !1177)
!1181 = !DILocation(line: 269, column: 6, scope: !1054)
!1182 = !DILocation(line: 270, column: 10, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1177, file: !3, line: 269, column: 35)
!1184 = !DILocation(line: 270, column: 15, scope: !1183)
!1185 = !DILocation(line: 270, column: 3, scope: !1183)
!1186 = !DILocation(line: 271, column: 3, scope: !1183)
!1187 = !DILocation(line: 273, column: 2, scope: !1054)
!1188 = !DILocation(line: 274, column: 1, scope: !1054)
!1189 = !DISubprogram(name: "snprintf", scope: !959, file: !959, line: 378, type: !1190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!288, !1192, !546, !962, null}
!1192 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !290)
!1193 = !DISubprogram(name: "warn", scope: !955, file: !955, line: 34, type: !1194, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{null, !608, null}
!1196 = !DISubprogram(name: "open", scope: !1197, file: !1197, line: 181, type: !1198, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1197 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!288, !608, !288, null}
!1200 = !DILocation(line: 308, column: 17, scope: !354)
!1201 = !DILocation(line: 311, column: 2, scope: !354)
!1202 = !DILocation(line: 311, column: 16, scope: !354)
!1203 = !DILocation(line: 312, column: 2, scope: !354)
!1204 = !DILocation(line: 312, column: 6, scope: !354)
!1205 = !DILocation(line: 313, column: 2, scope: !354)
!1206 = !DILocation(line: 313, column: 6, scope: !354)
!1207 = !DILocation(line: 314, column: 2, scope: !354)
!1208 = !DILocation(line: 314, column: 6, scope: !354)
!1209 = !DILocation(line: 316, column: 6, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !354, file: !3, line: 316, column: 6)
!1211 = !DILocation(line: 316, column: 23, scope: !1210)
!1212 = !DILocation(line: 316, column: 6, scope: !354)
!1213 = !DILocation(line: 317, column: 3, scope: !1210)
!1214 = !DILocation(line: 319, column: 9, scope: !354)
!1215 = !DILocation(line: 319, column: 7, scope: !354)
!1216 = !DILocation(line: 320, column: 22, scope: !354)
!1217 = !DILocation(line: 320, column: 32, scope: !354)
!1218 = !DILocation(line: 320, column: 13, scope: !354)
!1219 = !DILocation(line: 320, column: 36, scope: !354)
!1220 = !DILocation(line: 320, column: 35, scope: !354)
!1221 = !DILocation(line: 320, column: 11, scope: !354)
!1222 = !DILocation(line: 322, column: 14, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !354, file: !3, line: 322, column: 6)
!1224 = !DILocation(line: 322, column: 6, scope: !1223)
!1225 = !DILocation(line: 322, column: 6, scope: !354)
!1226 = !DILocation(line: 323, column: 28, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1223, file: !3, line: 322, column: 22)
!1228 = !DILocation(line: 323, column: 8, scope: !1227)
!1229 = !DILocation(line: 323, column: 6, scope: !1227)
!1230 = !DILocation(line: 324, column: 7, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1227, file: !3, line: 324, column: 7)
!1232 = !DILocation(line: 324, column: 10, scope: !1231)
!1233 = !DILocation(line: 324, column: 7, scope: !1227)
!1234 = !DILocation(line: 325, column: 51, scope: !1231)
!1235 = !DILocation(line: 325, column: 4, scope: !1231)
!1236 = !DILocation(line: 326, column: 2, scope: !1227)
!1237 = !DILocation(line: 328, column: 20, scope: !354)
!1238 = !{!664, !651, i64 8}
!1239 = !DILocation(line: 328, column: 25, scope: !354)
!1240 = !DILocation(line: 328, column: 2, scope: !354)
!1241 = !DILocation(line: 331, column: 6, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !354, file: !3, line: 331, column: 6)
!1243 = !DILocation(line: 331, column: 9, scope: !1242)
!1244 = !DILocation(line: 331, column: 6, scope: !354)
!1245 = !DILocation(line: 332, column: 9, scope: !1242)
!1246 = !DILocation(line: 332, column: 3, scope: !1242)
!1247 = !DILocation(line: 334, column: 2, scope: !354)
!1248 = !DILocation(line: 335, column: 2, scope: !354)
!1249 = !DILocation(line: 337, column: 18, scope: !354)
!1250 = !DILocation(line: 337, column: 25, scope: !354)
!1251 = !DILocation(line: 337, column: 2, scope: !354)
!1252 = !DILocation(line: 337, column: 13, scope: !354)
!1253 = !DILocation(line: 337, column: 16, scope: !354)
!1254 = !{!1255, !651, i64 0}
!1255 = !{!"pollfd", !651, i64 0, !689, i64 4, !689, i64 6}
!1256 = !DILocation(line: 338, column: 2, scope: !354)
!1257 = !DILocation(line: 338, column: 13, scope: !354)
!1258 = !DILocation(line: 338, column: 20, scope: !354)
!1259 = !{!1255, !689, i64 4}
!1260 = !DILocation(line: 340, column: 65, scope: !354)
!1261 = !DILocation(line: 340, column: 78, scope: !354)
!1262 = !{!664, !651, i64 16}
!1263 = !DILocation(line: 340, column: 2, scope: !354)
!1264 = !DILocation(line: 342, column: 6, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !354, file: !3, line: 342, column: 6)
!1266 = !DILocation(line: 342, column: 19, scope: !1265)
!1267 = !DILocation(line: 342, column: 6, scope: !354)
!1268 = !DILocation(line: 343, column: 3, scope: !1265)
!1269 = !DILocation(line: 345, column: 2, scope: !354)
!1270 = !DILocation(line: 347, column: 16, scope: !354)
!1271 = !DILocation(line: 347, column: 2, scope: !354)
!1272 = !DILocation(line: 351, column: 2, scope: !354)
!1273 = !DILocation(line: 352, column: 14, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1275, file: !3, line: 351, column: 10)
!1275 = distinct !DILexicalBlock(scope: !1276, file: !3, line: 351, column: 2)
!1276 = distinct !DILexicalBlock(scope: !354, file: !3, line: 351, column: 2)
!1277 = !DILocation(line: 352, column: 9, scope: !1274)
!1278 = !DILocation(line: 352, column: 7, scope: !1274)
!1279 = !DILocation(line: 353, column: 7, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1274, file: !3, line: 353, column: 7)
!1281 = !DILocation(line: 353, column: 11, scope: !1280)
!1282 = !DILocation(line: 353, column: 15, scope: !1280)
!1283 = !DILocation(line: 353, column: 18, scope: !1280)
!1284 = !DILocation(line: 353, column: 24, scope: !1280)
!1285 = !DILocation(line: 353, column: 7, scope: !1274)
!1286 = !DILocation(line: 354, column: 4, scope: !1280)
!1287 = !DILocation(line: 355, column: 13, scope: !1274)
!1288 = !DILocation(line: 356, column: 21, scope: !1274)
!1289 = !DILocation(line: 356, column: 3, scope: !1274)
!1290 = !DILocation(line: 351, column: 2, scope: !1275)
!1291 = distinct !{!1291, !1292, !1293}
!1292 = !DILocation(line: 351, column: 2, scope: !1276)
!1293 = !DILocation(line: 357, column: 2, scope: !1276)
!1294 = !DILocation(line: 358, column: 1, scope: !354)
!1295 = !DILocation(line: 359, column: 7, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !354, file: !3, line: 359, column: 2)
!1297 = !DILocation(line: 359, column: 6, scope: !1296)
!1298 = !DILocation(line: 359, column: 11, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1296, file: !3, line: 359, column: 2)
!1300 = !DILocation(line: 359, column: 15, scope: !1299)
!1301 = !DILocation(line: 359, column: 13, scope: !1299)
!1302 = !DILocation(line: 359, column: 2, scope: !1296)
!1303 = !DILocation(line: 360, column: 9, scope: !1299)
!1304 = !DILocation(line: 360, column: 13, scope: !1299)
!1305 = !DILocation(line: 360, column: 16, scope: !1299)
!1306 = !DILocation(line: 360, column: 3, scope: !1299)
!1307 = !DILocation(line: 359, column: 25, scope: !1299)
!1308 = !DILocation(line: 359, column: 2, scope: !1299)
!1309 = distinct !{!1309, !1302, !1310, !847}
!1310 = !DILocation(line: 360, column: 18, scope: !1296)
!1311 = !DILocation(line: 363, column: 20, scope: !354)
!1312 = !DILocation(line: 363, column: 2, scope: !354)
!1313 = !DILocation(line: 364, column: 9, scope: !354)
!1314 = !DILocation(line: 364, column: 16, scope: !354)
!1315 = !DILocation(line: 364, column: 21, scope: !354)
!1316 = !DILocation(line: 364, column: 2, scope: !354)
!1317 = !DILocation(line: 366, column: 16, scope: !354)
!1318 = !DILocation(line: 366, column: 21, scope: !354)
!1319 = !DILocation(line: 366, column: 2, scope: !354)
!1320 = !DILocation(line: 369, column: 3, scope: !354)
!1321 = !DILocation(line: 370, column: 3, scope: !354)
!1322 = !DILocation(line: 370, column: 15, scope: !354)
!1323 = !DILocation(line: 368, column: 2, scope: !354)
!1324 = !DILocation(line: 372, column: 1, scope: !354)
!1325 = !DILocation(line: 371, column: 2, scope: !354)
!1326 = !DISubprogram(name: "pfm_initialize", scope: !1327, file: !1327, line: 823, type: !1328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1327 = !DIFile(filename: "../include/perfmon/pfmlib.h", directory: "/local-ssd/libpfm4-eymjeez6kzzocrqb5p6y26hpb2o7cj4q-build/aidengro/spack-stage-libpfm4-4.13.0-eymjeez6kzzocrqb5p6y26hpb2o7cj4q/spack-src/perf_examples", checksumkind: CSK_MD5, checksum: "2d38033c4ff3b3331ebd0e551ec2d3c7")
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!1330}
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_err_t", file: !1327, line: 720, baseType: !288)
!1331 = !DISubprogram(name: "sysconf", scope: !1332, file: !1332, line: 640, type: !1333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1332 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!427, !288}
!1335 = !DISubprogram(name: "close", scope: !1332, file: !1332, line: 358, type: !1336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!288, !288}
!1338 = !DISubprogram(name: "signal", scope: !1339, file: !1339, line: 88, type: !1340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1339 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!1340 = !DISubroutineType(types: !1341)
!1341 = !{!1342, !288, !1342}
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !1339, line: 72, baseType: !1343)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{null, !288}
!1346 = distinct !DISubprogram(name: "handler", scope: !3, file: !3, line: 302, type: !1344, scopeLine: 303, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1347)
!1347 = !{!1348}
!1348 = !DILocalVariable(name: "n", arg: 1, scope: !1346, file: !3, line: 302, type: !288)
!1349 = !DILocation(line: 302, column: 25, scope: !1346)
!1350 = !DILocation(line: 304, column: 2, scope: !1346)
!1351 = !DISubprogram(name: "_setjmp", scope: !418, file: !418, line: 45, type: !1352, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!288, !1354}
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!1355 = distinct !DISubprogram(name: "start_cpu", scope: !3, file: !3, line: 220, type: !1356, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1358)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{null}
!1358 = !{!1359}
!1359 = !DILocalVariable(name: "ret", scope: !1355, file: !3, line: 222, type: !288)
!1360 = !DILocation(line: 222, column: 2, scope: !1355)
!1361 = !DILocation(line: 222, column: 6, scope: !1355)
!1362 = !DILocation(line: 224, column: 14, scope: !1355)
!1363 = !DILocation(line: 224, column: 21, scope: !1355)
!1364 = !DILocation(line: 224, column: 8, scope: !1355)
!1365 = !DILocation(line: 224, column: 6, scope: !1355)
!1366 = !DILocation(line: 225, column: 6, scope: !1367)
!1367 = distinct !DILexicalBlock(scope: !1355, file: !3, line: 225, column: 6)
!1368 = !DILocation(line: 225, column: 6, scope: !1355)
!1369 = !DILocation(line: 226, column: 3, scope: !1367)
!1370 = !DILocation(line: 227, column: 1, scope: !1355)
!1371 = !DISubprogram(name: "alarm", scope: !1332, file: !1332, line: 452, type: !1372, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!7, !7}
!1374 = !DISubprogram(name: "poll", scope: !362, file: !362, line: 54, type: !1375, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!288, !1377, !1378, !288}
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfds_t", file: !362, line: 33, baseType: !378)
!1379 = !DISubprogram(name: "__errno_location", scope: !1380, file: !1380, line: 37, type: !1381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1380 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!612}
!1383 = distinct !DISubprogram(name: "process_smpl_buf", scope: !3, file: !3, line: 80, type: !1384, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1386)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{null, !446}
!1386 = !{!1387, !1388, !1394}
!1387 = !DILocalVariable(name: "hw", arg: 1, scope: !1383, file: !3, line: 80, type: !446)
!1388 = !DILocalVariable(name: "ehdr", scope: !1383, file: !3, line: 82, type: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perf_event_header", file: !6, line: 448, size: 64, elements: !1390)
!1390 = !{!1391, !1392, !1393}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1389, file: !6, line: 449, baseType: !455, size: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !1389, file: !6, line: 450, baseType: !530, size: 16, offset: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1389, file: !6, line: 451, baseType: !530, size: 16, offset: 48)
!1394 = !DILocalVariable(name: "ret", scope: !1383, file: !3, line: 83, type: !288)
!1395 = !DILocation(line: 80, column: 37, scope: !1383)
!1396 = !DILocation(line: 82, column: 2, scope: !1383)
!1397 = !DILocation(line: 82, column: 27, scope: !1383)
!1398 = !DILocation(line: 83, column: 2, scope: !1383)
!1399 = !DILocation(line: 83, column: 6, scope: !1383)
!1400 = !DILocation(line: 85, column: 2, scope: !1383)
!1401 = !DILocation(line: 86, column: 26, scope: !1402)
!1402 = distinct !DILexicalBlock(scope: !1403, file: !3, line: 85, column: 10)
!1403 = distinct !DILexicalBlock(scope: !1404, file: !3, line: 85, column: 2)
!1404 = distinct !DILexicalBlock(scope: !1383, file: !3, line: 85, column: 2)
!1405 = !DILocation(line: 86, column: 9, scope: !1402)
!1406 = !DILocation(line: 86, column: 7, scope: !1402)
!1407 = !DILocation(line: 87, column: 7, scope: !1408)
!1408 = distinct !DILexicalBlock(scope: !1402, file: !3, line: 87, column: 7)
!1409 = !DILocation(line: 87, column: 7, scope: !1402)
!1410 = !DILocation(line: 114, column: 1, scope: !1383)
!1411 = !DILocation(line: 90, column: 15, scope: !1402)
!1412 = !{!1413, !651, i64 0}
!1413 = !{!"perf_event_header", !651, i64 0, !689, i64 4, !689, i64 6}
!1414 = !DILocation(line: 90, column: 3, scope: !1402)
!1415 = !DILocation(line: 92, column: 31, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1402, file: !3, line: 90, column: 21)
!1417 = !DILocation(line: 92, column: 36, scope: !1416)
!1418 = !DILocation(line: 92, column: 45, scope: !1416)
!1419 = !DILocation(line: 92, column: 50, scope: !1416)
!1420 = !DILocation(line: 92, column: 48, scope: !1416)
!1421 = !DILocation(line: 92, column: 62, scope: !1416)
!1422 = !DILocation(line: 92, column: 11, scope: !1416)
!1423 = !DILocation(line: 92, column: 9, scope: !1416)
!1424 = !DILocation(line: 93, column: 9, scope: !1425)
!1425 = distinct !DILexicalBlock(scope: !1416, file: !3, line: 93, column: 9)
!1426 = !DILocation(line: 93, column: 9, scope: !1416)
!1427 = !DILocation(line: 94, column: 6, scope: !1425)
!1428 = !DILocation(line: 95, column: 22, scope: !1416)
!1429 = !DILocation(line: 96, column: 5, scope: !1416)
!1430 = !DILocation(line: 98, column: 18, scope: !1416)
!1431 = !DILocation(line: 98, column: 22, scope: !1416)
!1432 = !DILocation(line: 98, column: 5, scope: !1416)
!1433 = !DILocation(line: 99, column: 5, scope: !1416)
!1434 = !DILocation(line: 101, column: 34, scope: !1416)
!1435 = !DILocation(line: 101, column: 38, scope: !1416)
!1436 = !DILocation(line: 101, column: 43, scope: !1416)
!1437 = !DILocation(line: 101, column: 52, scope: !1416)
!1438 = !DILocation(line: 101, column: 21, scope: !1416)
!1439 = !DILocation(line: 101, column: 18, scope: !1416)
!1440 = !DILocation(line: 102, column: 5, scope: !1416)
!1441 = !DILocation(line: 104, column: 21, scope: !1416)
!1442 = !DILocation(line: 104, column: 25, scope: !1416)
!1443 = !DILocation(line: 104, column: 5, scope: !1416)
!1444 = !DILocation(line: 105, column: 5, scope: !1416)
!1445 = !DILocation(line: 107, column: 21, scope: !1416)
!1446 = !DILocation(line: 107, column: 25, scope: !1416)
!1447 = !DILocation(line: 107, column: 5, scope: !1416)
!1448 = !DILocation(line: 108, column: 5, scope: !1416)
!1449 = !DILocation(line: 110, column: 45, scope: !1416)
!1450 = !DILocation(line: 110, column: 5, scope: !1416)
!1451 = !DILocation(line: 111, column: 22, scope: !1416)
!1452 = !DILocation(line: 111, column: 31, scope: !1416)
!1453 = !{!1413, !689, i64 6}
!1454 = !DILocation(line: 111, column: 26, scope: !1416)
!1455 = !DILocation(line: 111, column: 36, scope: !1416)
!1456 = !DILocation(line: 111, column: 5, scope: !1416)
!1457 = !DILocation(line: 112, column: 3, scope: !1416)
!1458 = !DILocation(line: 85, column: 2, scope: !1403)
!1459 = distinct !{!1459, !1460, !1461}
!1460 = !DILocation(line: 85, column: 2, scope: !1404)
