; ModuleID = 'samples/76.bc'
source_filename = "src/http/modules/ngx_http_scgi_module.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_http_module_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_command_s = type { %struct.ngx_str_t, i64, ptr, i64, i64, ptr }
%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_path_init_t = type { %struct.ngx_str_t, [3 x i64] }
%struct.ngx_keyval_t = type { %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_conf_bitmask_t = type { %struct.ngx_str_t, i64 }
%struct.ngx_conf_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr }
%struct.ngx_http_scgi_main_conf_t = type { %struct.ngx_array_t }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }
%struct.ngx_http_scgi_loc_conf_t = type { %struct.ngx_http_upstream_conf_t, %struct.ngx_http_scgi_params_t, %struct.ngx_http_scgi_params_t, ptr, ptr, ptr, %struct.ngx_http_complex_value_t }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 429, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/http/modules/ngx_http_scgi_module.c", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2fdf915e39658a2ba3c29b1f3ede7c8a")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 41)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "ngx_http_scgi_module_ctx", scope: !9, file: !2, line: 413, type: !2231, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !10, globals: !1915, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !16, !17, !21, !23, !29, !38, !40, !43, !44, !1910, !50, !24, !963, !1911, !13}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !12, line: 79, baseType: !13)
!12 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !14, line: 90, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!15 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !18, line: 16, baseType: !19)
!18 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !20, line: 16, baseType: !11)
!20 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ee5b3151c1c48b156833d321f8e1946a")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !22, line: 29, baseType: !15)
!22 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !25, line: 33, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !27, line: 31, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !31, line: 21, baseType: !32)
!31 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f0f323751ab5b63196467d991a0424cd")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 17, size: 192, elements: !33)
!33 = !{!34, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !32, file: !31, line: 18, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !32, file: !31, line: 19, baseType: !35, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !32, file: !31, line: 20, baseType: !35, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !39, line: 16, baseType: !16)
!39 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6fc45f3cccbbf41b239dcfa9e2c5b7b1")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !25, line: 87, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !27, line: 153, baseType: !42)
!42 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_len_code_pt", file: !46, line: 86, baseType: !47)
!46 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c578244e54828180ff4c16989ec8b484")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!21, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_engine_t", file: !46, line: 36, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 17, size: 704, elements: !53)
!53 = !{!54, !55, !56, !71, !77, !78, !79, !80, !81, !82, !83, !84, !89}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !52, file: !46, line: 18, baseType: !23, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !52, file: !46, line: 19, baseType: !23, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !52, file: !46, line: 20, baseType: !57, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !59, line: 17, baseType: !60)
!59 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "8a2cbae62e5b0b58d6be14fb066f5b31")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !61, line: 37, baseType: !62)
!61 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "aecf67ab89c624000ba2e2684dbcfdc8")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 28, size: 128, elements: !63)
!63 = !{!64, !66, !67, !68, !69, !70}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !62, file: !61, line: 29, baseType: !65, size: 28, flags: DIFlagBitField, extraData: i64 0)
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !62, file: !61, line: 31, baseType: !65, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !62, file: !61, line: 32, baseType: !65, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !62, file: !61, line: 33, baseType: !65, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !62, file: !61, line: 34, baseType: !65, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !62, file: !61, line: 36, baseType: !23, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !52, file: !46, line: 22, baseType: !72, size: 128, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !61, line: 19, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 16, size: 128, elements: !74)
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, file: !61, line: 17, baseType: !21, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !61, line: 18, baseType: !23, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !52, file: !46, line: 23, baseType: !72, size: 128, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !52, file: !46, line: 26, baseType: !23, size: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !52, file: !46, line: 28, baseType: !65, size: 1, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !52, file: !46, line: 29, baseType: !65, size: 1, offset: 513, flags: DIFlagBitField, extraData: i64 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !52, file: !46, line: 30, baseType: !65, size: 1, offset: 514, flags: DIFlagBitField, extraData: i64 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "is_args", scope: !52, file: !46, line: 31, baseType: !65, size: 1, offset: 515, flags: DIFlagBitField, extraData: i64 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !52, file: !46, line: 32, baseType: !65, size: 1, offset: 516, flags: DIFlagBitField, extraData: i64 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !52, file: !46, line: 34, baseType: !85, size: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !12, line: 78, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !87, line: 267, baseType: !88)
!87 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !27, line: 207, baseType: !42)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !52, file: !46, line: 35, baseType: !90, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !92, line: 16, baseType: !93)
!92 = !DIFile(filename: "src/http/ngx_http.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "936639e5730ac898b9486f4f53b5f2f5")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !94, line: 371, size: 11456, elements: !95)
!94 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1757f93ddb5cd3c545713a957f23192d")
!95 = !{!96, !100, !499, !500, !501, !502, !503, !508, !509, !735, !1474, !1475, !1476, !1477, !1519, !1551, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1597, !1608, !1615, !1616, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1803, !1807, !1812, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !93, file: !94, line: 372, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !98, line: 26, baseType: !99)
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !27, line: 42, baseType: !65)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !93, file: !94, line: 374, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !103, line: 26, baseType: !104)
!103 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1c4d8383f329aa1de050d17038ecb169")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !105, line: 124, size: 1920, elements: !106)
!105 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf513a87e959064e14502903e9282b0e")
!106 = !{!107, !108, !207, !208, !211, !219, !221, !307, !312, !388, !389, !390, !427, !428, !429, !430, !431, !432, !437, !475, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !105, line: 125, baseType: !16, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !104, file: !105, line: 126, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !103, line: 24, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !112, line: 30, size: 768, elements: !113)
!112 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c79f651cc4aca504d9d912404beb8bf3")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !142, !143, !188, !199}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !111, file: !112, line: 31, baseType: !16, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !111, file: !112, line: 33, baseType: !65, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !111, file: !112, line: 35, baseType: !65, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !111, file: !112, line: 38, baseType: !65, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !111, file: !112, line: 44, baseType: !65, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !111, file: !112, line: 46, baseType: !65, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !111, file: !112, line: 49, baseType: !65, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !111, file: !112, line: 51, baseType: !65, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !111, file: !112, line: 54, baseType: !65, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !111, file: !112, line: 56, baseType: !65, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !111, file: !112, line: 57, baseType: !65, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !111, file: !112, line: 59, baseType: !65, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !111, file: !112, line: 60, baseType: !65, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !111, file: !112, line: 62, baseType: !65, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !111, file: !112, line: 64, baseType: !65, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !111, file: !112, line: 67, baseType: !65, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !111, file: !112, line: 69, baseType: !65, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !111, file: !112, line: 71, baseType: !65, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !111, file: !112, line: 74, baseType: !65, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !111, file: !112, line: 75, baseType: !65, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "skip_socket_leak_check", scope: !111, file: !112, line: 77, baseType: !65, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !111, file: !112, line: 80, baseType: !65, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !111, file: !112, line: 110, baseType: !65, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !111, file: !112, line: 113, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !103, line: 32, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !109}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !111, file: !112, line: 120, baseType: !11, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !111, file: !112, line: 122, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !103, line: 20, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !147, line: 50, size: 640, elements: !148)
!147 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f35895306f847777914ce99ffeccfabd")
!148 = !{!149, !150, !166, !169, !173, !178, !179, !184, !185, !187}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !146, file: !147, line: 51, baseType: !11, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !146, file: !147, line: 52, baseType: !151, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !103, line: 21, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !154, line: 89, size: 320, elements: !155)
!154 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6ae6b72e2fd6bbb6ecc9de2e6386072c")
!155 = !{!156, !160, !161, !165}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !153, file: !154, line: 90, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !158, line: 16, baseType: !159)
!158 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "7b9a751e8c1ad1afef5467d60ed94e69")
!159 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !154, line: 91, baseType: !72, size: 128, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !153, file: !154, line: 93, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !151, !144}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 94, baseType: !16, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !146, file: !147, line: 54, baseType: !167, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !168, line: 98, baseType: !15)
!168 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "eac8f0294f941da9268c3a72c9fca0e1")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !146, file: !147, line: 56, baseType: !170, size: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !171, line: 10, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !27, line: 160, baseType: !42)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !146, file: !147, line: 58, baseType: !174, size: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !147, line: 45, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!23, !144, !23, !21}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 59, baseType: !16, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !146, file: !147, line: 61, baseType: !180, size: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !147, line: 46, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !144, !11, !23, !21}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !146, file: !147, line: 62, baseType: !16, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !146, file: !147, line: 70, baseType: !186, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !147, line: 72, baseType: !144, size: 64, offset: 576)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !111, file: !112, line: 124, baseType: !189, size: 320, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !20, line: 20, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !20, line: 22, size: 320, elements: !191)
!191 = !{!192, !193, !195, !196, !197, !198}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !190, file: !20, line: 23, baseType: !19, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !190, file: !20, line: 24, baseType: !194, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !190, file: !20, line: 25, baseType: !194, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !190, file: !20, line: 26, baseType: !194, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !190, file: !20, line: 27, baseType: !24, size: 8, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !190, file: !20, line: 28, baseType: !24, size: 8, offset: 264)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !111, file: !112, line: 127, baseType: !200, size: 128, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !201, line: 16, baseType: !202)
!201 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !201, line: 18, size: 128, elements: !203)
!203 = !{!204, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !201, line: 19, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !201, line: 20, baseType: !205, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !104, file: !105, line: 127, baseType: !109, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !104, file: !105, line: 129, baseType: !209, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !210, line: 17, baseType: !159)
!210 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ad64fd7b9f2b4876e8c9dcdeeb2305ce")
!211 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !104, file: !105, line: 131, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !213, line: 19, baseType: !214)
!213 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!217, !101, !23, !21}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 108, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !27, line: 194, baseType: !42)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !104, file: !105, line: 132, baseType: !220, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !213, line: 22, baseType: !214)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !104, file: !105, line: 133, baseType: !222, size: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !213, line: 20, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!217, !101, !226, !40}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !103, line: 19, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !39, line: 59, size: 128, elements: !229)
!229 = !{!230, !306}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !228, file: !39, line: 60, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !39, line: 18, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !39, line: 20, size: 640, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !233, file: !39, line: 21, baseType: !23, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !233, file: !39, line: 22, baseType: !23, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !233, file: !39, line: 23, baseType: !40, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !233, file: !39, line: 24, baseType: !40, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !233, file: !39, line: 26, baseType: !23, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !233, file: !39, line: 27, baseType: !23, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !233, file: !39, line: 28, baseType: !38, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !233, file: !39, line: 29, baseType: !243, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !103, line: 23, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !246, line: 16, size: 1600, elements: !247)
!246 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!247 = !{!248, !249, !250, !288, !289, !290, !291, !292}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !245, file: !246, line: 17, baseType: !157, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !245, file: !246, line: 18, baseType: !72, size: 128, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !245, file: !246, line: 19, baseType: !251, size: 1152, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !158, line: 17, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !253, line: 26, size: 1152, elements: !254)
!253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!254 = !{!255, !257, !259, !261, !263, !265, !267, !268, !269, !271, !273, !275, !282, !283, !284}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !252, file: !253, line: 31, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !27, line: 145, baseType: !15)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !252, file: !253, line: 36, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !27, line: 148, baseType: !15)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !252, file: !253, line: 44, baseType: !260, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !27, line: 151, baseType: !15)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !252, file: !253, line: 45, baseType: !262, size: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !27, line: 150, baseType: !65)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !252, file: !253, line: 47, baseType: !264, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !27, line: 146, baseType: !65)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !252, file: !253, line: 48, baseType: !266, size: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !27, line: 147, baseType: !65)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !252, file: !253, line: 50, baseType: !159, size: 32, offset: 288)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !252, file: !253, line: 52, baseType: !256, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !252, file: !253, line: 57, baseType: !270, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !27, line: 152, baseType: !42)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !252, file: !253, line: 61, baseType: !272, size: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !27, line: 175, baseType: !42)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !252, file: !253, line: 63, baseType: !274, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !27, line: 180, baseType: !42)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !252, file: !253, line: 74, baseType: !276, size: 128, offset: 576)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !277, line: 11, size: 128, elements: !278)
!277 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !276, file: !277, line: 16, baseType: !172, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !276, file: !277, line: 21, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !27, line: 197, baseType: !42)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !252, file: !253, line: 75, baseType: !276, size: 128, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !252, file: !253, line: 76, baseType: !276, size: 128, offset: 832)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !252, file: !253, line: 89, baseType: !285, size: 192, offset: 960)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 192, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 3)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !245, file: !246, line: 21, baseType: !40, size: 64, offset: 1344)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !245, file: !246, line: 22, baseType: !40, size: 64, offset: 1408)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !245, file: !246, line: 24, baseType: !144, size: 64, offset: 1472)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !245, file: !246, line: 37, baseType: !65, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !245, file: !246, line: 38, baseType: !65, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !233, file: !39, line: 30, baseType: !231, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !233, file: !39, line: 34, baseType: !65, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !233, file: !39, line: 40, baseType: !65, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !233, file: !39, line: 43, baseType: !65, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !233, file: !39, line: 45, baseType: !65, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !233, file: !39, line: 46, baseType: !65, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !233, file: !39, line: 47, baseType: !65, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !233, file: !39, line: 48, baseType: !65, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !233, file: !39, line: 49, baseType: !65, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !233, file: !39, line: 50, baseType: !65, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !233, file: !39, line: 52, baseType: !65, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !233, file: !39, line: 53, baseType: !65, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !233, file: !39, line: 55, baseType: !159, size: 32, offset: 608)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !39, line: 61, baseType: !226, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !104, file: !105, line: 134, baseType: !308, size: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !213, line: 23, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!226, !101, !226, !40}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !104, file: !105, line: 136, baseType: !313, size: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !105, line: 16, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !105, line: 18, size: 2432, elements: !316)
!316 = !{!317, !318, !331, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !315, file: !105, line: 19, baseType: !209, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !315, file: !105, line: 21, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !321, line: 180, size: 128, elements: !322)
!321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!322 = !{!323, !327}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !320, file: !321, line: 182, baseType: !324, size: 16)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !325, line: 28, baseType: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!326 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !320, file: !321, line: 183, baseType: !328, size: 112, offset: 16)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 14)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !315, file: !105, line: 22, baseType: !332, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !87, line: 274, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !27, line: 210, baseType: !65)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !315, file: !105, line: 23, baseType: !21, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !315, file: !105, line: 24, baseType: !72, size: 128, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !105, line: 26, baseType: !159, size: 32, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !315, file: !105, line: 28, baseType: !159, size: 32, offset: 416)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !315, file: !105, line: 29, baseType: !159, size: 32, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !315, file: !105, line: 30, baseType: !159, size: 32, offset: 480)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !315, file: !105, line: 32, baseType: !159, size: 32, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !315, file: !105, line: 33, baseType: !159, size: 32, offset: 544)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !315, file: !105, line: 34, baseType: !159, size: 32, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !315, file: !105, line: 38, baseType: !344, size: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !103, line: 33, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !101}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !315, file: !105, line: 40, baseType: !16, size: 64, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !315, file: !105, line: 42, baseType: !145, size: 640, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !315, file: !105, line: 43, baseType: !144, size: 64, offset: 1408)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !315, file: !105, line: 45, baseType: !21, size: 64, offset: 1472)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !315, file: !105, line: 47, baseType: !21, size: 64, offset: 1536)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !315, file: !105, line: 49, baseType: !17, size: 64, offset: 1600)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !315, file: !105, line: 51, baseType: !313, size: 64, offset: 1664)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !315, file: !105, line: 52, baseType: !101, size: 64, offset: 1728)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !315, file: !105, line: 54, baseType: !357, size: 192, offset: 1792)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !20, line: 32, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !20, line: 37, size: 192, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !358, file: !20, line: 38, baseType: !194, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !358, file: !20, line: 39, baseType: !194, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !358, file: !20, line: 40, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !20, line: 34, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !194, !194, !194}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !315, file: !105, line: 55, baseType: !189, size: 320, offset: 1984)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !315, file: !105, line: 57, baseType: !11, size: 64, offset: 2304)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !315, file: !105, line: 59, baseType: !65, size: 1, offset: 2368, flags: DIFlagBitField, extraData: i64 2368)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !315, file: !105, line: 60, baseType: !65, size: 1, offset: 2369, flags: DIFlagBitField, extraData: i64 2368)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !315, file: !105, line: 61, baseType: !65, size: 1, offset: 2370, flags: DIFlagBitField, extraData: i64 2368)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !315, file: !105, line: 63, baseType: !65, size: 1, offset: 2371, flags: DIFlagBitField, extraData: i64 2368)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !315, file: !105, line: 64, baseType: !65, size: 1, offset: 2372, flags: DIFlagBitField, extraData: i64 2368)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !315, file: !105, line: 65, baseType: !65, size: 1, offset: 2373, flags: DIFlagBitField, extraData: i64 2368)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !315, file: !105, line: 66, baseType: !65, size: 1, offset: 2374, flags: DIFlagBitField, extraData: i64 2368)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !315, file: !105, line: 67, baseType: !65, size: 1, offset: 2375, flags: DIFlagBitField, extraData: i64 2368)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !315, file: !105, line: 68, baseType: !65, size: 1, offset: 2376, flags: DIFlagBitField, extraData: i64 2368)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !315, file: !105, line: 69, baseType: !65, size: 1, offset: 2377, flags: DIFlagBitField, extraData: i64 2368)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !315, file: !105, line: 70, baseType: !65, size: 1, offset: 2378, flags: DIFlagBitField, extraData: i64 2368)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !315, file: !105, line: 73, baseType: !65, size: 1, offset: 2379, flags: DIFlagBitField, extraData: i64 2368)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !315, file: !105, line: 75, baseType: !65, size: 1, offset: 2380, flags: DIFlagBitField, extraData: i64 2368)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !315, file: !105, line: 76, baseType: !65, size: 1, offset: 2381, flags: DIFlagBitField, extraData: i64 2368)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !315, file: !105, line: 77, baseType: !65, size: 2, offset: 2382, flags: DIFlagBitField, extraData: i64 2368)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !315, file: !105, line: 79, baseType: !65, size: 1, offset: 2384, flags: DIFlagBitField, extraData: i64 2368)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !315, file: !105, line: 80, baseType: !65, size: 1, offset: 2385, flags: DIFlagBitField, extraData: i64 2368)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !315, file: !105, line: 81, baseType: !65, size: 1, offset: 2386, flags: DIFlagBitField, extraData: i64 2368)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !315, file: !105, line: 90, baseType: !159, size: 32, offset: 2400)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !104, file: !105, line: 138, baseType: !40, size: 64, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !104, file: !105, line: 140, baseType: !144, size: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !104, file: !105, line: 142, baseType: !391, size: 64, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !103, line: 18, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !394, line: 57, size: 640, elements: !395)
!394 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!395 = !{!396, !404, !405, !406, !407, !414, !426}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !393, file: !394, line: 58, baseType: !397, size: 256)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !394, line: 54, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 49, size: 256, elements: !399)
!399 = !{!400, !401, !402, !403}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !398, file: !394, line: 50, baseType: !23, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !398, file: !394, line: 51, baseType: !23, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !394, line: 52, baseType: !391, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !398, file: !394, line: 53, baseType: !11, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !393, file: !394, line: 59, baseType: !21, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !393, file: !394, line: 60, baseType: !391, size: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !393, file: !394, line: 61, baseType: !226, size: 64, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !393, file: !394, line: 62, baseType: !408, size: 64, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !394, line: 41, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !394, line: 43, size: 128, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !394, line: 44, baseType: !408, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !410, file: !394, line: 45, baseType: !16, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !393, file: !394, line: 63, baseType: !415, size: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !394, line: 32, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !394, line: 34, size: 192, elements: !418)
!418 = !{!419, !424, !425}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !417, file: !394, line: 35, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !394, line: 30, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !16}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !417, file: !394, line: 36, baseType: !16, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !394, line: 37, baseType: !415, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !393, file: !394, line: 64, baseType: !144, size: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !105, line: 144, baseType: !159, size: 32, offset: 768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !104, file: !105, line: 146, baseType: !319, size: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !104, file: !105, line: 147, baseType: !332, size: 32, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !104, file: !105, line: 148, baseType: !72, size: 128, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !104, file: !105, line: 150, baseType: !72, size: 128, offset: 1088)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !104, file: !105, line: 151, baseType: !433, size: 16, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !434, line: 123, baseType: !435)
!434 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !98, line: 25, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !27, line: 40, baseType: !326)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !104, file: !105, line: 154, baseType: !438, size: 64, offset: 1280)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !103, line: 29, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !441, line: 74, size: 704, elements: !442)
!441 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "51639b814b1b55c5b35047c033281672")
!442 = !{!443, !448, !452, !453, !454, !455, !456, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !440, file: !441, line: 75, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !446, line: 184, baseType: !447)
!446 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !446, line: 184, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !440, file: !441, line: 76, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !446, line: 185, baseType: !451)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !446, line: 185, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !440, file: !441, line: 78, baseType: !85, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !440, file: !441, line: 79, baseType: !231, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !440, file: !441, line: 80, baseType: !21, size: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !440, file: !441, line: 82, baseType: !344, size: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !440, file: !441, line: 84, baseType: !457, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !459, line: 231, baseType: !460)
!459 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "848d42aedd0da44ffda19088217823c7")
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !459, line: 231, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !440, file: !441, line: 85, baseType: !344, size: 64, offset: 448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !440, file: !441, line: 87, baseType: !138, size: 64, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !440, file: !441, line: 88, baseType: !138, size: 64, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !440, file: !441, line: 90, baseType: !24, size: 8, offset: 640)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !440, file: !441, line: 92, baseType: !65, size: 1, offset: 648, flags: DIFlagBitField, extraData: i64 648)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !440, file: !441, line: 93, baseType: !65, size: 1, offset: 649, flags: DIFlagBitField, extraData: i64 648)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !440, file: !441, line: 94, baseType: !65, size: 1, offset: 650, flags: DIFlagBitField, extraData: i64 648)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !440, file: !441, line: 95, baseType: !65, size: 1, offset: 651, flags: DIFlagBitField, extraData: i64 648)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !440, file: !441, line: 96, baseType: !65, size: 1, offset: 652, flags: DIFlagBitField, extraData: i64 648)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !440, file: !441, line: 97, baseType: !65, size: 1, offset: 653, flags: DIFlagBitField, extraData: i64 648)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !440, file: !441, line: 98, baseType: !65, size: 1, offset: 654, flags: DIFlagBitField, extraData: i64 648)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !440, file: !441, line: 99, baseType: !65, size: 1, offset: 655, flags: DIFlagBitField, extraData: i64 648)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !440, file: !441, line: 100, baseType: !65, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 648)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !440, file: !441, line: 101, baseType: !65, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 648)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !104, file: !105, line: 157, baseType: !476, size: 64, offset: 1344)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !103, line: 30, baseType: !478)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !103, line: 30, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !104, file: !105, line: 159, baseType: !319, size: 64, offset: 1408)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !104, file: !105, line: 160, baseType: !332, size: 32, offset: 1472)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !104, file: !105, line: 162, baseType: !231, size: 64, offset: 1536)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !104, file: !105, line: 164, baseType: !200, size: 128, offset: 1600)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !104, file: !105, line: 166, baseType: !167, size: 64, offset: 1728)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !104, file: !105, line: 168, baseType: !11, size: 64, offset: 1792)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !104, file: !105, line: 170, baseType: !65, size: 8, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !104, file: !105, line: 172, baseType: !65, size: 3, offset: 1864, flags: DIFlagBitField, extraData: i64 1856)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !104, file: !105, line: 174, baseType: !65, size: 1, offset: 1867, flags: DIFlagBitField, extraData: i64 1856)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !104, file: !105, line: 175, baseType: !65, size: 1, offset: 1868, flags: DIFlagBitField, extraData: i64 1856)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !104, file: !105, line: 176, baseType: !65, size: 1, offset: 1869, flags: DIFlagBitField, extraData: i64 1856)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !104, file: !105, line: 178, baseType: !65, size: 1, offset: 1870, flags: DIFlagBitField, extraData: i64 1856)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !104, file: !105, line: 179, baseType: !65, size: 1, offset: 1871, flags: DIFlagBitField, extraData: i64 1856)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !104, file: !105, line: 180, baseType: !65, size: 1, offset: 1872, flags: DIFlagBitField, extraData: i64 1856)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !104, file: !105, line: 181, baseType: !65, size: 1, offset: 1873, flags: DIFlagBitField, extraData: i64 1856)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !104, file: !105, line: 183, baseType: !65, size: 1, offset: 1874, flags: DIFlagBitField, extraData: i64 1856)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !104, file: !105, line: 184, baseType: !65, size: 1, offset: 1875, flags: DIFlagBitField, extraData: i64 1856)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !104, file: !105, line: 185, baseType: !65, size: 2, offset: 1876, flags: DIFlagBitField, extraData: i64 1856)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !104, file: !105, line: 186, baseType: !65, size: 2, offset: 1878, flags: DIFlagBitField, extraData: i64 1856)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !104, file: !105, line: 188, baseType: !65, size: 1, offset: 1880, flags: DIFlagBitField, extraData: i64 1856)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !93, file: !94, line: 376, baseType: !35, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !93, file: !94, line: 377, baseType: !35, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !93, file: !94, line: 378, baseType: !35, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !93, file: !94, line: 379, baseType: !35, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !93, file: !94, line: 381, baseType: !504, size: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !94, line: 368, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !90}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !93, file: !94, line: 382, baseType: !504, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !93, file: !94, line: 385, baseType: !510, size: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !92, line: 18, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !513, line: 65, size: 4800, elements: !514)
!513 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "04ea2ebc84c597718a4782ab3cabf19d")
!514 = !{!515, !516, !526, !527, !531, !532, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !693, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !512, file: !513, line: 66, baseType: !244, size: 1600)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !512, file: !513, line: 67, baseType: !517, size: 320, offset: 1600)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !518, line: 22, baseType: !519)
!518 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 16, size: 320, elements: !520)
!520 = !{!521, !522, !523, !524, !525}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !519, file: !518, line: 17, baseType: !16, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !519, file: !518, line: 18, baseType: !11, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !518, line: 19, baseType: !21, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !519, file: !518, line: 20, baseType: !11, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !519, file: !518, line: 21, baseType: !391, size: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !512, file: !513, line: 68, baseType: !97, size: 32, offset: 1920)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !512, file: !513, line: 69, baseType: !528, size: 128, offset: 1952)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !512, file: !513, line: 70, baseType: !528, size: 128, offset: 2080)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !512, file: !513, line: 72, baseType: !533, size: 64, offset: 2240)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !158, line: 18, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !25, line: 49, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !27, line: 149, baseType: !15)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !512, file: !513, line: 73, baseType: !170, size: 64, offset: 2304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !512, file: !513, line: 74, baseType: !170, size: 64, offset: 2368)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !512, file: !513, line: 75, baseType: !170, size: 64, offset: 2432)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !512, file: !513, line: 76, baseType: !170, size: 64, offset: 2496)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !512, file: !513, line: 77, baseType: !170, size: 64, offset: 2560)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !512, file: !513, line: 79, baseType: !72, size: 128, offset: 2624)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !512, file: !513, line: 80, baseType: !72, size: 128, offset: 2752)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !512, file: !513, line: 81, baseType: !528, size: 128, offset: 2880)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !512, file: !513, line: 83, baseType: !21, size: 64, offset: 3008)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !512, file: !513, line: 84, baseType: !21, size: 64, offset: 3072)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !512, file: !513, line: 85, baseType: !40, size: 64, offset: 3136)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !512, file: !513, line: 86, baseType: !40, size: 64, offset: 3200)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !512, file: !513, line: 88, baseType: !11, size: 64, offset: 3264)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !512, file: !513, line: 89, baseType: !11, size: 64, offset: 3328)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !512, file: !513, line: 90, baseType: !11, size: 64, offset: 3392)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !512, file: !513, line: 91, baseType: !11, size: 64, offset: 3456)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !512, file: !513, line: 93, baseType: !231, size: 64, offset: 3520)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !512, file: !513, line: 95, baseType: !554, size: 64, offset: 3584)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !92, line: 19, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !513, line: 157, size: 1088, elements: !557)
!557 = !{!558, !573, !634, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !692}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !556, file: !513, line: 158, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !513, line: 154, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 145, size: 960, elements: !562)
!562 = !{!563, !564, !565, !566, !569, !570, !571, !572}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !561, file: !513, line: 146, baseType: !357, size: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !561, file: !513, line: 147, baseType: !189, size: 320, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !561, file: !513, line: 148, baseType: !200, size: 128, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !561, file: !513, line: 149, baseType: !567, size: 64, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !168, line: 106, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !561, file: !513, line: 150, baseType: !567, size: 64, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !561, file: !513, line: 151, baseType: !40, size: 64, offset: 768)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !561, file: !513, line: 152, baseType: !11, size: 64, offset: 832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !561, file: !513, line: 153, baseType: !11, size: 64, offset: 896)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !556, file: !513, line: 159, baseType: !574, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !576, line: 59, baseType: !577)
!576 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6137611cd598fa2ecc498e6967a03177")
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !576, line: 34, size: 1600, elements: !578)
!578 = !{!579, !586, !587, !588, !596, !597, !598, !607, !608, !609, !610, !629, !630, !631, !632, !633}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !577, file: !576, line: 35, baseType: !580, size: 128)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !581, line: 21, baseType: !582)
!581 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "56a332e5761f46e2bb83cbdaf8b18a9f")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 16, size: 128, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !582, file: !581, line: 17, baseType: !567, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !582, file: !581, line: 19, baseType: !567, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !577, file: !576, line: 37, baseType: !21, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !577, file: !576, line: 38, baseType: !21, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !577, file: !576, line: 40, baseType: !589, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !576, line: 16, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !576, line: 18, size: 192, elements: !592)
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !591, file: !576, line: 19, baseType: !13, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !591, file: !576, line: 20, baseType: !589, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !591, file: !576, line: 21, baseType: !13, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !577, file: !576, line: 41, baseType: !589, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !577, file: !576, line: 42, baseType: !590, size: 192, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !577, file: !576, line: 44, baseType: !599, size: 64, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !576, line: 31, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !576, line: 25, size: 256, elements: !602)
!602 = !{!603, !604, !605, !606}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !601, file: !576, line: 26, baseType: !11, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !601, file: !576, line: 27, baseType: !11, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !601, file: !576, line: 29, baseType: !11, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !601, file: !576, line: 30, baseType: !11, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !577, file: !576, line: 45, baseType: !11, size: 64, offset: 640)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !577, file: !576, line: 47, baseType: !23, size: 64, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !577, file: !576, line: 48, baseType: !23, size: 64, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !577, file: !576, line: 50, baseType: !611, size: 512, offset: 832)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !581, line: 37, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 24, size: 512, elements: !613)
!613 = !{!614, !616, !617, !618, !628}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !612, file: !581, line: 26, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !612, file: !581, line: 28, baseType: !615, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !612, file: !581, line: 29, baseType: !11, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !612, file: !581, line: 30, baseType: !619, size: 256, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !620, line: 39, baseType: !621)
!620 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !620, line: 35, size: 256, elements: !622)
!622 = !{!623, !627}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !621, file: !620, line: 37, baseType: !624, size: 256)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !621, file: !620, line: 38, baseType: !42, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !612, file: !581, line: 36, baseType: !11, size: 64, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !577, file: !576, line: 52, baseType: !23, size: 64, offset: 1344)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !577, file: !576, line: 53, baseType: !24, size: 8, offset: 1408)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !577, file: !576, line: 55, baseType: !65, size: 1, offset: 1416, flags: DIFlagBitField, extraData: i64 1416)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !577, file: !576, line: 57, baseType: !16, size: 64, offset: 1472)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !577, file: !576, line: 58, baseType: !16, size: 64, offset: 1536)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !556, file: !513, line: 161, baseType: !635, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !246, line: 62, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 50, size: 768, elements: !638)
!638 = !{!639, !640, !641, !643, !648, !650, !652, !653, !654}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !637, file: !246, line: 51, baseType: !72, size: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !637, file: !246, line: 52, baseType: !21, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !637, file: !246, line: 53, baseType: !642, size: 192, offset: 192)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 192, elements: !286)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !637, file: !246, line: 55, baseType: !644, size: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !246, line: 45, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!17, !16}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !637, file: !246, line: 56, baseType: !649, size: 64, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !246, line: 46, baseType: !645)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !637, file: !246, line: 57, baseType: !651, size: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !246, line: 47, baseType: !421)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !637, file: !246, line: 58, baseType: !16, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !637, file: !246, line: 60, baseType: !23, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !637, file: !246, line: 61, baseType: !11, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !556, file: !513, line: 163, baseType: !40, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !556, file: !513, line: 164, baseType: !21, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !556, file: !513, line: 166, baseType: !170, size: 64, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !556, file: !513, line: 168, baseType: !170, size: 64, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !556, file: !513, line: 170, baseType: !11, size: 64, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !556, file: !513, line: 171, baseType: !11, size: 64, offset: 512)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !556, file: !513, line: 172, baseType: !17, size: 64, offset: 576)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !556, file: !513, line: 173, baseType: !17, size: 64, offset: 640)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !556, file: !513, line: 174, baseType: !17, size: 64, offset: 704)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !556, file: !513, line: 176, baseType: !11, size: 64, offset: 768)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !556, file: !513, line: 177, baseType: !17, size: 64, offset: 832)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !556, file: !513, line: 178, baseType: !17, size: 64, offset: 896)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !556, file: !513, line: 180, baseType: !668, size: 64, offset: 960)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !670, line: 31, baseType: !671)
!670 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "084646d0d3ecf791b89c14281fd46376")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !670, line: 37, size: 704, elements: !672)
!672 = !{!673, !674, !684, !689, !690, !691}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !671, file: !670, line: 38, baseType: !16, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !671, file: !670, line: 39, baseType: !675, size: 384, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !676, line: 22, baseType: !677)
!676 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf27d4781f3b25ce5eb9a764f55ea2d4")
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !676, line: 16, size: 384, elements: !678)
!678 = !{!679, !680, !681, !682, !683}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !677, file: !676, line: 17, baseType: !23, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !677, file: !676, line: 18, baseType: !21, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !677, file: !676, line: 19, baseType: !72, size: 128, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !677, file: !676, line: 20, baseType: !144, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !677, file: !676, line: 21, baseType: !11, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !671, file: !670, line: 40, baseType: !685, size: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !670, line: 33, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!85, !668, !16}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !671, file: !670, line: 41, baseType: !16, size: 64, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !671, file: !670, line: 42, baseType: !16, size: 64, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !671, file: !670, line: 43, baseType: !11, size: 64, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !556, file: !513, line: 182, baseType: !11, size: 64, offset: 1024)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !512, file: !513, line: 96, baseType: !694, size: 64, offset: 3648)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !513, line: 62, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 39, size: 960, elements: !697)
!697 = !{!698, !699, !700, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !696, file: !513, line: 40, baseType: !189, size: 320)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !696, file: !513, line: 41, baseType: !200, size: 128, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !696, file: !513, line: 43, baseType: !701, size: 64, offset: 448)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 8)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !696, file: !513, line: 46, baseType: !65, size: 20, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !696, file: !513, line: 47, baseType: !65, size: 10, offset: 532, flags: DIFlagBitField, extraData: i64 512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !696, file: !513, line: 48, baseType: !65, size: 10, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !696, file: !513, line: 49, baseType: !65, size: 10, offset: 554, flags: DIFlagBitField, extraData: i64 544)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !696, file: !513, line: 50, baseType: !65, size: 1, offset: 564, flags: DIFlagBitField, extraData: i64 544)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !696, file: !513, line: 51, baseType: !65, size: 1, offset: 565, flags: DIFlagBitField, extraData: i64 544)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !696, file: !513, line: 52, baseType: !65, size: 1, offset: 566, flags: DIFlagBitField, extraData: i64 544)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !696, file: !513, line: 53, baseType: !65, size: 1, offset: 567, flags: DIFlagBitField, extraData: i64 544)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !696, file: !513, line: 56, baseType: !533, size: 64, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !696, file: !513, line: 57, baseType: !170, size: 64, offset: 640)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !696, file: !513, line: 58, baseType: !170, size: 64, offset: 704)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !696, file: !513, line: 59, baseType: !21, size: 64, offset: 768)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !696, file: !513, line: 60, baseType: !40, size: 64, offset: 832)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !696, file: !513, line: 61, baseType: !17, size: 64, offset: 896)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !512, file: !513, line: 102, baseType: !17, size: 64, offset: 3712)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !512, file: !513, line: 103, baseType: !17, size: 64, offset: 3776)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !512, file: !513, line: 104, baseType: !17, size: 64, offset: 3840)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !512, file: !513, line: 105, baseType: !17, size: 64, offset: 3904)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !512, file: !513, line: 107, baseType: !110, size: 768, offset: 3968)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !512, file: !513, line: 109, baseType: !65, size: 1, offset: 4736, flags: DIFlagBitField, extraData: i64 4736)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !512, file: !513, line: 110, baseType: !65, size: 1, offset: 4737, flags: DIFlagBitField, extraData: i64 4736)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !512, file: !513, line: 112, baseType: !65, size: 1, offset: 4738, flags: DIFlagBitField, extraData: i64 4736)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !512, file: !513, line: 113, baseType: !65, size: 1, offset: 4739, flags: DIFlagBitField, extraData: i64 4736)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !512, file: !513, line: 114, baseType: !65, size: 1, offset: 4740, flags: DIFlagBitField, extraData: i64 4736)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !512, file: !513, line: 115, baseType: !65, size: 1, offset: 4741, flags: DIFlagBitField, extraData: i64 4736)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !512, file: !513, line: 116, baseType: !65, size: 1, offset: 4742, flags: DIFlagBitField, extraData: i64 4736)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !512, file: !513, line: 117, baseType: !65, size: 1, offset: 4743, flags: DIFlagBitField, extraData: i64 4736)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !512, file: !513, line: 118, baseType: !65, size: 1, offset: 4744, flags: DIFlagBitField, extraData: i64 4736)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !512, file: !513, line: 119, baseType: !65, size: 1, offset: 4745, flags: DIFlagBitField, extraData: i64 4736)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !512, file: !513, line: 121, baseType: !65, size: 1, offset: 4746, flags: DIFlagBitField, extraData: i64 4736)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !512, file: !513, line: 122, baseType: !65, size: 1, offset: 4747, flags: DIFlagBitField, extraData: i64 4736)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !93, file: !94, line: 388, baseType: !736, size: 64, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !92, line: 17, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !739, line: 319, size: 8960, elements: !740)
!739 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c0fceda7aff0a351f062ef07edbc2de2")
!740 = !{!741, !746, !747, !796, !875, !876, !898, !907, !1189, !1190, !1191, !1192, !1193, !1194, !1234, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1415, !1419, !1420, !1424, !1425, !1426, !1427, !1428, !1432, !1436, !1440, !1441, !1455, !1456, !1457, !1458, !1459, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !738, file: !739, line: 320, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !739, line: 315, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !90, !736}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !738, file: !739, line: 321, baseType: !742, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !738, file: !739, line: 323, baseType: !748, size: 1024, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !749, line: 22, baseType: !750)
!749 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ac5aedde14d2cb26bc31b0019c79e36b")
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !749, line: 36, size: 1024, elements: !751)
!751 = !{!752, !753, !754, !755, !757, !758, !759, !765, !770, !772, !773, !775, !780, !789, !790, !791, !792, !793, !794, !795}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !750, file: !749, line: 37, baseType: !101, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !750, file: !749, line: 39, baseType: !319, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !750, file: !749, line: 40, baseType: !332, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !750, file: !749, line: 41, baseType: !756, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !750, file: !749, line: 43, baseType: !11, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !750, file: !749, line: 44, baseType: !17, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !750, file: !749, line: 46, baseType: !760, size: 64, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !749, line: 24, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!85, !764, !16}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !750, file: !749, line: 47, baseType: !766, size: 64, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !749, line: 26, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !764, !16, !11}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !750, file: !749, line: 48, baseType: !771, size: 64, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !749, line: 28, baseType: !767)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !750, file: !749, line: 49, baseType: !16, size: 64, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "set_session", scope: !750, file: !749, line: 52, baseType: !774, size: 64, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_set_peer_session_pt", file: !749, line: 30, baseType: !761)
