; ModuleID = 'samples/761.bc'
source_filename = "threads.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct._xmlMutex = type { %union.pthread_mutex_t }
%struct._xmlRMutex = type { %union.pthread_mutex_t, i32, i32, i64, %union.pthread_cond_t }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.__atomic_wide_counter, %union.__atomic_wide_counter, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.__atomic_wide_counter = type { i64 }
%struct._xmlGlobalState = type { ptr, %struct._xmlSAXLocator, %struct._xmlSAXHandlerV1, %struct._xmlSAXHandlerV1, %struct._xmlSAXHandlerV1, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, %struct._xmlError, ptr, ptr, ptr }
%struct._xmlSAXLocator = type { ptr, ptr, ptr, ptr }
%struct._xmlSAXHandlerV1 = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct._xmlError = type { i32, i32, ptr, i32, ptr, i32, ptr, ptr, ptr, i32, i32, ptr, ptr }

@libxml_is_threaded = internal global i32 -1, align 4, !dbg !0

!42 = !DIFile(filename: "./include/libxml/entities.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build/aidengro/spack-stage-libxml2-2.10.3-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y/spack-src", checksumkind: CSK_MD5, checksum: "bbcf5796d61f8622702aeacafea4d993")
!43 = !{!44, !45, !46, !47, !48, !49}
!44 = !DIEnumerator(name: "XML_INTERNAL_GENERAL_ENTITY", value: 1)
!45 = !DIEnumerator(name: "XML_EXTERNAL_GENERAL_PARSED_ENTITY", value: 2)
!46 = !DIEnumerator(name: "XML_EXTERNAL_GENERAL_UNPARSED_ENTITY", value: 3)
!47 = !DIEnumerator(name: "XML_INTERNAL_PARAMETER_ENTITY", value: 4)
!48 = !DIEnumerator(name: "XML_EXTERNAL_PARAMETER_ENTITY", value: 5)
!49 = !DIEnumerator(name: "XML_INTERNAL_PREDEFINED_ENTITY", value: 6)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 278, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "XML_ELEMENT_CONTENT_PCDATA", value: 1)
!53 = !DIEnumerator(name: "XML_ELEMENT_CONTENT_ELEMENT", value: 2)
!54 = !DIEnumerator(name: "XML_ELEMENT_CONTENT_SEQ", value: 3)
!55 = !DIEnumerator(name: "XML_ELEMENT_CONTENT_OR", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 290, baseType: !7, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "XML_ELEMENT_CONTENT_ONCE", value: 1)
!59 = !DIEnumerator(name: "XML_ELEMENT_CONTENT_OPT", value: 2)
!60 = !DIEnumerator(name: "XML_ELEMENT_CONTENT_MULT", value: 3)
!61 = !DIEnumerator(name: "XML_ELEMENT_CONTENT_PLUS", value: 4)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 24, baseType: !7, size: 32, elements: !64)
!63 = !DIFile(filename: "./include/libxml/xmlerror.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build/aidengro/spack-stage-libxml2-2.10.3-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y/spack-src", checksumkind: CSK_MD5, checksum: "7e825cd47252b863bbbd4d8d4449cf69")
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "XML_ERR_NONE", value: 0)
!66 = !DIEnumerator(name: "XML_ERR_WARNING", value: 1)
!67 = !DIEnumerator(name: "XML_ERR_ERROR", value: 2)
!68 = !DIEnumerator(name: "XML_ERR_FATAL", value: 3)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 74, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76}
!71 = !DIEnumerator(name: "XML_BUFFER_ALLOC_DOUBLEIT", value: 0)
!72 = !DIEnumerator(name: "XML_BUFFER_ALLOC_EXACT", value: 1)
!73 = !DIEnumerator(name: "XML_BUFFER_ALLOC_IMMUTABLE", value: 2)
!74 = !DIEnumerator(name: "XML_BUFFER_ALLOC_IO", value: 3)
!75 = !DIEnumerator(name: "XML_BUFFER_ALLOC_HYBRID", value: 4)
!76 = !DIEnumerator(name: "XML_BUFFER_ALLOC_BOUNDED", value: 5)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !78, line: 56, baseType: !79, size: 32, elements: !80)
!78 = !DIFile(filename: "./include/libxml/encoding.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build/aidengro/spack-stage-libxml2-2.10.3-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y/spack-src", checksumkind: CSK_MD5, checksum: "3f36e3b337230a6185e6c519d000e037")
!79 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!81 = !DIEnumerator(name: "XML_CHAR_ENCODING_ERROR", value: -1)
!82 = !DIEnumerator(name: "XML_CHAR_ENCODING_NONE", value: 0)
!83 = !DIEnumerator(name: "XML_CHAR_ENCODING_UTF8", value: 1)
!84 = !DIEnumerator(name: "XML_CHAR_ENCODING_UTF16LE", value: 2)
!85 = !DIEnumerator(name: "XML_CHAR_ENCODING_UTF16BE", value: 3)
!86 = !DIEnumerator(name: "XML_CHAR_ENCODING_UCS4LE", value: 4)
!87 = !DIEnumerator(name: "XML_CHAR_ENCODING_UCS4BE", value: 5)
!88 = !DIEnumerator(name: "XML_CHAR_ENCODING_EBCDIC", value: 6)
!89 = !DIEnumerator(name: "XML_CHAR_ENCODING_UCS4_2143", value: 7)
!90 = !DIEnumerator(name: "XML_CHAR_ENCODING_UCS4_3412", value: 8)
!91 = !DIEnumerator(name: "XML_CHAR_ENCODING_UCS2", value: 9)
!92 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_1", value: 10)
!93 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_2", value: 11)
!94 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_3", value: 12)
!95 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_4", value: 13)
!96 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_5", value: 14)
!97 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_6", value: 15)
!98 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_7", value: 16)
!99 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_8", value: 17)
!100 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_9", value: 18)
!101 = !DIEnumerator(name: "XML_CHAR_ENCODING_2022_JP", value: 19)
!102 = !DIEnumerator(name: "XML_CHAR_ENCODING_SHIFT_JIS", value: 20)
!103 = !DIEnumerator(name: "XML_CHAR_ENCODING_EUC_JP", value: 21)
!104 = !DIEnumerator(name: "XML_CHAR_ENCODING_ASCII", value: 22)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlGlobalState", file: !109, line: 120, baseType: !110)
!109 = !DIFile(filename: "./include/libxml/globals.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build/aidengro/spack-stage-libxml2-2.10.3-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y/spack-src", checksumkind: CSK_MD5, checksum: "7f015ed635e5788f2301bae7c8384545")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlGlobalState", file: !109, line: 122, size: 7744, elements: !111)
!111 = !{!112, !116, !136, !459, !460, !461, !464, !471, !476, !481, !483, !507, !508, !509, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !531, !533, !534, !535, !541, !564}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "xmlParserVersion", scope: !110, file: !109, line: 124, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "xmlDefaultSAXLocator", scope: !110, file: !109, line: 126, baseType: !117, size: 256, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlSAXLocator", file: !6, line: 41, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlSAXLocator", file: !119, line: 321, size: 256, elements: !120)
!119 = !DIFile(filename: "./include/libxml/parser.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build/aidengro/spack-stage-libxml2-2.10.3-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y/spack-src", checksumkind: CSK_MD5, checksum: "4cbcb375d54234f53f49e76e95c077ac")
!120 = !{!121, !130, !131, !135}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "getPublicId", scope: !118, file: !119, line: 322, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !106}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlChar", file: !128, line: 28, baseType: !129)
!128 = !DIFile(filename: "./include/libxml/xmlstring.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build/aidengro/spack-stage-libxml2-2.10.3-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y/spack-src", checksumkind: CSK_MD5, checksum: "82efb8a055d5fc8eb7d815ed471eca53")
!129 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "getSystemId", scope: !118, file: !119, line: 323, baseType: !122, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "getLineNumber", scope: !118, file: !119, line: 324, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!79, !106}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "getColumnNumber", scope: !118, file: !119, line: 325, baseType: !132, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "xmlDefaultSAXHandler", scope: !110, file: !109, line: 127, baseType: !137, size: 1792, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlSAXHandlerV1", file: !119, line: 758, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlSAXHandlerV1", file: !119, line: 760, size: 1792, elements: !139)
!139 = !{!140, !145, !147, !149, !151, !228, !357, !362, !364, !377, !397, !402, !409, !414, !416, !422, !427, !429, !434, !436, !441, !443, !448, !450, !452, !454, !456, !458}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "internalSubset", scope: !138, file: !119, line: 761, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "internalSubsetSAXFunc", file: !119, line: 362, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !106, !125, !125, !125}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "isStandalone", scope: !138, file: !119, line: 762, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "isStandaloneSAXFunc", file: !119, line: 640, baseType: !132)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "hasInternalSubset", scope: !138, file: !119, line: 763, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "hasInternalSubsetSAXFunc", file: !119, line: 649, baseType: !132)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "hasExternalSubset", scope: !138, file: !119, line: 764, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "hasExternalSubsetSAXFunc", file: !119, line: 659, baseType: !132)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "resolveEntity", scope: !138, file: !119, line: 765, baseType: !152, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "resolveEntitySAXFunc", file: !119, line: 350, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !106, !125, !125}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlParserInputPtr", file: !6, line: 36, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlParserInput", file: !6, line: 35, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlParserInput", file: !119, line: 52, size: 832, elements: !160)
!160 = !{!161, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !224, !225, !226, !227}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !159, file: !119, line: 54, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlParserInputBufferPtr", file: !6, line: 29, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlParserInputBuffer", file: !6, line: 28, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlParserInputBuffer", file: !166, line: 125, size: 512, elements: !167)
!166 = !DIFile(filename: "./include/libxml/xmlIO.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build/aidengro/spack-stage-libxml2-2.10.3-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y/spack-src", checksumkind: CSK_MD5, checksum: "a868e7a396360b2f16d10eac4a34669c")
!167 = !{!168, !169, !175, !177, !199, !204, !205, !206, !207}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !165, file: !166, line: 126, baseType: !106, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "readcallback", scope: !165, file: !166, line: 127, baseType: !170, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlInputReadCallback", file: !166, line: 54, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!79, !106, !174, !79}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "closecallback", scope: !165, file: !166, line: 128, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlInputCloseCallback", file: !166, line: 63, baseType: !132)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !165, file: !166, line: 130, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlCharEncodingHandlerPtr", file: !78, line: 130, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlCharEncodingHandler", file: !78, line: 129, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlCharEncodingHandler", file: !78, line: 131, size: 320, elements: !182)
!182 = !{!183, !184, !193, !195, !198}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !78, line: 132, baseType: !174, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !181, file: !78, line: 133, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlCharEncodingInputFunc", file: !78, line: 99, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!79, !189, !190, !191, !190}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !181, file: !78, line: 134, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlCharEncodingOutputFunc", file: !78, line: 121, baseType: !186)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "iconv_in", scope: !181, file: !78, line: 136, baseType: !196, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "libiconv_t", file: !197, line: 46, baseType: !106)
!197 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack/linux-ubuntu22.04-zen2/clang-18.0.0/libiconv-1.17-yjxuwwhaestsjkdrfxfvtlovzccan2px/include/iconv.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build", checksumkind: CSK_MD5, checksum: "b2fc3eb69b19b470f76aa362172c4039")
!198 = !DIDerivedType(tag: DW_TAG_member, name: "iconv_out", scope: !181, file: !78, line: 137, baseType: !196, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !165, file: !166, line: 132, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlBufPtr", file: !6, line: 114, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlBuf", file: !6, line: 105, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlBuf", file: !6, line: 105, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !165, file: !166, line: 133, baseType: !200, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !165, file: !166, line: 134, baseType: !79, size: 32, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !165, file: !166, line: 135, baseType: !79, size: 32, offset: 416)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rawconsumed", scope: !165, file: !166, line: 136, baseType: !208, size: 64, offset: 448)
!208 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !159, file: !119, line: 56, baseType: !113, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !159, file: !119, line: 57, baseType: !113, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !159, file: !119, line: 58, baseType: !125, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !159, file: !119, line: 59, baseType: !125, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !159, file: !119, line: 60, baseType: !125, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !159, file: !119, line: 61, baseType: !79, size: 32, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !159, file: !119, line: 62, baseType: !79, size: 32, offset: 416)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !159, file: !119, line: 63, baseType: !79, size: 32, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "consumed", scope: !159, file: !119, line: 69, baseType: !208, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !159, file: !119, line: 70, baseType: !219, size: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlParserInputDeallocate", file: !119, line: 50, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !159, file: !119, line: 71, baseType: !125, size: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !159, file: !119, line: 72, baseType: !125, size: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "standalone", scope: !159, file: !119, line: 73, baseType: !79, size: 32, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !159, file: !119, line: 74, baseType: !79, size: 32, offset: 800)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "getEntity", scope: !138, file: !119, line: 766, baseType: !229, size: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getEntitySAXFunc", file: !119, line: 388, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !106, !125}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlEntityPtr", file: !6, line: 49, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlEntity", file: !6, line: 48, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlEntity", file: !42, line: 38, size: 1088, elements: !237)
!237 = !{!238, !239, !241, !242, !340, !341, !342, !343, !344, !345, !346, !347, !348, !350, !351, !352, !354, !355, !356}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !236, file: !42, line: 39, baseType: !106, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !42, line: 40, baseType: !240, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementType", file: !6, line: 181, baseType: !5)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !42, line: 41, baseType: !125, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !42, line: 42, baseType: !243, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlNode", file: !6, line: 489, size: 960, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !314, !317, !318, !335, !336, !337, !339}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !244, file: !6, line: 490, baseType: !106, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !244, file: !6, line: 491, baseType: !240, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !244, file: !6, line: 492, baseType: !125, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !244, file: !6, line: 493, baseType: !243, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !244, file: !6, line: 494, baseType: !243, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !244, file: !6, line: 495, baseType: !243, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !6, line: 496, baseType: !243, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !244, file: !6, line: 497, baseType: !243, size: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !244, file: !6, line: 498, baseType: !255, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlDoc", file: !6, line: 551, size: 1408, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !289, !290, !301, !302, !303, !304, !305, !306, !307, !311, !312, !313}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !256, file: !6, line: 552, baseType: !106, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !256, file: !6, line: 553, baseType: !240, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !256, file: !6, line: 554, baseType: !174, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !256, file: !6, line: 555, baseType: !243, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !256, file: !6, line: 556, baseType: !243, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !256, file: !6, line: 557, baseType: !243, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !6, line: 558, baseType: !243, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !256, file: !6, line: 559, baseType: !243, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !256, file: !6, line: 560, baseType: !255, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !256, file: !6, line: 563, baseType: !79, size: 32, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "standalone", scope: !256, file: !6, line: 564, baseType: !79, size: 32, offset: 608)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "intSubset", scope: !256, file: !6, line: 570, baseType: !270, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlDtd", file: !6, line: 406, size: 1024, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !271, file: !6, line: 407, baseType: !106, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !271, file: !6, line: 408, baseType: !240, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !271, file: !6, line: 409, baseType: !125, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !271, file: !6, line: 410, baseType: !243, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !271, file: !6, line: 411, baseType: !243, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !271, file: !6, line: 412, baseType: !255, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !6, line: 413, baseType: !243, size: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !271, file: !6, line: 414, baseType: !243, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !271, file: !6, line: 415, baseType: !255, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "notations", scope: !271, file: !6, line: 418, baseType: !106, size: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !271, file: !6, line: 419, baseType: !106, size: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !271, file: !6, line: 420, baseType: !106, size: 64, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "entities", scope: !271, file: !6, line: 421, baseType: !106, size: 64, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ExternalID", scope: !271, file: !6, line: 422, baseType: !125, size: 64, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "SystemID", scope: !271, file: !6, line: 423, baseType: !125, size: 64, offset: 896)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pentities", scope: !271, file: !6, line: 424, baseType: !106, size: 64, offset: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "extSubset", scope: !256, file: !6, line: 571, baseType: !270, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "oldNs", scope: !256, file: !6, line: 572, baseType: !291, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlNs", file: !6, line: 389, size: 384, elements: !293)
!293 = !{!294, !295, !297, !298, !299, !300}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !292, file: !6, line: 390, baseType: !291, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !6, line: 391, baseType: !296, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNsType", file: !6, line: 375, baseType: !240)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "href", scope: !292, file: !6, line: 392, baseType: !125, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !292, file: !6, line: 393, baseType: !125, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !292, file: !6, line: 394, baseType: !106, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !292, file: !6, line: 395, baseType: !255, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !256, file: !6, line: 573, baseType: !125, size: 64, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !256, file: !6, line: 574, baseType: !125, size: 64, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ids", scope: !256, file: !6, line: 575, baseType: !106, size: 64, offset: 960)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !256, file: !6, line: 576, baseType: !106, size: 64, offset: 1024)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "URL", scope: !256, file: !6, line: 577, baseType: !125, size: 64, offset: 1088)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !256, file: !6, line: 578, baseType: !79, size: 32, offset: 1152)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !256, file: !6, line: 580, baseType: !308, size: 64, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlDict", file: !310, line: 24, flags: DIFlagFwdDecl)
!310 = !DIFile(filename: "./include/libxml/dict.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build/aidengro/spack-stage-libxml2-2.10.3-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y/spack-src", checksumkind: CSK_MD5, checksum: "34f358f6d1debb908632b95b68e9484e")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "psvi", scope: !256, file: !6, line: 581, baseType: !106, size: 64, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "parseFlags", scope: !256, file: !6, line: 582, baseType: !79, size: 32, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !256, file: !6, line: 584, baseType: !79, size: 32, offset: 1376)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !244, file: !6, line: 501, baseType: !315, size: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNs", file: !6, line: 387, baseType: !292)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !244, file: !6, line: 502, baseType: !223, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !244, file: !6, line: 503, baseType: !319, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlAttr", file: !6, line: 434, size: 768, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !334}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !320, file: !6, line: 435, baseType: !106, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !6, line: 436, baseType: !240, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !320, file: !6, line: 437, baseType: !125, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !320, file: !6, line: 438, baseType: !243, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !320, file: !6, line: 439, baseType: !243, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !320, file: !6, line: 440, baseType: !243, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !6, line: 441, baseType: !319, size: 64, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !320, file: !6, line: 442, baseType: !319, size: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !320, file: !6, line: 443, baseType: !255, size: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !320, file: !6, line: 444, baseType: !315, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "atype", scope: !320, file: !6, line: 445, baseType: !333, size: 32, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlAttributeType", file: !6, line: 217, baseType: !29)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "psvi", scope: !320, file: !6, line: 446, baseType: !106, size: 64, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "nsDef", scope: !244, file: !6, line: 504, baseType: !315, size: 64, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "psvi", scope: !244, file: !6, line: 505, baseType: !106, size: 64, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !244, file: !6, line: 506, baseType: !338, size: 16, offset: 896)
!338 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !244, file: !6, line: 507, baseType: !338, size: 16, offset: 912)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !236, file: !42, line: 43, baseType: !243, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !236, file: !42, line: 44, baseType: !270, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !42, line: 45, baseType: !243, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !42, line: 46, baseType: !243, size: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !236, file: !42, line: 47, baseType: !255, size: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !236, file: !42, line: 49, baseType: !223, size: 64, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !236, file: !42, line: 50, baseType: !223, size: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !236, file: !42, line: 51, baseType: !79, size: 32, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "etype", scope: !236, file: !42, line: 52, baseType: !349, size: 32, offset: 736)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlEntityType", file: !42, line: 31, baseType: !41)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ExternalID", scope: !236, file: !42, line: 53, baseType: !125, size: 64, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "SystemID", scope: !236, file: !42, line: 54, baseType: !125, size: 64, offset: 832)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nexte", scope: !236, file: !42, line: 56, baseType: !353, size: 64, offset: 896)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "URI", scope: !236, file: !42, line: 57, baseType: !125, size: 64, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !236, file: !42, line: 58, baseType: !79, size: 32, offset: 1024)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "checked", scope: !236, file: !42, line: 59, baseType: !79, size: 32, offset: 1056)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "entityDecl", scope: !138, file: !119, line: 767, baseType: !358, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "entityDeclSAXFunc", file: !119, line: 412, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !106, !125, !79, !125, !125, !223}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "notationDecl", scope: !138, file: !119, line: 768, baseType: !363, size: 64, offset: 448)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "notationDeclSAXFunc", file: !119, line: 427, baseType: !142)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "attributeDecl", scope: !138, file: !119, line: 769, baseType: !365, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "attributeDeclSAXFunc", file: !119, line: 443, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !106, !125, !125, !79, !79, !125, !369}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlEnumerationPtr", file: !6, line: 239, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlEnumeration", file: !6, line: 238, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlEnumeration", file: !6, line: 240, size: 128, elements: !373)
!373 = !{!374, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !6, line: 241, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !6, line: 242, baseType: !125, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "elementDecl", scope: !138, file: !119, line: 770, baseType: !378, size: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "elementDeclSAXFunc", file: !119, line: 459, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !106, !125, !79, !382}
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementContentPtr", file: !6, line: 305, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementContent", file: !6, line: 304, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlElementContent", file: !6, line: 306, size: 384, elements: !386)
!386 = !{!387, !389, !391, !392, !394, !395, !396}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !385, file: !6, line: 307, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementContentType", file: !6, line: 283, baseType: !50)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ocur", scope: !385, file: !6, line: 308, baseType: !390, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementContentOccur", file: !6, line: 295, baseType: !56)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !6, line: 309, baseType: !125, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !385, file: !6, line: 310, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !385, file: !6, line: 311, baseType: !393, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !385, file: !6, line: 312, baseType: !393, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !385, file: !6, line: 313, baseType: !125, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "unparsedEntityDecl", scope: !138, file: !119, line: 771, baseType: !398, size: 64, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "unparsedEntityDeclSAXFunc", file: !119, line: 473, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !106, !125, !125, !125, !125}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "setDocumentLocator", scope: !138, file: !119, line: 772, baseType: !403, size: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "setDocumentLocatorSAXFunc", file: !119, line: 486, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !106, !407}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlSAXLocatorPtr", file: !6, line: 42, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "startDocument", scope: !138, file: !119, line: 773, baseType: !410, size: 64, offset: 768)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "startDocumentSAXFunc", file: !119, line: 494, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !106}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "endDocument", scope: !138, file: !119, line: 774, baseType: !415, size: 64, offset: 832)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "endDocumentSAXFunc", file: !119, line: 501, baseType: !411)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "startElement", scope: !138, file: !119, line: 775, baseType: !417, size: 64, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "startElementSAXFunc", file: !119, line: 510, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !106, !125, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "endElement", scope: !138, file: !119, line: 776, baseType: !423, size: 64, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "endElementSAXFunc", file: !119, line: 520, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !106, !125}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !138, file: !119, line: 777, baseType: !428, size: 64, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "referenceSAXFunc", file: !119, line: 543, baseType: !424)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "characters", scope: !138, file: !119, line: 778, baseType: !430, size: 64, offset: 1088)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "charactersSAXFunc", file: !119, line: 553, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !106, !125, !79}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ignorableWhitespace", scope: !138, file: !119, line: 779, baseType: !435, size: 64, offset: 1152)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ignorableWhitespaceSAXFunc", file: !119, line: 565, baseType: !431)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "processingInstruction", scope: !138, file: !119, line: 780, baseType: !437, size: 64, offset: 1216)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "processingInstructionSAXFunc", file: !119, line: 576, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !106, !125, !125}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !138, file: !119, line: 781, baseType: !442, size: 64, offset: 1280)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "commentSAXFunc", file: !119, line: 586, baseType: !424)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !138, file: !119, line: 782, baseType: !444, size: 64, offset: 1344)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "warningSAXFunc", file: !119, line: 608, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !106, !113, null}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !138, file: !119, line: 783, baseType: !449, size: 64, offset: 1408)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "errorSAXFunc", file: !119, line: 618, baseType: !445)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fatalError", scope: !138, file: !119, line: 784, baseType: !451, size: 64, offset: 1472)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "fatalErrorSAXFunc", file: !119, line: 630, baseType: !445)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "getParameterEntity", scope: !138, file: !119, line: 785, baseType: !453, size: 64, offset: 1536)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "getParameterEntitySAXFunc", file: !119, line: 399, baseType: !230)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cdataBlock", scope: !138, file: !119, line: 786, baseType: !455, size: 64, offset: 1600)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "cdataBlockSAXFunc", file: !119, line: 596, baseType: !431)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "externalSubset", scope: !138, file: !119, line: 787, baseType: !457, size: 64, offset: 1664)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "externalSubsetSAXFunc", file: !119, line: 375, baseType: !142)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !138, file: !119, line: 788, baseType: !7, size: 32, offset: 1728)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "docbDefaultSAXHandler", scope: !110, file: !109, line: 128, baseType: !137, size: 1792, offset: 2112)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "htmlDefaultSAXHandler", scope: !110, file: !109, line: 129, baseType: !137, size: 1792, offset: 3904)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "xmlFree", scope: !110, file: !109, line: 131, baseType: !462, size: 64, offset: 5696)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlFreeFunc", file: !463, line: 57, baseType: !411)
!463 = !DIFile(filename: "./include/libxml/xmlmemory.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build/aidengro/spack-stage-libxml2-2.10.3-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y/spack-src", checksumkind: CSK_MD5, checksum: "7e446747cb8069ea015f0cc10b63166b")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "xmlMalloc", scope: !110, file: !109, line: 132, baseType: !465, size: 64, offset: 5760)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlMallocFunc", file: !463, line: 66, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!106, !469}
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !470, line: 70, baseType: !208)
!470 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!471 = !DIDerivedType(tag: DW_TAG_member, name: "xmlMemStrdup", scope: !110, file: !109, line: 133, baseType: !472, size: 64, offset: 5824)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlStrdupFunc", file: !463, line: 87, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!174, !113}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "xmlRealloc", scope: !110, file: !109, line: 134, baseType: !477, size: 64, offset: 5888)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlReallocFunc", file: !463, line: 77, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!106, !106, !469}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "xmlGenericError", scope: !110, file: !109, line: 136, baseType: !482, size: 64, offset: 5952)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlGenericErrorFunc", file: !63, line: 847, baseType: !445)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "xmlStructuredError", scope: !110, file: !109, line: 137, baseType: !484, size: 64, offset: 6016)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlStructuredErrorFunc", file: !63, line: 858, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !106, !488}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlErrorPtr", file: !63, line: 77, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlError", file: !63, line: 76, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlError", file: !63, line: 78, size: 704, elements: !492)
!492 = !{!493, !494, !495, !496, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !491, file: !63, line: 79, baseType: !79, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !491, file: !63, line: 80, baseType: !79, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !491, file: !63, line: 81, baseType: !174, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !491, file: !63, line: 82, baseType: !497, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlErrorLevel", file: !63, line: 29, baseType: !62)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !491, file: !63, line: 83, baseType: !174, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !491, file: !63, line: 84, baseType: !79, size: 32, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "str1", scope: !491, file: !63, line: 85, baseType: !174, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "str2", scope: !491, file: !63, line: 86, baseType: !174, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "str3", scope: !491, file: !63, line: 87, baseType: !174, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "int1", scope: !491, file: !63, line: 88, baseType: !79, size: 32, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "int2", scope: !491, file: !63, line: 89, baseType: !79, size: 32, offset: 544)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ctxt", scope: !491, file: !63, line: 90, baseType: !106, size: 64, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !491, file: !63, line: 91, baseType: !106, size: 64, offset: 640)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "xmlGenericErrorContext", scope: !110, file: !109, line: 138, baseType: !106, size: 64, offset: 6080)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "oldXMLWDcompatibility", scope: !110, file: !109, line: 140, baseType: !79, size: 32, offset: 6144)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "xmlBufferAllocScheme", scope: !110, file: !109, line: 142, baseType: !510, size: 32, offset: 6176)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlBufferAllocationScheme", file: !6, line: 81, baseType: !69)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "xmlDefaultBufferSize", scope: !110, file: !109, line: 143, baseType: !79, size: 32, offset: 6208)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "xmlSubstituteEntitiesDefaultValue", scope: !110, file: !109, line: 145, baseType: !79, size: 32, offset: 6240)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "xmlDoValidityCheckingDefaultValue", scope: !110, file: !109, line: 146, baseType: !79, size: 32, offset: 6272)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "xmlGetWarningsDefaultValue", scope: !110, file: !109, line: 147, baseType: !79, size: 32, offset: 6304)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "xmlKeepBlanksDefaultValue", scope: !110, file: !109, line: 148, baseType: !79, size: 32, offset: 6336)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "xmlLineNumbersDefaultValue", scope: !110, file: !109, line: 149, baseType: !79, size: 32, offset: 6368)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "xmlLoadExtDtdDefaultValue", scope: !110, file: !109, line: 150, baseType: !79, size: 32, offset: 6400)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "xmlParserDebugEntities", scope: !110, file: !109, line: 151, baseType: !79, size: 32, offset: 6432)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "xmlPedanticParserDefaultValue", scope: !110, file: !109, line: 152, baseType: !79, size: 32, offset: 6464)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "xmlSaveNoEmptyTags", scope: !110, file: !109, line: 154, baseType: !79, size: 32, offset: 6496)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "xmlIndentTreeOutput", scope: !110, file: !109, line: 155, baseType: !79, size: 32, offset: 6528)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "xmlTreeIndentString", scope: !110, file: !109, line: 156, baseType: !113, size: 64, offset: 6592)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "xmlRegisterNodeDefaultValue", scope: !110, file: !109, line: 158, baseType: !524, size: 64, offset: 6656)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlRegisterNodeFunc", file: !109, line: 111, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !528}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNodePtr", file: !6, line: 488, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNode", file: !6, line: 487, baseType: !244)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "xmlDeregisterNodeDefaultValue", scope: !110, file: !109, line: 159, baseType: !532, size: 64, offset: 6720)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlDeregisterNodeFunc", file: !109, line: 118, baseType: !525)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "xmlMallocAtomic", scope: !110, file: !109, line: 161, baseType: !465, size: 64, offset: 6784)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "xmlLastError", scope: !110, file: !109, line: 162, baseType: !490, size: 704, offset: 6848)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "xmlParserInputBufferCreateFilenameValue", scope: !110, file: !109, line: 164, baseType: !536, size: 64, offset: 7552)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlParserInputBufferCreateFilenameFunc", file: !109, line: 43, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!162, !113, !540}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlCharEncoding", file: !78, line: 81, baseType: !77)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "xmlOutputBufferCreateFilenameValue", scope: !110, file: !109, line: 165, baseType: !542, size: 64, offset: 7616)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlOutputBufferCreateFilenameFunc", file: !109, line: 58, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !113, !178, !79}
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlOutputBufferPtr", file: !6, line: 32, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlOutputBuffer", file: !6, line: 31, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlOutputBuffer", file: !166, line: 141, size: 448, elements: !550)
!550 = !{!551, !552, !557, !559, !560, !561, !562, !563}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !549, file: !166, line: 142, baseType: !106, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "writecallback", scope: !549, file: !166, line: 143, baseType: !553, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlOutputWriteCallback", file: !166, line: 100, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!79, !106, !113, !79}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "closecallback", scope: !549, file: !166, line: 144, baseType: !558, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlOutputCloseCallback", file: !166, line: 110, baseType: !132)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !549, file: !166, line: 146, baseType: !178, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !549, file: !166, line: 148, baseType: !200, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "conv", scope: !549, file: !166, line: 149, baseType: !200, size: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !549, file: !166, line: 150, baseType: !79, size: 32, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !549, file: !166, line: 151, baseType: !79, size: 32, offset: 416)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "xmlStructuredErrorContext", scope: !110, file: !109, line: 167, baseType: !106, size: 64, offset: 7680)
!565 = !{!566, !570, !0, !573, !604, !607, !612, !658}
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "globalkey", scope: !2, file: !3, line: 125, type: !568, isLocal: true, isDefinition: true)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !569, line: 49, baseType: !7)
!569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "mainthread", scope: !2, file: !3, line: 126, type: !572, isLocal: true, isDefinition: true)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !569, line: 27, baseType: !208)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "global_init_lock", scope: !2, file: !3, line: 129, type: !575, isLocal: true, isDefinition: true)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !569, line: 72, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !569, line: 67, size: 320, elements: !577)
!577 = !{!578, !598, !602}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !576, file: !569, line: 69, baseType: !579, size: 320)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !580, line: 22, size: 320, elements: !581)
!580 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!581 = !{!582, !583, !584, !585, !586, !587, !589, !590}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !579, file: !580, line: 24, baseType: !79, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !579, file: !580, line: 25, baseType: !7, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !579, file: !580, line: 26, baseType: !79, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !579, file: !580, line: 28, baseType: !7, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !579, file: !580, line: 32, baseType: !79, size: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !579, file: !580, line: 34, baseType: !588, size: 16, offset: 160)
!588 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !579, file: !580, line: 35, baseType: !588, size: 16, offset: 176)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !579, file: !580, line: 36, baseType: !591, size: 128, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !592, line: 55, baseType: !593)
!592 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !592, line: 51, size: 128, elements: !594)
!594 = !{!595, !597}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !593, file: !592, line: 53, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !593, file: !592, line: 54, baseType: !596, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !576, file: !569, line: 70, baseType: !599, size: 320)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 320, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 40)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !576, file: !569, line: 71, baseType: !603, size: 64)
!603 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "once_control", scope: !2, file: !3, line: 127, type: !606, isLocal: true, isDefinition: true)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !569, line: 53, baseType: !79)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !3, line: 569, type: !609, isLocal: true, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 272, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 34)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "xmlLibraryLock", scope: !2, file: !3, line: 153, type: !614, isLocal: true, isDefinition: true)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlRMutexPtr", file: !615, line: 30, baseType: !616)
!615 = !DIFile(filename: "./include/libxml/threads.h", directory: "/local-ssd/libxml2-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y-build/aidengro/spack-stage-libxml2-2.10.3-xsvwup3iyubmj2kq4vl5tr75uyk5mi6y/spack-src", checksumkind: CSK_MD5, checksum: "1dc7307a775b27909a6aa3c80fee80a7")
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlRMutex", file: !615, line: 29, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlRMutex", file: !3, line: 100, size: 832, elements: !619)
!619 = !{!620, !621, !622, !623, !624}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !618, file: !3, line: 102, baseType: !575, size: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "held", scope: !618, file: !3, line: 103, baseType: !7, size: 32, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "waiters", scope: !618, file: !3, line: 104, baseType: !7, size: 32, offset: 352)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !618, file: !3, line: 105, baseType: !572, size: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !618, file: !3, line: 106, baseType: !625, size: 384, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !569, line: 80, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !569, line: 75, size: 384, elements: !627)
!627 = !{!628, !652, !656}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !626, file: !569, line: 77, baseType: !629, size: 384)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !592, line: 94, size: 384, elements: !630)
!630 = !{!631, !643, !644, !648, !649, !650, !651}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !629, file: !592, line: 96, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !633, line: 33, baseType: !634)
!633 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !633, line: 25, size: 64, elements: !635)
!635 = !{!636, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !634, file: !633, line: 27, baseType: !637, size: 64)
!637 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !634, file: !633, line: 32, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !634, file: !633, line: 28, size: 64, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !639, file: !633, line: 30, baseType: !7, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !639, file: !633, line: 31, baseType: !7, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !629, file: !592, line: 97, baseType: !632, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !629, file: !592, line: 98, baseType: !645, size: 64, offset: 128)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 2)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !629, file: !592, line: 99, baseType: !645, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !629, file: !592, line: 100, baseType: !7, size: 32, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !629, file: !592, line: 101, baseType: !7, size: 32, offset: 288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !629, file: !592, line: 102, baseType: !645, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !626, file: !569, line: 78, baseType: !653, size: 384)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 384, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 48)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !626, file: !569, line: 79, baseType: !657, size: 64)
!657 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "once_control_init", scope: !2, file: !3, line: 128, type: !606, isLocal: true, isDefinition: true)
!660 = !{i32 7, !"Dwarf Version", i32 5}
!661 = !{i32 2, !"Debug Info Version", i32 3}
!662 = !{i32 1, !"wchar_size", i32 4}
!663 = !{i32 8, !"PIC Level", i32 2}
!664 = !{i32 7, !"uwtable", i32 2}
!665 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!666 = distinct !DISubprogram(name: "xmlNewMutex", scope: !3, file: !3, line: 168, type: !667, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !675)
!667 = !DISubroutineType(types: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlMutexPtr", file: !615, line: 24, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlMutex", file: !615, line: 23, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlMutex", file: !3, line: 84, size: 320, elements: !673)
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !672, file: !3, line: 86, baseType: !575, size: 320)
!675 = !{!676}
!676 = !DILocalVariable(name: "tok", scope: !666, file: !3, line: 170, type: !669)
!677 = !DILocation(line: 170, column: 5, scope: !666)
!678 = !DILocation(line: 170, column: 17, scope: !666)
!679 = !DILocation(line: 172, column: 16, scope: !680)
!680 = distinct !DILexicalBlock(scope: !666, file: !3, line: 172, column: 9)
!681 = !DILocation(line: 172, column: 14, scope: !680)
!682 = !{!683, !683, i64 0}
!683 = !{!"any pointer", !684, i64 0}
!684 = !{!"omnipotent char", !685, i64 0}
!685 = !{!"Simple C/C++ TBAA"}
!686 = !DILocation(line: 172, column: 42, scope: !680)
!687 = !DILocation(line: 172, column: 9, scope: !666)
!688 = !DILocation(line: 173, column: 9, scope: !680)
!689 = !DILocation(line: 175, column: 9, scope: !690)
!690 = distinct !DILexicalBlock(scope: !666, file: !3, line: 175, column: 9)
!691 = !{!692, !692, i64 0}
!692 = !{!"int", !684, i64 0}
!693 = !DILocation(line: 175, column: 28, scope: !690)
!694 = !DILocation(line: 175, column: 9, scope: !666)
!695 = !DILocation(line: 176, column: 29, scope: !690)
!696 = !DILocation(line: 176, column: 34, scope: !690)
!697 = !DILocation(line: 176, column: 9, scope: !690)
!698 = !DILocation(line: 186, column: 13, scope: !666)
!699 = !DILocation(line: 186, column: 5, scope: !666)
!700 = !DILocation(line: 187, column: 1, scope: !666)
!701 = !DISubprogram(name: "malloc", scope: !702, file: !702, line: 540, type: !467, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!702 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!703 = !DISubprogram(name: "pthread_mutex_init", scope: !704, file: !704, line: 781, type: !705, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!704 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "5205981c6f80cc3dc1e81231df63d8ef")
!705 = !DISubroutineType(types: !706)
!706 = !{!79, !707, !708}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
