; ModuleID = 'samples/763.bc'
source_filename = "bamshuf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.elem_t = type { i32, ptr }
%struct.bam1_t = type { %struct.bam1_core_t, i64, ptr, i32, i32, i32 }
%struct.bam1_core_t = type { i64, i32, i16, i8, i8, i16, i16, i32, i32, i32, i64, i64 }
%struct.ks_isort_stack_t = type { ptr, ptr, i32 }
%struct.sam_global_args = type { %struct.htsFormat, %struct.htsFormat, ptr, i32, i32 }
%struct.htsFormat = type { i32, i32, %struct.anon, i32, i16, ptr }
%struct.anon = type { i16, i16 }
%struct.htsThreadPool = type { ptr, i32 }
%struct.bam_list_t = type { ptr, ptr, i64, i64 }
%struct.bam_item_t = type { i32, ptr }
%struct.kh_bam_store_s = type { i32, i32, i32, i32, ptr, ptr, ptr }
%struct.store_item_t = type { ptr }

@.str = private unnamed_addr constant [8 x i8] c"collate\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [15 x i8] c"/tmp/collate%x\00", align 1, !dbg !7

!23 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/htslib-1.13-3cptg6go643q7k5o3lqa333klizp6eek/include/htslib/hts.h", directory: "/local-ssd/samtools-i7lpfd7rznpn2jrnaklwe67pg7qot4ru-build", checksumkind: CSK_MD5, checksum: "ae37cf66fde41139f9a837bd3fe09912")
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !{!26, !27, !28, !29, !30, !31}
!26 = !DIEnumerator(name: "unknown_category", value: 0)
!27 = !DIEnumerator(name: "sequence_data", value: 1)
!28 = !DIEnumerator(name: "variant_data", value: 2)
!29 = !DIEnumerator(name: "index_file", value: 3)
!30 = !DIEnumerator(name: "region_list", value: 4)
!31 = !DIEnumerator(name: "category_maximum", value: 32767)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "htsExactFormat", file: !23, line: 199, baseType: !24, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!34 = !DIEnumerator(name: "unknown_format", value: 0)
!35 = !DIEnumerator(name: "binary_format", value: 1)
!36 = !DIEnumerator(name: "text_format", value: 2)
!37 = !DIEnumerator(name: "sam", value: 3)
!38 = !DIEnumerator(name: "bam", value: 4)
!39 = !DIEnumerator(name: "bai", value: 5)
!40 = !DIEnumerator(name: "cram", value: 6)
!41 = !DIEnumerator(name: "crai", value: 7)
!42 = !DIEnumerator(name: "vcf", value: 8)
!43 = !DIEnumerator(name: "bcf", value: 9)
!44 = !DIEnumerator(name: "csi", value: 10)
!45 = !DIEnumerator(name: "gzi", value: 11)
!46 = !DIEnumerator(name: "tbi", value: 12)
!47 = !DIEnumerator(name: "bed", value: 13)
!48 = !DIEnumerator(name: "htsget", value: 14)
!49 = !DIEnumerator(name: "json", value: 14)
!50 = !DIEnumerator(name: "empty_format", value: 15)
!51 = !DIEnumerator(name: "fasta_format", value: 16)
!52 = !DIEnumerator(name: "fastq_format", value: 17)
!53 = !DIEnumerator(name: "fai_format", value: 18)
!54 = !DIEnumerator(name: "fqi_format", value: 19)
!55 = !DIEnumerator(name: "hts_crypt4gh_format", value: 20)
!56 = !DIEnumerator(name: "format_maximum", value: 32767)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "htsCompression", file: !23, line: 211, baseType: !24, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65}
!59 = !DIEnumerator(name: "no_compression", value: 0)
!60 = !DIEnumerator(name: "gzip", value: 1)
!61 = !DIEnumerator(name: "bgzf", value: 2)
!62 = !DIEnumerator(name: "custom", value: 3)
!63 = !DIEnumerator(name: "bzip2_compression", value: 4)
!64 = !DIEnumerator(name: "razf_compression", value: 5)
!65 = !DIEnumerator(name: "compression_maximum", value: 32767)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hts_fmt_option", file: !23, line: 293, baseType: !24, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!68 = !DIEnumerator(name: "CRAM_OPT_DECODE_MD", value: 0)
!69 = !DIEnumerator(name: "CRAM_OPT_PREFIX", value: 1)
!70 = !DIEnumerator(name: "CRAM_OPT_VERBOSITY", value: 2)
!71 = !DIEnumerator(name: "CRAM_OPT_SEQS_PER_SLICE", value: 3)
!72 = !DIEnumerator(name: "CRAM_OPT_SLICES_PER_CONTAINER", value: 4)
!73 = !DIEnumerator(name: "CRAM_OPT_RANGE", value: 5)
!74 = !DIEnumerator(name: "CRAM_OPT_VERSION", value: 6)
!75 = !DIEnumerator(name: "CRAM_OPT_EMBED_REF", value: 7)
!76 = !DIEnumerator(name: "CRAM_OPT_IGNORE_MD5", value: 8)
!77 = !DIEnumerator(name: "CRAM_OPT_REFERENCE", value: 9)
!78 = !DIEnumerator(name: "CRAM_OPT_MULTI_SEQ_PER_SLICE", value: 10)
!79 = !DIEnumerator(name: "CRAM_OPT_NO_REF", value: 11)
!80 = !DIEnumerator(name: "CRAM_OPT_USE_BZIP2", value: 12)
!81 = !DIEnumerator(name: "CRAM_OPT_SHARED_REF", value: 13)
!82 = !DIEnumerator(name: "CRAM_OPT_NTHREADS", value: 14)
!83 = !DIEnumerator(name: "CRAM_OPT_THREAD_POOL", value: 15)
!84 = !DIEnumerator(name: "CRAM_OPT_USE_LZMA", value: 16)
!85 = !DIEnumerator(name: "CRAM_OPT_USE_RANS", value: 17)
!86 = !DIEnumerator(name: "CRAM_OPT_REQUIRED_FIELDS", value: 18)
!87 = !DIEnumerator(name: "CRAM_OPT_LOSSY_NAMES", value: 19)
!88 = !DIEnumerator(name: "CRAM_OPT_BASES_PER_SLICE", value: 20)
!89 = !DIEnumerator(name: "CRAM_OPT_STORE_MD", value: 21)
!90 = !DIEnumerator(name: "CRAM_OPT_STORE_NM", value: 22)
!91 = !DIEnumerator(name: "CRAM_OPT_RANGE_NOSEEK", value: 23)
!92 = !DIEnumerator(name: "CRAM_OPT_USE_TOK", value: 24)
!93 = !DIEnumerator(name: "CRAM_OPT_USE_FQZ", value: 25)
!94 = !DIEnumerator(name: "CRAM_OPT_USE_ARITH", value: 26)
!95 = !DIEnumerator(name: "CRAM_OPT_POS_DELTA", value: 27)
!96 = !DIEnumerator(name: "HTS_OPT_COMPRESSION_LEVEL", value: 100)
!97 = !DIEnumerator(name: "HTS_OPT_NTHREADS", value: 101)
!98 = !DIEnumerator(name: "HTS_OPT_THREAD_POOL", value: 102)
!99 = !DIEnumerator(name: "HTS_OPT_CACHE_SIZE", value: 103)
!100 = !DIEnumerator(name: "HTS_OPT_BLOCK_SIZE", value: 104)
!101 = !DIEnumerator(name: "HTS_OPT_FILTER", value: 105)
!102 = !DIEnumerator(name: "HTS_OPT_PROFILE", value: 106)
!103 = !DIEnumerator(name: "FASTQ_OPT_CASAVA", value: 1000)
!104 = !DIEnumerator(name: "FASTQ_OPT_AUX", value: 1001)
!105 = !DIEnumerator(name: "FASTQ_OPT_RNUM", value: 1002)
!106 = !DIEnumerator(name: "FASTQ_OPT_BARCODE", value: 1003)
!107 = !{!108, !161, !163, !17, !169, !19, !18, !172, !257, !258, !261, !270, !272, !275}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "elem_t", file: !2, line: 71, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 68, size: 128, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !110, file: !2, line: 69, baseType: !24, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !110, file: !2, line: 70, baseType: !114, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "bam1_t", file: !116, line: 252, baseType: !117)
!116 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/htslib-1.13-3cptg6go643q7k5o3lqa333klizp6eek/include/htslib/sam.h", directory: "/local-ssd/samtools-i7lpfd7rznpn2jrnaklwe67pg7qot4ru-build", checksumkind: CSK_MD5, checksum: "b64ad94d97c3b81ccf06052d1de39653")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bam1_t", file: !116, line: 245, size: 640, elements: !118)
!118 = !{!119, !152, !156, !158, !159, !160}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !117, file: !116, line: 246, baseType: !120, size: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "bam1_core_t", file: !116, line: 219, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bam1_core_t", file: !116, line: 206, size: 384, elements: !122)
!122 = !{!123, !130, !133, !138, !142, !143, !144, !145, !148, !149, !150, !151}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !121, file: !116, line: 207, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_pos_t", file: !23, line: 753, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !126, line: 27, baseType: !127)
!126 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !128, line: 44, baseType: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!129 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !121, file: !116, line: 208, baseType: !131, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !126, line: 26, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !128, line: 41, baseType: !17)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "bin", scope: !121, file: !116, line: 209, baseType: !134, size: 16, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !135, line: 25, baseType: !136)
!135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !128, line: 40, baseType: !137)
!137 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !121, file: !116, line: 210, baseType: !139, size: 8, offset: 112)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !135, line: 24, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !128, line: 38, baseType: !141)
!141 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "l_extranul", scope: !121, file: !116, line: 211, baseType: !139, size: 8, offset: 120)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !116, line: 212, baseType: !134, size: 16, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "l_qname", scope: !121, file: !116, line: 213, baseType: !134, size: 16, offset: 144)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "n_cigar", scope: !121, file: !116, line: 214, baseType: !146, size: 32, offset: 160)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !135, line: 26, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !128, line: 42, baseType: !24)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "l_qseq", scope: !121, file: !116, line: 215, baseType: !131, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mtid", scope: !121, file: !116, line: 216, baseType: !131, size: 32, offset: 224)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mpos", scope: !121, file: !116, line: 217, baseType: !124, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "isize", scope: !121, file: !116, line: 218, baseType: !124, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !117, file: !116, line: 247, baseType: !153, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !135, line: 27, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !128, line: 45, baseType: !155)
!155 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !116, line: 248, baseType: !157, size: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "l_data", scope: !117, file: !116, line: 249, baseType: !17, size: 32, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "m_data", scope: !117, file: !116, line: 250, baseType: !146, size: 32, offset: 544)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mempolicy", scope: !117, file: !116, line: 251, baseType: !146, size: 2, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !162, line: 70, baseType: !155)
!162 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ks_isort_stack_t", file: !165, line: 89, baseType: !166)
!165 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/htslib-1.13-3cptg6go643q7k5o3lqa333klizp6eek/include/htslib/ksort.h", directory: "/local-ssd/samtools-i7lpfd7rznpn2jrnaklwe67pg7qot4ru-build", checksumkind: CSK_MD5, checksum: "9f7b758259a19a6be0ac9de80e1d62dc")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 86, size: 192, elements: !167)
!167 = !{!168, !170, !171}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !166, file: !165, line: 87, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !166, file: !165, line: 87, baseType: !169, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !166, file: !165, line: 88, baseType: !17, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "samFile", file: !116, line: 396, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsFile", file: !23, line: 261, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsFile", file: !23, line: 245, size: 1088, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !193, !194, !195, !208, !209, !224, !228, !231, !254}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin", scope: !176, file: !23, line: 246, baseType: !146, size: 1, flags: DIFlagBitField, extraData: i64 0)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !176, file: !23, line: 246, baseType: !146, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "is_be", scope: !176, file: !23, line: 246, baseType: !146, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "is_cram", scope: !176, file: !23, line: 246, baseType: !146, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "is_bgzf", scope: !176, file: !23, line: 246, baseType: !146, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !176, file: !23, line: 246, baseType: !146, size: 27, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !176, file: !23, line: 247, baseType: !125, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !176, file: !23, line: 248, baseType: !186, size: 192, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "kstring_t", file: !187, line: 71, baseType: !188)
!187 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/htslib-1.13-3cptg6go643q7k5o3lqa333klizp6eek/include/htslib/kstring.h", directory: "/local-ssd/samtools-i7lpfd7rznpn2jrnaklwe67pg7qot4ru-build", checksumkind: CSK_MD5, checksum: "532459e2e5dea934e82fd1dc844130c8")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstring_t", file: !187, line: 68, size: 192, elements: !189)
!189 = !{!190, !191, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !188, file: !187, line: 69, baseType: !161, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !188, file: !187, line: 69, baseType: !161, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !188, file: !187, line: 70, baseType: !19, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !176, file: !23, line: 249, baseType: !19, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "fn_aux", scope: !176, file: !23, line: 249, baseType: !19, size: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !176, file: !23, line: 254, baseType: !196, size: 64, offset: 448)
!196 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !176, file: !23, line: 250, size: 64, elements: !197)
!197 = !{!198, !202, !205}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "bgzf", scope: !196, file: !23, line: 251, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "BGZF", file: !23, line: 54, baseType: !201)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "BGZF", file: !23, line: 54, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cram", scope: !196, file: !23, line: 252, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "cram_fd", file: !23, line: 57, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "hfile", scope: !196, file: !23, line: 253, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "hFILE", file: !23, line: 58, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !176, file: !23, line: 255, baseType: !169, size: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !176, file: !23, line: 256, baseType: !210, size: 256, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsFormat", file: !23, line: 223, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsFormat", file: !23, line: 216, size: 256, elements: !212)
!212 = !{!213, !214, !215, !221, !222, !223}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !211, file: !23, line: 217, baseType: !22, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !211, file: !23, line: 218, baseType: !32, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !211, file: !23, line: 219, baseType: !216, size: 32, offset: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !23, line: 219, size: 32, elements: !217)
!217 = !{!218, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !216, file: !23, line: 219, baseType: !219, size: 16)
!219 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !216, file: !23, line: 219, baseType: !219, size: 16, offset: 16)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !211, file: !23, line: 220, baseType: !57, size: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !211, file: !23, line: 221, baseType: !219, size: 16, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "specific", scope: !211, file: !23, line: 222, baseType: !169, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !176, file: !23, line: 257, baseType: !225, size: 64, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_idx_t", file: !23, line: 226, baseType: !227)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "hts_idx_t", file: !23, line: 225, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fnidx", scope: !176, file: !23, line: 258, baseType: !229, size: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "bam_header", scope: !176, file: !23, line: 259, baseType: !232, size: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sam_hdr_t", file: !116, line: 73, size: 576, elements: !234)
!234 = !{!235, !236, !237, !238, !240, !246, !247, !248, !249, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "n_targets", scope: !233, file: !116, line: 74, baseType: !131, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_sam_err", scope: !233, file: !116, line: 74, baseType: !131, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "l_text", scope: !233, file: !116, line: 75, baseType: !161, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "target_len", scope: !233, file: !116, line: 76, baseType: !239, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "cigar_tab", scope: !233, file: !116, line: 77, baseType: !241, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !126, line: 24, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !128, line: 37, baseType: !245)
!245 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "target_name", scope: !233, file: !116, line: 78, baseType: !18, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !233, file: !116, line: 79, baseType: !19, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sdict", scope: !233, file: !116, line: 80, baseType: !169, size: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "hrecs", scope: !233, file: !116, line: 81, baseType: !250, size: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sam_hrecs_t", file: !116, line: 52, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "sam_hrecs_t", file: !116, line: 52, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !233, file: !116, line: 82, baseType: !146, size: 32, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !176, file: !23, line: 260, baseType: !255, size: 64, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "hts_filter_t", file: !23, line: 227, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !259, line: 166, baseType: !260)
!259 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spac/linux-ubuntu22.04-zen2/clang-18.0.0/htslib-1.13-3cptg6go643q7k5o3lqa333klizp6eek/include/htslib/khash.h", directory: "/local-ssd/samtools-i7lpfd7rznpn2jrnaklwe67pg7qot4ru-build", checksumkind: CSK_MD5, checksum: "65a22945a6b0dd8c7e4297e6fc0b7826")
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !259, line: 139, baseType: !24)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_bam_store_t", file: !2, line: 103, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_bam_store_s", file: !2, line: 103, size: 320, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !271, !274}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !263, file: !2, line: 103, baseType: !258, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !263, file: !2, line: 103, baseType: !258, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !263, file: !2, line: 103, baseType: !258, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !263, file: !2, line: 103, baseType: !258, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !263, file: !2, line: 103, baseType: !270, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !263, file: !2, line: 103, baseType: !272, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_cstr_t", file: !259, line: 639, baseType: !229)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !263, file: !2, line: 103, baseType: !275, size: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "store_item_t", file: !2, line: 101, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 99, size: 64, elements: !278)
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "bi", scope: !277, file: !2, line: 100, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "bam_item_t", file: !2, line: 90, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 87, size: 128, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !282, file: !2, line: 88, baseType: !17, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !282, file: !2, line: 89, baseType: !114, size: 64, offset: 64)
!286 = !{!0, !7, !287, !292, !297, !302, !307, !309, !311, !316, !318, !12, !323, !328, !333, !338, !343, !348, !353, !358, !363, !365, !370, !375, !377, !379, !381, !383, !385, !390, !392, !397, !402, !404, !406, !408, !410, !415, !417, !419, !424, !429, !431, !433, !438, !443, !448, !450, !455, !460, !465, !467, !469, !471, !476, !481, !486, !491, !496, !498, !502}
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 10)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 17)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 11)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 18)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !289, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !3, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 12)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !289, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 6)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !2, line: 593, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 14)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !2, line: 613, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 53)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !2, line: 624, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 26)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 530, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3528, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 441)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 542, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 9)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !2, line: 544, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 62)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 197, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 28)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 204, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 2)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 206, type: !355, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 31)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !2, line: 217, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 3)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !2, line: 217, type: !372, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !2, line: 217, type: !345, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !2, line: 217, type: !372, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !2, line: 217, type: !320, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !2, line: 218, type: !372, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !2, line: 218, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 4)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !2, line: 220, type: !335, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 5)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !2, line: 233, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 7)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !320, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !2, line: 242, type: !372, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !360, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !355, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !2, line: 248, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 33)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !345, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 255, type: !372, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 40)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 22)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !2, line: 278, type: !313, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 279, type: !394, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 282, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 35)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !2, line: 287, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 48)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !2, line: 302, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 45)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 327, type: !421, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !2, line: 338, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 44)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 345, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 41)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 43)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !2, line: 366, type: !440, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !2, line: 372, type: !440, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !2, line: 431, type: !335, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !2, line: 439, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 23)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !2, line: 463, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 19)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !2, line: 472, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 20)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !2, line: 487, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 24)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !2, line: 498, type: !493, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 25)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !2, line: 506, type: !9, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression(DW_OP_constu, 4605110762971426980, DW_OP_stack_value))
!499 = distinct !DIGlobalVariable(name: "__ac_HASH_UPPER", scope: !20, file: !259, line: 196, type: !500, isLocal: true, isDefinition: true)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!501 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !2, line: 173, type: !457, isLocal: true, isDefinition: true)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!505 = !DILocalVariable(name: "argc", arg: 1, scope: !14, file: !2, line: 581, type: !17)
!506 = !DILocalVariable(name: "argv", arg: 2, scope: !14, file: !2, line: 581, type: !18)
!507 = !DILocalVariable(name: "c", scope: !14, file: !2, line: 583, type: !17)
!508 = !DILocalVariable(name: "n_files", scope: !14, file: !2, line: 583, type: !17)
!509 = !DILocalVariable(name: "clevel", scope: !14, file: !2, line: 583, type: !17)
!510 = !DILocalVariable(name: "is_stdout", scope: !14, file: !2, line: 583, type: !17)
!511 = !DILocalVariable(name: "is_un", scope: !14, file: !2, line: 583, type: !17)
!512 = !DILocalVariable(name: "fast_coll", scope: !14, file: !2, line: 583, type: !17)
!513 = !DILocalVariable(name: "reads_store", scope: !14, file: !2, line: 583, type: !17)
!514 = !DILocalVariable(name: "ret", scope: !14, file: !2, line: 583, type: !17)
!515 = !DILocalVariable(name: "pre_mem", scope: !14, file: !2, line: 583, type: !17)
!516 = !DILocalVariable(name: "no_pg", scope: !14, file: !2, line: 583, type: !17)
!517 = !DILocalVariable(name: "output_file", scope: !14, file: !2, line: 584, type: !229)
!518 = !DILocalVariable(name: "prefix", scope: !14, file: !2, line: 585, type: !19)
!519 = !DILocalVariable(name: "arg_list", scope: !14, file: !2, line: 585, type: !19)
!520 = !DILocalVariable(name: "ga", scope: !14, file: !2, line: 586, type: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "sam_global_args", file: !522, line: 39, baseType: !523)
!522 = !DIFile(filename: "./sam_opts.h", directory: "/local-ssd/samtools-i7lpfd7rznpn2jrnaklwe67pg7qot4ru-build/aidengro/spack-stage-samtools-1.13-i7lpfd7rznpn2jrnaklwe67pg7qot4ru/spack-src", checksumkind: CSK_MD5, checksum: "2b38086da37a54b3b8875492f0298c0e")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sam_global_args", file: !522, line: 33, size: 640, elements: !524)
!524 = !{!525, !526, !527, !528, !529}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !523, file: !522, line: 34, baseType: !210, size: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !523, file: !522, line: 35, baseType: !210, size: 256, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !523, file: !522, line: 36, baseType: !19, size: 64, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !523, file: !522, line: 37, baseType: !17, size: 32, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "write_index", scope: !523, file: !522, line: 38, baseType: !17, size: 32, offset: 608)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 2560, elements: !290)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !533, line: 50, size: 256, elements: !534)
!533 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!534 = !{!535, !536, !537, !539}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !532, file: !533, line: 52, baseType: !229, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !532, file: !533, line: 55, baseType: !17, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !532, file: !533, line: 56, baseType: !538, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !532, file: !533, line: 57, baseType: !17, size: 32, offset: 192)
!540 = !{i32 7, !"Dwarf Version", i32 5}
!541 = !{i32 2, !"Debug Info Version", i32 3}
!542 = !{i32 1, !"wchar_size", i32 4}
!543 = !{i32 8, !"PIC Level", i32 2}
!544 = !{i32 7, !"PIE Level", i32 2}
!545 = !{i32 7, !"uwtable", i32 2}
!546 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!547 = distinct !DISubprogram(name: "ks_mergesort_bamshuf", scope: !2, file: !2, line: 84, type: !548, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !550)
!548 = !DISubroutineType(types: !549)
!549 = !{!17, !161, !108, !108}
!550 = !{!551, !552, !553, !554, !556, !557, !558, !559, !560, !566, !567, !568, !570, !571, !575, !576, !577, !578, !579, !582, !583}
!551 = !DILocalVariable(name: "n", arg: 1, scope: !547, file: !2, line: 84, type: !161)
!552 = !DILocalVariable(name: "array", arg: 2, scope: !547, file: !2, line: 84, type: !108)
!553 = !DILocalVariable(name: "temp", arg: 3, scope: !547, file: !2, line: 84, type: !108)
!554 = !DILocalVariable(name: "a2", scope: !547, file: !2, line: 84, type: !555)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, elements: !361)
!556 = !DILocalVariable(name: "a", scope: !547, file: !2, line: 84, type: !108)
!557 = !DILocalVariable(name: "b", scope: !547, file: !2, line: 84, type: !108)
!558 = !DILocalVariable(name: "curr", scope: !547, file: !2, line: 84, type: !17)
!559 = !DILocalVariable(name: "shift", scope: !547, file: !2, line: 84, type: !17)
!560 = !DILocalVariable(name: "p", scope: !561, file: !2, line: 84, type: !108)
!561 = distinct !DILexicalBlock(scope: !562, file: !2, line: 84, column: 1)
!562 = distinct !DILexicalBlock(scope: !563, file: !2, line: 84, column: 1)
!563 = distinct !DILexicalBlock(scope: !564, file: !2, line: 84, column: 1)
!564 = distinct !DILexicalBlock(scope: !565, file: !2, line: 84, column: 1)
!565 = distinct !DILexicalBlock(scope: !547, file: !2, line: 84, column: 1)
!566 = !DILocalVariable(name: "i", scope: !561, file: !2, line: 84, type: !108)
!567 = !DILocalVariable(name: "eb", scope: !561, file: !2, line: 84, type: !108)
!568 = !DILocalVariable(name: "i", scope: !569, file: !2, line: 84, type: !161)
!569 = distinct !DILexicalBlock(scope: !562, file: !2, line: 84, column: 1)
!570 = !DILocalVariable(name: "step", scope: !569, file: !2, line: 84, type: !161)
!571 = !DILocalVariable(name: "p", scope: !572, file: !2, line: 84, type: !108)
!572 = distinct !DILexicalBlock(scope: !573, file: !2, line: 84, column: 1)
!573 = distinct !DILexicalBlock(scope: !574, file: !2, line: 84, column: 1)
!574 = distinct !DILexicalBlock(scope: !569, file: !2, line: 84, column: 1)
!575 = !DILocalVariable(name: "j", scope: !572, file: !2, line: 84, type: !108)
!576 = !DILocalVariable(name: "k", scope: !572, file: !2, line: 84, type: !108)
!577 = !DILocalVariable(name: "ea", scope: !572, file: !2, line: 84, type: !108)
!578 = !DILocalVariable(name: "eb", scope: !572, file: !2, line: 84, type: !108)
!579 = !DILocalVariable(name: "p", scope: !580, file: !2, line: 84, type: !108)
!580 = distinct !DILexicalBlock(scope: !581, file: !2, line: 84, column: 1)
!581 = distinct !DILexicalBlock(scope: !547, file: !2, line: 84, column: 1)
!582 = !DILocalVariable(name: "i", scope: !580, file: !2, line: 84, type: !108)
!583 = !DILocalVariable(name: "eb", scope: !580, file: !2, line: 84, type: !108)
!584 = !{!585, !585, i64 0}
!585 = !{!"long", !586, i64 0}
!586 = !{!"omnipotent char", !587, i64 0}
!587 = !{!"Simple C/C++ TBAA"}
!588 = !DILocation(line: 84, column: 1, scope: !547)
!589 = !{!590, !590, i64 0}
!590 = !{!"any pointer", !586, i64 0}
!591 = !DILocation(line: 84, column: 1, scope: !565)
!592 = !{!593, !593, i64 0}
!593 = !{!"int", !586, i64 0}
!594 = !DILocation(line: 84, column: 1, scope: !564)
!595 = !DILocation(line: 84, column: 1, scope: !563)
!596 = !DILocation(line: 84, column: 1, scope: !562)
!597 = !DILocation(line: 84, column: 1, scope: !561)
!598 = !DILocation(line: 84, column: 1, scope: !599)
!599 = distinct !DILexicalBlock(scope: !561, file: !2, line: 84, column: 1)
!600 = !DILocation(line: 84, column: 1, scope: !601)
!601 = distinct !DILexicalBlock(scope: !599, file: !2, line: 84, column: 1)
!602 = !DILocation(line: 84, column: 1, scope: !603)
!603 = distinct !DILexicalBlock(scope: !604, file: !2, line: 84, column: 1)
!604 = distinct !DILexicalBlock(scope: !601, file: !2, line: 84, column: 1)
!605 = !DILocation(line: 84, column: 1, scope: !604)
!606 = !{i64 0, i64 4, !592, i64 8, i64 8, !589}
!607 = !DILocation(line: 84, column: 1, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !2, line: 84, column: 1)
!609 = distinct !DILexicalBlock(scope: !603, file: !2, line: 84, column: 1)
!610 = !DILocation(line: 84, column: 1, scope: !609)
!611 = !DILocation(line: 84, column: 1, scope: !612)
!612 = distinct !DILexicalBlock(scope: !608, file: !2, line: 84, column: 1)
!613 = !DILocation(line: 84, column: 1, scope: !614)
!614 = distinct !DILexicalBlock(scope: !608, file: !2, line: 84, column: 1)
!615 = distinct !{!615, !598, !598, !616}
!616 = !{!"llvm.loop.mustprogress"}
!617 = !DILocation(line: 84, column: 1, scope: !569)
!618 = !DILocation(line: 84, column: 1, scope: !574)
!619 = !DILocation(line: 84, column: 1, scope: !573)
!620 = !DILocation(line: 84, column: 1, scope: !572)
!621 = !DILocation(line: 84, column: 1, scope: !622)
!622 = distinct !DILexicalBlock(scope: !572, file: !2, line: 84, column: 1)
!623 = !DILocation(line: 84, column: 1, scope: !624)
!624 = distinct !DILexicalBlock(scope: !622, file: !2, line: 84, column: 1)
!625 = !DILocation(line: 84, column: 1, scope: !626)
!626 = distinct !DILexicalBlock(scope: !622, file: !2, line: 84, column: 1)
!627 = !DILocation(line: 0, scope: !572)
!628 = !DILocation(line: 84, column: 1, scope: !629)
!629 = distinct !DILexicalBlock(scope: !630, file: !2, line: 84, column: 1)
!630 = distinct !DILexicalBlock(scope: !572, file: !2, line: 84, column: 1)
!631 = !DILocation(line: 84, column: 1, scope: !630)
!632 = distinct !{!632, !620, !620, !616}
!633 = distinct !{!633, !620, !620, !616}
!634 = distinct !{!634, !620, !620, !616}
!635 = distinct !{!635, !618, !618, !616}
!636 = distinct !{!636, !591, !591, !616}
!637 = !DILocation(line: 84, column: 1, scope: !581)
!638 = !DILocation(line: 84, column: 1, scope: !580)
!639 = !DILocation(line: 84, column: 1, scope: !640)
!640 = distinct !DILexicalBlock(scope: !641, file: !2, line: 84, column: 1)
!641 = distinct !DILexicalBlock(scope: !580, file: !2, line: 84, column: 1)
!642 = !DILocation(line: 84, column: 1, scope: !641)
!643 = distinct !{!643, !642, !642, !616}
!644 = !DILocation(line: 84, column: 1, scope: !645)
!645 = distinct !DILexicalBlock(scope: !547, file: !2, line: 84, column: 1)
!646 = !DISubprogram(name: "malloc", scope: !647, file: !647, line: 540, type: !648, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!647 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!648 = !DISubroutineType(types: !649)
!649 = !{!169, !161}
!650 = distinct !DISubprogram(name: "elem_lt", scope: !2, file: !2, line: 73, type: !651, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !653)
!651 = !DISubroutineType(types: !652)
!652 = !{!17, !109, !109}
!653 = !{!654, !655, !656}
!654 = !DILocalVariable(name: "x", arg: 1, scope: !650, file: !2, line: 73, type: !109)
!655 = !DILocalVariable(name: "y", arg: 2, scope: !650, file: !2, line: 73, type: !109)
!656 = !DILocalVariable(name: "t", scope: !657, file: !2, line: 77, type: !17)
!657 = distinct !DILexicalBlock(scope: !658, file: !2, line: 76, column: 25)
!658 = distinct !DILexicalBlock(scope: !650, file: !2, line: 76, column: 9)
!659 = !DILocation(line: 73, column: 34, scope: !650)
!660 = !DILocation(line: 73, column: 44, scope: !650)
!661 = !DILocation(line: 75, column: 11, scope: !662)
!662 = distinct !DILexicalBlock(scope: !650, file: !2, line: 75, column: 9)
!663 = !{!664, !593, i64 0}
!664 = !{!"", !593, i64 0, !590, i64 8}
!665 = !DILocation(line: 75, column: 19, scope: !662)
!666 = !DILocation(line: 75, column: 15, scope: !662)
!667 = !DILocation(line: 75, column: 9, scope: !650)
!668 = !DILocation(line: 75, column: 24, scope: !662)
!669 = !DILocation(line: 76, column: 11, scope: !658)
!670 = !DILocation(line: 76, column: 20, scope: !658)
!671 = !DILocation(line: 76, column: 15, scope: !658)
!672 = !DILocation(line: 76, column: 9, scope: !650)
!673 = !DILocation(line: 77, column: 9, scope: !657)
!674 = !DILocation(line: 77, column: 13, scope: !657)
!675 = !DILocation(line: 78, column: 20, scope: !657)
!676 = !{!664, !590, i64 8}
!677 = !{!678, !590, i64 56}
!678 = !{!"bam1_t", !679, i64 0, !585, i64 48, !590, i64 56, !593, i64 64, !593, i64 68, !593, i64 72}
!679 = !{!"bam1_core_t", !585, i64 0, !593, i64 8, !680, i64 12, !586, i64 14, !586, i64 15, !680, i64 16, !680, i64 18, !593, i64 20, !593, i64 24, !593, i64 28, !585, i64 32, !585, i64 40}
!680 = !{!"short", !586, i64 0}
!681 = !DILocation(line: 78, column: 40, scope: !657)
!682 = !DILocation(line: 78, column: 13, scope: !657)
!683 = !DILocation(line: 78, column: 11, scope: !657)
!684 = !DILocation(line: 79, column: 13, scope: !685)
!685 = distinct !DILexicalBlock(scope: !657, file: !2, line: 79, column: 13)
!686 = !DILocation(line: 79, column: 15, scope: !685)
!687 = !DILocation(line: 79, column: 13, scope: !657)
!688 = !DILocation(line: 79, column: 20, scope: !685)
!689 = !DILocation(line: 80, column: 17, scope: !657)
!690 = !DILocation(line: 80, column: 19, scope: !657)
!691 = !DILocation(line: 80, column: 24, scope: !657)
!692 = !DILocation(line: 80, column: 31, scope: !657)
!693 = !DILocation(line: 80, column: 34, scope: !657)
!694 = !DILocation(line: 80, column: 39, scope: !657)
!695 = !{!678, !680, i64 16}
!696 = !DILocation(line: 80, column: 29, scope: !657)
!697 = !DILocation(line: 80, column: 43, scope: !657)
!698 = !DILocation(line: 80, column: 46, scope: !657)
!699 = !DILocation(line: 80, column: 55, scope: !657)
!700 = !DILocation(line: 80, column: 58, scope: !657)
!701 = !DILocation(line: 80, column: 63, scope: !657)
!702 = !DILocation(line: 80, column: 53, scope: !657)
!703 = !DILocation(line: 80, column: 67, scope: !657)
!704 = !DILocation(line: 80, column: 70, scope: !657)
!705 = !DILocation(line: 80, column: 50, scope: !657)
!706 = !DILocation(line: 0, scope: !657)
!707 = !DILocation(line: 80, column: 9, scope: !657)
!708 = !DILocation(line: 81, column: 5, scope: !658)
!709 = !DILocation(line: 81, column: 12, scope: !658)
!710 = !DILocation(line: 82, column: 1, scope: !650)
!711 = !DISubprogram(name: "free", scope: !647, file: !647, line: 555, type: !712, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !169}
!714 = distinct !DISubprogram(name: "ks_heapadjust_bamshuf", scope: !2, file: !2, line: 84, type: !715, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !161, !161, !108}
!717 = !{!718, !719, !720, !721, !722}
!718 = !DILocalVariable(name: "i", arg: 1, scope: !714, file: !2, line: 84, type: !161)
!719 = !DILocalVariable(name: "n", arg: 2, scope: !714, file: !2, line: 84, type: !161)
!720 = !DILocalVariable(name: "l", arg: 3, scope: !714, file: !2, line: 84, type: !108)
!721 = !DILocalVariable(name: "k", scope: !714, file: !2, line: 84, type: !161)
!722 = !DILocalVariable(name: "tmp", scope: !714, file: !2, line: 84, type: !109)
!723 = !DILocation(line: 84, column: 1, scope: !714)
!724 = !DILocation(line: 84, column: 1, scope: !725)
!725 = distinct !DILexicalBlock(scope: !726, file: !2, line: 84, column: 1)
!726 = distinct !DILexicalBlock(scope: !714, file: !2, line: 84, column: 1)
!727 = !DILocation(line: 84, column: 1, scope: !726)
!728 = !DILocation(line: 84, column: 1, scope: !729)
!729 = distinct !DILexicalBlock(scope: !726, file: !2, line: 84, column: 1)
!730 = distinct !{!730, !723, !723, !616}
!731 = distinct !DISubprogram(name: "ks_heapmake_bamshuf", scope: !2, file: !2, line: 84, type: !732, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !161, !108}
!734 = !{!735, !736, !737}
!735 = !DILocalVariable(name: "lsize", arg: 1, scope: !731, file: !2, line: 84, type: !161)
!736 = !DILocalVariable(name: "l", arg: 2, scope: !731, file: !2, line: 84, type: !108)
!737 = !DILocalVariable(name: "i", scope: !731, file: !2, line: 84, type: !161)
!738 = !DILocation(line: 84, column: 1, scope: !731)
!739 = !DILocation(line: 84, column: 1, scope: !740)
!740 = distinct !DILexicalBlock(scope: !731, file: !2, line: 84, column: 1)
!741 = !DILocation(line: 84, column: 1, scope: !742)
!742 = distinct !DILexicalBlock(scope: !740, file: !2, line: 84, column: 1)
!743 = distinct !{!743, !739, !739, !616}
!744 = distinct !DISubprogram(name: "ks_heapsort_bamshuf", scope: !2, file: !2, line: 84, type: !732, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DILocalVariable(name: "lsize", arg: 1, scope: !744, file: !2, line: 84, type: !161)
!747 = !DILocalVariable(name: "l", arg: 2, scope: !744, file: !2, line: 84, type: !108)
!748 = !DILocalVariable(name: "i", scope: !744, file: !2, line: 84, type: !161)
!749 = !DILocalVariable(name: "tmp", scope: !750, file: !2, line: 84, type: !109)
!750 = distinct !DILexicalBlock(scope: !751, file: !2, line: 84, column: 1)
!751 = distinct !DILexicalBlock(scope: !752, file: !2, line: 84, column: 1)
!752 = distinct !DILexicalBlock(scope: !744, file: !2, line: 84, column: 1)
!753 = !DILocation(line: 84, column: 1, scope: !744)
!754 = !DILocation(line: 84, column: 1, scope: !752)
!755 = !DILocation(line: 84, column: 1, scope: !751)
!756 = !DILocation(line: 84, column: 1, scope: !750)
!757 = distinct !{!757, !754, !754, !616}
!758 = distinct !DISubprogram(name: "ks_combsort_bamshuf", scope: !2, file: !2, line: 84, type: !732, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767}
!760 = !DILocalVariable(name: "n", arg: 1, scope: !758, file: !2, line: 84, type: !161)
!761 = !DILocalVariable(name: "a", arg: 2, scope: !758, file: !2, line: 84, type: !108)
!762 = !DILocalVariable(name: "shrink_factor", scope: !758, file: !2, line: 84, type: !500)
!763 = !DILocalVariable(name: "do_swap", scope: !758, file: !2, line: 84, type: !17)
!764 = !DILocalVariable(name: "gap", scope: !758, file: !2, line: 84, type: !161)
!765 = !DILocalVariable(name: "tmp", scope: !758, file: !2, line: 84, type: !109)
!766 = !DILocalVariable(name: "i", scope: !758, file: !2, line: 84, type: !108)
!767 = !DILocalVariable(name: "j", scope: !758, file: !2, line: 84, type: !108)
!768 = !DILocation(line: 84, column: 1, scope: !758)
!769 = !{!770, !770, i64 0}
!770 = !{!"double", !586, i64 0}
!771 = !DILocation(line: 84, column: 1, scope: !772)
!772 = distinct !DILexicalBlock(scope: !773, file: !2, line: 84, column: 1)
!773 = distinct !DILexicalBlock(scope: !758, file: !2, line: 84, column: 1)
!774 = !DILocation(line: 84, column: 1, scope: !773)
!775 = !DILocation(line: 84, column: 1, scope: !776)
!776 = distinct !DILexicalBlock(scope: !772, file: !2, line: 84, column: 1)
!777 = !DILocation(line: 84, column: 1, scope: !778)
!778 = distinct !DILexicalBlock(scope: !776, file: !2, line: 84, column: 1)
!779 = !DILocation(line: 84, column: 1, scope: !780)
!780 = distinct !DILexicalBlock(scope: !773, file: !2, line: 84, column: 1)
!781 = !DILocation(line: 84, column: 1, scope: !782)
!782 = distinct !DILexicalBlock(scope: !780, file: !2, line: 84, column: 1)
!783 = !DILocation(line: 84, column: 1, scope: !784)
!784 = distinct !DILexicalBlock(scope: !782, file: !2, line: 84, column: 1)
!785 = !DILocation(line: 84, column: 1, scope: !786)
!786 = distinct !DILexicalBlock(scope: !784, file: !2, line: 84, column: 1)
!787 = !DILocation(line: 84, column: 1, scope: !788)
!788 = distinct !DILexicalBlock(scope: !786, file: !2, line: 84, column: 1)
!789 = distinct !{!789, !779, !779, !616}
!790 = distinct !{!790, !768, !768, !616}
!791 = !DILocation(line: 84, column: 1, scope: !792)
!792 = distinct !DILexicalBlock(scope: !758, file: !2, line: 84, column: 1)
!793 = distinct !DISubprogram(name: "__ks_insertsort_bamshuf", scope: !2, file: !2, line: 84, type: !794, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !796)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !108, !108}
!796 = !{!797, !798, !799, !800, !801}
!797 = !DILocalVariable(name: "s", arg: 1, scope: !793, file: !2, line: 84, type: !108)
!798 = !DILocalVariable(name: "t", arg: 2, scope: !793, file: !2, line: 84, type: !108)
!799 = !DILocalVariable(name: "i", scope: !793, file: !2, line: 84, type: !108)
!800 = !DILocalVariable(name: "j", scope: !793, file: !2, line: 84, type: !108)
!801 = !DILocalVariable(name: "swap_tmp", scope: !793, file: !2, line: 84, type: !109)
!802 = !DILocation(line: 84, column: 1, scope: !793)
!803 = !DILocation(line: 84, column: 1, scope: !804)
!804 = distinct !DILexicalBlock(scope: !793, file: !2, line: 84, column: 1)
!805 = !DILocation(line: 84, column: 1, scope: !806)
!806 = distinct !DILexicalBlock(scope: !804, file: !2, line: 84, column: 1)
!807 = !DILocation(line: 84, column: 1, scope: !808)
!808 = distinct !DILexicalBlock(scope: !806, file: !2, line: 84, column: 1)
!809 = !DILocation(line: 84, column: 1, scope: !810)
!810 = distinct !DILexicalBlock(scope: !808, file: !2, line: 84, column: 1)
!811 = !DILocation(line: 0, scope: !810)
!812 = !DILocation(line: 84, column: 1, scope: !813)
!813 = distinct !DILexicalBlock(scope: !810, file: !2, line: 84, column: 1)
!814 = distinct !{!814, !807, !807, !616}
!815 = distinct !{!815, !803, !803, !616}
!816 = distinct !DISubprogram(name: "ks_introsort_bamshuf", scope: !2, file: !2, line: 84, type: !817, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !819)
!817 = !DISubroutineType(types: !818)
!818 = !{!17, !161, !108}
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!820 = !DILocalVariable(name: "n", arg: 1, scope: !816, file: !2, line: 84, type: !161)
!821 = !DILocalVariable(name: "a", arg: 2, scope: !816, file: !2, line: 84, type: !108)
!822 = !DILocalVariable(name: "d", scope: !816, file: !2, line: 84, type: !17)
!823 = !DILocalVariable(name: "top", scope: !816, file: !2, line: 84, type: !163)
!824 = !DILocalVariable(name: "stack", scope: !816, file: !2, line: 84, type: !163)
!825 = !DILocalVariable(name: "rp", scope: !816, file: !2, line: 84, type: !109)
!826 = !DILocalVariable(name: "swap_tmp", scope: !816, file: !2, line: 84, type: !109)
!827 = !DILocalVariable(name: "s", scope: !816, file: !2, line: 84, type: !108)
!828 = !DILocalVariable(name: "t", scope: !816, file: !2, line: 84, type: !108)
!829 = !DILocalVariable(name: "i", scope: !816, file: !2, line: 84, type: !108)
!830 = !DILocalVariable(name: "j", scope: !816, file: !2, line: 84, type: !108)
!831 = !DILocalVariable(name: "k", scope: !816, file: !2, line: 84, type: !108)
!832 = !DILocation(line: 84, column: 1, scope: !816)
!833 = !DILocation(line: 84, column: 1, scope: !834)
!834 = distinct !DILexicalBlock(scope: !816, file: !2, line: 84, column: 1)
!835 = !DILocation(line: 84, column: 1, scope: !836)
!836 = distinct !DILexicalBlock(scope: !834, file: !2, line: 84, column: 1)
!837 = !DILocation(line: 84, column: 1, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !2, line: 84, column: 1)
!839 = distinct !DILexicalBlock(scope: !836, file: !2, line: 84, column: 1)
!840 = !DILocation(line: 84, column: 1, scope: !839)
!841 = !DILocation(line: 84, column: 1, scope: !842)
!842 = distinct !DILexicalBlock(scope: !838, file: !2, line: 84, column: 1)
!843 = !DILocation(line: 84, column: 1, scope: !844)
!844 = distinct !DILexicalBlock(scope: !816, file: !2, line: 84, column: 1)
!845 = !DILocation(line: 84, column: 1, scope: !846)
!846 = distinct !DILexicalBlock(scope: !844, file: !2, line: 84, column: 1)
!847 = distinct !{!847, !843, !843, !616}
!848 = !DILocation(line: 84, column: 1, scope: !849)
!849 = distinct !DILexicalBlock(scope: !850, file: !2, line: 84, column: 1)
!850 = distinct !DILexicalBlock(scope: !816, file: !2, line: 84, column: 1)
!851 = !DILocation(line: 84, column: 1, scope: !850)
!852 = !DILocation(line: 84, column: 1, scope: !853)
!853 = distinct !DILexicalBlock(scope: !854, file: !2, line: 84, column: 1)
!854 = distinct !DILexicalBlock(scope: !849, file: !2, line: 84, column: 1)
!855 = !DILocation(line: 84, column: 1, scope: !854)
!856 = !DILocation(line: 84, column: 1, scope: !857)
!857 = distinct !DILexicalBlock(scope: !853, file: !2, line: 84, column: 1)
!858 = distinct !{!858, !832, !832}
!859 = !DILocation(line: 84, column: 1, scope: !860)
!860 = distinct !DILexicalBlock(scope: !854, file: !2, line: 84, column: 1)
!861 = !DILocation(line: 84, column: 1, scope: !862)
!862 = distinct !DILexicalBlock(scope: !863, file: !2, line: 84, column: 1)
!863 = distinct !DILexicalBlock(scope: !860, file: !2, line: 84, column: 1)
!864 = !DILocation(line: 84, column: 1, scope: !863)
!865 = !DILocation(line: 84, column: 1, scope: !866)
!866 = distinct !DILexicalBlock(scope: !854, file: !2, line: 84, column: 1)
!867 = !DILocation(line: 84, column: 1, scope: !868)
!868 = distinct !DILexicalBlock(scope: !866, file: !2, line: 84, column: 1)
!869 = !DILocation(line: 84, column: 1, scope: !870)
!870 = distinct !DILexicalBlock(scope: !871, file: !2, line: 84, column: 1)
!871 = distinct !DILexicalBlock(scope: !872, file: !2, line: 84, column: 1)
!872 = distinct !DILexicalBlock(scope: !854, file: !2, line: 84, column: 1)
!873 = distinct !{!873, !869, !869, !616}
!874 = !DILocation(line: 0, scope: !870)
!875 = distinct !{!875, !869, !869, !616}
!876 = !DILocation(line: 84, column: 1, scope: !877)
!877 = distinct !DILexicalBlock(scope: !870, file: !2, line: 84, column: 1)
!878 = !DILocation(line: 84, column: 1, scope: !871)
!879 = distinct !{!879, !880, !880}
!880 = !DILocation(line: 84, column: 1, scope: !872)
!881 = !DILocation(line: 84, column: 1, scope: !882)
!882 = distinct !DILexicalBlock(scope: !854, file: !2, line: 84, column: 1)
!883 = !DILocation(line: 84, column: 1, scope: !884)
!884 = distinct !DILexicalBlock(scope: !885, file: !2, line: 84, column: 1)
!885 = distinct !DILexicalBlock(scope: !882, file: !2, line: 84, column: 1)
!886 = !DILocation(line: 84, column: 1, scope: !885)
!887 = !DILocation(line: 84, column: 1, scope: !888)
!888 = distinct !DILexicalBlock(scope: !884, file: !2, line: 84, column: 1)
!889 = !{!890, !590, i64 0}
!890 = !{!"", !590, i64 0, !590, i64 8, !593, i64 16}
!891 = !{!890, !590, i64 8}
!892 = !{!890, !593, i64 16}
!893 = !DILocation(line: 84, column: 1, scope: !894)
!894 = distinct !DILexicalBlock(scope: !895, file: !2, line: 84, column: 1)
!895 = distinct !DILexicalBlock(scope: !882, file: !2, line: 84, column: 1)
!896 = !DILocation(line: 84, column: 1, scope: !895)
!897 = !DILocation(line: 84, column: 1, scope: !898)
!898 = distinct !DILexicalBlock(scope: !894, file: !2, line: 84, column: 1)
!899 = !DILocation(line: 84, column: 1, scope: !900)
!900 = distinct !DILexicalBlock(scope: !901, file: !2, line: 84, column: 1)
!901 = distinct !DILexicalBlock(scope: !849, file: !2, line: 84, column: 1)
!902 = !DILocation(line: 84, column: 1, scope: !901)
!903 = !DILocation(line: 84, column: 1, scope: !904)
!904 = distinct !DILexicalBlock(scope: !900, file: !2, line: 84, column: 1)
!905 = !DILocation(line: 84, column: 1, scope: !906)
!906 = distinct !DILexicalBlock(scope: !900, file: !2, line: 84, column: 1)
!907 = distinct !DISubprogram(name: "ks_ksmall_bamshuf", scope: !2, file: !2, line: 84, type: !908, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !910)
!908 = !DISubroutineType(types: !909)
!909 = !{!109, !161, !108, !161}
!910 = !{!911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !928, !931, !934, !937, !939, !944}
!911 = !DILocalVariable(name: "n", arg: 1, scope: !907, file: !2, line: 84, type: !161)
!912 = !DILocalVariable(name: "arr", arg: 2, scope: !907, file: !2, line: 84, type: !108)
!913 = !DILocalVariable(name: "kk", arg: 3, scope: !907, file: !2, line: 84, type: !161)
!914 = !DILocalVariable(name: "low", scope: !907, file: !2, line: 84, type: !108)
!915 = !DILocalVariable(name: "high", scope: !907, file: !2, line: 84, type: !108)
!916 = !DILocalVariable(name: "k", scope: !907, file: !2, line: 84, type: !108)
!917 = !DILocalVariable(name: "ll", scope: !907, file: !2, line: 84, type: !108)
!918 = !DILocalVariable(name: "hh", scope: !907, file: !2, line: 84, type: !108)
!919 = !DILocalVariable(name: "mid", scope: !907, file: !2, line: 84, type: !108)
!920 = !DILocalVariable(name: "t", scope: !921, file: !2, line: 84, type: !109)
!921 = distinct !DILexicalBlock(scope: !922, file: !2, line: 84, column: 1)
!922 = distinct !DILexicalBlock(scope: !923, file: !2, line: 84, column: 1)
!923 = distinct !DILexicalBlock(scope: !924, file: !2, line: 84, column: 1)
!924 = distinct !DILexicalBlock(scope: !925, file: !2, line: 84, column: 1)
!925 = distinct !DILexicalBlock(scope: !926, file: !2, line: 84, column: 1)
!926 = distinct !DILexicalBlock(scope: !927, file: !2, line: 84, column: 1)
!927 = distinct !DILexicalBlock(scope: !907, file: !2, line: 84, column: 1)
!928 = !DILocalVariable(name: "t", scope: !929, file: !2, line: 84, type: !109)
!929 = distinct !DILexicalBlock(scope: !930, file: !2, line: 84, column: 1)
!930 = distinct !DILexicalBlock(scope: !925, file: !2, line: 84, column: 1)
!931 = !DILocalVariable(name: "t", scope: !932, file: !2, line: 84, type: !109)
!932 = distinct !DILexicalBlock(scope: !933, file: !2, line: 84, column: 1)
!933 = distinct !DILexicalBlock(scope: !925, file: !2, line: 84, column: 1)
!934 = !DILocalVariable(name: "t", scope: !935, file: !2, line: 84, type: !109)
!935 = distinct !DILexicalBlock(scope: !936, file: !2, line: 84, column: 1)
!936 = distinct !DILexicalBlock(scope: !925, file: !2, line: 84, column: 1)
!937 = !DILocalVariable(name: "t", scope: !938, file: !2, line: 84, type: !109)
!938 = distinct !DILexicalBlock(scope: !925, file: !2, line: 84, column: 1)
!939 = !DILocalVariable(name: "t", scope: !940, file: !2, line: 84, type: !109)
!940 = distinct !DILexicalBlock(scope: !941, file: !2, line: 84, column: 1)
!941 = distinct !DILexicalBlock(scope: !942, file: !2, line: 84, column: 1)
!942 = distinct !DILexicalBlock(scope: !943, file: !2, line: 84, column: 1)
!943 = distinct !DILexicalBlock(scope: !925, file: !2, line: 84, column: 1)
!944 = !DILocalVariable(name: "t", scope: !945, file: !2, line: 84, type: !109)
!945 = distinct !DILexicalBlock(scope: !925, file: !2, line: 84, column: 1)
!946 = !DILocation(line: 84, column: 1, scope: !907)
!947 = !DILocation(line: 84, column: 1, scope: !948)
!948 = distinct !DILexicalBlock(scope: !925, file: !2, line: 84, column: 1)
!949 = !DILocation(line: 84, column: 1, scope: !925)
!950 = !DILocation(line: 84, column: 1, scope: !924)
!951 = !DILocation(line: 84, column: 1, scope: !922)
!952 = !DILocation(line: 84, column: 1, scope: !923)
!953 = !DILocation(line: 84, column: 1, scope: !921)
!954 = !DILocation(line: 84, column: 1, scope: !930)
!955 = !DILocation(line: 84, column: 1, scope: !929)
!956 = !DILocation(line: 84, column: 1, scope: !933)
!957 = !DILocation(line: 84, column: 1, scope: !932)
!958 = !DILocation(line: 84, column: 1, scope: !936)
!959 = !DILocation(line: 84, column: 1, scope: !935)
!960 = !DILocation(line: 84, column: 1, scope: !938)
!961 = !DILocation(line: 84, column: 1, scope: !941)
!962 = distinct !{!962, !961, !961, !616}
!963 = distinct !{!963, !961, !961, !616}
!964 = !DILocation(line: 84, column: 1, scope: !965)
!965 = distinct !DILexicalBlock(scope: !941, file: !2, line: 84, column: 1)
!966 = !DILocation(line: 84, column: 1, scope: !940)
!967 = !DILocation(line: 84, column: 1, scope: !942)
!968 = distinct !{!968, !969, !969}
!969 = !DILocation(line: 84, column: 1, scope: !943)
!970 = !DILocation(line: 84, column: 1, scope: !945)
!971 = !DILocation(line: 84, column: 1, scope: !972)
!972 = distinct !DILexicalBlock(scope: !925, file: !2, line: 84, column: 1)
!973 = !DILocation(line: 84, column: 1, scope: !974)
!974 = distinct !DILexicalBlock(scope: !925, file: !2, line: 84, column: 1)
!975 = !DILocation(line: 84, column: 1, scope: !926)
!976 = distinct !{!976, !977, !977}
!977 = !DILocation(line: 84, column: 1, scope: !927)
!978 = distinct !DISubprogram(name: "ks_shuffle_bamshuf", scope: !2, file: !2, line: 84, type: !732, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !979)
!979 = !{!980, !981, !982, !983, !984}
!980 = !DILocalVariable(name: "n", arg: 1, scope: !978, file: !2, line: 84, type: !161)
!981 = !DILocalVariable(name: "a", arg: 2, scope: !978, file: !2, line: 84, type: !108)
!982 = !DILocalVariable(name: "i", scope: !978, file: !2, line: 84, type: !17)
!983 = !DILocalVariable(name: "j", scope: !978, file: !2, line: 84, type: !17)
!984 = !DILocalVariable(name: "tmp", scope: !985, file: !2, line: 84, type: !109)
!985 = distinct !DILexicalBlock(scope: !986, file: !2, line: 84, column: 1)
!986 = distinct !DILexicalBlock(scope: !987, file: !2, line: 84, column: 1)
!987 = distinct !DILexicalBlock(scope: !978, file: !2, line: 84, column: 1)
!988 = !DILocation(line: 84, column: 1, scope: !978)
!989 = !DILocation(line: 84, column: 1, scope: !987)
!990 = !DILocation(line: 84, column: 1, scope: !986)
!991 = !DILocation(line: 84, column: 1, scope: !985)
!992 = distinct !{!992, !989, !989, !616}
!993 = !DISubprogram(name: "hts_drand48", scope: !165, file: !165, line: 84, type: !994, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!994 = !DISubroutineType(types: !995)
!995 = !{!501}
!996 = distinct !DISubprogram(name: "generate_prefix", scope: !2, file: !2, line: 549, type: !997, scopeLine: 549, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !999)
!997 = !DISubroutineType(types: !998)
!998 = !{!19}
!999 = !{!1000, !1001}
!1000 = !DILocalVariable(name: "prefix", scope: !996, file: !2, line: 550, type: !19)
!1001 = !DILocalVariable(name: "pid", scope: !996, file: !2, line: 551, type: !24)
!1002 = !DILocation(line: 550, column: 5, scope: !996)
!1003 = !DILocation(line: 550, column: 11, scope: !996)
!1004 = !DILocation(line: 551, column: 5, scope: !996)
!1005 = !DILocation(line: 551, column: 18, scope: !996)
!1006 = !DILocation(line: 551, column: 24, scope: !996)
!1007 = !DILocation(line: 571, column: 14, scope: !996)
!1008 = !DILocation(line: 571, column: 12, scope: !996)
!1009 = !DILocation(line: 572, column: 10, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !996, file: !2, line: 572, column: 9)
!1011 = !DILocation(line: 572, column: 9, scope: !996)
!1012 = !DILocation(line: 573, column: 9, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1010, file: !2, line: 572, column: 18)
!1014 = !DILocation(line: 574, column: 9, scope: !1013)
!1015 = !DILocation(line: 576, column: 14, scope: !996)
!1016 = !DILocation(line: 576, column: 52, scope: !996)
!1017 = !DILocation(line: 576, column: 5, scope: !996)
!1018 = !DILocation(line: 577, column: 12, scope: !996)
!1019 = !DILocation(line: 577, column: 5, scope: !996)
!1020 = !DILocation(line: 579, column: 1, scope: !996)
!1021 = !DISubprogram(name: "getpid", scope: !1022, file: !1022, line: 650, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1022 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !128, line: 154, baseType: !17)
!1026 = !DISubprogram(name: "perror", scope: !1027, file: !1027, line: 804, type: !1028, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1027 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1028 = !DISubroutineType(types: !1029)
!1029 = !{null, !229}
!1030 = !DISubprogram(name: "snprintf", scope: !1027, file: !1027, line: 378, type: !1031, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!17, !1033, !161, !1034, null}
!1033 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !19)
!1034 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !229)
!1035 = !DILocation(line: 581, column: 22, scope: !14)
!1036 = !DILocation(line: 581, column: 34, scope: !14)
!1037 = !DILocation(line: 583, column: 5, scope: !14)
!1038 = !DILocation(line: 583, column: 9, scope: !14)
!1039 = !DILocation(line: 583, column: 12, scope: !14)
!1040 = !DILocation(line: 583, column: 26, scope: !14)
!1041 = !DILocation(line: 583, column: 47, scope: !14)
!1042 = !DILocation(line: 583, column: 62, scope: !14)
!1043 = !DILocation(line: 583, column: 73, scope: !14)
!1044 = !DILocation(line: 583, column: 88, scope: !14)
!1045 = !DILocation(line: 583, column: 109, scope: !14)
!1046 = !DILocation(line: 583, column: 114, scope: !14)
!1047 = !DILocation(line: 583, column: 127, scope: !14)
!1048 = !DILocation(line: 584, column: 5, scope: !14)
!1049 = !DILocation(line: 584, column: 17, scope: !14)
!1050 = !DILocation(line: 585, column: 5, scope: !14)
!1051 = !DILocation(line: 585, column: 11, scope: !14)
!1052 = !DILocation(line: 585, column: 27, scope: !14)
!1053 = !DILocation(line: 586, column: 5, scope: !14)
!1054 = !DILocation(line: 586, column: 21, scope: !14)
!1055 = !DILocation(line: 593, column: 5, scope: !14)
!1056 = !DILocation(line: 593, column: 29, scope: !14)
!1057 = !DILocation(line: 593, column: 35, scope: !14)
!1058 = !DILocation(line: 593, column: 17, scope: !14)
!1059 = !DILocation(line: 593, column: 15, scope: !14)
!1060 = !DILocation(line: 593, column: 72, scope: !14)
!1061 = !DILocation(line: 594, column: 17, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !14, file: !2, line: 593, column: 78)
!1063 = !DILocation(line: 594, column: 9, scope: !1062)
!1064 = !DILocation(line: 595, column: 34, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 594, column: 20)
!1066 = !DILocation(line: 595, column: 29, scope: !1065)
!1067 = !DILocation(line: 595, column: 27, scope: !1065)
!1068 = !DILocation(line: 595, column: 43, scope: !1065)
!1069 = !DILocation(line: 596, column: 33, scope: !1065)
!1070 = !DILocation(line: 596, column: 28, scope: !1065)
!1071 = !DILocation(line: 596, column: 26, scope: !1065)
!1072 = !DILocation(line: 596, column: 42, scope: !1065)
!1073 = !DILocation(line: 597, column: 25, scope: !1065)
!1074 = !DILocation(line: 597, column: 30, scope: !1065)
!1075 = !DILocation(line: 598, column: 29, scope: !1065)
!1076 = !DILocation(line: 598, column: 34, scope: !1065)
!1077 = !DILocation(line: 599, column: 33, scope: !1065)
!1078 = !DILocation(line: 599, column: 31, scope: !1065)
!1079 = !DILocation(line: 599, column: 41, scope: !1065)
!1080 = !DILocation(line: 600, column: 29, scope: !1065)
!1081 = !DILocation(line: 600, column: 34, scope: !1065)
!1082 = !DILocation(line: 601, column: 38, scope: !1065)
!1083 = !DILocation(line: 601, column: 33, scope: !1065)
!1084 = !DILocation(line: 601, column: 31, scope: !1065)
!1085 = !DILocation(line: 601, column: 47, scope: !1065)
!1086 = !DILocation(line: 602, column: 23, scope: !1065)
!1087 = !DILocation(line: 602, column: 28, scope: !1065)
!1088 = !DILocation(line: 603, column: 44, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1065, file: !2, line: 603, column: 23)
!1090 = !DILocation(line: 603, column: 47, scope: !1089)
!1091 = !DILocation(line: 603, column: 23, scope: !1089)
!1092 = !DILocation(line: 603, column: 67, scope: !1089)
!1093 = !DILocation(line: 603, column: 23, scope: !1065)
!1094 = !DILocation(line: 603, column: 73, scope: !1089)
!1095 = !DILocation(line: 603, column: 70, scope: !1089)
!1096 = !DILocation(line: 605, column: 32, scope: !1065)
!1097 = !DILocation(line: 605, column: 40, scope: !1065)
!1098 = !DILocation(line: 605, column: 49, scope: !1065)
!1099 = !DILocation(line: 605, column: 26, scope: !1065)
!1100 = !DILocation(line: 605, column: 19, scope: !1065)
!1101 = distinct !{!1101, !1055, !1102, !616}
!1102 = !DILocation(line: 607, column: 5, scope: !14)
!1103 = !DILocation(line: 608, column: 9, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !14, file: !2, line: 608, column: 9)
!1105 = !DILocation(line: 608, column: 9, scope: !14)
!1106 = !DILocation(line: 608, column: 23, scope: !1104)
!1107 = !DILocation(line: 608, column: 16, scope: !1104)
!1108 = !DILocation(line: 609, column: 9, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !14, file: !2, line: 609, column: 9)
!1110 = !DILocation(line: 609, column: 17, scope: !1109)
!1111 = !DILocation(line: 609, column: 24, scope: !1109)
!1112 = !DILocation(line: 609, column: 14, scope: !1109)
!1113 = !DILocation(line: 609, column: 9, scope: !14)
!1114 = !DILocation(line: 609, column: 38, scope: !1109)
!1115 = !DILocation(line: 609, column: 43, scope: !1109)
!1116 = !DILocation(line: 609, column: 49, scope: !1109)
!1117 = !DILocation(line: 609, column: 36, scope: !1109)
!1118 = !DILocation(line: 609, column: 29, scope: !1109)
!1119 = !DILocation(line: 610, column: 11, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !14, file: !2, line: 610, column: 9)
!1121 = !DILocation(line: 610, column: 18, scope: !1120)
!1122 = !DILocation(line: 610, column: 21, scope: !1120)
!1123 = !DILocation(line: 610, column: 31, scope: !1120)
!1124 = !DILocation(line: 610, column: 34, scope: !1120)
!1125 = !DILocation(line: 610, column: 9, scope: !14)
!1126 = !DILocation(line: 611, column: 22, scope: !1120)
!1127 = !DILocation(line: 611, column: 30, scope: !1120)
!1128 = !DILocation(line: 611, column: 39, scope: !1120)
!1129 = !DILocation(line: 611, column: 16, scope: !1120)
!1130 = !DILocation(line: 611, column: 9, scope: !1120)
!1131 = !DILocation(line: 612, column: 9, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !14, file: !2, line: 612, column: 9)
!1133 = !DILocation(line: 612, column: 19, scope: !1132)
!1134 = !DILocation(line: 612, column: 22, scope: !1132)
!1135 = !DILocation(line: 612, column: 9, scope: !14)
!1136 = !DILocation(line: 613, column: 17, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1132, file: !2, line: 612, column: 35)
!1138 = !DILocation(line: 613, column: 9, scope: !1137)
!1139 = !DILocation(line: 614, column: 22, scope: !1137)
!1140 = !DILocation(line: 614, column: 30, scope: !1137)
!1141 = !DILocation(line: 614, column: 39, scope: !1137)
!1142 = !DILocation(line: 614, column: 16, scope: !1137)
!1143 = !DILocation(line: 614, column: 9, scope: !1137)
!1144 = !DILocation(line: 616, column: 10, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !14, file: !2, line: 616, column: 9)
!1146 = !DILocation(line: 616, column: 9, scope: !14)
!1147 = !DILocation(line: 617, column: 18, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1145, file: !2, line: 616, column: 18)
!1149 = !DILocation(line: 617, column: 16, scope: !1148)
!1150 = !DILocation(line: 618, column: 17, scope: !1148)
!1151 = !DILocation(line: 619, column: 5, scope: !1148)
!1152 = !DILocation(line: 621, column: 10, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !14, file: !2, line: 621, column: 9)
!1154 = !DILocation(line: 621, column: 9, scope: !14)
!1155 = !DILocation(line: 621, column: 18, scope: !1153)
!1156 = !DILocation(line: 623, column: 10, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !14, file: !2, line: 623, column: 9)
!1158 = !DILocation(line: 623, column: 16, scope: !1157)
!1159 = !DILocation(line: 623, column: 47, scope: !1157)
!1160 = !DILocation(line: 623, column: 51, scope: !1157)
!1161 = !DILocation(line: 623, column: 55, scope: !1157)
!1162 = !DILocation(line: 623, column: 59, scope: !1157)
!1163 = !DILocation(line: 623, column: 32, scope: !1157)
!1164 = !DILocation(line: 623, column: 30, scope: !1157)
!1165 = !DILocation(line: 623, column: 9, scope: !14)
!1166 = !DILocation(line: 624, column: 9, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1157, file: !2, line: 623, column: 65)
!1168 = !DILocation(line: 625, column: 9, scope: !1167)
!1169 = !DILocation(line: 628, column: 19, scope: !14)
!1170 = !DILocation(line: 628, column: 24, scope: !14)
!1171 = !DILocation(line: 628, column: 33, scope: !14)
!1172 = !DILocation(line: 628, column: 42, scope: !14)
!1173 = !DILocation(line: 628, column: 50, scope: !14)
!1174 = !DILocation(line: 628, column: 58, scope: !14)
!1175 = !DILocation(line: 629, column: 20, scope: !14)
!1176 = !DILocation(line: 629, column: 33, scope: !14)
!1177 = !DILocation(line: 629, column: 44, scope: !14)
!1178 = !DILocation(line: 629, column: 62, scope: !14)
!1179 = !DILocation(line: 629, column: 72, scope: !14)
!1180 = !DILocation(line: 628, column: 11, scope: !14)
!1181 = !DILocation(line: 628, column: 9, scope: !14)
!1182 = !DILocation(line: 631, column: 9, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !14, file: !2, line: 631, column: 9)
!1184 = !DILocation(line: 631, column: 9, scope: !14)
!1185 = !DILocation(line: 631, column: 23, scope: !1183)
!1186 = !DILocation(line: 631, column: 18, scope: !1183)
!1187 = !DILocation(line: 632, column: 10, scope: !14)
!1188 = !DILocation(line: 632, column: 5, scope: !14)
!1189 = !DILocation(line: 634, column: 12, scope: !14)
!1190 = !DILocation(line: 634, column: 5, scope: !14)
!1191 = !DILocation(line: 635, column: 1, scope: !14)
!1192 = !DISubprogram(name: "getopt_long", scope: !533, file: !533, line: 66, type: !1193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!17, !17, !1195, !229, !1197, !538}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!1198 = distinct !DISubprogram(name: "atoi", scope: !647, file: !647, line: 362, type: !1199, scopeLine: 363, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !1201)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!17, !229}
!1201 = !{!1202}
!1202 = !DILocalVariable(name: "__nptr", arg: 1, scope: !1198, file: !647, line: 362, type: !229)
!1203 = !DILocation(line: 362, column: 1, scope: !1198)
!1204 = !DILocation(line: 364, column: 24, scope: !1198)
!1205 = !DILocation(line: 364, column: 16, scope: !1198)
!1206 = !DILocation(line: 364, column: 10, scope: !1198)
!1207 = !DILocation(line: 364, column: 3, scope: !1198)
!1208 = !DISubprogram(name: "parse_sam_global_opt", scope: !522, file: !522, line: 85, type: !1209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!17, !17, !229, !1197, !1211}
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!1212 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 528, type: !1213, scopeLine: 528, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !1264)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!17, !1215, !17, !17}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1217, line: 7, baseType: !1218)
!1217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1219, line: 49, size: 1728, elements: !1220)
!1219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1220 = !{!1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1236, !1238, !1239, !1240, !1242, !1243, !1244, !1248, !1251, !1253, !1256, !1259, !1260, !1261, !1262, !1263}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1218, file: !1219, line: 51, baseType: !17, size: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1218, file: !1219, line: 54, baseType: !19, size: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1218, file: !1219, line: 55, baseType: !19, size: 64, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1218, file: !1219, line: 56, baseType: !19, size: 64, offset: 192)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1218, file: !1219, line: 57, baseType: !19, size: 64, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1218, file: !1219, line: 58, baseType: !19, size: 64, offset: 320)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1218, file: !1219, line: 59, baseType: !19, size: 64, offset: 384)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1218, file: !1219, line: 60, baseType: !19, size: 64, offset: 448)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1218, file: !1219, line: 61, baseType: !19, size: 64, offset: 512)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1218, file: !1219, line: 64, baseType: !19, size: 64, offset: 576)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1218, file: !1219, line: 65, baseType: !19, size: 64, offset: 640)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1218, file: !1219, line: 66, baseType: !19, size: 64, offset: 704)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1218, file: !1219, line: 68, baseType: !1234, size: 64, offset: 768)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1219, line: 36, flags: DIFlagFwdDecl)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1218, file: !1219, line: 70, baseType: !1237, size: 64, offset: 832)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1218, file: !1219, line: 72, baseType: !17, size: 32, offset: 896)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1218, file: !1219, line: 73, baseType: !17, size: 32, offset: 928)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1218, file: !1219, line: 74, baseType: !1241, size: 64, offset: 960)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !128, line: 152, baseType: !129)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1218, file: !1219, line: 77, baseType: !137, size: 16, offset: 1024)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1218, file: !1219, line: 78, baseType: !245, size: 8, offset: 1040)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1218, file: !1219, line: 79, baseType: !1245, size: 8, offset: 1048)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !1246)
!1246 = !{!1247}
!1247 = !DISubrange(count: 1)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1218, file: !1219, line: 81, baseType: !1249, size: 64, offset: 1088)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1219, line: 43, baseType: null)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1218, file: !1219, line: 89, baseType: !1252, size: 64, offset: 1152)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !128, line: 153, baseType: !129)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1218, file: !1219, line: 91, baseType: !1254, size: 64, offset: 1216)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1219, line: 37, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1218, file: !1219, line: 92, baseType: !1257, size: 64, offset: 1280)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1219, line: 38, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1218, file: !1219, line: 93, baseType: !1237, size: 64, offset: 1344)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1218, file: !1219, line: 94, baseType: !169, size: 64, offset: 1408)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1218, file: !1219, line: 95, baseType: !161, size: 64, offset: 1472)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1218, file: !1219, line: 96, baseType: !17, size: 32, offset: 1536)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1218, file: !1219, line: 98, baseType: !483, size: 160, offset: 1568)
!1264 = !{!1265, !1266, !1267}
!1265 = !DILocalVariable(name: "fp", arg: 1, scope: !1212, file: !2, line: 528, type: !1215)
!1266 = !DILocalVariable(name: "n_files", arg: 2, scope: !1212, file: !2, line: 528, type: !17)
!1267 = !DILocalVariable(name: "reads_store", arg: 3, scope: !1212, file: !2, line: 528, type: !17)
!1268 = !DILocation(line: 528, column: 24, scope: !1212)
!1269 = !DILocation(line: 528, column: 32, scope: !1212)
!1270 = !DILocation(line: 528, column: 45, scope: !1212)
!1271 = !DILocation(line: 529, column: 13, scope: !1212)
!1272 = !DILocation(line: 540, column: 13, scope: !1212)
!1273 = !DILocation(line: 540, column: 38, scope: !1212)
!1274 = !DILocation(line: 529, column: 5, scope: !1212)
!1275 = !DILocation(line: 542, column: 25, scope: !1212)
!1276 = !DILocation(line: 542, column: 5, scope: !1212)
!1277 = !DILocation(line: 543, column: 13, scope: !1212)
!1278 = !DILocation(line: 543, column: 5, scope: !1212)
!1279 = !DILocation(line: 546, column: 5, scope: !1212)
!1280 = !DISubprogram(name: "fprintf", scope: !1027, file: !1027, line: 350, type: !1281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!17, !1283, !1034, null}
!1283 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1215)
!1284 = !DISubprogram(name: "stringify_argv", scope: !116, file: !116, line: 814, type: !1285, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!19, !17, !18}
!1287 = !DISubprogram(name: "print_error", scope: !1288, file: !1288, line: 35, type: !1289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
