; ModuleID = 'samples/773.bc'
source_filename = "src/http/modules/ngx_http_proxy_module.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_http_module_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_command_s = type { %struct.ngx_str_t, i64, ptr, i64, i64, ptr }
%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_http_variable_s = type { %struct.ngx_str_t, ptr, ptr, i64, i64, i64 }
%struct.ngx_path_init_t = type { %struct.ngx_str_t, [3 x i64] }
%struct.ngx_keyval_t = type { %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_conf_bitmask_t = type { %struct.ngx_str_t, i64 }
%struct.ngx_conf_post_t = type { ptr }
%struct.ngx_conf_enum_t = type { %struct.ngx_str_t, i64 }
%struct.ngx_conf_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr }
%struct.ngx_http_proxy_main_conf_t = type { %struct.ngx_array_t }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 803, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/http/modules/ngx_http_proxy_module.c", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "9db097235afc3b9ba2aeca210a8a2dda")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 41)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "ngx_http_proxy_module_ctx", scope: !9, file: !2, line: 787, type: !2571, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !10, globals: !1983, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !16, !17, !23, !27, !29, !38, !40, !46, !47, !1978, !53, !18, !240, !986, !139, !1979, !13}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !12, line: 79, baseType: !13)
!12 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !14, line: 90, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!15 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !19, line: 33, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !21, line: 31, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !24, line: 16, baseType: !25)
!24 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !26, line: 16, baseType: !11)
!26 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3e0aca9b19636f12ab4dbc16c3f8a0a1")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 29, baseType: !15)
!28 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !31, line: 21, baseType: !32)
!31 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "f0f323751ab5b63196467d991a0424cd")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 17, size: 192, elements: !33)
!33 = !{!34, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !32, file: !31, line: 18, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !32, file: !31, line: 19, baseType: !35, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !32, file: !31, line: 20, baseType: !35, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !39, line: 16, baseType: !16)
!39 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6333220b53b7706731e71ee9d0416317")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !41, line: 123, baseType: !42)
!41 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !43, line: 25, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !21, line: 40, baseType: !45)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_len_code_pt", file: !49, line: 90, baseType: !50)
!49 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "c6267aff67e650adcd8c4290fd2f4626")
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!27, !53}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_engine_t", file: !49, line: 36, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 17, size: 704, elements: !56)
!56 = !{!57, !58, !59, !74, !80, !81, !82, !83, !84, !85, !86, !87, !93}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !55, file: !49, line: 18, baseType: !17, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !55, file: !49, line: 19, baseType: !17, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !55, file: !49, line: 20, baseType: !60, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !62, line: 17, baseType: !63)
!62 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "282b3527419dfe56984107919878b418")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !64, line: 37, baseType: !65)
!64 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2f3ab61eca09df707b083ffd5eafea4f")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 28, size: 128, elements: !66)
!66 = !{!67, !69, !70, !71, !72, !73}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, file: !64, line: 29, baseType: !68, size: 28, flags: DIFlagBitField, extraData: i64 0)
!68 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !65, file: !64, line: 31, baseType: !68, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !65, file: !64, line: 32, baseType: !68, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !65, file: !64, line: 33, baseType: !68, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !65, file: !64, line: 34, baseType: !68, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !64, line: 36, baseType: !17, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !55, file: !49, line: 22, baseType: !75, size: 128, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !64, line: 19, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 16, size: 128, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !76, file: !64, line: 17, baseType: !27, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !64, line: 18, baseType: !17, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !55, file: !49, line: 23, baseType: !75, size: 128, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !55, file: !49, line: 26, baseType: !17, size: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !55, file: !49, line: 28, baseType: !68, size: 1, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !55, file: !49, line: 29, baseType: !68, size: 1, offset: 513, flags: DIFlagBitField, extraData: i64 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !55, file: !49, line: 30, baseType: !68, size: 1, offset: 514, flags: DIFlagBitField, extraData: i64 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "is_args", scope: !55, file: !49, line: 31, baseType: !68, size: 1, offset: 515, flags: DIFlagBitField, extraData: i64 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !55, file: !49, line: 32, baseType: !68, size: 1, offset: 516, flags: DIFlagBitField, extraData: i64 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !55, file: !49, line: 34, baseType: !88, size: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !12, line: 78, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !90, line: 267, baseType: !91)
!90 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !21, line: 207, baseType: !92)
!92 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !55, file: !49, line: 35, baseType: !94, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !96, line: 16, baseType: !97)
!96 = !DIFile(filename: "src/http/ngx_http.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "7164149d4c2473091a4e1c4f6baa1b7e")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !98, line: 377, size: 10624, elements: !99)
!98 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2bd9fa6c0840df2506a27db4121d9c74")
!99 = !{!100, !103, !518, !519, !520, !521, !522, !527, !528, !757, !1500, !1501, !1502, !1503, !1547, !1579, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1628, !1639, !1646, !1647, !1649, !1650, !1651, !1652, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1868, !1872, !1877, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !97, file: !98, line: 378, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 26, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !21, line: 42, baseType: !68)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !97, file: !98, line: 380, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !106, line: 26, baseType: !107)
!106 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "20a149d22b95b5c7a0a8830d485b97ae")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !108, line: 122, size: 1856, elements: !109)
!108 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "212f2f4879dcb10799877db6a93ee4ed")
!109 = !{!110, !111, !209, !210, !213, !221, !223, !311, !316, !390, !391, !392, !429, !430, !431, !432, !433, !444, !491, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !108, line: 123, baseType: !16, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !107, file: !108, line: 124, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !106, line: 24, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !115, line: 30, size: 768, elements: !116)
!115 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "37d7d908a1a7ebec5ff5673dd5f89a52")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !140, !145, !146, !190, !201}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !114, file: !115, line: 31, baseType: !16, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !114, file: !115, line: 33, baseType: !68, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !114, file: !115, line: 35, baseType: !68, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !114, file: !115, line: 38, baseType: !68, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !114, file: !115, line: 44, baseType: !68, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !114, file: !115, line: 46, baseType: !68, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !114, file: !115, line: 49, baseType: !68, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !114, file: !115, line: 51, baseType: !68, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !114, file: !115, line: 54, baseType: !68, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !114, file: !115, line: 56, baseType: !68, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !114, file: !115, line: 57, baseType: !68, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !114, file: !115, line: 59, baseType: !68, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !114, file: !115, line: 60, baseType: !68, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !114, file: !115, line: 62, baseType: !68, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !114, file: !115, line: 64, baseType: !68, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !114, file: !115, line: 67, baseType: !68, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !114, file: !115, line: 69, baseType: !68, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !114, file: !115, line: 71, baseType: !68, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !114, file: !115, line: 74, baseType: !68, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !114, file: !115, line: 75, baseType: !68, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !114, file: !115, line: 77, baseType: !68, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !114, file: !115, line: 101, baseType: !139, size: 32, offset: 96)
!139 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !114, file: !115, line: 103, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !106, line: 33, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !112}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !114, file: !115, line: 110, baseType: !11, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !114, file: !115, line: 112, baseType: !147, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !106, line: 20, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !150, line: 50, size: 640, elements: !151)
!150 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "81257099415bdc5e18cdef9b4461d934")
!151 = !{!152, !153, !168, !171, !175, !180, !181, !186, !187, !189}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !149, file: !150, line: 51, baseType: !11, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !149, file: !150, line: 52, baseType: !154, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !106, line: 21, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !157, line: 89, size: 320, elements: !158)
!157 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "b737d189253ca17c55f83e424debf52b")
!158 = !{!159, !162, !163, !167}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !156, file: !157, line: 90, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !161, line: 16, baseType: !139)
!161 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "5c6995d5f659dd97ea6d10eff0ad0f12")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !157, line: 91, baseType: !75, size: 128, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !156, file: !157, line: 93, baseType: !164, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !154, !147}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !156, file: !157, line: 94, baseType: !16, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !149, file: !150, line: 54, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !170, line: 48, baseType: !15)
!170 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "5d14beceab1860bcc051d3b7a146b2a2")
!171 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !149, file: !150, line: 56, baseType: !172, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !173, line: 10, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !21, line: 160, baseType: !92)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !149, file: !150, line: 58, baseType: !176, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !150, line: 45, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!17, !147, !17, !27}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !149, file: !150, line: 59, baseType: !16, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !149, file: !150, line: 61, baseType: !182, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !150, line: 46, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !147, !11, !17, !27}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !149, file: !150, line: 62, baseType: !16, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !149, file: !150, line: 70, baseType: !188, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !150, line: 72, baseType: !147, size: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !114, file: !115, line: 114, baseType: !191, size: 320, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !26, line: 20, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !26, line: 22, size: 320, elements: !193)
!193 = !{!194, !195, !197, !198, !199, !200}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !192, file: !26, line: 23, baseType: !25, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !192, file: !26, line: 24, baseType: !196, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !192, file: !26, line: 25, baseType: !196, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !192, file: !26, line: 26, baseType: !196, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !192, file: !26, line: 27, baseType: !18, size: 8, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !26, line: 28, baseType: !18, size: 8, offset: 264)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !114, file: !115, line: 117, baseType: !202, size: 128, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !203, line: 16, baseType: !204)
!203 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !203, line: 18, size: 128, elements: !205)
!205 = !{!206, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !204, file: !203, line: 19, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !204, file: !203, line: 20, baseType: !207, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !107, file: !108, line: 125, baseType: !112, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !107, file: !108, line: 127, baseType: !211, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !212, line: 17, baseType: !139)
!212 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3294ca407f098b2e2906f1b2d90752a2")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !107, file: !108, line: 129, baseType: !214, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !215, line: 19, baseType: !216)
!215 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!219, !104, !17, !27}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !19, line: 108, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !21, line: 194, baseType: !92)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !107, file: !108, line: 130, baseType: !222, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !215, line: 22, baseType: !216)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !107, file: !108, line: 131, baseType: !224, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !215, line: 20, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!219, !104, !228, !240}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !106, line: 19, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !39, line: 59, size: 128, elements: !231)
!231 = !{!232, !310}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !230, file: !39, line: 60, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !39, line: 18, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !39, line: 20, size: 640, elements: !236)
!236 = !{!237, !238, !239, !242, !243, !244, !245, !246, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !235, file: !39, line: 21, baseType: !17, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !235, file: !39, line: 22, baseType: !17, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !235, file: !39, line: 23, baseType: !240, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !19, line: 87, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !21, line: 153, baseType: !92)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !235, file: !39, line: 24, baseType: !240, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !235, file: !39, line: 26, baseType: !17, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !235, file: !39, line: 27, baseType: !17, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !235, file: !39, line: 28, baseType: !38, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !235, file: !39, line: 29, baseType: !247, size: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !106, line: 23, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !250, line: 16, size: 1600, elements: !251)
!250 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!251 = !{!252, !253, !254, !292, !293, !294, !295, !296}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !249, file: !250, line: 17, baseType: !160, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !249, file: !250, line: 18, baseType: !75, size: 128, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !249, file: !250, line: 19, baseType: !255, size: 1152, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !161, line: 17, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !257, line: 26, size: 1152, elements: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!258 = !{!259, !261, !263, !265, !267, !269, !271, !272, !273, !275, !277, !279, !286, !287, !288}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !256, file: !257, line: 31, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !21, line: 145, baseType: !15)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !256, file: !257, line: 36, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !21, line: 148, baseType: !15)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !256, file: !257, line: 44, baseType: !264, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !21, line: 151, baseType: !15)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !256, file: !257, line: 45, baseType: !266, size: 32, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !21, line: 150, baseType: !68)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !256, file: !257, line: 47, baseType: !268, size: 32, offset: 224)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !21, line: 146, baseType: !68)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !256, file: !257, line: 48, baseType: !270, size: 32, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !21, line: 147, baseType: !68)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !256, file: !257, line: 50, baseType: !139, size: 32, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !256, file: !257, line: 52, baseType: !260, size: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !256, file: !257, line: 57, baseType: !274, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !21, line: 152, baseType: !92)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !256, file: !257, line: 61, baseType: !276, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !21, line: 175, baseType: !92)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !256, file: !257, line: 63, baseType: !278, size: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !21, line: 180, baseType: !92)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !256, file: !257, line: 74, baseType: !280, size: 128, offset: 576)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !281, line: 11, size: 128, elements: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !280, file: !281, line: 16, baseType: !174, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !280, file: !281, line: 21, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !21, line: 197, baseType: !92)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !256, file: !257, line: 75, baseType: !280, size: 128, offset: 704)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !256, file: !257, line: 76, baseType: !280, size: 128, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !256, file: !257, line: 89, baseType: !289, size: 192, offset: 960)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 192, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 3)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !249, file: !250, line: 21, baseType: !240, size: 64, offset: 1344)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !249, file: !250, line: 22, baseType: !240, size: 64, offset: 1408)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !249, file: !250, line: 24, baseType: !147, size: 64, offset: 1472)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !249, file: !250, line: 37, baseType: !68, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !249, file: !250, line: 38, baseType: !68, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !235, file: !39, line: 30, baseType: !233, size: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !235, file: !39, line: 34, baseType: !68, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !235, file: !39, line: 40, baseType: !68, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !235, file: !39, line: 43, baseType: !68, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !235, file: !39, line: 45, baseType: !68, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !235, file: !39, line: 46, baseType: !68, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !235, file: !39, line: 47, baseType: !68, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !235, file: !39, line: 48, baseType: !68, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !235, file: !39, line: 49, baseType: !68, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !235, file: !39, line: 50, baseType: !68, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !235, file: !39, line: 52, baseType: !68, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !235, file: !39, line: 53, baseType: !68, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !235, file: !39, line: 55, baseType: !139, size: 32, offset: 608)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !39, line: 61, baseType: !228, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !107, file: !108, line: 132, baseType: !312, size: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !215, line: 23, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!228, !104, !228, !240}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !107, file: !108, line: 134, baseType: !317, size: 64, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !108, line: 16, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !108, line: 18, size: 2368, elements: !320)
!320 = !{!321, !322, !334, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !351, !352, !353, !354, !355, !356, !357, !358, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !319, file: !108, line: 19, baseType: !211, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !319, file: !108, line: 21, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !325, line: 180, size: 128, elements: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!326 = !{!327, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !324, file: !325, line: 182, baseType: !328, size: 16)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !329, line: 28, baseType: !45)
!329 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !324, file: !325, line: 183, baseType: !331, size: 112, offset: 16)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 14)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !319, file: !108, line: 22, baseType: !335, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !90, line: 274, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !21, line: 210, baseType: !68)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !319, file: !108, line: 23, baseType: !27, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !319, file: !108, line: 24, baseType: !75, size: 128, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !319, file: !108, line: 26, baseType: !139, size: 32, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !319, file: !108, line: 28, baseType: !139, size: 32, offset: 416)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !319, file: !108, line: 29, baseType: !139, size: 32, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !319, file: !108, line: 30, baseType: !139, size: 32, offset: 480)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !319, file: !108, line: 32, baseType: !139, size: 32, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !319, file: !108, line: 33, baseType: !139, size: 32, offset: 544)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !319, file: !108, line: 34, baseType: !139, size: 32, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !319, file: !108, line: 38, baseType: !347, size: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !106, line: 34, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !104}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !319, file: !108, line: 40, baseType: !16, size: 64, offset: 704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !319, file: !108, line: 42, baseType: !148, size: 640, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !319, file: !108, line: 43, baseType: !147, size: 64, offset: 1408)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !319, file: !108, line: 45, baseType: !27, size: 64, offset: 1472)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !319, file: !108, line: 47, baseType: !27, size: 64, offset: 1536)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !319, file: !108, line: 49, baseType: !317, size: 64, offset: 1600)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !319, file: !108, line: 50, baseType: !104, size: 64, offset: 1664)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !319, file: !108, line: 52, baseType: !359, size: 192, offset: 1728)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !26, line: 32, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !26, line: 37, size: 192, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !360, file: !26, line: 38, baseType: !196, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !360, file: !26, line: 39, baseType: !196, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !360, file: !26, line: 40, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !26, line: 34, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !196, !196, !196}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !319, file: !108, line: 53, baseType: !191, size: 320, offset: 1920)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !319, file: !108, line: 55, baseType: !11, size: 64, offset: 2240)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !319, file: !108, line: 57, baseType: !68, size: 1, offset: 2304, flags: DIFlagBitField, extraData: i64 2304)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !319, file: !108, line: 58, baseType: !68, size: 1, offset: 2305, flags: DIFlagBitField, extraData: i64 2304)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !319, file: !108, line: 59, baseType: !68, size: 1, offset: 2306, flags: DIFlagBitField, extraData: i64 2304)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !319, file: !108, line: 61, baseType: !68, size: 1, offset: 2307, flags: DIFlagBitField, extraData: i64 2304)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !319, file: !108, line: 62, baseType: !68, size: 1, offset: 2308, flags: DIFlagBitField, extraData: i64 2304)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !319, file: !108, line: 63, baseType: !68, size: 1, offset: 2309, flags: DIFlagBitField, extraData: i64 2304)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !319, file: !108, line: 64, baseType: !68, size: 1, offset: 2310, flags: DIFlagBitField, extraData: i64 2304)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !319, file: !108, line: 65, baseType: !68, size: 1, offset: 2311, flags: DIFlagBitField, extraData: i64 2304)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !319, file: !108, line: 66, baseType: !68, size: 1, offset: 2312, flags: DIFlagBitField, extraData: i64 2304)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !319, file: !108, line: 67, baseType: !68, size: 1, offset: 2313, flags: DIFlagBitField, extraData: i64 2304)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !319, file: !108, line: 68, baseType: !68, size: 1, offset: 2314, flags: DIFlagBitField, extraData: i64 2304)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !319, file: !108, line: 71, baseType: !68, size: 1, offset: 2315, flags: DIFlagBitField, extraData: i64 2304)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !319, file: !108, line: 73, baseType: !68, size: 1, offset: 2316, flags: DIFlagBitField, extraData: i64 2304)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !319, file: !108, line: 74, baseType: !68, size: 1, offset: 2317, flags: DIFlagBitField, extraData: i64 2304)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !319, file: !108, line: 75, baseType: !68, size: 2, offset: 2318, flags: DIFlagBitField, extraData: i64 2304)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !319, file: !108, line: 77, baseType: !68, size: 1, offset: 2320, flags: DIFlagBitField, extraData: i64 2304)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !319, file: !108, line: 78, baseType: !68, size: 1, offset: 2321, flags: DIFlagBitField, extraData: i64 2304)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !319, file: !108, line: 79, baseType: !68, size: 1, offset: 2322, flags: DIFlagBitField, extraData: i64 2304)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !319, file: !108, line: 88, baseType: !139, size: 32, offset: 2336)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !107, file: !108, line: 136, baseType: !240, size: 64, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !107, file: !108, line: 138, baseType: !147, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !107, file: !108, line: 140, baseType: !393, size: 64, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !106, line: 18, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !396, line: 57, size: 640, elements: !397)
!396 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!397 = !{!398, !406, !407, !408, !409, !416, !428}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !395, file: !396, line: 58, baseType: !399, size: 256)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !396, line: 54, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 49, size: 256, elements: !401)
!401 = !{!402, !403, !404, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !400, file: !396, line: 50, baseType: !17, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !400, file: !396, line: 51, baseType: !17, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !396, line: 52, baseType: !393, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !400, file: !396, line: 53, baseType: !11, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !395, file: !396, line: 59, baseType: !27, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !395, file: !396, line: 60, baseType: !393, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !395, file: !396, line: 61, baseType: !228, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !395, file: !396, line: 62, baseType: !410, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !396, line: 41, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !396, line: 43, size: 128, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !396, line: 44, baseType: !410, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !412, file: !396, line: 45, baseType: !16, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !395, file: !396, line: 63, baseType: !417, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !396, line: 32, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !396, line: 34, size: 192, elements: !420)
!420 = !{!421, !426, !427}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !419, file: !396, line: 35, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !396, line: 30, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !16}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !419, file: !396, line: 36, baseType: !16, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !396, line: 37, baseType: !417, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !395, file: !396, line: 64, baseType: !147, size: 64, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !108, line: 142, baseType: !139, size: 32, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !107, file: !108, line: 144, baseType: !323, size: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !107, file: !108, line: 145, baseType: !335, size: 32, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !107, file: !108, line: 146, baseType: !75, size: 128, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol", scope: !107, file: !108, line: 148, baseType: !434, size: 64, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_proxy_protocol_t", file: !106, line: 29, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_proxy_protocol_s", file: !437, line: 20, size: 448, elements: !438)
!437 = !DIFile(filename: "src/core/ngx_proxy_protocol.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2f709b54741e3446706b44243689209d")
!438 = !{!439, !440, !441, !442, !443}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !436, file: !437, line: 21, baseType: !75, size: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr", scope: !436, file: !437, line: 22, baseType: !75, size: 128, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !436, file: !437, line: 23, baseType: !40, size: 16, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !436, file: !437, line: 24, baseType: !40, size: 16, offset: 272)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tlvs", scope: !436, file: !437, line: 25, baseType: !75, size: 128, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !107, file: !108, line: 151, baseType: !445, size: 64, offset: 1152)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !106, line: 30, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !448, line: 88, size: 768, elements: !449)
!448 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3af21306d729871437c56397859c5d10")
!449 = !{!450, !455, !459, !460, !461, !462, !463, !468, !469, !470, !471, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !447, file: !448, line: 89, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !453, line: 187, baseType: !454)
!453 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/openssl-3.1.3-t2z4gdp5gh6gi55dbaqbl32ceazzcooa/include/openssl/types.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build", checksumkind: CSK_MD5, checksum: "b6649ae9fb159d98e26ef5156a06b00d")
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !453, line: 187, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !447, file: !448, line: 90, baseType: !456, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !453, line: 188, baseType: !458)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !453, line: 188, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !447, file: !448, line: 92, baseType: !88, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !447, file: !448, line: 93, baseType: !233, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !447, file: !448, line: 94, baseType: !27, size: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !447, file: !448, line: 96, baseType: !347, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !447, file: !448, line: 98, baseType: !464, size: 64, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !466, line: 234, baseType: !467)
!466 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/openssl-3.1.3-t2z4gdp5gh6gi55dbaqbl32ceazzcooa/include/openssl/ssl.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build", checksumkind: CSK_MD5, checksum: "b3965e72168556c434721fcea95f586f")
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !466, line: 234, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !447, file: !448, line: 99, baseType: !347, size: 64, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !447, file: !448, line: 101, baseType: !141, size: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !447, file: !448, line: 102, baseType: !141, size: 64, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ocsp", scope: !447, file: !448, line: 104, baseType: !472, size: 64, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_ocsp_t", file: !448, line: 78, baseType: !474)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_ocsp_s", file: !448, line: 78, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !447, file: !448, line: 106, baseType: !18, size: 8, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !447, file: !448, line: 108, baseType: !68, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_rejected", scope: !447, file: !448, line: 109, baseType: !68, size: 1, offset: 713, flags: DIFlagBitField, extraData: i64 712)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !447, file: !448, line: 110, baseType: !68, size: 1, offset: 714, flags: DIFlagBitField, extraData: i64 712)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !447, file: !448, line: 111, baseType: !68, size: 1, offset: 715, flags: DIFlagBitField, extraData: i64 712)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !447, file: !448, line: 112, baseType: !68, size: 1, offset: 716, flags: DIFlagBitField, extraData: i64 712)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !447, file: !448, line: 113, baseType: !68, size: 1, offset: 717, flags: DIFlagBitField, extraData: i64 712)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !447, file: !448, line: 114, baseType: !68, size: 1, offset: 718, flags: DIFlagBitField, extraData: i64 712)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_without_free", scope: !447, file: !448, line: 115, baseType: !68, size: 1, offset: 719, flags: DIFlagBitField, extraData: i64 712)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !447, file: !448, line: 116, baseType: !68, size: 1, offset: 720, flags: DIFlagBitField, extraData: i64 712)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "session_timeout_set", scope: !447, file: !448, line: 117, baseType: !68, size: 1, offset: 721, flags: DIFlagBitField, extraData: i64 712)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !447, file: !448, line: 118, baseType: !68, size: 1, offset: 722, flags: DIFlagBitField, extraData: i64 712)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !447, file: !448, line: 119, baseType: !68, size: 1, offset: 723, flags: DIFlagBitField, extraData: i64 712)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "in_ocsp", scope: !447, file: !448, line: 120, baseType: !68, size: 1, offset: 724, flags: DIFlagBitField, extraData: i64 712)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !447, file: !448, line: 121, baseType: !68, size: 1, offset: 725, flags: DIFlagBitField, extraData: i64 712)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !447, file: !448, line: 122, baseType: !68, size: 1, offset: 726, flags: DIFlagBitField, extraData: i64 712)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !107, file: !108, line: 154, baseType: !492, size: 64, offset: 1216)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !106, line: 31, baseType: !494)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !106, line: 31, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !107, file: !108, line: 156, baseType: !323, size: 64, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !107, file: !108, line: 157, baseType: !335, size: 32, offset: 1344)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !107, file: !108, line: 159, baseType: !233, size: 64, offset: 1408)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !107, file: !108, line: 161, baseType: !202, size: 128, offset: 1472)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !107, file: !108, line: 163, baseType: !169, size: 64, offset: 1600)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !107, file: !108, line: 165, baseType: !23, size: 64, offset: 1664)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !107, file: !108, line: 166, baseType: !11, size: 64, offset: 1728)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !107, file: !108, line: 168, baseType: !68, size: 8, offset: 1792, flags: DIFlagBitField, extraData: i64 1792)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !107, file: !108, line: 170, baseType: !68, size: 3, offset: 1800, flags: DIFlagBitField, extraData: i64 1792)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !107, file: !108, line: 172, baseType: !68, size: 1, offset: 1803, flags: DIFlagBitField, extraData: i64 1792)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !107, file: !108, line: 173, baseType: !68, size: 1, offset: 1804, flags: DIFlagBitField, extraData: i64 1792)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !107, file: !108, line: 174, baseType: !68, size: 1, offset: 1805, flags: DIFlagBitField, extraData: i64 1792)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pipeline", scope: !107, file: !108, line: 175, baseType: !68, size: 1, offset: 1806, flags: DIFlagBitField, extraData: i64 1792)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !107, file: !108, line: 177, baseType: !68, size: 1, offset: 1807, flags: DIFlagBitField, extraData: i64 1792)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !107, file: !108, line: 178, baseType: !68, size: 1, offset: 1808, flags: DIFlagBitField, extraData: i64 1792)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !107, file: !108, line: 179, baseType: !68, size: 1, offset: 1809, flags: DIFlagBitField, extraData: i64 1792)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !107, file: !108, line: 180, baseType: !68, size: 1, offset: 1810, flags: DIFlagBitField, extraData: i64 1792)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !107, file: !108, line: 182, baseType: !68, size: 1, offset: 1811, flags: DIFlagBitField, extraData: i64 1792)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !107, file: !108, line: 183, baseType: !68, size: 1, offset: 1812, flags: DIFlagBitField, extraData: i64 1792)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !107, file: !108, line: 184, baseType: !68, size: 2, offset: 1813, flags: DIFlagBitField, extraData: i64 1792)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !107, file: !108, line: 185, baseType: !68, size: 2, offset: 1815, flags: DIFlagBitField, extraData: i64 1792)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !107, file: !108, line: 187, baseType: !68, size: 1, offset: 1817, flags: DIFlagBitField, extraData: i64 1792)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "need_flush_buf", scope: !107, file: !108, line: 188, baseType: !68, size: 1, offset: 1818, flags: DIFlagBitField, extraData: i64 1792)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !97, file: !98, line: 382, baseType: !35, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !97, file: !98, line: 383, baseType: !35, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !97, file: !98, line: 384, baseType: !35, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !97, file: !98, line: 385, baseType: !35, size: 64, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !97, file: !98, line: 387, baseType: !523, size: 64, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !98, line: 374, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !94}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !97, file: !98, line: 388, baseType: !523, size: 64, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !97, file: !98, line: 391, baseType: !529, size: 64, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !96, line: 18, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !532, line: 65, size: 4864, elements: !533)
!532 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "f29cd7dd14e04d7d4af9197bf6cdb9bb")
!533 = !{!534, !535, !545, !546, !550, !551, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !714, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !531, file: !532, line: 66, baseType: !248, size: 1600)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !531, file: !532, line: 67, baseType: !536, size: 320, offset: 1600)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !537, line: 22, baseType: !538)
!537 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !537, line: 16, size: 320, elements: !539)
!539 = !{!540, !541, !542, !543, !544}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !538, file: !537, line: 17, baseType: !16, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !538, file: !537, line: 18, baseType: !11, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !538, file: !537, line: 19, baseType: !27, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !538, file: !537, line: 20, baseType: !11, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !538, file: !537, line: 21, baseType: !393, size: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !531, file: !532, line: 68, baseType: !101, size: 32, offset: 1920)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !531, file: !532, line: 69, baseType: !547, size: 128, offset: 1952)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !531, file: !532, line: 70, baseType: !547, size: 128, offset: 2080)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !531, file: !532, line: 72, baseType: !552, size: 64, offset: 2240)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !161, line: 18, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !19, line: 49, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !21, line: 149, baseType: !15)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !531, file: !532, line: 73, baseType: !172, size: 64, offset: 2304)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !531, file: !532, line: 74, baseType: !172, size: 64, offset: 2368)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !531, file: !532, line: 75, baseType: !172, size: 64, offset: 2432)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !531, file: !532, line: 76, baseType: !172, size: 64, offset: 2496)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !531, file: !532, line: 77, baseType: !172, size: 64, offset: 2560)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !531, file: !532, line: 79, baseType: !75, size: 128, offset: 2624)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !531, file: !532, line: 80, baseType: !75, size: 128, offset: 2752)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !531, file: !532, line: 81, baseType: !547, size: 128, offset: 2880)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !531, file: !532, line: 83, baseType: !27, size: 64, offset: 3008)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !531, file: !532, line: 84, baseType: !27, size: 64, offset: 3072)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !531, file: !532, line: 85, baseType: !27, size: 64, offset: 3136)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !531, file: !532, line: 86, baseType: !240, size: 64, offset: 3200)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !531, file: !532, line: 87, baseType: !240, size: 64, offset: 3264)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !531, file: !532, line: 89, baseType: !11, size: 64, offset: 3328)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !531, file: !532, line: 90, baseType: !11, size: 64, offset: 3392)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !531, file: !532, line: 91, baseType: !11, size: 64, offset: 3456)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !531, file: !532, line: 92, baseType: !11, size: 64, offset: 3520)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !531, file: !532, line: 94, baseType: !233, size: 64, offset: 3584)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !531, file: !532, line: 96, baseType: !574, size: 64, offset: 3648)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !96, line: 19, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !532, line: 159, size: 1152, elements: !577)
!577 = !{!578, !593, !654, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !713}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !576, file: !532, line: 160, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !532, line: 156, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 147, size: 960, elements: !582)
!582 = !{!583, !584, !585, !586, !589, !590, !591, !592}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !581, file: !532, line: 148, baseType: !359, size: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !581, file: !532, line: 149, baseType: !191, size: 320, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !581, file: !532, line: 150, baseType: !202, size: 128, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !581, file: !532, line: 151, baseType: !587, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !170, line: 56, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !169)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !581, file: !532, line: 152, baseType: !587, size: 64, offset: 704)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !581, file: !532, line: 153, baseType: !240, size: 64, offset: 768)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !581, file: !532, line: 154, baseType: !11, size: 64, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !581, file: !532, line: 155, baseType: !11, size: 64, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !576, file: !532, line: 161, baseType: !594, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !596, line: 59, baseType: !597)
!596 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6137611cd598fa2ecc498e6967a03177")
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !596, line: 34, size: 1600, elements: !598)
!598 = !{!599, !606, !607, !608, !616, !617, !618, !627, !628, !629, !630, !649, !650, !651, !652, !653}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !597, file: !596, line: 35, baseType: !600, size: 128)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !601, line: 21, baseType: !602)
!601 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "56a332e5761f46e2bb83cbdaf8b18a9f")
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 16, size: 128, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !602, file: !601, line: 17, baseType: !587, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !602, file: !601, line: 19, baseType: !587, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !597, file: !596, line: 37, baseType: !27, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !597, file: !596, line: 38, baseType: !27, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !597, file: !596, line: 40, baseType: !609, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !596, line: 16, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !596, line: 18, size: 192, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !611, file: !596, line: 19, baseType: !13, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !596, line: 20, baseType: !609, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !611, file: !596, line: 21, baseType: !13, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !597, file: !596, line: 41, baseType: !609, size: 64, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !597, file: !596, line: 42, baseType: !610, size: 192, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !597, file: !596, line: 44, baseType: !619, size: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !596, line: 31, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !596, line: 25, size: 256, elements: !622)
!622 = !{!623, !624, !625, !626}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !621, file: !596, line: 26, baseType: !11, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !621, file: !596, line: 27, baseType: !11, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !621, file: !596, line: 29, baseType: !11, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !621, file: !596, line: 30, baseType: !11, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !597, file: !596, line: 45, baseType: !11, size: 64, offset: 640)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !597, file: !596, line: 47, baseType: !17, size: 64, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !597, file: !596, line: 48, baseType: !17, size: 64, offset: 768)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !597, file: !596, line: 50, baseType: !631, size: 512, offset: 832)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !601, line: 37, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 24, size: 512, elements: !633)
!633 = !{!634, !636, !637, !638, !648}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !632, file: !601, line: 26, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !632, file: !601, line: 28, baseType: !635, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !632, file: !601, line: 29, baseType: !11, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !632, file: !601, line: 30, baseType: !639, size: 256, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !640, line: 39, baseType: !641)
!640 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !640, line: 35, size: 256, elements: !642)
!642 = !{!643, !647}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !641, file: !640, line: 37, baseType: !644, size: 256)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !641, file: !640, line: 38, baseType: !92, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !632, file: !601, line: 36, baseType: !11, size: 64, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !597, file: !596, line: 52, baseType: !17, size: 64, offset: 1344)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !597, file: !596, line: 53, baseType: !18, size: 8, offset: 1408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !597, file: !596, line: 55, baseType: !68, size: 1, offset: 1416, flags: DIFlagBitField, extraData: i64 1416)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !597, file: !596, line: 57, baseType: !16, size: 64, offset: 1472)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !597, file: !596, line: 58, baseType: !16, size: 64, offset: 1536)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !576, file: !532, line: 163, baseType: !655, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !250, line: 62, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !250, line: 50, size: 768, elements: !658)
!658 = !{!659, !660, !661, !663, !668, !670, !672, !673, !674}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !657, file: !250, line: 51, baseType: !75, size: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !657, file: !250, line: 52, baseType: !27, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !657, file: !250, line: 53, baseType: !662, size: 192, offset: 192)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 192, elements: !290)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !657, file: !250, line: 55, baseType: !664, size: 64, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !250, line: 45, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!23, !16}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !657, file: !250, line: 56, baseType: !669, size: 64, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !250, line: 46, baseType: !665)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !657, file: !250, line: 57, baseType: !671, size: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !250, line: 47, baseType: !423)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !657, file: !250, line: 58, baseType: !16, size: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !657, file: !250, line: 60, baseType: !17, size: 64, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !657, file: !250, line: 61, baseType: !11, size: 64, offset: 704)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "min_free", scope: !576, file: !532, line: 165, baseType: !240, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !576, file: !532, line: 166, baseType: !240, size: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !576, file: !532, line: 167, baseType: !27, size: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !576, file: !532, line: 169, baseType: !172, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !576, file: !532, line: 171, baseType: !172, size: 64, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !576, file: !532, line: 173, baseType: !11, size: 64, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !576, file: !532, line: 174, baseType: !11, size: 64, offset: 576)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !576, file: !532, line: 175, baseType: !23, size: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !576, file: !532, line: 176, baseType: !23, size: 64, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !576, file: !532, line: 177, baseType: !23, size: 64, offset: 768)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !576, file: !532, line: 179, baseType: !11, size: 64, offset: 832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !576, file: !532, line: 180, baseType: !23, size: 64, offset: 896)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !576, file: !532, line: 181, baseType: !23, size: 64, offset: 960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !576, file: !532, line: 183, baseType: !689, size: 64, offset: 1024)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !691, line: 25, baseType: !692)
!691 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "44a673836137b8263e2cfd875033292f")
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !691, line: 29, size: 704, elements: !693)
!693 = !{!694, !695, !705, !710, !711, !712}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !692, file: !691, line: 30, baseType: !16, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !692, file: !691, line: 31, baseType: !696, size: 384, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !697, line: 22, baseType: !698)
!697 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "bf27d4781f3b25ce5eb9a764f55ea2d4")
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 16, size: 384, elements: !699)
!699 = !{!700, !701, !702, !703, !704}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !698, file: !697, line: 17, baseType: !17, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !698, file: !697, line: 18, baseType: !27, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !698, file: !697, line: 19, baseType: !75, size: 128, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !698, file: !697, line: 20, baseType: !147, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !698, file: !697, line: 21, baseType: !11, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !692, file: !691, line: 32, baseType: !706, size: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !691, line: 27, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!88, !689, !16}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !692, file: !691, line: 33, baseType: !16, size: 64, offset: 512)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !692, file: !691, line: 34, baseType: !16, size: 64, offset: 576)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !692, file: !691, line: 35, baseType: !11, size: 64, offset: 640)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !576, file: !532, line: 185, baseType: !11, size: 64, offset: 1088)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !531, file: !532, line: 97, baseType: !715, size: 64, offset: 3712)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !532, line: 62, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 39, size: 960, elements: !718)
!718 = !{!719, !720, !721, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !717, file: !532, line: 40, baseType: !191, size: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !717, file: !532, line: 41, baseType: !202, size: 128, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !717, file: !532, line: 43, baseType: !722, size: 64, offset: 448)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 8)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !717, file: !532, line: 46, baseType: !68, size: 20, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !717, file: !532, line: 47, baseType: !68, size: 10, offset: 532, flags: DIFlagBitField, extraData: i64 512)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !717, file: !532, line: 48, baseType: !68, size: 10, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !717, file: !532, line: 49, baseType: !68, size: 10, offset: 554, flags: DIFlagBitField, extraData: i64 544)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !717, file: !532, line: 50, baseType: !68, size: 1, offset: 564, flags: DIFlagBitField, extraData: i64 544)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !717, file: !532, line: 51, baseType: !68, size: 1, offset: 565, flags: DIFlagBitField, extraData: i64 544)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !717, file: !532, line: 52, baseType: !68, size: 1, offset: 566, flags: DIFlagBitField, extraData: i64 544)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !717, file: !532, line: 53, baseType: !68, size: 1, offset: 567, flags: DIFlagBitField, extraData: i64 544)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !717, file: !532, line: 56, baseType: !552, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !717, file: !532, line: 57, baseType: !172, size: 64, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !717, file: !532, line: 58, baseType: !172, size: 64, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !717, file: !532, line: 59, baseType: !27, size: 64, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !717, file: !532, line: 60, baseType: !240, size: 64, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !717, file: !532, line: 61, baseType: !23, size: 64, offset: 896)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !531, file: !532, line: 103, baseType: !23, size: 64, offset: 3776)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !531, file: !532, line: 104, baseType: !23, size: 64, offset: 3840)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !531, file: !532, line: 105, baseType: !23, size: 64, offset: 3904)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !531, file: !532, line: 106, baseType: !23, size: 64, offset: 3968)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !531, file: !532, line: 108, baseType: !113, size: 768, offset: 4032)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !531, file: !532, line: 110, baseType: !68, size: 1, offset: 4800, flags: DIFlagBitField, extraData: i64 4800)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !531, file: !532, line: 111, baseType: !68, size: 1, offset: 4801, flags: DIFlagBitField, extraData: i64 4800)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !531, file: !532, line: 113, baseType: !68, size: 1, offset: 4802, flags: DIFlagBitField, extraData: i64 4800)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !531, file: !532, line: 114, baseType: !68, size: 1, offset: 4803, flags: DIFlagBitField, extraData: i64 4800)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !531, file: !532, line: 115, baseType: !68, size: 1, offset: 4804, flags: DIFlagBitField, extraData: i64 4800)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !531, file: !532, line: 116, baseType: !68, size: 1, offset: 4805, flags: DIFlagBitField, extraData: i64 4800)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !531, file: !532, line: 117, baseType: !68, size: 1, offset: 4806, flags: DIFlagBitField, extraData: i64 4800)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !531, file: !532, line: 118, baseType: !68, size: 1, offset: 4807, flags: DIFlagBitField, extraData: i64 4800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !531, file: !532, line: 119, baseType: !68, size: 1, offset: 4808, flags: DIFlagBitField, extraData: i64 4800)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "update_variant", scope: !531, file: !532, line: 120, baseType: !68, size: 1, offset: 4809, flags: DIFlagBitField, extraData: i64 4800)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !531, file: !532, line: 121, baseType: !68, size: 1, offset: 4810, flags: DIFlagBitField, extraData: i64 4800)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !531, file: !532, line: 123, baseType: !68, size: 1, offset: 4811, flags: DIFlagBitField, extraData: i64 4800)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !531, file: !532, line: 124, baseType: !68, size: 1, offset: 4812, flags: DIFlagBitField, extraData: i64 4800)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !97, file: !98, line: 394, baseType: !758, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !96, line: 17, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !761, line: 321, size: 8192, elements: !762)
!761 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "bad45a65b84155e2cd31779ca946a5e9")
!762 = !{!763, !768, !769, !819, !898, !899, !921, !930, !1214, !1215, !1216, !1258, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1440, !1444, !1445, !1449, !1450, !1451, !1452, !1453, !1457, !1461, !1465, !1466, !1480, !1481, !1482, !1483, !1484, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !760, file: !761, line: 322, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !761, line: 317, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
