; ModuleID = 'samples/775.bc'
source_filename = "xmlsave.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._xmlNs = type { ptr, i32, ptr, ptr, ptr, ptr }
%struct._xmlSaveCtxt = type { ptr, i32, i32, ptr, ptr, ptr, ptr, i32, i32, i32, [61 x i8], i32, i32, ptr, ptr }
%struct._xmlOutputBuffer = type { ptr, ptr, ptr, ptr, ptr, ptr, i32, i32 }
%struct._xmlDoc = type { ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i32, i32 }
%struct._xmlDtd = type { ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct._xmlNode = type { ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i16, i16 }
%struct._xmlAttr = type { ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr }

@.str = private unnamed_addr constant [33 x i8] c"-//W3C//DTD XHTML 1.0 Strict//EN\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [35 x i8] c"-//W3C//DTD XHTML 1.0 Frameset//EN\00", align 1, !dbg !8
@.str.2 = private unnamed_addr constant [39 x i8] c"-//W3C//DTD XHTML 1.0 Transitional//EN\00", align 1, !dbg !13
@.str.3 = private unnamed_addr constant [50 x i8] c"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd\00", align 1, !dbg !18
@.str.4 = private unnamed_addr constant [52 x i8] c"http://www.w3.org/TR/xhtml1/DTD/xhtml1-frameset.dtd\00", align 1, !dbg !23

!1098 = !DIEnumerator(name: "XML_SAVE_XHTML", value: 16)
!1099 = !DIEnumerator(name: "XML_SAVE_AS_XML", value: 32)
!1100 = !DIEnumerator(name: "XML_SAVE_AS_HTML", value: 64)
!1101 = !DIEnumerator(name: "XML_SAVE_WSNONSIG", value: 128)
!1102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1103, line: 58, baseType: !1104, size: 32, elements: !1105)
!1103 = !DIFile(filename: "./include/libxml/encoding.h", directory: "/local-ssd/libxml2-5hiu2bm3eabodlo3ma2tknpx3yddqhyc-build/aidengro/spack-stage-libxml2-2.9.10-5hiu2bm3eabodlo3ma2tknpx3yddqhyc/spack-src", checksumkind: CSK_MD5, checksum: "807b84fade38abad3ae0d9b6af714dbc")
!1104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1105 = !{!1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1106 = !DIEnumerator(name: "XML_CHAR_ENCODING_ERROR", value: -1)
!1107 = !DIEnumerator(name: "XML_CHAR_ENCODING_NONE", value: 0)
!1108 = !DIEnumerator(name: "XML_CHAR_ENCODING_UTF8", value: 1)
!1109 = !DIEnumerator(name: "XML_CHAR_ENCODING_UTF16LE", value: 2)
!1110 = !DIEnumerator(name: "XML_CHAR_ENCODING_UTF16BE", value: 3)
!1111 = !DIEnumerator(name: "XML_CHAR_ENCODING_UCS4LE", value: 4)
!1112 = !DIEnumerator(name: "XML_CHAR_ENCODING_UCS4BE", value: 5)
!1113 = !DIEnumerator(name: "XML_CHAR_ENCODING_EBCDIC", value: 6)
!1114 = !DIEnumerator(name: "XML_CHAR_ENCODING_UCS4_2143", value: 7)
!1115 = !DIEnumerator(name: "XML_CHAR_ENCODING_UCS4_3412", value: 8)
!1116 = !DIEnumerator(name: "XML_CHAR_ENCODING_UCS2", value: 9)
!1117 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_1", value: 10)
!1118 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_2", value: 11)
!1119 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_3", value: 12)
!1120 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_4", value: 13)
!1121 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_5", value: 14)
!1122 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_6", value: 15)
!1123 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_7", value: 16)
!1124 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_8", value: 17)
!1125 = !DIEnumerator(name: "XML_CHAR_ENCODING_8859_9", value: 18)
!1126 = !DIEnumerator(name: "XML_CHAR_ENCODING_2022_JP", value: 19)
!1127 = !DIEnumerator(name: "XML_CHAR_ENCODING_SHIFT_JIS", value: 20)
!1128 = !DIEnumerator(name: "XML_CHAR_ENCODING_EUC_JP", value: 21)
!1129 = !DIEnumerator(name: "XML_CHAR_ENCODING_ASCII", value: 22)
!1130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !355, line: 36, baseType: !277, size: 32, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162}
!1132 = !DIEnumerator(name: "XML_FROM_NONE", value: 0)
!1133 = !DIEnumerator(name: "XML_FROM_PARSER", value: 1)
!1134 = !DIEnumerator(name: "XML_FROM_TREE", value: 2)
!1135 = !DIEnumerator(name: "XML_FROM_NAMESPACE", value: 3)
!1136 = !DIEnumerator(name: "XML_FROM_DTD", value: 4)
!1137 = !DIEnumerator(name: "XML_FROM_HTML", value: 5)
!1138 = !DIEnumerator(name: "XML_FROM_MEMORY", value: 6)
!1139 = !DIEnumerator(name: "XML_FROM_OUTPUT", value: 7)
!1140 = !DIEnumerator(name: "XML_FROM_IO", value: 8)
!1141 = !DIEnumerator(name: "XML_FROM_FTP", value: 9)
!1142 = !DIEnumerator(name: "XML_FROM_HTTP", value: 10)
!1143 = !DIEnumerator(name: "XML_FROM_XINCLUDE", value: 11)
!1144 = !DIEnumerator(name: "XML_FROM_XPATH", value: 12)
!1145 = !DIEnumerator(name: "XML_FROM_XPOINTER", value: 13)
!1146 = !DIEnumerator(name: "XML_FROM_REGEXP", value: 14)
!1147 = !DIEnumerator(name: "XML_FROM_DATATYPE", value: 15)
!1148 = !DIEnumerator(name: "XML_FROM_SCHEMASP", value: 16)
!1149 = !DIEnumerator(name: "XML_FROM_SCHEMASV", value: 17)
!1150 = !DIEnumerator(name: "XML_FROM_RELAXNGP", value: 18)
!1151 = !DIEnumerator(name: "XML_FROM_RELAXNGV", value: 19)
!1152 = !DIEnumerator(name: "XML_FROM_CATALOG", value: 20)
!1153 = !DIEnumerator(name: "XML_FROM_C14N", value: 21)
!1154 = !DIEnumerator(name: "XML_FROM_XSLT", value: 22)
!1155 = !DIEnumerator(name: "XML_FROM_VALID", value: 23)
!1156 = !DIEnumerator(name: "XML_FROM_CHECK", value: 24)
!1157 = !DIEnumerator(name: "XML_FROM_WRITER", value: 25)
!1158 = !DIEnumerator(name: "XML_FROM_MODULE", value: 26)
!1159 = !DIEnumerator(name: "XML_FROM_I18N", value: 27)
!1160 = !DIEnumerator(name: "XML_FROM_SCHEMATRONV", value: 28)
!1161 = !DIEnumerator(name: "XML_FROM_BUFFER", value: 29)
!1162 = !DIEnumerator(name: "XML_FROM_URI", value: 30)
!1163 = !{!1164, !1165, !1169, !1104, !1273, !1321, !1178, !1285, !1193, !1324, !1345, !1348, !1351, !1384, !1422, !1448, !1451, !1452}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlChar", file: !1167, line: 28, baseType: !1168)
!1167 = !DIFile(filename: "./include/libxml/xmlstring.h", directory: "/local-ssd/libxml2-5hiu2bm3eabodlo3ma2tknpx3yddqhyc-build/aidengro/spack-stage-libxml2-2.9.10-5hiu2bm3eabodlo3ma2tknpx3yddqhyc/spack-src", checksumkind: CSK_MD5, checksum: "82efb8a055d5fc8eb7d815ed471eca53")
!1168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNodePtr", file: !276, line: 488, baseType: !1170)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNode", file: !276, line: 487, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlNode", file: !276, line: 489, size: 960, elements: !1173)
!1173 = !{!1174, !1175, !1177, !1180, !1182, !1183, !1184, !1185, !1186, !1247, !1250, !1251, !1268, !1269, !1270, !1272}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !1172, file: !276, line: 490, baseType: !1164, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1172, file: !276, line: 491, baseType: !1176, size: 32, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementType", file: !276, line: 183, baseType: !285)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1172, file: !276, line: 492, baseType: !1178, size: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1166)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1172, file: !276, line: 493, baseType: !1181, size: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1172, file: !276, line: 494, baseType: !1181, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1172, file: !276, line: 495, baseType: !1181, size: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1172, file: !276, line: 496, baseType: !1181, size: 64, offset: 384)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1172, file: !276, line: 497, baseType: !1181, size: 64, offset: 448)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !1172, file: !276, line: 498, baseType: !1187, size: 64, offset: 512)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlDoc", file: !276, line: 551, size: 1408, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1222, !1223, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1244, !1245, !1246}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !1188, file: !276, line: 552, baseType: !1164, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1188, file: !276, line: 553, baseType: !1176, size: 32, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1188, file: !276, line: 554, baseType: !1193, size: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1188, file: !276, line: 555, baseType: !1181, size: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1188, file: !276, line: 556, baseType: !1181, size: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1188, file: !276, line: 557, baseType: !1181, size: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1188, file: !276, line: 558, baseType: !1181, size: 64, offset: 384)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1188, file: !276, line: 559, baseType: !1181, size: 64, offset: 448)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !1188, file: !276, line: 560, baseType: !1187, size: 64, offset: 512)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !1188, file: !276, line: 563, baseType: !1104, size: 32, offset: 576)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "standalone", scope: !1188, file: !276, line: 564, baseType: !1104, size: 32, offset: 608)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "intSubset", scope: !1188, file: !276, line: 570, baseType: !1203, size: 64, offset: 640)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlDtd", file: !276, line: 406, size: 1024, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !1204, file: !276, line: 407, baseType: !1164, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1204, file: !276, line: 408, baseType: !1176, size: 32, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1204, file: !276, line: 409, baseType: !1178, size: 64, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1204, file: !276, line: 410, baseType: !1181, size: 64, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1204, file: !276, line: 411, baseType: !1181, size: 64, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1204, file: !276, line: 412, baseType: !1187, size: 64, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1204, file: !276, line: 413, baseType: !1181, size: 64, offset: 384)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1204, file: !276, line: 414, baseType: !1181, size: 64, offset: 448)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !1204, file: !276, line: 415, baseType: !1187, size: 64, offset: 512)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "notations", scope: !1204, file: !276, line: 418, baseType: !1164, size: 64, offset: 576)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1204, file: !276, line: 419, baseType: !1164, size: 64, offset: 640)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1204, file: !276, line: 420, baseType: !1164, size: 64, offset: 704)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "entities", scope: !1204, file: !276, line: 421, baseType: !1164, size: 64, offset: 768)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ExternalID", scope: !1204, file: !276, line: 422, baseType: !1178, size: 64, offset: 832)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "SystemID", scope: !1204, file: !276, line: 423, baseType: !1178, size: 64, offset: 896)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "pentities", scope: !1204, file: !276, line: 424, baseType: !1164, size: 64, offset: 960)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "extSubset", scope: !1188, file: !276, line: 571, baseType: !1203, size: 64, offset: 704)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "oldNs", scope: !1188, file: !276, line: 572, baseType: !1224, size: 64, offset: 768)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlNs", file: !276, line: 389, size: 384, elements: !1226)
!1226 = !{!1227, !1228, !1230, !1231, !1232, !1233}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1225, file: !276, line: 390, baseType: !1224, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1225, file: !276, line: 391, baseType: !1229, size: 32, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNsType", file: !276, line: 375, baseType: !1176)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "href", scope: !1225, file: !276, line: 392, baseType: !1178, size: 64, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1225, file: !276, line: 393, baseType: !1178, size: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !1225, file: !276, line: 394, baseType: !1164, size: 64, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1225, file: !276, line: 395, baseType: !1187, size: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1188, file: !276, line: 573, baseType: !1178, size: 64, offset: 832)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1188, file: !276, line: 574, baseType: !1178, size: 64, offset: 896)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ids", scope: !1188, file: !276, line: 575, baseType: !1164, size: 64, offset: 960)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1188, file: !276, line: 576, baseType: !1164, size: 64, offset: 1024)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "URL", scope: !1188, file: !276, line: 577, baseType: !1178, size: 64, offset: 1088)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !1188, file: !276, line: 578, baseType: !1104, size: 32, offset: 1152)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !1188, file: !276, line: 580, baseType: !1241, size: 64, offset: 1216)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlDict", file: !1243, line: 24, flags: DIFlagFwdDecl)
!1243 = !DIFile(filename: "./include/libxml/dict.h", directory: "/local-ssd/libxml2-5hiu2bm3eabodlo3ma2tknpx3yddqhyc-build/aidengro/spack-stage-libxml2-2.9.10-5hiu2bm3eabodlo3ma2tknpx3yddqhyc/spack-src", checksumkind: CSK_MD5, checksum: "a48513ceb9774ebece2daa8a2cd52f07")
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "psvi", scope: !1188, file: !276, line: 581, baseType: !1164, size: 64, offset: 1280)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "parseFlags", scope: !1188, file: !276, line: 582, baseType: !1104, size: 32, offset: 1344)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1188, file: !276, line: 584, baseType: !1104, size: 32, offset: 1376)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !1172, file: !276, line: 501, baseType: !1248, size: 64, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNs", file: !276, line: 387, baseType: !1225)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !1172, file: !276, line: 502, baseType: !1165, size: 64, offset: 640)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1172, file: !276, line: 503, baseType: !1252, size: 64, offset: 704)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlAttr", file: !276, line: 434, size: 768, elements: !1254)
!1254 = !{!1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1267}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !1253, file: !276, line: 435, baseType: !1164, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1253, file: !276, line: 436, baseType: !1176, size: 32, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1253, file: !276, line: 437, baseType: !1178, size: 64, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1253, file: !276, line: 438, baseType: !1181, size: 64, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1253, file: !276, line: 439, baseType: !1181, size: 64, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1253, file: !276, line: 440, baseType: !1181, size: 64, offset: 320)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1253, file: !276, line: 441, baseType: !1252, size: 64, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1253, file: !276, line: 442, baseType: !1252, size: 64, offset: 448)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !1253, file: !276, line: 443, baseType: !1187, size: 64, offset: 512)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !1253, file: !276, line: 444, baseType: !1248, size: 64, offset: 576)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "atype", scope: !1253, file: !276, line: 445, baseType: !1266, size: 32, offset: 640)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlAttributeType", file: !276, line: 217, baseType: !308)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "psvi", scope: !1253, file: !276, line: 446, baseType: !1164, size: 64, offset: 704)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "nsDef", scope: !1172, file: !276, line: 504, baseType: !1248, size: 64, offset: 768)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "psvi", scope: !1172, file: !276, line: 505, baseType: !1164, size: 64, offset: 832)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !1172, file: !276, line: 506, baseType: !1271, size: 16, offset: 896)
!1271 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !1172, file: !276, line: 507, baseType: !1271, size: 16, offset: 912)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlOutputBufferPtr", file: !276, line: 32, baseType: !1274)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlOutputBuffer", file: !276, line: 31, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlOutputBuffer", file: !1277, line: 141, size: 448, elements: !1278)
!1277 = !DIFile(filename: "./include/libxml/xmlIO.h", directory: "/local-ssd/libxml2-5hiu2bm3eabodlo3ma2tknpx3yddqhyc-build/aidengro/spack-stage-libxml2-2.9.10-5hiu2bm3eabodlo3ma2tknpx3yddqhyc/spack-src", checksumkind: CSK_MD5, checksum: "cb4be47d203f7d54f374b9272db7e3f3")
!1278 = !{!1279, !1280, !1286, !1291, !1313, !1318, !1319, !1320}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1276, file: !1277, line: 142, baseType: !1164, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "writecallback", scope: !1276, file: !1277, line: 143, baseType: !1281, size: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlOutputWriteCallback", file: !1277, line: 100, baseType: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!1104, !1164, !1285, !1104}
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "closecallback", scope: !1276, file: !1277, line: 144, baseType: !1287, size: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlOutputCloseCallback", file: !1277, line: 110, baseType: !1288)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!1104, !1164}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !1276, file: !1277, line: 146, baseType: !1292, size: 64, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlCharEncodingHandlerPtr", file: !1103, line: 145, baseType: !1293)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlCharEncodingHandler", file: !1103, line: 144, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlCharEncodingHandler", file: !1103, line: 146, size: 320, elements: !1296)
!1296 = !{!1297, !1298, !1307, !1309, !1312}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1295, file: !1103, line: 147, baseType: !1193, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !1295, file: !1103, line: 148, baseType: !1299, size: 64, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlCharEncodingInputFunc", file: !1103, line: 101, baseType: !1300)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!1104, !1303, !1304, !1305, !1304}
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1168)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !1295, file: !1103, line: 149, baseType: !1308, size: 64, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlCharEncodingOutputFunc", file: !1103, line: 123, baseType: !1300)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "iconv_in", scope: !1295, file: !1103, line: 151, baseType: !1310, size: 64, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "libiconv_t", file: !1311, line: 46, baseType: !1164)
!1311 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack/linux-ubuntu22.04-zen2/clang-18.0.0/libiconv-1.17-yjxuwwhaestsjkdrfxfvtlovzccan2px/include/iconv.h", directory: "/local-ssd/libxml2-5hiu2bm3eabodlo3ma2tknpx3yddqhyc-build", checksumkind: CSK_MD5, checksum: "b2fc3eb69b19b470f76aa362172c4039")
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "iconv_out", scope: !1295, file: !1103, line: 152, baseType: !1310, size: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1276, file: !1277, line: 148, baseType: !1314, size: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlBufPtr", file: !276, line: 114, baseType: !1315)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlBuf", file: !276, line: 105, baseType: !1317)
!1317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlBuf", file: !276, line: 105, flags: DIFlagFwdDecl)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "conv", scope: !1276, file: !1277, line: 149, baseType: !1314, size: 64, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1276, file: !1277, line: 150, baseType: !1104, size: 32, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1276, file: !1277, line: 151, baseType: !1104, size: 32, offset: 416)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1322, line: 70, baseType: !1323)
!1322 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!1323 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlSaveCtxtPtr", file: !1092, line: 42, baseType: !1325)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlSaveCtxt", file: !1092, line: 41, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlSaveCtxt", file: !2, line: 78, size: 1216, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1341, !1342, !1343, !1344}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !1327, file: !2, line: 79, baseType: !1164, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1327, file: !2, line: 80, baseType: !1104, size: 32, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1327, file: !2, line: 81, baseType: !1104, size: 32, offset: 96)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1327, file: !2, line: 82, baseType: !1178, size: 64, offset: 128)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1327, file: !2, line: 83, baseType: !1178, size: 64, offset: 192)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1327, file: !2, line: 84, baseType: !1292, size: 64, offset: 256)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1327, file: !2, line: 85, baseType: !1273, size: 64, offset: 320)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1327, file: !2, line: 86, baseType: !1104, size: 32, offset: 384)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1327, file: !2, line: 87, baseType: !1104, size: 32, offset: 416)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1327, file: !2, line: 88, baseType: !1104, size: 32, offset: 448)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "indent", scope: !1327, file: !2, line: 89, baseType: !1340, size: 488, offset: 480)
!1340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 488, elements: !208)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "indent_nr", scope: !1327, file: !2, line: 90, baseType: !1104, size: 32, offset: 992)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "indent_size", scope: !1327, file: !2, line: 91, baseType: !1104, size: 32, offset: 1024)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !1327, file: !2, line: 92, baseType: !1308, size: 64, offset: 1088)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "escapeAttr", scope: !1327, file: !2, line: 93, baseType: !1308, size: 64, offset: 1152)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlDocPtr", file: !276, line: 550, baseType: !1346)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlDoc", file: !276, line: 549, baseType: !1188)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlDtdPtr", file: !276, line: 405, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlDtd", file: !276, line: 404, baseType: !1204)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementPtr", file: !276, line: 345, baseType: !1352)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElement", file: !276, line: 344, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlElement", file: !276, line: 346, size: 896, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1367, !1383, !1415, !1416}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !1354, file: !276, line: 347, baseType: !1164, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1354, file: !276, line: 348, baseType: !1176, size: 32, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1354, file: !276, line: 349, baseType: !1178, size: 64, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1354, file: !276, line: 350, baseType: !1181, size: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1354, file: !276, line: 351, baseType: !1181, size: 64, offset: 256)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1354, file: !276, line: 352, baseType: !1203, size: 64, offset: 320)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1354, file: !276, line: 353, baseType: !1181, size: 64, offset: 384)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1354, file: !276, line: 354, baseType: !1181, size: 64, offset: 448)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !1354, file: !276, line: 355, baseType: !1187, size: 64, offset: 512)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "etype", scope: !1354, file: !276, line: 357, baseType: !1366, size: 32, offset: 576)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementTypeVal", file: !276, line: 328, baseType: !320)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !1354, file: !276, line: 358, baseType: !1368, size: 64, offset: 640)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementContentPtr", file: !276, line: 305, baseType: !1369)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementContent", file: !276, line: 304, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlElementContent", file: !276, line: 306, size: 384, elements: !1372)
!1372 = !{!1373, !1375, !1377, !1378, !1380, !1381, !1382}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1371, file: !276, line: 307, baseType: !1374, size: 32)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementContentType", file: !276, line: 283, baseType: !327)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "ocur", scope: !1371, file: !276, line: 308, baseType: !1376, size: 32, offset: 32)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlElementContentOccur", file: !276, line: 295, baseType: !333)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1371, file: !276, line: 309, baseType: !1178, size: 64, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !1371, file: !276, line: 310, baseType: !1379, size: 64, offset: 128)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !1371, file: !276, line: 311, baseType: !1379, size: 64, offset: 192)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1371, file: !276, line: 312, baseType: !1379, size: 64, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1371, file: !276, line: 313, baseType: !1178, size: 64, offset: 320)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1354, file: !276, line: 359, baseType: !1384, size: 64, offset: 704)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlAttributePtr", file: !276, line: 252, baseType: !1385)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlAttribute", file: !276, line: 251, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlAttribute", file: !276, line: 253, size: 960, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1400, !1401, !1403, !1404, !1413, !1414}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !1387, file: !276, line: 254, baseType: !1164, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1387, file: !276, line: 255, baseType: !1176, size: 32, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1387, file: !276, line: 256, baseType: !1178, size: 64, offset: 128)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1387, file: !276, line: 257, baseType: !1181, size: 64, offset: 192)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1387, file: !276, line: 258, baseType: !1181, size: 64, offset: 256)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1387, file: !276, line: 259, baseType: !1203, size: 64, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1387, file: !276, line: 260, baseType: !1181, size: 64, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1387, file: !276, line: 261, baseType: !1181, size: 64, offset: 448)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !1387, file: !276, line: 262, baseType: !1187, size: 64, offset: 512)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "nexth", scope: !1387, file: !276, line: 264, baseType: !1399, size: 64, offset: 576)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "atype", scope: !1387, file: !276, line: 265, baseType: !1266, size: 32, offset: 640)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1387, file: !276, line: 266, baseType: !1402, size: 32, offset: 672)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlAttributeDefault", file: !276, line: 230, baseType: !339)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "defaultValue", scope: !1387, file: !276, line: 267, baseType: !1178, size: 64, offset: 704)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !1387, file: !276, line: 268, baseType: !1405, size: 64, offset: 768)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlEnumerationPtr", file: !276, line: 239, baseType: !1406)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlEnumeration", file: !276, line: 238, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlEnumeration", file: !276, line: 240, size: 128, elements: !1409)
!1409 = !{!1410, !1412}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1408, file: !276, line: 241, baseType: !1411, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1408, file: !276, line: 242, baseType: !1178, size: 64, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1387, file: !276, line: 269, baseType: !1178, size: 64, offset: 832)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1387, file: !276, line: 270, baseType: !1178, size: 64, offset: 896)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1354, file: !276, line: 360, baseType: !1178, size: 64, offset: 768)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "contModel", scope: !1354, file: !276, line: 362, baseType: !1417, size: 64, offset: 832)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlRegexpPtr", file: !1418, line: 29, baseType: !1419)
!1418 = !DIFile(filename: "./include/libxml/xmlregexp.h", directory: "/local-ssd/libxml2-5hiu2bm3eabodlo3ma2tknpx3yddqhyc-build/aidengro/spack-stage-libxml2-2.9.10-5hiu2bm3eabodlo3ma2tknpx3yddqhyc/spack-src", checksumkind: CSK_MD5, checksum: "fea3110c96e8cd9013900e1c8e5b6c0b")
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlRegexp", file: !1418, line: 28, baseType: !1421)
!1421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlRegexp", file: !1418, line: 28, flags: DIFlagFwdDecl)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlEntityPtr", file: !276, line: 49, baseType: !1423)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlEntity", file: !276, line: 48, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlEntity", file: !346, line: 38, size: 1088, elements: !1426)
!1426 = !{!1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1441, !1442, !1443, !1445, !1446, !1447}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !1425, file: !346, line: 39, baseType: !1164, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1425, file: !346, line: 40, baseType: !1176, size: 32, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1425, file: !346, line: 41, baseType: !1178, size: 64, offset: 128)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1425, file: !346, line: 42, baseType: !1181, size: 64, offset: 192)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1425, file: !346, line: 43, baseType: !1181, size: 64, offset: 256)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1425, file: !346, line: 44, baseType: !1203, size: 64, offset: 320)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1425, file: !346, line: 45, baseType: !1181, size: 64, offset: 384)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1425, file: !346, line: 46, baseType: !1181, size: 64, offset: 448)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !1425, file: !346, line: 47, baseType: !1187, size: 64, offset: 512)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1425, file: !346, line: 49, baseType: !1165, size: 64, offset: 576)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !1425, file: !346, line: 50, baseType: !1165, size: 64, offset: 640)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1425, file: !346, line: 51, baseType: !1104, size: 32, offset: 704)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "etype", scope: !1425, file: !346, line: 52, baseType: !1440, size: 32, offset: 736)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlEntityType", file: !346, line: 31, baseType: !345)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "ExternalID", scope: !1425, file: !346, line: 53, baseType: !1178, size: 64, offset: 768)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "SystemID", scope: !1425, file: !346, line: 54, baseType: !1178, size: 64, offset: 832)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "nexte", scope: !1425, file: !346, line: 56, baseType: !1444, size: 64, offset: 896)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "URI", scope: !1425, file: !346, line: 57, baseType: !1178, size: 64, offset: 960)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1425, file: !346, line: 58, baseType: !1104, size: 32, offset: 1024)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "checked", scope: !1425, file: !346, line: 59, baseType: !1104, size: 32, offset: 1056)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlAttrPtr", file: !276, line: 433, baseType: !1449)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlAttr", file: !276, line: 432, baseType: !1253)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNsPtr", file: !276, line: 388, baseType: !1248)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNotationTablePtr", file: !1453, line: 118, baseType: !1454)
!1453 = !DIFile(filename: "./include/libxml/valid.h", directory: "/local-ssd/libxml2-5hiu2bm3eabodlo3ma2tknpx3yddqhyc-build/aidengro/spack-stage-libxml2-2.9.10-5hiu2bm3eabodlo3ma2tknpx3yddqhyc/spack-src", checksumkind: CSK_MD5, checksum: "3c082c0a5b81e1bc9fd9a21b69014584")
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlNotationTable", file: !1453, line: 117, baseType: !1456)
!1456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlHashTable", file: !1457, line: 21, flags: DIFlagFwdDecl)
!1457 = !DIFile(filename: "./include/libxml/hash.h", directory: "/local-ssd/libxml2-5hiu2bm3eabodlo3ma2tknpx3yddqhyc-build/aidengro/spack-stage-libxml2-2.9.10-5hiu2bm3eabodlo3ma2tknpx3yddqhyc/spack-src", checksumkind: CSK_MD5, checksum: "af6927d60ab5a971b68a65626d903bb2")
!1458 = !{!0, !8, !13, !18, !23, !28, !33, !38, !40, !45, !50, !52, !54, !56, !61, !63, !65, !70, !75, !77, !79, !81, !83, !88, !90, !95, !97, !102, !107, !112, !114, !119, !121, !126, !128, !130, !132, !134, !136, !141, !146, !148, !150, !152, !154, !156, !158, !160, !165, !167, !169, !171, !173, !175, !177, !179, !184, !186, !188, !190, !195, !197, !199, !201, !203, !205, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !234, !236, !238, !243, !248, !253, !255, !257, !259, !261, !263, !265, !267, !269, !271}
!1459 = !{i32 7, !"Dwarf Version", i32 5}
!1460 = !{i32 2, !"Debug Info Version", i32 3}
!1461 = !{i32 1, !"wchar_size", i32 4}
!1462 = !{i32 8, !"PIC Level", i32 2}
!1463 = !{i32 7, !"uwtable", i32 2}
!1464 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!1465 = distinct !DISubprogram(name: "xmlIsXHTML__internal_alias", scope: !2, file: !2, line: 55, type: !1466, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1468)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!1104, !1178, !1178}
!1468 = !{!1469, !1470}
!1469 = !DILocalVariable(name: "systemID", arg: 1, scope: !1465, file: !2, line: 55, type: !1178)
!1470 = !DILocalVariable(name: "publicID", arg: 2, scope: !1465, file: !2, line: 55, type: !1178)
!1471 = !{!1472, !1472, i64 0}
!1472 = !{!"any pointer", !1473, i64 0}
!1473 = !{!"omnipotent char", !1474, i64 0}
!1474 = !{!"Simple C/C++ TBAA"}
!1475 = !DILocation(line: 55, column: 27, scope: !1465)
!1476 = !DILocation(line: 55, column: 52, scope: !1465)
!1477 = !DILocation(line: 56, column: 10, scope: !1478)
!1478 = distinct !DILexicalBlock(scope: !1465, file: !2, line: 56, column: 9)
!1479 = !DILocation(line: 56, column: 19, scope: !1478)
!1480 = !DILocation(line: 56, column: 28, scope: !1478)
!1481 = !DILocation(line: 56, column: 32, scope: !1478)
!1482 = !DILocation(line: 56, column: 41, scope: !1478)
!1483 = !DILocation(line: 56, column: 9, scope: !1465)
!1484 = !DILocation(line: 57, column: 2, scope: !1478)
!1485 = !DILocation(line: 58, column: 9, scope: !1486)
!1486 = distinct !DILexicalBlock(scope: !1465, file: !2, line: 58, column: 9)
!1487 = !DILocation(line: 58, column: 18, scope: !1486)
!1488 = !DILocation(line: 58, column: 9, scope: !1465)
!1489 = !DILocation(line: 59, column: 18, scope: !1490)
!1490 = distinct !DILexicalBlock(scope: !1491, file: !2, line: 59, column: 6)
!1491 = distinct !DILexicalBlock(scope: !1486, file: !2, line: 58, column: 27)
!1492 = !DILocation(line: 59, column: 6, scope: !1490)
!1493 = !DILocation(line: 59, column: 6, scope: !1491)
!1494 = !DILocation(line: 59, column: 53, scope: !1490)
!1495 = !DILocation(line: 60, column: 18, scope: !1496)
!1496 = distinct !DILexicalBlock(scope: !1491, file: !2, line: 60, column: 6)
!1497 = !DILocation(line: 60, column: 6, scope: !1496)
!1498 = !DILocation(line: 60, column: 6, scope: !1491)
!1499 = !DILocation(line: 60, column: 52, scope: !1496)
!1500 = !DILocation(line: 61, column: 18, scope: !1501)
!1501 = distinct !DILexicalBlock(scope: !1491, file: !2, line: 61, column: 6)
!1502 = !DILocation(line: 61, column: 6, scope: !1501)
!1503 = !DILocation(line: 61, column: 6, scope: !1491)
!1504 = !DILocation(line: 61, column: 52, scope: !1501)
!1505 = !DILocation(line: 62, column: 5, scope: !1491)
!1506 = !DILocation(line: 63, column: 9, scope: !1507)
!1507 = distinct !DILexicalBlock(scope: !1465, file: !2, line: 63, column: 9)
!1508 = !DILocation(line: 63, column: 18, scope: !1507)
!1509 = !DILocation(line: 63, column: 9, scope: !1465)
!1510 = !DILocation(line: 64, column: 18, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1512, file: !2, line: 64, column: 6)
!1512 = distinct !DILexicalBlock(scope: !1507, file: !2, line: 63, column: 27)
!1513 = !DILocation(line: 64, column: 6, scope: !1511)
!1514 = !DILocation(line: 64, column: 6, scope: !1512)
!1515 = !DILocation(line: 64, column: 53, scope: !1511)
!1516 = !DILocation(line: 65, column: 18, scope: !1517)
!1517 = distinct !DILexicalBlock(scope: !1512, file: !2, line: 65, column: 6)
!1518 = !DILocation(line: 65, column: 6, scope: !1517)
!1519 = !DILocation(line: 65, column: 6, scope: !1512)
!1520 = !DILocation(line: 65, column: 52, scope: !1517)
!1521 = !DILocation(line: 66, column: 18, scope: !1522)
!1522 = distinct !DILexicalBlock(scope: !1512, file: !2, line: 66, column: 6)
!1523 = !DILocation(line: 66, column: 6, scope: !1522)
!1524 = !DILocation(line: 66, column: 6, scope: !1512)
!1525 = !DILocation(line: 66, column: 52, scope: !1522)
!1526 = !DILocation(line: 67, column: 5, scope: !1512)
!1527 = !DILocation(line: 68, column: 5, scope: !1465)
!1528 = !DILocation(line: 69, column: 1, scope: !1465)
!1529 = !DISubprogram(name: "xmlStrEqual__internal_alias", scope: !1530, file: !1530, line: 10811, type: !1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1530 = !DIFile(filename: "./elfgcchack.h", directory: "/local-ssd/libxml2-5hiu2bm3eabodlo3ma2tknpx3yddqhyc-build/aidengro/spack-stage-libxml2-2.9.10-5hiu2bm3eabodlo3ma2tknpx3yddqhyc/spack-src", checksumkind: CSK_MD5, checksum: "8278cf5308b2e49b9b44b5d0704ddb9f")
!1531 = distinct !DISubprogram(name: "xmlBufDumpNotationTable", scope: !2, file: !2, line: 467, type: !1532, scopeLine: 467, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1534)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{null, !1314, !1452}
!1534 = !{!1535, !1536, !1537}
!1535 = !DILocalVariable(name: "buf", arg: 1, scope: !1531, file: !2, line: 467, type: !1314)
!1536 = !DILocalVariable(name: "table", arg: 2, scope: !1531, file: !2, line: 467, type: !1452)
!1537 = !DILocalVariable(name: "buffer", scope: !1531, file: !2, line: 468, type: !1538)
!1538 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlBufferPtr", file: !276, line: 90, baseType: !1539)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64)
!1540 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlBuffer", file: !276, line: 89, baseType: !1541)
!1541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_xmlBuffer", file: !276, line: 91, size: 256, elements: !1542)
!1542 = !{!1543, !1544, !1545, !1546, !1548}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !1541, file: !276, line: 92, baseType: !1165, size: 64)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1541, file: !276, line: 93, baseType: !277, size: 32, offset: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1541, file: !276, line: 94, baseType: !277, size: 32, offset: 96)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1541, file: !276, line: 95, baseType: !1547, size: 32, offset: 128)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlBufferAllocationScheme", file: !276, line: 81, baseType: !275)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "contentIO", scope: !1541, file: !276, line: 96, baseType: !1165, size: 64, offset: 192)
!1549 = !DILocation(line: 467, column: 35, scope: !1531)
!1550 = !DILocation(line: 467, column: 60, scope: !1531)
!1551 = !DILocation(line: 468, column: 5, scope: !1531)
!1552 = !DILocation(line: 468, column: 18, scope: !1531)
!1553 = !DILocation(line: 470, column: 14, scope: !1531)
!1554 = !DILocation(line: 470, column: 12, scope: !1531)
!1555 = !DILocation(line: 471, column: 9, scope: !1556)
!1556 = distinct !DILexicalBlock(scope: !1531, file: !2, line: 471, column: 9)
!1557 = !DILocation(line: 471, column: 16, scope: !1556)
!1558 = !DILocation(line: 471, column: 9, scope: !1531)
!1559 = !DILocation(line: 475, column: 9, scope: !1560)
!1560 = distinct !DILexicalBlock(scope: !1556, file: !2, line: 471, column: 25)
!1561 = !DILocation(line: 477, column: 26, scope: !1531)
!1562 = !DILocation(line: 477, column: 34, scope: !1531)
!1563 = !DILocation(line: 477, column: 5, scope: !1531)
!1564 = !DILocation(line: 478, column: 23, scope: !1531)
!1565 = !DILocation(line: 478, column: 28, scope: !1531)
!1566 = !DILocation(line: 478, column: 5, scope: !1531)
!1567 = !DILocation(line: 479, column: 1, scope: !1531)
!1568 = !DISubprogram(name: "xmlBufferCreate__internal_alias", scope: !1530, file: !1530, line: 1463, type: !1569, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!1538}
!1571 = !DISubprogram(name: "xmlDumpNotationTable__internal_alias", scope: !1530, file: !1530, line: 3188, type: !1572, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{null, !1538, !1452}
!1574 = !DISubprogram(name: "xmlBufMergeBuffer", scope: !1575, file: !1575, line: 62, type: !1576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1575 = !DIFile(filename: "./buf.h", directory: "/local-ssd/libxml2-5hiu2bm3eabodlo3ma2tknpx3yddqhyc-build/aidengro/spack-stage-libxml2-2.9.10-5hiu2bm3eabodlo3ma2tknpx3yddqhyc/spack-src", checksumkind: CSK_MD5, checksum: "760feeae2c042ff45bc33ab6ce484557")
!1576 = !DISubroutineType(types: !1577)
!1577 = !{!1104, !1314, !1538}
!1578 = distinct !DISubprogram(name: "xmlBufDumpElementDecl", scope: !2, file: !2, line: 490, type: !1579, scopeLine: 490, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1581)
!1579 = !DISubroutineType(types: !1580)
!1580 = !{null, !1314, !1351}
!1581 = !{!1582, !1583, !1584}
!1582 = !DILocalVariable(name: "buf", arg: 1, scope: !1578, file: !2, line: 490, type: !1314)
!1583 = !DILocalVariable(name: "elem", arg: 2, scope: !1578, file: !2, line: 490, type: !1351)
!1584 = !DILocalVariable(name: "buffer", scope: !1578, file: !2, line: 491, type: !1538)
!1585 = !DILocation(line: 490, column: 33, scope: !1578)
!1586 = !DILocation(line: 490, column: 52, scope: !1578)
!1587 = !DILocation(line: 491, column: 5, scope: !1578)
!1588 = !DILocation(line: 491, column: 18, scope: !1578)
!1589 = !DILocation(line: 493, column: 14, scope: !1578)
!1590 = !DILocation(line: 493, column: 12, scope: !1578)
!1591 = !DILocation(line: 494, column: 9, scope: !1592)
!1592 = distinct !DILexicalBlock(scope: !1578, file: !2, line: 494, column: 9)
!1593 = !DILocation(line: 494, column: 16, scope: !1592)
!1594 = !DILocation(line: 494, column: 9, scope: !1578)
!1595 = !DILocation(line: 498, column: 9, scope: !1596)
!1596 = distinct !DILexicalBlock(scope: !1592, file: !2, line: 494, column: 25)
!1597 = !DILocation(line: 500, column: 24, scope: !1578)
!1598 = !DILocation(line: 500, column: 32, scope: !1578)
!1599 = !DILocation(line: 500, column: 5, scope: !1578)
!1600 = !DILocation(line: 501, column: 23, scope: !1578)
!1601 = !DILocation(line: 501, column: 28, scope: !1578)
!1602 = !DILocation(line: 501, column: 5, scope: !1578)
!1603 = !DILocation(line: 502, column: 1, scope: !1578)
!1604 = !DISubprogram(name: "xmlDumpElementDecl__internal_alias", scope: !1530, file: !1530, line: 3128, type: !1605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{null, !1538, !1351}
!1607 = distinct !DISubprogram(name: "xmlBufDumpAttributeDecl", scope: !2, file: !2, line: 513, type: !1608, scopeLine: 513, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1610)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{null, !1314, !1384}
!1610 = !{!1611, !1612, !1613}
!1611 = !DILocalVariable(name: "buf", arg: 1, scope: !1607, file: !2, line: 513, type: !1314)
!1612 = !DILocalVariable(name: "attr", arg: 2, scope: !1607, file: !2, line: 513, type: !1384)
!1613 = !DILocalVariable(name: "buffer", scope: !1607, file: !2, line: 514, type: !1538)
!1614 = !DILocation(line: 513, column: 35, scope: !1607)
!1615 = !DILocation(line: 513, column: 56, scope: !1607)
!1616 = !DILocation(line: 514, column: 5, scope: !1607)
!1617 = !DILocation(line: 514, column: 18, scope: !1607)
!1618 = !DILocation(line: 516, column: 14, scope: !1607)
!1619 = !DILocation(line: 516, column: 12, scope: !1607)
!1620 = !DILocation(line: 517, column: 9, scope: !1621)
!1621 = distinct !DILexicalBlock(scope: !1607, file: !2, line: 517, column: 9)
!1622 = !DILocation(line: 517, column: 16, scope: !1621)
!1623 = !DILocation(line: 517, column: 9, scope: !1607)
!1624 = !DILocation(line: 521, column: 9, scope: !1625)
!1625 = distinct !DILexicalBlock(scope: !1621, file: !2, line: 517, column: 25)
!1626 = !DILocation(line: 523, column: 26, scope: !1607)
!1627 = !DILocation(line: 523, column: 34, scope: !1607)
!1628 = !DILocation(line: 523, column: 5, scope: !1607)
!1629 = !DILocation(line: 524, column: 23, scope: !1607)
!1630 = !DILocation(line: 524, column: 28, scope: !1607)
!1631 = !DILocation(line: 524, column: 5, scope: !1607)
!1632 = !DILocation(line: 525, column: 1, scope: !1607)
!1633 = !DISubprogram(name: "xmlDumpAttributeDecl__internal_alias", scope: !1530, file: !1530, line: 3104, type: !1634, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{null, !1538, !1384}
!1636 = distinct !DISubprogram(name: "xmlBufDumpEntityDecl", scope: !2, file: !2, line: 535, type: !1637, scopeLine: 535, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1639)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{null, !1314, !1422}
!1639 = !{!1640, !1641, !1642}
!1640 = !DILocalVariable(name: "buf", arg: 1, scope: !1636, file: !2, line: 535, type: !1314)
!1641 = !DILocalVariable(name: "ent", arg: 2, scope: !1636, file: !2, line: 535, type: !1422)
!1642 = !DILocalVariable(name: "buffer", scope: !1636, file: !2, line: 536, type: !1538)
!1643 = !DILocation(line: 535, column: 32, scope: !1636)
!1644 = !DILocation(line: 535, column: 50, scope: !1636)
!1645 = !DILocation(line: 536, column: 5, scope: !1636)
!1646 = !DILocation(line: 536, column: 18, scope: !1636)
!1647 = !DILocation(line: 538, column: 14, scope: !1636)
!1648 = !DILocation(line: 538, column: 12, scope: !1636)
!1649 = !DILocation(line: 539, column: 9, scope: !1650)
!1650 = distinct !DILexicalBlock(scope: !1636, file: !2, line: 539, column: 9)
!1651 = !DILocation(line: 539, column: 16, scope: !1650)
!1652 = !DILocation(line: 539, column: 9, scope: !1636)
!1653 = !DILocation(line: 543, column: 9, scope: !1654)
!1654 = distinct !DILexicalBlock(scope: !1650, file: !2, line: 539, column: 25)
!1655 = !DILocation(line: 545, column: 23, scope: !1636)
!1656 = !DILocation(line: 545, column: 31, scope: !1636)
!1657 = !DILocation(line: 545, column: 5, scope: !1636)
!1658 = !DILocation(line: 546, column: 23, scope: !1636)
!1659 = !DILocation(line: 546, column: 28, scope: !1636)
!1660 = !DILocation(line: 546, column: 5, scope: !1636)
!1661 = !DILocation(line: 547, column: 1, scope: !1636)
!1662 = !DISubprogram(name: "xmlDumpEntityDecl__internal_alias", scope: !1530, file: !1530, line: 3164, type: !1663, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{null, !1538, !1422}
!1665 = distinct !DISubprogram(name: "xmlNsListDumpOutput", scope: !2, file: !2, line: 691, type: !1666, scopeLine: 691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1668)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{null, !1273, !1451}
!1668 = !{!1669, !1670}
!1669 = !DILocalVariable(name: "buf", arg: 1, scope: !1665, file: !2, line: 691, type: !1273)
!1670 = !DILocalVariable(name: "cur", arg: 2, scope: !1665, file: !2, line: 691, type: !1451)
!1671 = !DILocation(line: 691, column: 40, scope: !1665)
!1672 = !DILocation(line: 691, column: 54, scope: !1665)
!1673 = !DILocation(line: 692, column: 5, scope: !1665)
!1674 = !DILocation(line: 692, column: 12, scope: !1665)
!1675 = !DILocation(line: 692, column: 16, scope: !1665)
!1676 = !DILocation(line: 693, column: 25, scope: !1677)
!1677 = distinct !DILexicalBlock(scope: !1665, file: !2, line: 692, column: 25)
!1678 = !DILocation(line: 693, column: 30, scope: !1677)
!1679 = !DILocation(line: 693, column: 9, scope: !1677)
!1680 = !DILocation(line: 694, column: 8, scope: !1677)
!1681 = !DILocation(line: 694, column: 13, scope: !1677)
!1682 = !{!1683, !1472, i64 0}
!1683 = !{!"_xmlNs", !1472, i64 0, !1473, i64 8, !1472, i64 16, !1472, i64 24, !1472, i64 32, !1472, i64 40}
!1684 = !DILocation(line: 694, column: 6, scope: !1677)
!1685 = distinct !{!1685, !1673, !1686, !1687}
!1686 = !DILocation(line: 695, column: 5, scope: !1665)
!1687 = !{!"llvm.loop.mustprogress"}
!1688 = !DILocation(line: 696, column: 1, scope: !1665)
!1689 = distinct !DISubprogram(name: "xmlNsDumpOutput", scope: !2, file: !2, line: 631, type: !1690, scopeLine: 631, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1692)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{null, !1273, !1451, !1324}
!1692 = !{!1693, !1694, !1695}
!1693 = !DILocalVariable(name: "buf", arg: 1, scope: !1689, file: !2, line: 631, type: !1273)
!1694 = !DILocalVariable(name: "cur", arg: 2, scope: !1689, file: !2, line: 631, type: !1451)
!1695 = !DILocalVariable(name: "ctxt", arg: 3, scope: !1689, file: !2, line: 631, type: !1324)
!1696 = !DILocation(line: 631, column: 36, scope: !1689)
!1697 = !DILocation(line: 631, column: 50, scope: !1689)
!1698 = !DILocation(line: 631, column: 70, scope: !1689)
!1699 = !DILocation(line: 632, column: 10, scope: !1700)
!1700 = distinct !DILexicalBlock(scope: !1689, file: !2, line: 632, column: 9)
!1701 = !DILocation(line: 632, column: 14, scope: !1700)
!1702 = !DILocation(line: 632, column: 23, scope: !1700)
!1703 = !DILocation(line: 632, column: 27, scope: !1700)
!1704 = !DILocation(line: 632, column: 31, scope: !1700)
!1705 = !DILocation(line: 632, column: 9, scope: !1689)
!1706 = !DILocation(line: 632, column: 41, scope: !1700)
!1707 = !DILocation(line: 633, column: 10, scope: !1708)
!1708 = distinct !DILexicalBlock(scope: !1689, file: !2, line: 633, column: 9)
!1709 = !DILocation(line: 633, column: 15, scope: !1708)
!1710 = !{!1683, !1473, i64 8}
!1711 = !DILocation(line: 633, column: 20, scope: !1708)
!1712 = !DILocation(line: 633, column: 44, scope: !1708)
!1713 = !DILocation(line: 633, column: 48, scope: !1708)
!1714 = !DILocation(line: 633, column: 53, scope: !1708)
!1715 = !{!1683, !1472, i64 16}
!1716 = !DILocation(line: 633, column: 58, scope: !1708)
!1717 = !DILocation(line: 633, column: 9, scope: !1689)
!1718 = !DILocation(line: 634, column: 18, scope: !1719)
!1719 = distinct !DILexicalBlock(scope: !1720, file: !2, line: 634, column: 6)
!1720 = distinct !DILexicalBlock(scope: !1708, file: !2, line: 633, column: 68)
!1721 = !DILocation(line: 634, column: 23, scope: !1719)
!1722 = !{!1683, !1472, i64 24}
!1723 = !DILocation(line: 634, column: 6, scope: !1719)
!1724 = !DILocation(line: 634, column: 6, scope: !1720)
!1725 = !DILocation(line: 635, column: 6, scope: !1719)
!1726 = !DILocation(line: 637, column: 6, scope: !1727)
!1727 = distinct !DILexicalBlock(scope: !1720, file: !2, line: 637, column: 6)
!1728 = !DILocation(line: 637, column: 11, scope: !1727)
!1729 = !DILocation(line: 637, column: 19, scope: !1727)
!1730 = !DILocation(line: 637, column: 22, scope: !1727)
!1731 = !DILocation(line: 637, column: 28, scope: !1727)
!1732 = !{!1733, !1734, i64 56}
!1733 = !{!"_xmlSaveCtxt", !1472, i64 0, !1734, i64 8, !1734, i64 12, !1472, i64 16, !1472, i64 24, !1472, i64 32, !1472, i64 40, !1734, i64 48, !1734, i64 52, !1734, i64 56, !1473, i64 60, !1734, i64 124, !1734, i64 128, !1472, i64 136, !1472, i64 144}
!1734 = !{!"int", !1473, i64 0}
!1735 = !DILocation(line: 637, column: 35, scope: !1727)
!1736 = !DILocation(line: 637, column: 6, scope: !1720)
!1737 = !DILocation(line: 638, column: 35, scope: !1727)
!1738 = !DILocation(line: 638, column: 6, scope: !1727)
!1739 = !DILocation(line: 640, column: 27, scope: !1727)
!1740 = !DILocation(line: 640, column: 6, scope: !1727)
!1741 = !DILocation(line: 643, column: 6, scope: !1742)
!1742 = distinct !DILexicalBlock(scope: !1720, file: !2, line: 643, column: 6)
!1743 = !DILocation(line: 643, column: 11, scope: !1742)
!1744 = !DILocation(line: 643, column: 18, scope: !1742)
!1745 = !DILocation(line: 643, column: 6, scope: !1720)
!1746 = !DILocation(line: 644, column: 27, scope: !1747)
!1747 = distinct !DILexicalBlock(scope: !1742, file: !2, line: 643, column: 27)
!1748 = !DILocation(line: 644, column: 6, scope: !1747)
!1749 = !DILocation(line: 645, column: 33, scope: !1747)
!1750 = !DILocation(line: 645, column: 52, scope: !1747)
!1751 = !DILocation(line: 645, column: 57, scope: !1747)
!1752 = !DILocation(line: 645, column: 6, scope: !1747)
!1753 = !DILocation(line: 646, column: 2, scope: !1747)
!1754 = !DILocation(line: 647, column: 27, scope: !1742)
!1755 = !DILocation(line: 647, column: 6, scope: !1742)
!1756 = !DILocation(line: 648, column: 23, scope: !1720)
!1757 = !DILocation(line: 648, column: 2, scope: !1720)
!1758 = !DILocation(line: 649, column: 26, scope: !1720)
!1759 = !DILocation(line: 649, column: 31, scope: !1720)
!1760 = !{!1761, !1472, i64 32}
!1761 = !{!"_xmlOutputBuffer", !1472, i64 0, !1472, i64 8, !1472, i64 16, !1472, i64 24, !1472, i64 32, !1472, i64 40, !1734, i64 48, !1734, i64 52}
!1762 = !DILocation(line: 649, column: 39, scope: !1720)
!1763 = !DILocation(line: 649, column: 44, scope: !1720)
!1764 = !DILocation(line: 649, column: 2, scope: !1720)
!1765 = !DILocation(line: 650, column: 5, scope: !1720)
!1766 = !DILocation(line: 651, column: 1, scope: !1689)
!1767 = distinct !DISubprogram(name: "xmlSaveToFd__internal_alias", scope: !2, file: !2, line: 1797, type: !1768, scopeLine: 1798, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1770)
!1768 = !DISubroutineType(types: !1769)
!1769 = !{!1324, !1104, !1285, !1104}
!1770 = !{!1771, !1772, !1773, !1774}
!1771 = !DILocalVariable(name: "fd", arg: 1, scope: !1767, file: !2, line: 1797, type: !1104)
!1772 = !DILocalVariable(name: "encoding", arg: 2, scope: !1767, file: !2, line: 1797, type: !1285)
!1773 = !DILocalVariable(name: "options", arg: 3, scope: !1767, file: !2, line: 1797, type: !1104)
!1774 = !DILocalVariable(name: "ret", scope: !1767, file: !2, line: 1799, type: !1324)
!1775 = !{!1734, !1734, i64 0}
!1776 = !DILocation(line: 1797, column: 17, scope: !1767)
!1777 = !DILocation(line: 1797, column: 33, scope: !1767)
!1778 = !DILocation(line: 1797, column: 47, scope: !1767)
!1779 = !DILocation(line: 1799, column: 5, scope: !1767)
!1780 = !DILocation(line: 1799, column: 20, scope: !1767)
!1781 = !DILocation(line: 1801, column: 26, scope: !1767)
!1782 = !DILocation(line: 1801, column: 36, scope: !1767)
!1783 = !DILocation(line: 1801, column: 11, scope: !1767)
!1784 = !DILocation(line: 1801, column: 9, scope: !1767)
!1785 = !DILocation(line: 1802, column: 9, scope: !1786)
!1786 = distinct !DILexicalBlock(scope: !1767, file: !2, line: 1802, column: 9)
!1787 = !DILocation(line: 1802, column: 13, scope: !1786)
!1788 = !DILocation(line: 1802, column: 9, scope: !1767)
!1789 = !DILocation(line: 1802, column: 22, scope: !1786)
!1790 = !DILocation(line: 1803, column: 40, scope: !1767)
!1791 = !DILocation(line: 1803, column: 44, scope: !1767)
!1792 = !DILocation(line: 1803, column: 49, scope: !1767)
!1793 = !{!1733, !1472, i64 32}
!1794 = !DILocation(line: 1803, column: 16, scope: !1767)
!1795 = !DILocation(line: 1803, column: 5, scope: !1767)
!1796 = !DILocation(line: 1803, column: 10, scope: !1767)
!1797 = !DILocation(line: 1803, column: 14, scope: !1767)
!1798 = !{!1733, !1472, i64 40}
!1799 = !DILocation(line: 1804, column: 9, scope: !1800)
!1800 = distinct !DILexicalBlock(scope: !1767, file: !2, line: 1804, column: 9)
!1801 = !DILocation(line: 1804, column: 14, scope: !1800)
!1802 = !DILocation(line: 1804, column: 18, scope: !1800)
!1803 = !DILocation(line: 1804, column: 9, scope: !1767)
!1804 = !DILocation(line: 1805, column: 18, scope: !1805)
!1805 = distinct !DILexicalBlock(scope: !1800, file: !2, line: 1804, column: 27)
!1806 = !DILocation(line: 1805, column: 2, scope: !1805)
!1807 = !DILocation(line: 1806, column: 2, scope: !1805)
!1808 = !DILocation(line: 1808, column: 12, scope: !1767)
!1809 = !DILocation(line: 1808, column: 5, scope: !1767)
!1810 = !DILocation(line: 1809, column: 1, scope: !1767)
!1811 = distinct !DISubprogram(name: "xmlNewSaveCtxt", scope: !2, file: !2, line: 379, type: !1812, scopeLine: 380, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1814)
!1812 = !DISubroutineType(types: !1813)
!1813 = !{!1324, !1285, !1104}
!1814 = !{!1815, !1816, !1817}
!1815 = !DILocalVariable(name: "encoding", arg: 1, scope: !1811, file: !2, line: 379, type: !1285)
!1816 = !DILocalVariable(name: "options", arg: 2, scope: !1811, file: !2, line: 379, type: !1104)
!1817 = !DILocalVariable(name: "ret", scope: !1811, file: !2, line: 381, type: !1324)
!1818 = !DILocation(line: 379, column: 28, scope: !1811)
!1819 = !DILocation(line: 379, column: 42, scope: !1811)
!1820 = !DILocation(line: 381, column: 5, scope: !1811)
!1821 = !DILocation(line: 381, column: 20, scope: !1811)
!1822 = !DILocation(line: 383, column: 28, scope: !1811)
!1823 = !DILocation(line: 383, column: 9, scope: !1811)
!1824 = !DILocation(line: 384, column: 9, scope: !1825)
!1825 = distinct !DILexicalBlock(scope: !1811, file: !2, line: 384, column: 9)
!1826 = !DILocation(line: 384, column: 13, scope: !1825)
!1827 = !DILocation(line: 384, column: 9, scope: !1811)
!1828 = !DILocation(line: 385, column: 2, scope: !1829)
!1829 = distinct !DILexicalBlock(scope: !1825, file: !2, line: 384, column: 22)
!1830 = !DILocation(line: 386, column: 2, scope: !1829)
!1831 = !DILocation(line: 388, column: 12, scope: !1811)
!1832 = !DILocation(line: 388, column: 5, scope: !1811)
!1833 = !DILocation(line: 390, column: 9, scope: !1834)
!1834 = distinct !DILexicalBlock(scope: !1811, file: !2, line: 390, column: 9)
!1835 = !DILocation(line: 390, column: 18, scope: !1834)
!1836 = !DILocation(line: 390, column: 9, scope: !1811)
!1837 = !DILocation(line: 391, column: 51, scope: !1838)
!1838 = distinct !DILexicalBlock(scope: !1834, file: !2, line: 390, column: 27)
!1839 = !DILocation(line: 391, column: 24, scope: !1838)
!1840 = !DILocation(line: 391, column: 9, scope: !1838)
!1841 = !DILocation(line: 391, column: 14, scope: !1838)
!1842 = !DILocation(line: 391, column: 22, scope: !1838)
!1843 = !DILocation(line: 392, column: 6, scope: !1844)
!1844 = distinct !DILexicalBlock(scope: !1838, file: !2, line: 392, column: 6)
!1845 = !DILocation(line: 392, column: 11, scope: !1844)
!1846 = !DILocation(line: 392, column: 19, scope: !1844)
!1847 = !DILocation(line: 392, column: 6, scope: !1838)
!1848 = !DILocation(line: 393, column: 50, scope: !1849)
!1849 = distinct !DILexicalBlock(scope: !1844, file: !2, line: 392, column: 28)
!1850 = !DILocation(line: 393, column: 6, scope: !1849)
!1851 = !DILocation(line: 394, column: 29, scope: !1849)
!1852 = !DILocation(line: 394, column: 13, scope: !1849)
!1853 = !DILocation(line: 395, column: 6, scope: !1849)
!1854 = !DILocation(line: 397, column: 52, scope: !1838)
!1855 = !DILocation(line: 397, column: 25, scope: !1838)
!1856 = !DILocation(line: 397, column: 9, scope: !1838)
!1857 = !DILocation(line: 397, column: 14, scope: !1838)
!1858 = !DILocation(line: 397, column: 23, scope: !1838)
!1859 = !{!1733, !1472, i64 24}
!1860 = !DILocation(line: 398, column: 2, scope: !1838)
!1861 = !DILocation(line: 398, column: 7, scope: !1838)
!1862 = !DILocation(line: 398, column: 14, scope: !1838)
!1863 = !{!1733, !1472, i64 136}
!1864 = !DILocation(line: 399, column: 5, scope: !1838)
!1865 = !DILocation(line: 400, column: 21, scope: !1811)
!1866 = !DILocation(line: 400, column: 5, scope: !1811)
!1867 = !DILocation(line: 407, column: 10, scope: !1868)
!1868 = distinct !DILexicalBlock(scope: !1811, file: !2, line: 407, column: 9)
!1869 = !DILocation(line: 407, column: 15, scope: !1868)
!1870 = !{!1733, !1734, i64 48}
!1871 = !DILocation(line: 407, column: 23, scope: !1868)
!1872 = !DILocation(line: 407, column: 44, scope: !1868)
!1873 = !DILocation(line: 407, column: 50, scope: !1868)
!1874 = !DILocation(line: 407, column: 58, scope: !1868)
!1875 = !DILocation(line: 407, column: 9, scope: !1811)
!1876 = !DILocation(line: 408, column: 10, scope: !1877)
!1877 = distinct !DILexicalBlock(scope: !1868, file: !2, line: 407, column: 80)
!1878 = !DILocation(line: 409, column: 5, scope: !1877)
!1879 = !DILocation(line: 411, column: 20, scope: !1811)
!1880 = !DILocation(line: 411, column: 5, scope: !1811)
!1881 = !DILocation(line: 411, column: 10, scope: !1811)
!1882 = !DILocation(line: 411, column: 18, scope: !1811)
!1883 = !DILocation(line: 412, column: 9, scope: !1884)
!1884 = distinct !DILexicalBlock(scope: !1811, file: !2, line: 412, column: 9)
!1885 = !DILocation(line: 412, column: 17, scope: !1884)
!1886 = !DILocation(line: 412, column: 9, scope: !1811)
!1887 = !DILocation(line: 413, column: 9, scope: !1884)
!1888 = !DILocation(line: 413, column: 14, scope: !1884)
!1889 = !DILocation(line: 413, column: 21, scope: !1884)
!1890 = !DILocation(line: 414, column: 14, scope: !1891)
!1891 = distinct !DILexicalBlock(scope: !1884, file: !2, line: 414, column: 14)
!1892 = !DILocation(line: 414, column: 22, scope: !1891)
!1893 = !DILocation(line: 414, column: 14, scope: !1884)
!1894 = !DILocation(line: 415, column: 9, scope: !1891)
!1895 = !DILocation(line: 415, column: 14, scope: !1891)
!1896 = !DILocation(line: 415, column: 21, scope: !1891)
!1897 = !DILocation(line: 417, column: 12, scope: !1811)
!1898 = !DILocation(line: 417, column: 5, scope: !1811)
!1899 = !DILocation(line: 418, column: 1, scope: !1811)
!1900 = !DISubprogram(name: "xmlOutputBufferCreateFd__internal_alias", scope: !1530, file: !1530, line: 6806, type: !1901, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1901 = !DISubroutineType(types: !1902)
!1902 = !{!1273, !1104, !1292}
!1903 = distinct !DISubprogram(name: "xmlFreeSaveCtxt", scope: !2, file: !2, line: 361, type: !1904, scopeLine: 362, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1906)
!1904 = !DISubroutineType(types: !1905)
!1905 = !{null, !1324}
!1906 = !{!1907}
!1907 = !DILocalVariable(name: "ctxt", arg: 1, scope: !1903, file: !2, line: 361, type: !1324)
!1908 = !DILocation(line: 361, column: 32, scope: !1903)
!1909 = !DILocation(line: 363, column: 9, scope: !1910)
!1910 = distinct !DILexicalBlock(scope: !1903, file: !2, line: 363, column: 9)
!1911 = !DILocation(line: 363, column: 14, scope: !1910)
!1912 = !DILocation(line: 363, column: 9, scope: !1903)
!1913 = !DILocation(line: 363, column: 23, scope: !1910)
!1914 = !DILocation(line: 364, column: 9, scope: !1915)
!1915 = distinct !DILexicalBlock(scope: !1903, file: !2, line: 364, column: 9)
!1916 = !DILocation(line: 364, column: 15, scope: !1915)
!1917 = !DILocation(line: 364, column: 24, scope: !1915)
!1918 = !DILocation(line: 364, column: 9, scope: !1903)
!1919 = !DILocation(line: 365, column: 9, scope: !1915)
!1920 = !DILocation(line: 365, column: 26, scope: !1915)
!1921 = !DILocation(line: 365, column: 32, scope: !1915)
!1922 = !DILocation(line: 366, column: 9, scope: !1923)
!1923 = distinct !DILexicalBlock(scope: !1903, file: !2, line: 366, column: 9)
!1924 = !DILocation(line: 366, column: 15, scope: !1923)
!1925 = !DILocation(line: 366, column: 19, scope: !1923)
!1926 = !DILocation(line: 366, column: 9, scope: !1903)
!1927 = !DILocation(line: 367, column: 30, scope: !1923)
!1928 = !DILocation(line: 367, column: 36, scope: !1923)
!1929 = !DILocation(line: 367, column: 9, scope: !1923)
!1930 = !DILocation(line: 368, column: 5, scope: !1903)
!1931 = !DILocation(line: 368, column: 13, scope: !1903)
!1932 = !DILocation(line: 369, column: 1, scope: !1903)
!1933 = distinct !DISubprogram(name: "xmlSaveToFilename__internal_alias", scope: !2, file: !2, line: 1824, type: !1934, scopeLine: 1825, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1936)
!1934 = !DISubroutineType(types: !1935)
!1935 = !{!1324, !1285, !1285, !1104}
!1936 = !{!1937, !1938, !1939, !1940, !1941}
!1937 = !DILocalVariable(name: "filename", arg: 1, scope: !1933, file: !2, line: 1824, type: !1285)
!1938 = !DILocalVariable(name: "encoding", arg: 2, scope: !1933, file: !2, line: 1824, type: !1285)
!1939 = !DILocalVariable(name: "options", arg: 3, scope: !1933, file: !2, line: 1824, type: !1104)
!1940 = !DILocalVariable(name: "ret", scope: !1933, file: !2, line: 1826, type: !1324)
!1941 = !DILocalVariable(name: "compression", scope: !1933, file: !2, line: 1827, type: !1104)
!1942 = !DILocation(line: 1824, column: 31, scope: !1933)
!1943 = !DILocation(line: 1824, column: 53, scope: !1933)
!1944 = !DILocation(line: 1824, column: 67, scope: !1933)
!1945 = !DILocation(line: 1826, column: 5, scope: !1933)
!1946 = !DILocation(line: 1826, column: 20, scope: !1933)
!1947 = !DILocation(line: 1827, column: 5, scope: !1933)
!1948 = !DILocation(line: 1827, column: 9, scope: !1933)
!1949 = !DILocation(line: 1829, column: 26, scope: !1933)
!1950 = !DILocation(line: 1829, column: 36, scope: !1933)
!1951 = !DILocation(line: 1829, column: 11, scope: !1933)
!1952 = !DILocation(line: 1829, column: 9, scope: !1933)
!1953 = !DILocation(line: 1830, column: 9, scope: !1954)
!1954 = distinct !DILexicalBlock(scope: !1933, file: !2, line: 1830, column: 9)
!1955 = !DILocation(line: 1830, column: 13, scope: !1954)
!1956 = !DILocation(line: 1830, column: 9, scope: !1933)
!1957 = !DILocation(line: 1830, column: 22, scope: !1954)
!1958 = !DILocation(line: 1831, column: 46, scope: !1933)
!1959 = !DILocation(line: 1831, column: 56, scope: !1933)
!1960 = !DILocation(line: 1831, column: 61, scope: !1933)
!1961 = !DILocation(line: 1832, column: 46, scope: !1933)
!1962 = !DILocation(line: 1831, column: 16, scope: !1933)
!1963 = !DILocation(line: 1831, column: 5, scope: !1933)
!1964 = !DILocation(line: 1831, column: 10, scope: !1933)
!1965 = !DILocation(line: 1831, column: 14, scope: !1933)
!1966 = !DILocation(line: 1833, column: 9, scope: !1967)
!1967 = distinct !DILexicalBlock(scope: !1933, file: !2, line: 1833, column: 9)
!1968 = !DILocation(line: 1833, column: 14, scope: !1967)
!1969 = !DILocation(line: 1833, column: 18, scope: !1967)
!1970 = !DILocation(line: 1833, column: 9, scope: !1933)
!1971 = !DILocation(line: 1834, column: 18, scope: !1972)
!1972 = distinct !DILexicalBlock(scope: !1967, file: !2, line: 1833, column: 27)
!1973 = !DILocation(line: 1834, column: 2, scope: !1972)
!1974 = !DILocation(line: 1835, column: 2, scope: !1972)
!1975 = !DILocation(line: 1837, column: 12, scope: !1933)
!1976 = !DILocation(line: 1837, column: 5, scope: !1933)
!1977 = !DILocation(line: 1838, column: 1, scope: !1933)
!1978 = !DISubprogram(name: "xmlOutputBufferCreateFilename__internal_alias", scope: !1530, file: !1530, line: 6830, type: !1979, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1979 = !DISubroutineType(types: !1980)
!1980 = !{!1273, !1285, !1292, !1104}
!1981 = distinct !DISubprogram(name: "xmlSaveToBuffer__internal_alias", scope: !2, file: !2, line: 1853, type: !1982, scopeLine: 1854, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !1984)
!1982 = !DISubroutineType(types: !1983)
!1983 = !{!1324, !1538, !1285, !1104}
!1984 = !{!1985, !1986, !1987, !1988, !1989, !1990}
!1985 = !DILocalVariable(name: "buffer", arg: 1, scope: !1981, file: !2, line: 1853, type: !1538)
!1986 = !DILocalVariable(name: "encoding", arg: 2, scope: !1981, file: !2, line: 1853, type: !1285)
!1987 = !DILocalVariable(name: "options", arg: 3, scope: !1981, file: !2, line: 1853, type: !1104)
!1988 = !DILocalVariable(name: "ret", scope: !1981, file: !2, line: 1855, type: !1324)
!1989 = !DILocalVariable(name: "out_buff", scope: !1981, file: !2, line: 1856, type: !1273)
!1990 = !DILocalVariable(name: "handler", scope: !1981, file: !2, line: 1857, type: !1292)
!1991 = !DILocation(line: 1853, column: 30, scope: !1981)
!1992 = !DILocation(line: 1853, column: 50, scope: !1981)
!1993 = !DILocation(line: 1853, column: 64, scope: !1981)
!1994 = !DILocation(line: 1855, column: 5, scope: !1981)
!1995 = !DILocation(line: 1855, column: 20, scope: !1981)
!1996 = !DILocation(line: 1856, column: 5, scope: !1981)
!1997 = !DILocation(line: 1856, column: 24, scope: !1981)
!1998 = !DILocation(line: 1857, column: 5, scope: !1981)
!1999 = !DILocation(line: 1857, column: 31, scope: !1981)
!2000 = !DILocation(line: 1859, column: 26, scope: !1981)
!2001 = !DILocation(line: 1859, column: 36, scope: !1981)
!2002 = !DILocation(line: 1859, column: 11, scope: !1981)
!2003 = !DILocation(line: 1859, column: 9, scope: !1981)
!2004 = !DILocation(line: 1860, column: 9, scope: !2005)
!2005 = distinct !DILexicalBlock(scope: !1981, file: !2, line: 1860, column: 9)
!2006 = !DILocation(line: 1860, column: 13, scope: !2005)
!2007 = !DILocation(line: 1860, column: 9, scope: !1981)
!2008 = !DILocation(line: 1860, column: 22, scope: !2005)
!2009 = !DILocation(line: 1862, column: 9, scope: !2010)
!2010 = distinct !DILexicalBlock(scope: !1981, file: !2, line: 1862, column: 9)
!2011 = !DILocation(line: 1862, column: 18, scope: !2010)
!2012 = !DILocation(line: 1862, column: 9, scope: !1981)
!2013 = !DILocation(line: 1863, column: 46, scope: !2014)
!2014 = distinct !DILexicalBlock(scope: !2010, file: !2, line: 1862, column: 27)
!2015 = !DILocation(line: 1863, column: 19, scope: !2014)
!2016 = !DILocation(line: 1863, column: 17, scope: !2014)
!2017 = !DILocation(line: 1864, column: 13, scope: !2018)
!2018 = distinct !DILexicalBlock(scope: !2014, file: !2, line: 1864, column: 13)
!2019 = !DILocation(line: 1864, column: 21, scope: !2018)
!2020 = !DILocation(line: 1864, column: 13, scope: !2014)
!2021 = !DILocation(line: 1865, column: 13, scope: !2022)
!2022 = distinct !DILexicalBlock(scope: !2018, file: !2, line: 1864, column: 30)
!2023 = !DILocation(line: 1865, column: 21, scope: !2022)
!2024 = !DILocation(line: 1866, column: 13, scope: !2022)
!2025 = !DILocation(line: 1868, column: 5, scope: !2014)
!2026 = !DILocation(line: 1869, column: 17, scope: !2010)
!2027 = !DILocation(line: 1870, column: 44, scope: !1981)
!2028 = !DILocation(line: 1870, column: 52, scope: !1981)
!2029 = !DILocation(line: 1870, column: 16, scope: !1981)
!2030 = !DILocation(line: 1870, column: 14, scope: !1981)
!2031 = !DILocation(line: 1871, column: 9, scope: !2032)
!2032 = distinct !DILexicalBlock(scope: !1981, file: !2, line: 1871, column: 9)
!2033 = !DILocation(line: 1871, column: 18, scope: !2032)
!2034 = !DILocation(line: 1871, column: 9, scope: !1981)
!2035 = !DILocation(line: 1872, column: 9, scope: !2036)
!2036 = distinct !DILexicalBlock(scope: !2032, file: !2, line: 1871, column: 27)
!2037 = !DILocation(line: 1872, column: 17, scope: !2036)
!2038 = !DILocation(line: 1873, column: 13, scope: !2039)
!2039 = distinct !DILexicalBlock(scope: !2036, file: !2, line: 1873, column: 13)
!2040 = !DILocation(line: 1873, column: 13, scope: !2036)
!2041 = !DILocation(line: 1873, column: 42, scope: !2039)
!2042 = !DILocation(line: 1873, column: 22, scope: !2039)
!2043 = !DILocation(line: 1874, column: 9, scope: !2036)
!2044 = !DILocation(line: 1877, column: 16, scope: !1981)
!2045 = !DILocation(line: 1877, column: 5, scope: !1981)
!2046 = !DILocation(line: 1877, column: 10, scope: !1981)
!2047 = !DILocation(line: 1877, column: 14, scope: !1981)
!2048 = !DILocation(line: 1878, column: 12, scope: !1981)
!2049 = !DILocation(line: 1878, column: 5, scope: !1981)
!2050 = !DILocation(line: 1879, column: 1, scope: !1981)
!2051 = !DISubprogram(name: "xmlFindCharEncodingHandler__internal_alias", scope: !1530, file: !1530, line: 3521, type: !2052, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2052 = !DISubroutineType(types: !2053)
!2053 = !{!1292, !1285}
!2054 = !DISubprogram(name: "xmlOutputBufferCreateBuffer__internal_alias", scope: !1530, file: !1530, line: 6794, type: !2055, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2055 = !DISubroutineType(types: !2056)
!2056 = !{!1273, !1538, !1292}
!2057 = !DISubprogram(name: "xmlCharEncCloseFunc__internal_alias", scope: !1530, file: !1530, line: 1951, type: !2058, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2058 = !DISubroutineType(types: !2059)
!2059 = !{!1104, !1293}
!2060 = distinct !DISubprogram(name: "xmlSaveToIO__internal_alias", scope: !2, file: !2, line: 1895, type: !2061, scopeLine: 1898, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !2063)
!2061 = !DISubroutineType(types: !2062)
!2062 = !{!1324, !1281, !1287, !1164, !1285, !1104}
!2063 = !{!2064, !2065, !2066, !2067, !2068, !2069}
!2064 = !DILocalVariable(name: "iowrite", arg: 1, scope: !2060, file: !2, line: 1895, type: !1281)
!2065 = !DILocalVariable(name: "ioclose", arg: 2, scope: !2060, file: !2, line: 1896, type: !1287)
!2066 = !DILocalVariable(name: "ioctx", arg: 3, scope: !2060, file: !2, line: 1897, type: !1164)
!2067 = !DILocalVariable(name: "encoding", arg: 4, scope: !2060, file: !2, line: 1897, type: !1285)
!2068 = !DILocalVariable(name: "options", arg: 5, scope: !2060, file: !2, line: 1897, type: !1104)
!2069 = !DILocalVariable(name: "ret", scope: !2060, file: !2, line: 1899, type: !1324)
!2070 = !DILocation(line: 1895, column: 36, scope: !2060)
!2071 = !DILocation(line: 1896, column: 36, scope: !2060)
!2072 = !DILocation(line: 1897, column: 19, scope: !2060)
!2073 = !DILocation(line: 1897, column: 38, scope: !2060)
!2074 = !DILocation(line: 1897, column: 52, scope: !2060)
!2075 = !DILocation(line: 1899, column: 5, scope: !2060)
!2076 = !DILocation(line: 1899, column: 20, scope: !2060)
!2077 = !DILocation(line: 1901, column: 26, scope: !2060)
!2078 = !DILocation(line: 1901, column: 36, scope: !2060)
!2079 = !DILocation(line: 1901, column: 11, scope: !2060)
!2080 = !DILocation(line: 1901, column: 9, scope: !2060)
!2081 = !DILocation(line: 1902, column: 9, scope: !2082)
!2082 = distinct !DILexicalBlock(scope: !2060, file: !2, line: 1902, column: 9)
!2083 = !DILocation(line: 1902, column: 13, scope: !2082)
!2084 = !DILocation(line: 1902, column: 9, scope: !2060)
!2085 = !DILocation(line: 1902, column: 22, scope: !2082)
!2086 = !DILocation(line: 1903, column: 40, scope: !2060)
!2087 = !DILocation(line: 1903, column: 49, scope: !2060)
!2088 = !DILocation(line: 1903, column: 58, scope: !2060)
!2089 = !DILocation(line: 1903, column: 65, scope: !2060)
!2090 = !DILocation(line: 1903, column: 70, scope: !2060)
!2091 = !DILocation(line: 1903, column: 16, scope: !2060)
!2092 = !DILocation(line: 1903, column: 5, scope: !2060)
!2093 = !DILocation(line: 1903, column: 10, scope: !2060)
!2094 = !DILocation(line: 1903, column: 14, scope: !2060)
!2095 = !DILocation(line: 1904, column: 9, scope: !2096)
!2096 = distinct !DILexicalBlock(scope: !2060, file: !2, line: 1904, column: 9)
!2097 = !DILocation(line: 1904, column: 14, scope: !2096)
!2098 = !DILocation(line: 1904, column: 18, scope: !2096)
!2099 = !DILocation(line: 1904, column: 9, scope: !2060)
!2100 = !DILocation(line: 1905, column: 18, scope: !2101)
!2101 = distinct !DILexicalBlock(scope: !2096, file: !2, line: 1904, column: 27)
!2102 = !DILocation(line: 1905, column: 2, scope: !2101)
!2103 = !DILocation(line: 1906, column: 2, scope: !2101)
!2104 = !DILocation(line: 1908, column: 12, scope: !2060)
!2105 = !DILocation(line: 1908, column: 5, scope: !2060)
!2106 = !DILocation(line: 1909, column: 1, scope: !2060)
!2107 = !DISubprogram(name: "xmlOutputBufferCreateIO__internal_alias", scope: !1530, file: !1530, line: 6852, type: !2108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!2108 = !DISubroutineType(types: !2109)
!2109 = !{!1273, !1281, !1287, !1164, !1292}
!2110 = distinct !DISubprogram(name: "xmlSaveDoc__internal_alias", scope: !2, file: !2, line: 1923, type: !2111, scopeLine: 1924, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !2114)
!2111 = !DISubroutineType(types: !2112)
!2112 = !{!2113, !1324, !1345}
!2113 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!2114 = !{!2115, !2116, !2117}
!2115 = !DILocalVariable(name: "ctxt", arg: 1, scope: !2110, file: !2, line: 1923, type: !1324)
!2116 = !DILocalVariable(name: "doc", arg: 2, scope: !2110, file: !2, line: 1923, type: !1345)
!2117 = !DILocalVariable(name: "ret", scope: !2110, file: !2, line: 1925, type: !2113)
!2118 = !DILocation(line: 1923, column: 27, scope: !2110)
!2119 = !DILocation(line: 1923, column: 43, scope: !2110)
!2120 = !DILocation(line: 1925, column: 5, scope: !2110)
!2121 = !DILocation(line: 1925, column: 10, scope: !2110)
!2122 = !{!2123, !2123, i64 0}
!2123 = !{!"long", !1473, i64 0}
!2124 = !DILocation(line: 1927, column: 10, scope: !2125)
!2125 = distinct !DILexicalBlock(scope: !2110, file: !2, line: 1927, column: 9)
!2126 = !DILocation(line: 1927, column: 15, scope: !2125)
!2127 = !DILocation(line: 1927, column: 24, scope: !2125)
!2128 = !DILocation(line: 1927, column: 28, scope: !2125)
!2129 = !DILocation(line: 1927, column: 32, scope: !2125)
!2130 = !DILocation(line: 1927, column: 9, scope: !2110)
!2131 = !DILocation(line: 1927, column: 42, scope: !2125)
!2132 = !DILocation(line: 1928, column: 33, scope: !2133)
!2133 = distinct !DILexicalBlock(scope: !2110, file: !2, line: 1928, column: 9)
!2134 = !DILocation(line: 1928, column: 39, scope: !2133)
!2135 = !DILocation(line: 1928, column: 9, scope: !2133)
!2136 = !DILocation(line: 1928, column: 44, scope: !2133)
!2137 = !DILocation(line: 1928, column: 9, scope: !2110)
!2138 = !DILocation(line: 1929, column: 9, scope: !2133)
!2139 = !DILocation(line: 1930, column: 12, scope: !2110)
!2140 = !DILocation(line: 1930, column: 5, scope: !2110)
!2141 = !DILocation(line: 1931, column: 1, scope: !2110)
!2142 = distinct !DISubprogram(name: "xmlDocContentDumpOutput", scope: !2, file: !2, line: 1097, type: !2143, scopeLine: 1097, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !2145)
!2143 = !DISubroutineType(types: !2144)
!2144 = !{!1104, !1324, !1345}
!2145 = !{!2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2158, !2159}
!2146 = !DILocalVariable(name: "ctxt", arg: 1, scope: !2142, file: !2, line: 1097, type: !1324)
!2147 = !DILocalVariable(name: "cur", arg: 2, scope: !2142, file: !2, line: 1097, type: !1345)
!2148 = !DILocalVariable(name: "dtd", scope: !2142, file: !2, line: 1099, type: !1348)
!2149 = !DILocalVariable(name: "is_xhtml", scope: !2142, file: !2, line: 1100, type: !1104)
!2150 = !DILocalVariable(name: "oldenc", scope: !2142, file: !2, line: 1102, type: !1178)
!2151 = !DILocalVariable(name: "oldctxtenc", scope: !2142, file: !2, line: 1103, type: !1178)
!2152 = !DILocalVariable(name: "encoding", scope: !2142, file: !2, line: 1104, type: !1178)
!2153 = !DILocalVariable(name: "oldescape", scope: !2142, file: !2, line: 1105, type: !1308)
!2154 = !DILocalVariable(name: "oldescapeAttr", scope: !2142, file: !2, line: 1106, type: !1308)
!2155 = !DILocalVariable(name: "buf", scope: !2142, file: !2, line: 1107, type: !1273)
!2156 = !DILocalVariable(name: "enc", scope: !2142, file: !2, line: 1108, type: !2157)
!2157 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlCharEncoding", file: !1103, line: 83, baseType: !1102)
!2158 = !DILocalVariable(name: "switched_encoding", scope: !2142, file: !2, line: 1109, type: !1104)
!2159 = !DILocalVariable(name: "child", scope: !2160, file: !2, line: 1217, type: !1169)
!2160 = distinct !DILexicalBlock(scope: !2161, file: !2, line: 1216, column: 29)
!2161 = distinct !DILexicalBlock(scope: !2162, file: !2, line: 1216, column: 6)
!2162 = distinct !DILexicalBlock(scope: !2163, file: !2, line: 1155, column: 50)
!2163 = distinct !DILexicalBlock(scope: !2164, file: !2, line: 1153, column: 16)
!2164 = distinct !DILexicalBlock(scope: !2142, file: !2, line: 1123, column: 9)
!2165 = !DILocation(line: 1097, column: 40, scope: !2142)
!2166 = !DILocation(line: 1097, column: 56, scope: !2142)
!2167 = !DILocation(line: 1099, column: 5, scope: !2142)
!2168 = !DILocation(line: 1099, column: 15, scope: !2142)
!2169 = !DILocation(line: 1100, column: 5, scope: !2142)
!2170 = !DILocation(line: 1100, column: 9, scope: !2142)
!2171 = !DILocation(line: 1102, column: 5, scope: !2142)
!2172 = !DILocation(line: 1102, column: 20, scope: !2142)
!2173 = !DILocation(line: 1102, column: 29, scope: !2142)
!2174 = !DILocation(line: 1102, column: 34, scope: !2142)
!2175 = !{!2176, !1472, i64 112}
!2176 = !{!"_xmlDoc", !1472, i64 0, !1473, i64 8, !1472, i64 16, !1472, i64 24, !1472, i64 32, !1472, i64 40, !1472, i64 48, !1472, i64 56, !1472, i64 64, !1734, i64 72, !1734, i64 76, !1472, i64 80, !1472, i64 88, !1472, i64 96, !1472, i64 104, !1472, i64 112, !1472, i64 120, !1472, i64 128, !1472, i64 136, !1734, i64 144, !1472, i64 152, !1472, i64 160, !1734, i64 168, !1734, i64 172}
!2177 = !DILocation(line: 1103, column: 5, scope: !2142)
!2178 = !DILocation(line: 1103, column: 20, scope: !2142)
!2179 = !DILocation(line: 1103, column: 33, scope: !2142)
!2180 = !DILocation(line: 1103, column: 39, scope: !2142)
!2181 = !DILocation(line: 1104, column: 5, scope: !2142)
!2182 = !DILocation(line: 1104, column: 20, scope: !2142)
!2183 = !DILocation(line: 1104, column: 31, scope: !2142)
!2184 = !DILocation(line: 1104, column: 37, scope: !2142)
!2185 = !DILocation(line: 1105, column: 5, scope: !2142)
!2186 = !DILocation(line: 1105, column: 31, scope: !2142)
!2187 = !DILocation(line: 1105, column: 43, scope: !2142)
!2188 = !DILocation(line: 1105, column: 49, scope: !2142)
!2189 = !DILocation(line: 1106, column: 5, scope: !2142)
!2190 = !DILocation(line: 1106, column: 31, scope: !2142)
!2191 = !DILocation(line: 1106, column: 47, scope: !2142)
!2192 = !DILocation(line: 1106, column: 53, scope: !2142)
!2193 = !{!1733, !1472, i64 144}
!2194 = !DILocation(line: 1107, column: 5, scope: !2142)
!2195 = !DILocation(line: 1107, column: 24, scope: !2142)
!2196 = !DILocation(line: 1107, column: 30, scope: !2142)
!2197 = !DILocation(line: 1107, column: 36, scope: !2142)
!2198 = !DILocation(line: 1108, column: 5, scope: !2142)
!2199 = !DILocation(line: 1108, column: 21, scope: !2142)
!2200 = !DILocation(line: 1109, column: 5, scope: !2142)
!2201 = !DILocation(line: 1109, column: 9, scope: !2142)
!2202 = !DILocation(line: 1111, column: 5, scope: !2142)
!2203 = !DILocation(line: 1113, column: 10, scope: !2204)
!2204 = distinct !DILexicalBlock(scope: !2142, file: !2, line: 1113, column: 9)
!2205 = !DILocation(line: 1113, column: 15, scope: !2204)
!2206 = !{!2176, !1473, i64 8}
!2207 = !DILocation(line: 1113, column: 20, scope: !2204)
!2208 = !DILocation(line: 1113, column: 47, scope: !2204)
!2209 = !DILocation(line: 1114, column: 10, scope: !2204)
!2210 = !DILocation(line: 1114, column: 15, scope: !2204)
!2211 = !DILocation(line: 1114, column: 20, scope: !2204)
!2212 = !DILocation(line: 1113, column: 9, scope: !2142)
!2213 = !DILocation(line: 1115, column: 3, scope: !2204)
!2214 = !DILocation(line: 1117, column: 9, scope: !2215)
!2215 = distinct !DILexicalBlock(scope: !2142, file: !2, line: 1117, column: 9)
!2216 = !DILocation(line: 1117, column: 15, scope: !2215)
!2217 = !DILocation(line: 1117, column: 24, scope: !2215)
!2218 = !DILocation(line: 1117, column: 9, scope: !2142)
!2219 = !DILocation(line: 1118, column: 34, scope: !2220)
!2220 = distinct !DILexicalBlock(scope: !2215, file: !2, line: 1117, column: 33)
!2221 = !DILocation(line: 1118, column: 40, scope: !2220)
!2222 = !DILocation(line: 1118, column: 9, scope: !2220)
!2223 = !DILocation(line: 1118, column: 14, scope: !2220)
!2224 = !DILocation(line: 1118, column: 23, scope: !2220)
!2225 = !DILocation(line: 1119, column: 5, scope: !2220)
!2226 = !DILocation(line: 1119, column: 16, scope: !2227)
!2227 = distinct !DILexicalBlock(scope: !2215, file: !2, line: 1119, column: 16)
!2228 = !DILocation(line: 1119, column: 21, scope: !2227)
!2229 = !DILocation(line: 1119, column: 30, scope: !2227)
!2230 = !DILocation(line: 1119, column: 16, scope: !2215)
!2231 = !DILocation(line: 1120, column: 13, scope: !2232)
!2232 = distinct !DILexicalBlock(scope: !2227, file: !2, line: 1119, column: 39)
!2233 = !DILocation(line: 1120, column: 18, scope: !2232)
!2234 = !DILocation(line: 1120, column: 11, scope: !2232)
!2235 = !DILocation(line: 1121, column: 5, scope: !2232)
!2236 = !DILocation(line: 1123, column: 11, scope: !2164)
!2237 = !DILocation(line: 1123, column: 16, scope: !2164)
!2238 = !DILocation(line: 1123, column: 21, scope: !2164)
!2239 = !DILocation(line: 1123, column: 48, scope: !2164)
!2240 = !DILocation(line: 1124, column: 12, scope: !2164)
!2241 = !DILocation(line: 1124, column: 18, scope: !2164)
!2242 = !DILocation(line: 1124, column: 26, scope: !2164)
!2243 = !DILocation(line: 1124, column: 45, scope: !2164)
!2244 = !DILocation(line: 1124, column: 51, scope: !2164)
!2245 = !DILocation(line: 1125, column: 12, scope: !2164)
!2246 = !DILocation(line: 1125, column: 18, scope: !2164)
!2247 = !DILocation(line: 1125, column: 26, scope: !2164)
!2248 = !DILocation(line: 1125, column: 44, scope: !2164)
!2249 = !DILocation(line: 1125, column: 51, scope: !2164)
!2250 = !DILocation(line: 1126, column: 10, scope: !2164)
!2251 = !DILocation(line: 1126, column: 16, scope: !2164)
!2252 = !DILocation(line: 1126, column: 24, scope: !2164)
!2253 = !DILocation(line: 1123, column: 9, scope: !2142)
!2254 = !DILocation(line: 1128, column: 13, scope: !2255)
!2255 = distinct !DILexicalBlock(scope: !2256, file: !2, line: 1128, column: 13)
!2256 = distinct !DILexicalBlock(scope: !2164, file: !2, line: 1126, column: 45)
!2257 = !DILocation(line: 1128, column: 22, scope: !2255)
!2258 = !DILocation(line: 1128, column: 13, scope: !2256)
!2259 = !DILocation(line: 1129, column: 26, scope: !2255)
!2260 = !DILocation(line: 1129, column: 49, scope: !2255)
!2261 = !DILocation(line: 1129, column: 6, scope: !2255)
!2262 = !DILocation(line: 1130, column: 13, scope: !2263)
!2263 = distinct !DILexicalBlock(scope: !2256, file: !2, line: 1130, column: 13)
!2264 = !DILocation(line: 1130, column: 22, scope: !2263)
!2265 = !DILocation(line: 1130, column: 13, scope: !2256)
!2266 = !DILocation(line: 1131, column: 37, scope: !2263)
!2267 = !DILocation(line: 1131, column: 17, scope: !2263)
!2268 = !DILocation(line: 1131, column: 15, scope: !2263)
!2269 = !DILocation(line: 1131, column: 6, scope: !2263)
!2270 = !DILocation(line: 1132, column: 13, scope: !2271)
!2271 = distinct !DILexicalBlock(scope: !2256, file: !2, line: 1132, column: 13)
!2272 = !DILocation(line: 1132, column: 22, scope: !2271)
!2273 = !DILocation(line: 1132, column: 13, scope: !2256)
!2274 = !DILocation(line: 1133, column: 15, scope: !2271)
!2275 = !DILocation(line: 1133, column: 6, scope: !2271)
!2276 = !DILocation(line: 1134, column: 7, scope: !2277)
!2277 = distinct !DILexicalBlock(scope: !2256, file: !2, line: 1134, column: 6)
!2278 = !DILocation(line: 1134, column: 16, scope: !2277)
!2279 = !DILocation(line: 1134, column: 25, scope: !2277)
!2280 = !DILocation(line: 1134, column: 29, scope: !2277)
!2281 = !DILocation(line: 1134, column: 40, scope: !2277)
!2282 = !DILocation(line: 1134, column: 49, scope: !2277)
!2283 = !DILocation(line: 1135, column: 7, scope: !2277)
!2284 = !DILocation(line: 1135, column: 12, scope: !2277)
!2285 = !{!1761, !1472, i64 24}
!2286 = !DILocation(line: 1135, column: 20, scope: !2277)
!2287 = !DILocation(line: 1135, column: 29, scope: !2277)
!2288 = !DILocation(line: 1135, column: 33, scope: !2277)
!2289 = !DILocation(line: 1135, column: 38, scope: !2277)
!2290 = !{!1761, !1472, i64 40}
!2291 = !DILocation(line: 1135, column: 43, scope: !2277)
!2292 = !DILocation(line: 1134, column: 6, scope: !2256)
!2293 = !DILocation(line: 1136, column: 32, scope: !2294)
!2294 = distinct !DILexicalBlock(scope: !2295, file: !2, line: 1136, column: 10)
!2295 = distinct !DILexicalBlock(scope: !2277, file: !2, line: 1135, column: 53)
!2296 = !DILocation(line: 1136, column: 52, scope: !2294)
!2297 = !DILocation(line: 1136, column: 10, scope: !2294)
!2298 = !DILocation(line: 1136, column: 62, scope: !2294)
!2299 = !DILocation(line: 1136, column: 10, scope: !2295)
!2300 = !DILocation(line: 1137, column: 19, scope: !2301)
!2301 = distinct !DILexicalBlock(scope: !2294, file: !2, line: 1136, column: 67)
!2302 = !DILocation(line: 1137, column: 3, scope: !2301)
!2303 = !DILocation(line: 1137, column: 8, scope: !2301)
!2304 = !DILocation(line: 1137, column: 17, scope: !2301)
!2305 = !DILocation(line: 1138, column: 3, scope: !2301)
!2306 = !DILocation(line: 1140, column: 2, scope: !2295)
!2307 = !DILocation(line: 1141, column: 13, scope: !2308)
!2308 = distinct !DILexicalBlock(scope: !2256, file: !2, line: 1141, column: 13)
!2309 = !DILocation(line: 1141, column: 19, scope: !2308)
!2310 = !DILocation(line: 1141, column: 27, scope: !2308)
!2311 = !DILocation(line: 1141, column: 13, scope: !2256)
!2312 = !DILocation(line: 1142, column: 37, scope: !2308)
!2313 = !DILocation(line: 1142, column: 42, scope: !2308)
!2314 = !DILocation(line: 1143, column: 51, scope: !2308)
