; ModuleID = 'samples/777.bc'
source_filename = "libyasm/hamt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HAMT = type { %struct.HAMTEntryHead, ptr, ptr, ptr, ptr, ptr }
%struct.HAMTEntryHead = type { ptr, ptr }
%struct.HAMTNode = type { i64, i64 }
%struct.HAMTEntry = type { %struct.anon, ptr, ptr }
%struct.anon = type { ptr }

@yasm_xmalloc = external global ptr, align 8
@yasm_xfree = external global ptr, align 8
@.str = private unnamed_addr constant [15 x i8] c"libyasm/hamt.c\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [39 x i8] c"Value is seen as subtrie (misaligned?)\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [38 x i8] c"Data is seen as subtrie (misaligned?)\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [60 x i8] c"Subtrie is seen as subtrie before flag is set (misaligned?)\00", align 1, !dbg !17

; Function Attrs: nounwind uwtable
define dso_local ptr @HAMT_create(i32 noundef %nocase, ptr noundef %error_func) #0 !dbg !57 {
entry:
  %nocase.addr = alloca i32, align 4
  %error_func.addr = alloca ptr, align 8
  %hamt = alloca ptr, align 8
  %i = alloca i32, align 4
  store i32 %nocase, ptr %nocase.addr, align 4, !tbaa !93
  tail call void @llvm.dbg.declare(metadata ptr %nocase.addr, metadata !89, metadata !DIExpression()), !dbg !97
  store ptr %error_func, ptr %error_func.addr, align 8, !tbaa !98

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 238, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "libyasm/hamt.c", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "05cf2fe165661a55abc1330ff3d79bf0")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 15)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 238, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 39)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 241, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 38)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 286, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 60)
!22 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !23, globals: !49, splitDebugInlining: false, nameTableKind: None)
!23 = !{!24, !25, !28, !27, !42, !48}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !26, line: 90, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!27 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAMTEntry", file: !30, line: 40, baseType: !31)
!30 = !DIFile(filename: "libyasm/hamt.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "ee0aefbcc035f779a3961203e3690615")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HAMTEntry", file: !2, line: 40, size: 192, elements: !32)
!32 = !{!33, !38, !41}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !2, line: 41, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !31, file: !2, line: 41, size: 64, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !34, file: !2, line: 41, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !31, file: !2, line: 42, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !31, file: !2, line: 43, baseType: !24, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAMTNode", file: !2, line: 49, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HAMTNode", file: !2, line: 46, size: 128, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "BitMapKey", scope: !44, file: !2, line: 47, baseType: !27, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "BaseValue", scope: !44, file: !2, line: 48, baseType: !25, size: 64, offset: 64)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!0, !7, !12, !17}
!50 = !{i32 7, !"Dwarf Version", i32 5}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{i32 1, !"wchar_size", i32 4}
!53 = !{i32 8, !"PIC Level", i32 2}
!54 = !{i32 7, !"PIE Level", i32 2}
!55 = !{i32 7, !"uwtable", i32 2}
!56 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!57 = distinct !DISubprogram(name: "HAMT_create", scope: !2, file: !2, line: 117, type: !58, scopeLine: 119, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !22, retainedNodes: !88)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !48, !72}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAMT", file: !30, line: 38, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HAMT", file: !2, line: 51, size: 448, elements: !63)
!63 = !{!64, !70, !71, !76, !80, !84}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !62, file: !2, line: 52, baseType: !65, size: 128)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HAMTEntryHead", file: !2, line: 52, size: 128, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !65, file: !2, line: 52, baseType: !37, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !65, file: !2, line: 52, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !62, file: !2, line: 53, baseType: !42, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "error_func", scope: !62, file: !2, line: 54, baseType: !72, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !39, !75, !39}
!75 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "HashKey", scope: !62, file: !2, line: 56, baseType: !77, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!27, !39}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ReHashKey", scope: !62, file: !2, line: 57, baseType: !81, size: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!27, !39, !48}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "CmpKey", scope: !62, file: !2, line: 58, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!48, !39, !39}
!88 = !{!89, !90, !91, !92}
!89 = !DILocalVariable(name: "nocase", arg: 1, scope: !57, file: !2, line: 117, type: !48)
!90 = !DILocalVariable(name: "error_func", arg: 2, scope: !57, file: !2, line: 117, type: !72)
!91 = !DILocalVariable(name: "hamt", scope: !57, file: !2, line: 120, type: !60)
!92 = !DILocalVariable(name: "i", scope: !57, file: !2, line: 121, type: !48)
!93 = !{!94, !94, i64 0}
!94 = !{!"int", !95, i64 0}
!95 = !{!"omnipotent char", !96, i64 0}
!96 = !{!"Simple C/C++ TBAA"}
!97 = !DILocation(line: 117, column: 17, scope: !57)
!98 = !{!99, !99, i64 0}
!99 = !{!"any pointer", !95, i64 0}
!100 = !DILocation(line: 117, column: 44, scope: !57)
!101 = !DILocation(line: 120, column: 15, scope: !57)
!102 = !DILocation(line: 120, column: 21, scope: !57)
!103 = !DILocation(line: 120, column: 28, scope: !57)
!104 = !DILocation(line: 121, column: 5, scope: !57)
!105 = !DILocation(line: 121, column: 9, scope: !57)
!106 = !DILocation(line: 123, column: 5, scope: !57)
!107 = !DILocation(line: 123, column: 5, scope: !108)
!108 = distinct !DILexicalBlock(scope: !57, file: !2, line: 123, column: 5)
!109 = !{!110, !99, i64 0}
!110 = !{!"HAMT", !111, i64 0, !99, i64 16, !99, i64 24, !99, i64 32, !99, i64 40, !99, i64 48}
!111 = !{!"HAMTEntryHead", !99, i64 0, !99, i64 8}
!112 = !{!110, !99, i64 8}
!113 = !DILocation(line: 124, column: 18, scope: !57)
!114 = !DILocation(line: 124, column: 5, scope: !57)
!115 = !DILocation(line: 124, column: 11, scope: !57)
!116 = !DILocation(line: 124, column: 16, scope: !57)
!117 = !{!110, !99, i64 16}
!118 = !DILocation(line: 126, column: 11, scope: !119)
!119 = distinct !DILexicalBlock(scope: !57, file: !2, line: 126, column: 5)
!120 = !DILocation(line: 126, column: 10, scope: !119)
!121 = !DILocation(line: 126, column: 15, scope: !122)
!122 = distinct !DILexicalBlock(scope: !119, file: !2, line: 126, column: 5)
!123 = !DILocation(line: 126, column: 16, scope: !122)
!124 = !DILocation(line: 126, column: 5, scope: !119)
!125 = !DILocation(line: 127, column: 9, scope: !126)
!126 = distinct !DILexicalBlock(scope: !122, file: !2, line: 126, column: 26)
!127 = !DILocation(line: 127, column: 15, scope: !126)
!128 = !DILocation(line: 127, column: 20, scope: !126)
!129 = !DILocation(line: 127, column: 23, scope: !126)
!130 = !DILocation(line: 127, column: 33, scope: !126)
!131 = !{!132, !133, i64 0}
!132 = !{!"HAMTNode", !133, i64 0, !133, i64 8}
!133 = !{!"long", !95, i64 0}
!134 = !DILocation(line: 128, column: 9, scope: !126)
!135 = !DILocation(line: 128, column: 15, scope: !126)
!136 = !DILocation(line: 128, column: 20, scope: !126)
!137 = !DILocation(line: 128, column: 23, scope: !126)
!138 = !DILocation(line: 128, column: 33, scope: !126)
!139 = !{!132, !133, i64 8}
!140 = !DILocation(line: 129, column: 5, scope: !126)
!141 = !DILocation(line: 126, column: 22, scope: !122)
!142 = !DILocation(line: 126, column: 5, scope: !122)
!143 = distinct !{!143, !124, !144, !145}
!144 = !DILocation(line: 129, column: 5, scope: !119)
!145 = !{!"llvm.loop.mustprogress"}
!146 = !DILocation(line: 131, column: 24, scope: !57)
!147 = !DILocation(line: 131, column: 5, scope: !57)
!148 = !DILocation(line: 131, column: 11, scope: !57)
!149 = !DILocation(line: 131, column: 22, scope: !57)
!150 = !{!110, !99, i64 24}
!151 = !DILocation(line: 132, column: 9, scope: !152)
!152 = distinct !DILexicalBlock(scope: !57, file: !2, line: 132, column: 9)
!153 = !DILocation(line: 132, column: 9, scope: !57)
!154 = !DILocation(line: 133, column: 9, scope: !155)
!155 = distinct !DILexicalBlock(scope: !152, file: !2, line: 132, column: 17)
!156 = !DILocation(line: 133, column: 15, scope: !155)
!157 = !DILocation(line: 133, column: 23, scope: !155)
!158 = !{!110, !99, i64 32}
