; ModuleID = 'samples/784.bc'
source_filename = "src/tools/gt_patternmatch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Pmatchoptions = type { i64, i64, i64, i8, i8, i8, ptr }
%struct.Suffixarray = type { ptr, %struct.Definedunsignedlong, %struct.Definedunsignedlong, %struct.Defineddouble, %struct.Definedunsignedlong, i32, i8, i64, ptr, ptr, ptr, ptr, i32, ptr, %struct.GtBufferedfile_uint32_t, %struct.GtBufferedfile_GtUword, %struct.GtBufferedfile_GtUchar, %struct.GtBufferedfile_GtUchar, %struct.GtBufferedfile_Largelcpvalue }
%struct.Defineddouble = type { i8, double }
%struct.Definedunsignedlong = type { i8, i64 }
%struct.GtBufferedfile_uint32_t = type { i32, i32, ptr, ptr }
%struct.GtBufferedfile_GtUword = type { i32, i32, ptr, ptr }
%struct.GtBufferedfile_GtUchar = type { i32, i32, ptr, ptr }
%struct.GtBufferedfile_Largelcpvalue = type { i32, i32, ptr, ptr }
%struct.GtBucketspecification = type { i64, i64, i64 }
%struct.Lcpinterval = type { i64, i64, i64 }

@stderr = external global ptr, align 8

!113 = distinct !DIGlobalVariable(scope: null, file: !2, line: 175, type: !114, isLocal: true, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 41)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(scope: null, file: !2, line: 47, type: !9, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(scope: null, file: !2, line: 54, type: !9, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 31)
!126 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !127, retainedTypes: !142, globals: !150, splitDebugInlining: false, nameTableKind: None)
!127 = !{!128, !135}
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GtOPrval", file: !129, line: 35, baseType: !130, size: 32, elements: !131)
!129 = !DIFile(filename: "src/core/option_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "4af8e95b11f2236d309c3019659f4935")
!130 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!131 = !{!132, !133, !134}
!132 = !DIEnumerator(name: "GT_OPTION_PARSER_OK", value: 0)
!133 = !DIEnumerator(name: "GT_OPTION_PARSER_ERROR", value: 1)
!134 = !DIEnumerator(name: "GT_OPTION_PARSER_REQUESTS_EXIT", value: 2)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GtReadmode", file: !136, line: 23, baseType: !130, size: 32, elements: !137)
!136 = !DIFile(filename: "src/core/readmode_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1b062e226e296972a431b9bfcad13aa9")
!137 = !{!138, !139, !140, !141}
!138 = !DIEnumerator(name: "GT_READMODE_FORWARD", value: 0)
!139 = !DIEnumerator(name: "GT_READMODE_REVERSE", value: 1)
!140 = !DIEnumerator(name: "GT_READMODE_COMPL", value: 2)
!141 = !DIEnumerator(name: "GT_READMODE_REVCOMPL", value: 3)
!142 = !{!143, !130, !146, !147, !148}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !144, line: 83, baseType: !145)
!144 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!145 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!147 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUchar", file: !144, line: 102, baseType: !149)
!149 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!150 = !{!0, !7, !12, !18, !23, !28, !33, !38, !43, !48, !53, !58, !60, !62, !67, !72, !77, !82, !87, !89, !91, !93, !98, !100, !102, !107, !112, !117, !119, !121}
!151 = !{i32 7, !"Dwarf Version", i32 5}
!152 = !{i32 2, !"Debug Info Version", i32 3}
!153 = !{i32 1, !"wchar_size", i32 4}
!154 = !{i32 8, !"PIC Level", i32 2}
!155 = !{i32 7, !"uwtable", i32 2}
!156 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!157 = distinct !DISubprogram(name: "gt_patternmatch", scope: !2, file: !2, line: 300, type: !158, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !166)
!158 = !DISubroutineType(types: !159)
!159 = !{!147, !147, !160, !162}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !164, line: 44, baseType: !165)
!164 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !164, line: 44, flags: DIFlagFwdDecl)
!166 = !{!167, !168, !169, !170, !172, !173, !188}
!167 = !DILocalVariable(name: "argc", arg: 1, scope: !157, file: !2, line: 300, type: !147)
!168 = !DILocalVariable(name: "argv", arg: 2, scope: !157, file: !2, line: 300, type: !160)
!169 = !DILocalVariable(name: "err", arg: 3, scope: !157, file: !2, line: 300, type: !162)
!170 = !DILocalVariable(name: "haserr", scope: !157, file: !2, line: 302, type: !171)
!171 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!172 = !DILocalVariable(name: "parsed_args", scope: !157, file: !2, line: 303, type: !147)
!173 = !DILocalVariable(name: "pmopt", scope: !157, file: !2, line: 304, type: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmatchoptions", file: !2, line: 38, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 33, size: 320, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !183}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "minpatternlen", scope: !175, file: !2, line: 35, baseType: !143, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "maxpatternlen", scope: !175, file: !2, line: 35, baseType: !143, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "numofsamples", scope: !175, file: !2, line: 35, baseType: !143, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "showpatt", scope: !175, file: !2, line: 36, baseType: !171, size: 8, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "usebcktab", scope: !175, file: !2, line: 36, baseType: !171, size: 8, offset: 200)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "immediate", scope: !175, file: !2, line: 36, baseType: !171, size: 8, offset: 208)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "indexname", scope: !175, file: !2, line: 37, baseType: !184, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStr", file: !186, line: 27, baseType: !187)
!186 = !DIFile(filename: "src/core/str_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "654ceffd2f9ff17a42a8522fe21401e1")
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStr", file: !186, line: 27, flags: DIFlagFwdDecl)
!188 = !DILocalVariable(name: "oprval", scope: !157, file: !2, line: 305, type: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOPrval", file: !129, line: 48, baseType: !128)
!190 = !{!191, !191, i64 0}
!191 = !{!"int", !192, i64 0}
!192 = !{!"omnipotent char", !193, i64 0}
!193 = !{!"Simple C/C++ TBAA"}
!194 = !DILocation(line: 300, column: 25, scope: !157)
!195 = !{!196, !196, i64 0}
!196 = !{!"any pointer", !192, i64 0}
!197 = !DILocation(line: 300, column: 44, scope: !157)
!198 = !DILocation(line: 300, column: 59, scope: !157)
!199 = !DILocation(line: 302, column: 3, scope: !157)
!200 = !DILocation(line: 302, column: 8, scope: !157)
!201 = !{!202, !202, i64 0}
!202 = !{!"_Bool", !192, i64 0}
!203 = !DILocation(line: 303, column: 3, scope: !157)
!204 = !DILocation(line: 303, column: 7, scope: !157)
!205 = !DILocation(line: 304, column: 3, scope: !157)
!206 = !DILocation(line: 304, column: 17, scope: !157)
!207 = !DILocation(line: 305, column: 3, scope: !157)
!208 = !DILocation(line: 305, column: 12, scope: !157)
!209 = !DILocation(line: 307, column: 3, scope: !157)
!210 = !DILocation(line: 307, column: 3, scope: !211)
!211 = distinct !DILexicalBlock(scope: !212, file: !2, line: 307, column: 3)
!212 = distinct !DILexicalBlock(scope: !157, file: !2, line: 307, column: 3)
!213 = !DILocation(line: 307, column: 3, scope: !212)
!214 = !DILocation(line: 307, column: 3, scope: !215)
!215 = distinct !DILexicalBlock(scope: !211, file: !2, line: 307, column: 3)
!216 = !DILocation(line: 309, column: 21, scope: !157)
!217 = !DILocation(line: 309, column: 9, scope: !157)
!218 = !DILocation(line: 309, column: 19, scope: !157)
!219 = !{!220, !196, i64 32}
!220 = !{!"", !221, i64 0, !221, i64 8, !221, i64 16, !202, i64 24, !202, i64 25, !202, i64 26, !196, i64 32}
!221 = !{!"long", !192, i64 0}
!222 = !DILocation(line: 310, column: 47, scope: !157)
!223 = !DILocation(line: 310, column: 53, scope: !157)
!224 = !DILocation(line: 310, column: 59, scope: !157)
!225 = !DILocation(line: 310, column: 12, scope: !157)
!226 = !DILocation(line: 310, column: 10, scope: !157)
!227 = !{!192, !192, i64 0}
!228 = !DILocation(line: 311, column: 7, scope: !229)
!229 = distinct !DILexicalBlock(scope: !157, file: !2, line: 311, column: 7)
!230 = !DILocation(line: 311, column: 14, scope: !229)
!231 = !DILocation(line: 311, column: 7, scope: !157)
!232 = !DILocation(line: 313, column: 5, scope: !233)
!233 = distinct !DILexicalBlock(scope: !229, file: !2, line: 312, column: 3)
!234 = !DILocation(line: 313, column: 5, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !2, line: 313, column: 5)
!236 = distinct !DILexicalBlock(scope: !233, file: !2, line: 313, column: 5)
!237 = !DILocation(line: 313, column: 5, scope: !236)
!238 = !DILocation(line: 313, column: 5, scope: !239)
!239 = distinct !DILexicalBlock(scope: !235, file: !2, line: 313, column: 5)
!240 = !DILocation(line: 314, column: 35, scope: !241)
!241 = distinct !DILexicalBlock(scope: !233, file: !2, line: 314, column: 9)
!242 = !DILocation(line: 314, column: 9, scope: !241)
!243 = !DILocation(line: 314, column: 40, scope: !241)
!244 = !DILocation(line: 314, column: 9, scope: !233)
!245 = !DILocation(line: 316, column: 14, scope: !246)
!246 = distinct !DILexicalBlock(scope: !241, file: !2, line: 315, column: 5)
!247 = !DILocation(line: 317, column: 5, scope: !246)
!248 = !DILocation(line: 318, column: 3, scope: !233)
!249 = !DILocation(line: 319, column: 23, scope: !157)
!250 = !DILocation(line: 319, column: 3, scope: !157)
!251 = !DILocation(line: 320, column: 7, scope: !252)
!252 = distinct !DILexicalBlock(scope: !157, file: !2, line: 320, column: 7)
!253 = !DILocation(line: 320, column: 14, scope: !252)
!254 = !DILocation(line: 320, column: 7, scope: !157)
!255 = !DILocation(line: 322, column: 5, scope: !256)
!256 = distinct !DILexicalBlock(scope: !252, file: !2, line: 321, column: 3)
!257 = !DILocation(line: 324, column: 7, scope: !258)
!258 = distinct !DILexicalBlock(scope: !157, file: !2, line: 324, column: 7)
!259 = !DILocation(line: 324, column: 14, scope: !258)
!260 = !DILocation(line: 324, column: 7, scope: !157)
!261 = !DILocation(line: 326, column: 5, scope: !262)
!262 = distinct !DILexicalBlock(scope: !258, file: !2, line: 325, column: 3)
!263 = !DILocation(line: 328, column: 10, scope: !157)
!264 = !{i8 0, i8 2}
!265 = !{}
!266 = !DILocation(line: 328, column: 3, scope: !157)
!267 = !DILocation(line: 329, column: 1, scope: !157)
!268 = !DISubprogram(name: "gt_error_is_set", scope: !164, file: !164, line: 64, type: !269, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!269 = !DISubroutineType(types: !270)
!270 = !{!171, !271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!273 = !DISubprogram(name: "fprintf", scope: !274, file: !274, line: 350, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!274 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!275 = !DISubroutineType(types: !276)
!276 = !{!147, !277, !334, null}
!277 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !280, line: 7, baseType: !281)
!280 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !282, line: 49, size: 1728, elements: !283)
!282 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!283 = !{!284, !285, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !300, !302, !303, !304, !308, !310, !312, !316, !319, !321, !324, !327, !328, !329, !332, !333}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !281, file: !282, line: 51, baseType: !147, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !281, file: !282, line: 54, baseType: !286, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !281, file: !282, line: 55, baseType: !286, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !281, file: !282, line: 56, baseType: !286, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !281, file: !282, line: 57, baseType: !286, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !281, file: !282, line: 58, baseType: !286, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !281, file: !282, line: 59, baseType: !286, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !281, file: !282, line: 60, baseType: !286, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !281, file: !282, line: 61, baseType: !286, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !281, file: !282, line: 64, baseType: !286, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !281, file: !282, line: 65, baseType: !286, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !281, file: !282, line: 66, baseType: !286, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !281, file: !282, line: 68, baseType: !298, size: 64, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !282, line: 36, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !281, file: !282, line: 70, baseType: !301, size: 64, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !281, file: !282, line: 72, baseType: !147, size: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !281, file: !282, line: 73, baseType: !147, size: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !281, file: !282, line: 74, baseType: !305, size: 64, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !306, line: 152, baseType: !307)
!306 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!307 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !281, file: !282, line: 77, baseType: !309, size: 16, offset: 1024)
!309 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !281, file: !282, line: 78, baseType: !311, size: 8, offset: 1040)
!311 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !281, file: !282, line: 79, baseType: !313, size: 8, offset: 1048)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 1)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !281, file: !282, line: 81, baseType: !317, size: 64, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !282, line: 43, baseType: null)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !281, file: !282, line: 89, baseType: !320, size: 64, offset: 1152)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !306, line: 153, baseType: !307)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !281, file: !282, line: 91, baseType: !322, size: 64, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !282, line: 37, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !281, file: !282, line: 92, baseType: !325, size: 64, offset: 1280)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !282, line: 38, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !281, file: !282, line: 93, baseType: !301, size: 64, offset: 1344)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !281, file: !282, line: 94, baseType: !146, size: 64, offset: 1408)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !281, file: !282, line: 95, baseType: !330, size: 64, offset: 1472)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !331, line: 70, baseType: !145)
!331 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !281, file: !282, line: 96, baseType: !147, size: 32, offset: 1536)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !281, file: !282, line: 98, baseType: !25, size: 160, offset: 1568)
!334 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !161)
!335 = !DISubprogram(name: "abort", scope: !336, file: !336, line: 598, type: !337, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!336 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!337 = !DISubroutineType(types: !338)
!338 = !{null}
!339 = !DISubprogram(name: "gt_str_new", scope: !186, file: !186, line: 30, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!340 = !DISubroutineType(types: !341)
!341 = !{!184}
!342 = distinct !DISubprogram(name: "parse_options", scope: !2, file: !2, line: 245, type: !343, scopeLine: 248, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !347)
!343 = !DISubroutineType(types: !344)
!344 = !{!189, !345, !346, !147, !160, !162}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!347 = !{!348, !349, !350, !351, !352, !353, !357, !361, !362, !363}
!348 = !DILocalVariable(name: "pmopt", arg: 1, scope: !342, file: !2, line: 245, type: !345)
!349 = !DILocalVariable(name: "parsed_args", arg: 2, scope: !342, file: !2, line: 246, type: !346)
!350 = !DILocalVariable(name: "argc", arg: 3, scope: !342, file: !2, line: 247, type: !147)
!351 = !DILocalVariable(name: "argv", arg: 4, scope: !342, file: !2, line: 247, type: !160)
!352 = !DILocalVariable(name: "err", arg: 5, scope: !342, file: !2, line: 247, type: !162)
!353 = !DILocalVariable(name: "op", scope: !342, file: !2, line: 249, type: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOptionParser", file: !129, line: 27, baseType: !356)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtOptionParser", file: !129, line: 27, flags: DIFlagFwdDecl)
!357 = !DILocalVariable(name: "option", scope: !342, file: !2, line: 250, type: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOption", file: !129, line: 33, baseType: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtOption", file: !129, line: 33, flags: DIFlagFwdDecl)
!361 = !DILocalVariable(name: "optionimm", scope: !342, file: !2, line: 250, type: !358)
!362 = !DILocalVariable(name: "optionbck", scope: !342, file: !2, line: 250, type: !358)
!363 = !DILocalVariable(name: "oprval", scope: !342, file: !2, line: 251, type: !189)
!364 = !DILocation(line: 245, column: 46, scope: !342)
!365 = !DILocation(line: 246, column: 36, scope: !342)
!366 = !DILocation(line: 247, column: 35, scope: !342)
!367 = !DILocation(line: 247, column: 54, scope: !342)
!368 = !DILocation(line: 247, column: 69, scope: !342)
!369 = !DILocation(line: 249, column: 3, scope: !342)
!370 = !DILocation(line: 249, column: 19, scope: !342)
!371 = !DILocation(line: 250, column: 3, scope: !342)
!372 = !DILocation(line: 250, column: 13, scope: !342)
!373 = !DILocation(line: 250, column: 22, scope: !342)
!374 = !DILocation(line: 250, column: 34, scope: !342)
!375 = !DILocation(line: 251, column: 3, scope: !342)
!376 = !DILocation(line: 251, column: 12, scope: !342)
!377 = !DILocation(line: 253, column: 3, scope: !342)
!378 = !DILocation(line: 253, column: 3, scope: !379)
!379 = distinct !DILexicalBlock(scope: !380, file: !2, line: 253, column: 3)
!380 = distinct !DILexicalBlock(scope: !342, file: !2, line: 253, column: 3)
!381 = !DILocation(line: 253, column: 3, scope: !380)
!382 = !DILocation(line: 253, column: 3, scope: !383)
!383 = distinct !DILexicalBlock(scope: !379, file: !2, line: 253, column: 3)
!384 = !DILocation(line: 254, column: 8, scope: !342)
!385 = !DILocation(line: 254, column: 6, scope: !342)
!386 = !DILocation(line: 256, column: 37, scope: !342)
!387 = !DILocation(line: 256, column: 3, scope: !342)
!388 = !DILocation(line: 259, column: 29, scope: !342)
!389 = !DILocation(line: 259, column: 36, scope: !342)
!390 = !DILocation(line: 258, column: 12, scope: !342)
!391 = !DILocation(line: 258, column: 10, scope: !342)
!392 = !DILocation(line: 261, column: 31, scope: !342)
!393 = !DILocation(line: 261, column: 35, scope: !342)
!394 = !DILocation(line: 261, column: 3, scope: !342)
!395 = !DILocation(line: 263, column: 30, scope: !342)
!396 = !DILocation(line: 263, column: 37, scope: !342)
!397 = !DILocation(line: 262, column: 12, scope: !342)
!398 = !DILocation(line: 262, column: 10, scope: !342)
!399 = !DILocation(line: 265, column: 31, scope: !342)
!400 = !DILocation(line: 265, column: 35, scope: !342)
!401 = !DILocation(line: 265, column: 3, scope: !342)
!402 = !DILocation(line: 268, column: 30, scope: !342)
!403 = !DILocation(line: 268, column: 37, scope: !342)
!404 = !DILocation(line: 267, column: 12, scope: !342)
!405 = !DILocation(line: 267, column: 10, scope: !342)
!406 = !DILocation(line: 270, column: 31, scope: !342)
!407 = !DILocation(line: 270, column: 35, scope: !342)
!408 = !DILocation(line: 270, column: 3, scope: !342)
!409 = !DILocation(line: 273, column: 30, scope: !342)
!410 = !DILocation(line: 273, column: 37, scope: !342)
!411 = !DILocation(line: 272, column: 12, scope: !342)
!412 = !DILocation(line: 272, column: 10, scope: !342)
!413 = !DILocation(line: 275, column: 31, scope: !342)
!414 = !DILocation(line: 275, column: 35, scope: !342)
!415 = !DILocation(line: 275, column: 3, scope: !342)
!416 = !DILocation(line: 278, column: 32, scope: !342)
!417 = !DILocation(line: 278, column: 39, scope: !342)
!418 = !DILocation(line: 277, column: 15, scope: !342)
!419 = !DILocation(line: 277, column: 13, scope: !342)
!420 = !DILocation(line: 280, column: 31, scope: !342)
!421 = !DILocation(line: 280, column: 35, scope: !342)
!422 = !DILocation(line: 280, column: 3, scope: !342)
!423 = !DILocation(line: 283, column: 32, scope: !342)
!424 = !DILocation(line: 283, column: 39, scope: !342)
!425 = !DILocation(line: 282, column: 15, scope: !342)
!426 = !DILocation(line: 282, column: 13, scope: !342)
!427 = !DILocation(line: 285, column: 31, scope: !342)
!428 = !DILocation(line: 285, column: 35, scope: !342)
!429 = !DILocation(line: 285, column: 3, scope: !342)
!430 = !DILocation(line: 289, column: 30, scope: !342)
!431 = !DILocation(line: 289, column: 37, scope: !342)
!432 = !DILocation(line: 287, column: 12, scope: !342)
!433 = !DILocation(line: 287, column: 10, scope: !342)
!434 = !DILocation(line: 290, column: 31, scope: !342)
!435 = !DILocation(line: 290, column: 35, scope: !342)
!436 = !DILocation(line: 290, column: 3, scope: !342)
!437 = !DILocation(line: 291, column: 26, scope: !342)
!438 = !DILocation(line: 291, column: 3, scope: !342)
!439 = !DILocation(line: 293, column: 35, scope: !342)
!440 = !DILocation(line: 293, column: 39, scope: !342)
!441 = !DILocation(line: 293, column: 52, scope: !342)
!442 = !DILocation(line: 293, column: 58, scope: !342)
!443 = !DILocation(line: 294, column: 48, scope: !342)
!444 = !DILocation(line: 293, column: 12, scope: !342)
!445 = !DILocation(line: 293, column: 10, scope: !342)
!446 = !DILocation(line: 295, column: 27, scope: !342)
!447 = !DILocation(line: 295, column: 3, scope: !342)
!448 = !DILocation(line: 297, column: 10, scope: !342)
!449 = !DILocation(line: 298, column: 1, scope: !342)
!450 = !DILocation(line: 297, column: 3, scope: !342)
!451 = distinct !DISubprogram(name: "callpatternmatcher", scope: !2, file: !2, line: 67, type: !452, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !456)
!452 = !DISubroutineType(types: !453)
!453 = !{!147, !454, !162}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!456 = !{!457, !458, !459, !553, !554, !555, !556, !557, !558, !561, !562, !567, !568, !573, !574, !581, !586, !594, !595, !599, !600, !601, !602, !603, !606, !610}
!457 = !DILocalVariable(name: "pmopt", arg: 1, scope: !451, file: !2, line: 67, type: !454)
!458 = !DILocalVariable(name: "err", arg: 2, scope: !451, file: !2, line: 67, type: !162)
!459 = !DILocalVariable(name: "suffixarray", scope: !451, file: !2, line: 69, type: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "Suffixarray", file: !461, line: 88, baseType: !462)
!461 = !DIFile(filename: "src/match/sarr-def.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "680305296307322e88a803109233df34")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !461, line: 63, size: 2048, elements: !463)
!463 = !{!464, !469, !476, !477, !484, !485, !487, !488, !489, !493, !496, !505, !506, !507, !512, !524, !534, !543, !544}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "encseq", scope: !462, file: !461, line: 65, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseq", file: !467, line: 48, baseType: !468)
!467 = !DIFile(filename: "src/core/encseq_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "bab4512cadee996edd2995020539d931")
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncseq", file: !467, line: 48, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "numoflargelcpvalues", scope: !462, file: !461, line: 66, baseType: !470, size: 128, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "Definedunsignedlong", file: !471, line: 28, baseType: !472)
!471 = !DIFile(filename: "src/core/defined-types.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e7a1f5519c7b299f300cac0dd118ae65")
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 24, size: 128, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "defined", scope: !472, file: !471, line: 26, baseType: !171, size: 8)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "valueunsignedlong", scope: !472, file: !471, line: 27, baseType: !143, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "maxbranchdepth", scope: !462, file: !461, line: 67, baseType: !470, size: 128, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "averagelcp", scope: !462, file: !461, line: 68, baseType: !478, size: 128, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "Defineddouble", file: !471, line: 40, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 36, size: 128, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "defined", scope: !479, file: !471, line: 38, baseType: !171, size: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "valuedouble", scope: !479, file: !471, line: 39, baseType: !483, size: 64, offset: 64)
!483 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "longest", scope: !462, file: !461, line: 69, baseType: !470, size: 128, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "readmode", scope: !462, file: !461, line: 70, baseType: !486, size: 32, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtReadmode", file: !136, line: 32, baseType: !135)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mirroredencseq", scope: !462, file: !461, line: 71, baseType: !171, size: 8, offset: 608)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "numberofallsortedsuffixes", scope: !462, file: !461, line: 72, baseType: !143, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "suftab", scope: !462, file: !461, line: 74, baseType: !490, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESASuffixptr", file: !461, line: 59, baseType: !143)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lcptab", scope: !462, file: !461, line: 75, baseType: !494, size: 64, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "llvtab", scope: !462, file: !461, line: 76, baseType: !497, size: 64, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "Largelcpvalue", file: !500, line: 30, baseType: !501)
!500 = !DIFile(filename: "src/match/lcpoverflow.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "fbf9328cf0deca32f53d590fbcd3426d")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !500, line: 26, size: 128, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !501, file: !500, line: 28, baseType: !143, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !501, file: !500, line: 29, baseType: !143, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bwttab", scope: !462, file: !461, line: 77, baseType: !494, size: 64, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlength", scope: !462, file: !461, line: 78, baseType: !130, size: 32, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bcktab", scope: !462, file: !461, line: 79, baseType: !508, size: 64, offset: 1024)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBcktab", file: !510, line: 49, baseType: !511)
!510 = !DIFile(filename: "src/match/bcktab.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1e275b447e1ba6b734897fa227cc90a3")
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtBcktab", file: !510, line: 49, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "suftabstream_uint32_t", scope: !462, file: !461, line: 82, baseType: !513, size: 192, offset: 1088)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_uint32_t", file: !461, line: 49, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !461, line: 49, size: 192, elements: !515)
!515 = !{!516, !517, !518, !523}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !514, file: !461, line: 49, baseType: !130, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !514, file: !461, line: 49, baseType: !130, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !514, file: !461, line: 49, baseType: !519, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !521, line: 26, baseType: !522)
!521 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !306, line: 42, baseType: !130)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !514, file: !461, line: 49, baseType: !278, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "suftabstream_GtUword", scope: !462, file: !461, line: 84, baseType: !525, size: 192, offset: 1280)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_GtUword", file: !526, line: 61, baseType: !527)
!526 = !DIFile(filename: "src/match/declare-readfunc.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "efed3a700136885dfbda6df2e18c991e")
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 61, size: 192, elements: !528)
!528 = !{!529, !530, !531, !533}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !527, file: !526, line: 61, baseType: !130, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !527, file: !526, line: 61, baseType: !130, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !527, file: !526, line: 61, baseType: !532, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !527, file: !526, line: 61, baseType: !278, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bwttabstream", scope: !462, file: !461, line: 85, baseType: !535, size: 192, offset: 1472)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_GtUchar", file: !461, line: 53, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !461, line: 53, size: 192, elements: !537)
!537 = !{!538, !539, !540, !542}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !536, file: !461, line: 53, baseType: !130, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !536, file: !461, line: 53, baseType: !130, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !536, file: !461, line: 53, baseType: !541, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !536, file: !461, line: 53, baseType: !278, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lcptabstream", scope: !462, file: !461, line: 86, baseType: !535, size: 192, offset: 1664)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "llvtabstream", scope: !462, file: !461, line: 87, baseType: !545, size: 192, offset: 1856)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_Largelcpvalue", file: !461, line: 56, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !461, line: 56, size: 192, elements: !547)
!547 = !{!548, !549, !550, !552}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !546, file: !461, line: 56, baseType: !130, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !546, file: !461, line: 56, baseType: !130, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !546, file: !461, line: 56, baseType: !551, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !546, file: !461, line: 56, baseType: !278, size: 64, offset: 128)
!553 = !DILocalVariable(name: "totallength", scope: !451, file: !2, line: 70, type: !143)
!554 = !DILocalVariable(name: "haserr", scope: !451, file: !2, line: 71, type: !171)
!555 = !DILocalVariable(name: "pptr", scope: !451, file: !2, line: 72, type: !494)
!556 = !DILocalVariable(name: "patternlen", scope: !451, file: !2, line: 73, type: !143)
!557 = !DILocalVariable(name: "demand", scope: !451, file: !2, line: 74, type: !130)
!558 = !DILocalVariable(name: "trial", scope: !559, file: !2, line: 93, type: !143)
!559 = distinct !DILexicalBlock(scope: !560, file: !2, line: 92, column: 3)
!560 = distinct !DILexicalBlock(scope: !451, file: !2, line: 91, column: 7)
!561 = !DILocalVariable(name: "dbstart", scope: !559, file: !2, line: 94, type: !143)
!562 = !DILocalVariable(name: "epi", scope: !559, file: !2, line: 95, type: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Enumpatterniterator", file: !565, line: 21, baseType: !566)
!565 = !DIFile(filename: "src/match/enum-patt.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "beb9c8cb58b09ab94d8a76d2b5c2c157")
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "Enumpatterniterator", file: !565, line: 21, flags: DIFlagFwdDecl)
!567 = !DILocalVariable(name: "firstspecial", scope: !559, file: !2, line: 96, type: !130)
!568 = !DILocalVariable(name: "mmsibck", scope: !559, file: !2, line: 97, type: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtMMsearchiterator", file: !571, line: 27, baseType: !572)
!571 = !DIFile(filename: "src/match/esa-mmsearch.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7cb9f50b1f4497c3f26d86f68f33e1b7")
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtMMsearchiterator", file: !571, line: 27, flags: DIFlagFwdDecl)
!573 = !DILocalVariable(name: "mmsiimm", scope: !559, file: !2, line: 97, type: !569)
!574 = !DILocalVariable(name: "bucketspec", scope: !559, file: !2, line: 98, type: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBucketspecification", file: !510, line: 41, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !510, line: 36, size: 192, elements: !577)
!577 = !{!578, !579, !580}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !576, file: !510, line: 38, baseType: !143, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nonspecialsinbucket", scope: !576, file: !510, line: 39, baseType: !143, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "specialsinbucket", scope: !576, file: !510, line: 40, baseType: !143, size: 64, offset: 128)
!581 = !DILocalVariable(name: "bucketenumerator", scope: !559, file: !2, line: 99, type: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bucketenumerator", file: !584, line: 28, baseType: !585)
!584 = !DIFile(filename: "src/match/cutendpfx.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1d40ba9cfb9c3cde90e8a4968c6fa262")
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bucketenumerator", file: !584, line: 28, flags: DIFlagFwdDecl)
!586 = !DILocalVariable(name: "itv", scope: !559, file: !2, line: 100, type: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lcpinterval", file: !588, line: 28, baseType: !589)
!588 = !DIFile(filename: "src/match/lcpinterval.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "f84ce0d1ab0e926c629db5b5fc519a43")
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 23, size: 192, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !589, file: !588, line: 25, baseType: !143, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !589, file: !588, line: 26, baseType: !143, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !589, file: !588, line: 27, baseType: !143, size: 64, offset: 128)
!594 = !DILocalVariable(name: "refstart", scope: !559, file: !2, line: 101, type: !143)
!595 = !DILocalVariable(name: "esr1", scope: !559, file: !2, line: 102, type: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseqReader", file: !467, line: 65, baseType: !598)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncseqReader", file: !467, line: 65, flags: DIFlagFwdDecl)
!599 = !DILocalVariable(name: "esr2", scope: !559, file: !2, line: 102, type: !596)
!600 = !DILocalVariable(name: "retval", scope: !559, file: !2, line: 103, type: !147)
!601 = !DILocalVariable(name: "idx", scope: !559, file: !2, line: 104, type: !143)
!602 = !DILocalVariable(name: "maxlcp", scope: !559, file: !2, line: 104, type: !143)
!603 = !DILocalVariable(name: "code", scope: !559, file: !2, line: 105, type: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCodetype", file: !605, line: 26, baseType: !143)
!605 = !DIFile(filename: "src/core/codetype.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "d0a02833f58b7a4740e0136da08ce0e1")
!606 = !DILocalVariable(name: "multimappower", scope: !559, file: !2, line: 106, type: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!610 = !DILocalVariable(name: "alpha", scope: !559, file: !2, line: 107, type: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtAlphabet", file: !614, line: 32, baseType: !615)
!614 = !DIFile(filename: "src/core/alphabet_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0b48240ce57ca6598f5548b5c9cf52e4")
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtAlphabet", file: !614, line: 32, flags: DIFlagFwdDecl)
!616 = !DILocation(line: 67, column: 52, scope: !451)
!617 = !DILocation(line: 67, column: 68, scope: !451)
!618 = !DILocation(line: 69, column: 3, scope: !451)
!619 = !DILocation(line: 69, column: 15, scope: !451)
!620 = !DILocation(line: 70, column: 3, scope: !451)
!621 = !DILocation(line: 70, column: 11, scope: !451)
!622 = !{!221, !221, i64 0}
!623 = !DILocation(line: 71, column: 3, scope: !451)
!624 = !DILocation(line: 71, column: 8, scope: !451)
!625 = !DILocation(line: 72, column: 3, scope: !451)
!626 = !DILocation(line: 72, column: 18, scope: !451)
!627 = !DILocation(line: 73, column: 3, scope: !451)
!628 = !DILocation(line: 73, column: 11, scope: !451)
!629 = !DILocation(line: 74, column: 3, scope: !451)
!630 = !DILocation(line: 74, column: 16, scope: !451)
!631 = !DILocation(line: 76, column: 7, scope: !632)
!632 = distinct !DILexicalBlock(scope: !451, file: !2, line: 76, column: 7)
!633 = !DILocation(line: 76, column: 14, scope: !632)
!634 = !{!220, !202, i64 25}
!635 = !DILocation(line: 76, column: 7, scope: !451)
!636 = !DILocation(line: 78, column: 12, scope: !637)
!637 = distinct !DILexicalBlock(scope: !632, file: !2, line: 77, column: 3)
!638 = !DILocation(line: 79, column: 3, scope: !637)
!639 = !DILocation(line: 81, column: 22, scope: !640)
!640 = distinct !DILexicalBlock(scope: !451, file: !2, line: 80, column: 7)
!641 = !DILocation(line: 82, column: 33, scope: !640)
!642 = !DILocation(line: 82, column: 40, scope: !640)
!643 = !DILocation(line: 82, column: 22, scope: !640)
!644 = !DILocation(line: 84, column: 22, scope: !640)
