; ModuleID = 'samples/797.bc'
source_filename = "init.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.spdk_env_opts = type { ptr, ptr, i32, i32, i32, i32, i8, i8, i8, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr }
%struct.spdk_pci_addr = type { i32, i8, i8, i8 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.glob_t = type { i64, ptr, i64, i32, ptr, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [5 x i8] c"spdk\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c"0x1\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [7 x i8] c"init.c\00", align 1, !dbg !12
@__func__.spdk_env_dpdk_post_init = private unnamed_addr constant [24 x i8] c"spdk_env_dpdk_post_init\00", align 1, !dbg !17
@.str.3 = private unnamed_addr constant [23 x i8] c"pci_env_init() failed\0A\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [28 x i8] c"Failed to allocate mem_map\0A\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [30 x i8] c"Failed to initialize vtophys\0A\00", align 1, !dbg !33
@g_eal_cmdline = internal global ptr null, align 8, !dbg !38
@g_eal_cmdline_argcount = internal global i32 0, align 4, !dbg !117
@g_external_init = internal global i8 1, align 1, !dbg !119
@stderr = external global ptr, align 8

!176 = !DISubrange(count: 20)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !2, line: 369, type: !124, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 15)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !2, line: 395, type: !181, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !2, line: 430, type: !167, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 441, type: !174, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 448, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 25)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 454, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 21)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 461, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 17)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 469, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 19)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 72, elements: !147)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !25, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 167, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 49)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !2, line: 168, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 37)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !2, line: 172, type: !227, isLocal: true, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 2)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !2, line: 179, type: !9, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !2, line: 180, type: !129, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 10)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!241 = !{i32 7, !"Dwarf Version", i32 5}
!242 = !{i32 2, !"Debug Info Version", i32 3}
!243 = !{i32 1, !"wchar_size", i32 4}
!244 = !{i32 8, !"PIC Level", i32 2}
!245 = !{i32 7, !"uwtable", i32 2}
!246 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!247 = distinct !DISubprogram(name: "spdk_env_opts_init", scope: !2, file: !2, line: 92, type: !248, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !40, retainedNodes: !289)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_env_opts", file: !252, line: 47, size: 832, elements: !253)
!252 = !DIFile(filename: "include/spdk/env.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "c5bb62a61dfb30b3c4fe3f80f0d985bb")
!253 = !{!254, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !282, !283, !284, !287, !288}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !252, line: 48, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "core_mask", scope: !251, file: !252, line: 49, baseType: !255, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "shm_id", scope: !251, file: !252, line: 50, baseType: !44, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mem_channel", scope: !251, file: !252, line: 51, baseType: !44, size: 32, offset: 160)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "main_core", scope: !251, file: !252, line: 52, baseType: !44, size: 32, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !251, file: !252, line: 53, baseType: !44, size: 32, offset: 224)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "no_pci", scope: !251, file: !252, line: 54, baseType: !121, size: 8, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hugepage_single_segments", scope: !251, file: !252, line: 55, baseType: !121, size: 8, offset: 264)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_hugepage", scope: !251, file: !252, line: 56, baseType: !121, size: 8, offset: 272)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "num_pci_addr", scope: !251, file: !252, line: 57, baseType: !54, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "hugedir", scope: !251, file: !252, line: 58, baseType: !255, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pci_blocked", scope: !251, file: !252, line: 59, baseType: !267, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spdk_pci_addr", file: !252, line: 639, size: 64, elements: !269)
!269 = !{!270, !276, !280, !281}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !268, file: !252, line: 640, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !272, line: 26, baseType: !273)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !274, line: 42, baseType: !275)
!274 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!275 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !268, file: !252, line: 641, baseType: !277, size: 8, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !272, line: 24, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !274, line: 38, baseType: !279)
!279 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !268, file: !252, line: 642, baseType: !277, size: 8, offset: 40)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !268, file: !252, line: 643, baseType: !277, size: 8, offset: 48)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pci_allowed", scope: !251, file: !252, line: 60, baseType: !267, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "iova_mode", scope: !251, file: !252, line: 61, baseType: !255, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "base_virtaddr", scope: !251, file: !252, line: 62, baseType: !285, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !272, line: 27, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !274, line: 45, baseType: !56)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "env_context", scope: !251, file: !252, line: 65, baseType: !53, size: 64, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "vf_token", scope: !251, file: !252, line: 66, baseType: !255, size: 64, offset: 768)
!289 = !{!290}
!290 = !DILocalVariable(name: "opts", arg: 1, scope: !247, file: !2, line: 92, type: !250)
!291 = !DILocation(line: 92, column: 42, scope: !247)
!292 = !DILocation(line: 94, column: 7, scope: !293)
!293 = distinct !DILexicalBlock(scope: !247, file: !2, line: 94, column: 6)
!294 = !DILocation(line: 94, column: 6, scope: !247)
!295 = !DILocation(line: 95, column: 3, scope: !296)
!296 = distinct !DILexicalBlock(scope: !293, file: !2, line: 94, column: 13)
!297 = !DILocation(line: 98, column: 9, scope: !247)
!298 = !DILocation(line: 98, column: 2, scope: !247)
!299 = !DILocation(line: 100, column: 2, scope: !247)
!300 = !DILocation(line: 100, column: 8, scope: !247)
!301 = !DILocation(line: 100, column: 13, scope: !247)
!302 = !DILocation(line: 101, column: 2, scope: !247)
!303 = !DILocation(line: 101, column: 8, scope: !247)
!304 = !DILocation(line: 101, column: 18, scope: !247)
!305 = !DILocation(line: 102, column: 2, scope: !247)
!306 = !DILocation(line: 102, column: 8, scope: !247)
!307 = !DILocation(line: 102, column: 15, scope: !247)
!308 = !DILocation(line: 103, column: 2, scope: !247)
!309 = !DILocation(line: 103, column: 8, scope: !247)
!310 = !DILocation(line: 103, column: 17, scope: !247)
!311 = !DILocation(line: 104, column: 2, scope: !247)
!312 = !DILocation(line: 104, column: 8, scope: !247)
!313 = !DILocation(line: 104, column: 18, scope: !247)
!314 = !DILocation(line: 105, column: 2, scope: !247)
!315 = !DILocation(line: 105, column: 8, scope: !247)
!316 = !DILocation(line: 105, column: 20, scope: !247)
!317 = !DILocation(line: 106, column: 2, scope: !247)
!318 = !DILocation(line: 106, column: 8, scope: !247)
!319 = !DILocation(line: 106, column: 22, scope: !247)
!320 = !DILocation(line: 107, column: 1, scope: !247)
!321 = distinct !DISubprogram(name: "memset", scope: !322, file: !322, line: 57, type: !323, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !40, retainedNodes: !327)
!322 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!323 = !DISubroutineType(types: !324)
!324 = !{!53, !53, !44, !325}
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !326, line: 70, baseType: !56)
!326 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!327 = !{!328, !329, !330}
!328 = !DILocalVariable(name: "__dest", arg: 1, scope: !321, file: !322, line: 57, type: !53)
!329 = !DILocalVariable(name: "__ch", arg: 2, scope: !321, file: !322, line: 57, type: !44)
!330 = !DILocalVariable(name: "__len", arg: 3, scope: !321, file: !322, line: 57, type: !325)
!331 = !DILocation(line: 57, column: 1, scope: !321)
!332 = !DILocation(line: 59, column: 34, scope: !321)
!333 = !DILocation(line: 59, column: 42, scope: !321)
!334 = !DILocation(line: 59, column: 48, scope: !321)
!335 = !DILocation(line: 60, column: 6, scope: !321)
!336 = !DILocation(line: 59, column: 10, scope: !321)
!337 = !DILocation(line: 59, column: 3, scope: !321)
!338 = distinct !DISubprogram(name: "spdk_env_dpdk_post_init", scope: !2, file: !2, line: 483, type: !339, scopeLine: 484, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !40, retainedNodes: !341)
!339 = !DISubroutineType(types: !340)
!340 = !{!44, !121}
!341 = !{!342, !343}
!342 = !DILocalVariable(name: "legacy_mem", arg: 1, scope: !338, file: !2, line: 483, type: !121)
!343 = !DILocalVariable(name: "rc", scope: !338, file: !2, line: 485, type: !44)
!344 = !DILocation(line: 483, column: 30, scope: !338)
!345 = !DILocation(line: 485, column: 2, scope: !338)
!346 = !DILocation(line: 485, column: 6, scope: !338)
!347 = !DILocation(line: 487, column: 7, scope: !338)
!348 = !DILocation(line: 487, column: 5, scope: !338)
!349 = !DILocation(line: 488, column: 6, scope: !350)
!350 = distinct !DILexicalBlock(scope: !338, file: !2, line: 488, column: 6)
!351 = !DILocation(line: 488, column: 9, scope: !350)
!352 = !DILocation(line: 488, column: 6, scope: !338)
!353 = !DILocation(line: 489, column: 3, scope: !354)
!354 = distinct !DILexicalBlock(scope: !350, file: !2, line: 488, column: 14)
!355 = !DILocation(line: 490, column: 10, scope: !354)
!356 = !DILocation(line: 490, column: 3, scope: !354)
!357 = !DILocation(line: 493, column: 20, scope: !338)
!358 = !{i8 0, i8 2}
!359 = !{}
!360 = !DILocation(line: 493, column: 7, scope: !338)
!361 = !DILocation(line: 493, column: 5, scope: !338)
!362 = !DILocation(line: 494, column: 6, scope: !363)
!363 = distinct !DILexicalBlock(scope: !338, file: !2, line: 494, column: 6)
!364 = !DILocation(line: 494, column: 9, scope: !363)
!365 = !DILocation(line: 494, column: 6, scope: !338)
!366 = !DILocation(line: 495, column: 3, scope: !367)
!367 = distinct !DILexicalBlock(scope: !363, file: !2, line: 494, column: 14)
!368 = !DILocation(line: 496, column: 10, scope: !367)
!369 = !DILocation(line: 496, column: 3, scope: !367)
!370 = !DILocation(line: 499, column: 7, scope: !338)
!371 = !DILocation(line: 499, column: 5, scope: !338)
!372 = !DILocation(line: 500, column: 6, scope: !373)
!373 = distinct !DILexicalBlock(scope: !338, file: !2, line: 500, column: 6)
!374 = !DILocation(line: 500, column: 9, scope: !373)
!375 = !DILocation(line: 500, column: 6, scope: !338)
!376 = !DILocation(line: 501, column: 3, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !2, line: 500, column: 14)
!378 = !DILocation(line: 502, column: 10, scope: !377)
!379 = !DILocation(line: 502, column: 3, scope: !377)
!380 = !DILocation(line: 505, column: 2, scope: !338)
!381 = !DILocation(line: 506, column: 1, scope: !338)
!382 = !DISubprogram(name: "pci_env_init", scope: !383, file: !383, line: 30, type: !384, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!383 = !DIFile(filename: "./env_internal.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src/lib/env_dpdk", checksumkind: CSK_MD5, checksum: "63de6607fdba160cc841571104936d30")
!384 = !DISubroutineType(types: !385)
!385 = !{!44}
!386 = !DISubprogram(name: "spdk_log", scope: !43, file: !43, line: 156, type: !387, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !42, !255, !389, !255, !255, null}
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!390 = !DISubprogram(name: "mem_map_init", scope: !383, file: !383, line: 33, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!391 = !DISubprogram(name: "vtophys_init", scope: !383, file: !383, line: 34, type: !384, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!392 = distinct !DISubprogram(name: "spdk_env_dpdk_post_fini", scope: !2, file: !2, line: 509, type: !393, scopeLine: 510, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !40)
!393 = !DISubroutineType(types: !394)
!394 = !{null}
!395 = !DILocation(line: 511, column: 2, scope: !392)
!396 = !DILocation(line: 513, column: 12, scope: !392)
!397 = !DILocation(line: 513, column: 27, scope: !392)
!398 = !DILocation(line: 513, column: 2, scope: !392)
!399 = !DILocation(line: 514, column: 16, scope: !392)
!400 = !DILocation(line: 515, column: 25, scope: !392)
!401 = !DILocation(line: 516, column: 1, scope: !392)
!402 = !DISubprogram(name: "pci_env_fini", scope: !383, file: !383, line: 32, type: !393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!403 = distinct !DISubprogram(name: "free_args", scope: !2, file: !2, line: 110, type: !404, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !40, retainedNodes: !406)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !239, !44}
!406 = !{!407, !408, !409}
!407 = !DILocalVariable(name: "args", arg: 1, scope: !403, file: !2, line: 110, type: !239)
!408 = !DILocalVariable(name: "argcount", arg: 2, scope: !403, file: !2, line: 110, type: !44)
!409 = !DILocalVariable(name: "i", scope: !403, file: !2, line: 112, type: !44)
!410 = !DILocation(line: 110, column: 18, scope: !403)
!411 = !DILocation(line: 110, column: 28, scope: !403)
!412 = !DILocation(line: 112, column: 2, scope: !403)
!413 = !DILocation(line: 112, column: 6, scope: !403)
!414 = !DILocation(line: 114, column: 6, scope: !415)
!415 = distinct !DILexicalBlock(scope: !403, file: !2, line: 114, column: 6)
!416 = !DILocation(line: 114, column: 11, scope: !415)
!417 = !DILocation(line: 114, column: 6, scope: !403)
!418 = !DILocation(line: 115, column: 3, scope: !419)
!419 = distinct !DILexicalBlock(scope: !415, file: !2, line: 114, column: 20)
!420 = !DILocation(line: 118, column: 9, scope: !421)
!421 = distinct !DILexicalBlock(scope: !403, file: !2, line: 118, column: 2)
!422 = !DILocation(line: 118, column: 7, scope: !421)
!423 = !DILocation(line: 118, column: 14, scope: !424)
!424 = distinct !DILexicalBlock(scope: !421, file: !2, line: 118, column: 2)
!425 = !DILocation(line: 118, column: 18, scope: !424)
!426 = !DILocation(line: 118, column: 16, scope: !424)
!427 = !DILocation(line: 118, column: 2, scope: !421)
!428 = !DILocation(line: 119, column: 8, scope: !429)
!429 = distinct !DILexicalBlock(scope: !424, file: !2, line: 118, column: 33)
!430 = !DILocation(line: 119, column: 13, scope: !429)
!431 = !DILocation(line: 119, column: 3, scope: !429)
!432 = !DILocation(line: 120, column: 2, scope: !429)
!433 = !DILocation(line: 118, column: 29, scope: !424)
!434 = !DILocation(line: 118, column: 2, scope: !424)
!435 = distinct !{!435, !427, !436}
!436 = !DILocation(line: 120, column: 2, scope: !421)
!437 = !DILocation(line: 122, column: 6, scope: !438)
!438 = distinct !DILexicalBlock(scope: !403, file: !2, line: 122, column: 6)
!439 = !DILocation(line: 122, column: 6, scope: !403)
!440 = !DILocation(line: 123, column: 8, scope: !441)
!441 = distinct !DILexicalBlock(scope: !438, file: !2, line: 122, column: 16)
!442 = !DILocation(line: 123, column: 3, scope: !441)
!443 = !DILocation(line: 124, column: 2, scope: !441)
!444 = !DILocation(line: 125, column: 1, scope: !403)
!445 = distinct !DISubprogram(name: "spdk_env_init", scope: !2, file: !2, line: 519, type: !446, scopeLine: 520, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !40, retainedNodes: !450)
!446 = !DISubroutineType(types: !447)
!447 = !{!44, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458}
!451 = !DILocalVariable(name: "opts", arg: 1, scope: !445, file: !2, line: 519, type: !448)
!452 = !DILocalVariable(name: "dpdk_args", scope: !445, file: !2, line: 521, type: !239)
!453 = !DILocalVariable(name: "args_print", scope: !445, file: !2, line: 522, type: !240)
!454 = !DILocalVariable(name: "args_tmp", scope: !445, file: !2, line: 522, type: !240)
!455 = !DILocalVariable(name: "i", scope: !445, file: !2, line: 523, type: !44)
!456 = !DILocalVariable(name: "rc", scope: !445, file: !2, line: 523, type: !44)
!457 = !DILocalVariable(name: "orig_optind", scope: !445, file: !2, line: 524, type: !44)
!458 = !DILocalVariable(name: "legacy_mem", scope: !445, file: !2, line: 525, type: !121)
!459 = !DILocation(line: 519, column: 43, scope: !445)
!460 = !DILocation(line: 521, column: 2, scope: !445)
!461 = !DILocation(line: 521, column: 9, scope: !445)
!462 = !DILocation(line: 522, column: 2, scope: !445)
!463 = !DILocation(line: 522, column: 8, scope: !445)
!464 = !DILocation(line: 522, column: 28, scope: !445)
!465 = !DILocation(line: 523, column: 2, scope: !445)
!466 = !DILocation(line: 523, column: 6, scope: !445)
!467 = !DILocation(line: 523, column: 9, scope: !445)
!468 = !DILocation(line: 524, column: 2, scope: !445)
!469 = !DILocation(line: 524, column: 6, scope: !445)
!470 = !DILocation(line: 525, column: 2, scope: !445)
!471 = !DILocation(line: 525, column: 7, scope: !445)
!472 = !DILocation(line: 530, column: 6, scope: !473)
!473 = distinct !DILexicalBlock(scope: !445, file: !2, line: 530, column: 6)
!474 = !DILocation(line: 530, column: 22, scope: !473)
!475 = !DILocation(line: 530, column: 6, scope: !445)
!476 = !DILocation(line: 531, column: 7, scope: !477)
!477 = distinct !DILexicalBlock(scope: !478, file: !2, line: 531, column: 7)
!478 = distinct !DILexicalBlock(scope: !473, file: !2, line: 530, column: 32)
!479 = !DILocation(line: 531, column: 12, scope: !477)
!480 = !DILocation(line: 531, column: 7, scope: !478)
!481 = !DILocation(line: 532, column: 4, scope: !482)
!482 = distinct !DILexicalBlock(scope: !477, file: !2, line: 531, column: 21)
!483 = !DILocation(line: 533, column: 4, scope: !482)
!484 = !DILocation(line: 536, column: 3, scope: !478)
!485 = !DILocation(line: 537, column: 3, scope: !478)
!486 = !DILocation(line: 539, column: 3, scope: !478)
!487 = !DILocation(line: 542, column: 6, scope: !488)
!488 = distinct !DILexicalBlock(scope: !445, file: !2, line: 542, column: 6)
!489 = !DILocation(line: 542, column: 11, scope: !488)
!490 = !DILocation(line: 542, column: 6, scope: !445)
!491 = !DILocation(line: 543, column: 3, scope: !492)
!492 = distinct !DILexicalBlock(scope: !488, file: !2, line: 542, column: 20)
!493 = !DILocation(line: 544, column: 3, scope: !492)
!494 = !DILocation(line: 547, column: 25, scope: !445)
!495 = !DILocation(line: 547, column: 7, scope: !445)
!496 = !DILocation(line: 547, column: 5, scope: !445)
!497 = !DILocation(line: 548, column: 6, scope: !498)
!498 = distinct !DILexicalBlock(scope: !445, file: !2, line: 548, column: 6)
!499 = !DILocation(line: 548, column: 9, scope: !498)
!500 = !DILocation(line: 548, column: 6, scope: !445)
!501 = !DILocation(line: 549, column: 3, scope: !502)
!502 = distinct !DILexicalBlock(scope: !498, file: !2, line: 548, column: 14)
!503 = !DILocation(line: 550, column: 3, scope: !502)
!504 = !DILocation(line: 553, column: 2, scope: !445)
!505 = !DILocation(line: 555, column: 15, scope: !445)
!506 = !DILocation(line: 555, column: 13, scope: !445)
!507 = !DILocation(line: 556, column: 6, scope: !508)
!508 = distinct !DILexicalBlock(scope: !445, file: !2, line: 556, column: 6)
!509 = !DILocation(line: 556, column: 17, scope: !508)
!510 = !DILocation(line: 556, column: 6, scope: !445)
!511 = !DILocation(line: 557, column: 3, scope: !512)
!512 = distinct !DILexicalBlock(scope: !508, file: !2, line: 556, column: 26)
!513 = !DILocation(line: 559, column: 9, scope: !514)
!514 = distinct !DILexicalBlock(scope: !445, file: !2, line: 559, column: 2)
!515 = !DILocation(line: 559, column: 7, scope: !514)
!516 = !DILocation(line: 559, column: 14, scope: !517)
!517 = distinct !DILexicalBlock(scope: !514, file: !2, line: 559, column: 2)
!518 = !DILocation(line: 559, column: 18, scope: !517)
!519 = !DILocation(line: 559, column: 16, scope: !517)
!520 = !DILocation(line: 559, column: 2, scope: !514)
!521 = !DILocation(line: 560, column: 14, scope: !522)
!522 = distinct !DILexicalBlock(scope: !517, file: !2, line: 559, column: 47)
!523 = !DILocation(line: 560, column: 12, scope: !522)
!524 = !DILocation(line: 561, column: 40, scope: !522)
!525 = !DILocation(line: 561, column: 50, scope: !522)
!526 = !DILocation(line: 561, column: 64, scope: !522)
!527 = !DILocation(line: 561, column: 16, scope: !522)
!528 = !DILocation(line: 561, column: 14, scope: !522)
!529 = !DILocation(line: 562, column: 7, scope: !530)
!530 = distinct !DILexicalBlock(scope: !522, file: !2, line: 562, column: 7)
!531 = !DILocation(line: 562, column: 18, scope: !530)
!532 = !DILocation(line: 562, column: 7, scope: !522)
!533 = !DILocation(line: 563, column: 9, scope: !534)
!534 = distinct !DILexicalBlock(scope: !530, file: !2, line: 562, column: 27)
!535 = !DILocation(line: 563, column: 4, scope: !534)
!536 = !DILocation(line: 564, column: 4, scope: !534)
!537 = !DILocation(line: 566, column: 8, scope: !522)
!538 = !DILocation(line: 566, column: 3, scope: !522)
!539 = !DILocation(line: 567, column: 2, scope: !522)
!540 = !DILocation(line: 559, column: 43, scope: !517)
!541 = !DILocation(line: 559, column: 2, scope: !517)
!542 = distinct !{!542, !520, !543}
!543 = !DILocation(line: 567, column: 2, scope: !514)
!544 = !DILocation(line: 568, column: 2, scope: !445)
!545 = !DILocation(line: 569, column: 7, scope: !445)
!546 = !DILocation(line: 569, column: 2, scope: !445)
!547 = !DILocation(line: 575, column: 21, scope: !445)
!548 = !DILocation(line: 575, column: 14, scope: !445)
!549 = !DILocation(line: 575, column: 12, scope: !445)
!550 = !DILocation(line: 576, column: 6, scope: !551)
!551 = distinct !DILexicalBlock(scope: !445, file: !2, line: 576, column: 6)
!552 = !DILocation(line: 576, column: 16, scope: !551)
!553 = !DILocation(line: 576, column: 6, scope: !445)
!554 = !DILocation(line: 577, column: 3, scope: !555)
!555 = distinct !DILexicalBlock(scope: !551, file: !2, line: 576, column: 25)
!556 = !DILocation(line: 578, column: 3, scope: !555)
!557 = !DILocation(line: 580, column: 9, scope: !445)
!558 = !DILocation(line: 580, column: 20, scope: !445)
!559 = !DILocation(line: 580, column: 52, scope: !445)
!560 = !DILocation(line: 580, column: 50, scope: !445)
!561 = !DILocation(line: 580, column: 2, scope: !445)
!562 = !DILocation(line: 582, column: 9, scope: !445)
!563 = !DILocation(line: 582, column: 2, scope: !445)
!564 = !DILocation(line: 583, column: 16, scope: !445)
!565 = !DILocation(line: 583, column: 14, scope: !445)
!566 = !DILocation(line: 584, column: 9, scope: !445)
!567 = !DILocation(line: 585, column: 20, scope: !445)
!568 = !DILocation(line: 585, column: 44, scope: !445)
!569 = !DILocation(line: 585, column: 7, scope: !445)
!570 = !DILocation(line: 585, column: 5, scope: !445)
!571 = !DILocation(line: 586, column: 11, scope: !445)
!572 = !DILocation(line: 586, column: 9, scope: !445)
!573 = !DILocation(line: 588, column: 7, scope: !445)
!574 = !DILocation(line: 588, column: 2, scope: !445)
!575 = !DILocation(line: 590, column: 6, scope: !576)
!576 = distinct !DILexicalBlock(scope: !445, file: !2, line: 590, column: 6)
!577 = !DILocation(line: 590, column: 9, scope: !576)
!578 = !DILocation(line: 590, column: 6, scope: !445)
!579 = !DILocation(line: 591, column: 7, scope: !580)
!580 = distinct !DILexicalBlock(scope: !581, file: !2, line: 591, column: 7)
!581 = distinct !DILexicalBlock(scope: !576, file: !2, line: 590, column: 14)
!582 = !DILocation(line: 591, column: 17, scope: !580)
!583 = !DILocation(line: 591, column: 7, scope: !581)
!584 = !DILocation(line: 592, column: 4, scope: !585)
!585 = distinct !DILexicalBlock(scope: !580, file: !2, line: 591, column: 30)
!586 = !DILocation(line: 593, column: 3, scope: !585)
!587 = !DILocation(line: 594, column: 4, scope: !588)
!588 = distinct !DILexicalBlock(scope: !580, file: !2, line: 593, column: 10)
!589 = !DILocation(line: 596, column: 11, scope: !581)
!590 = !DILocation(line: 596, column: 10, scope: !581)
!591 = !DILocation(line: 596, column: 3, scope: !581)
!592 = !DILocation(line: 599, column: 13, scope: !445)
!593 = !DILocation(line: 600, column: 6, scope: !594)
!594 = distinct !DILexicalBlock(scope: !445, file: !2, line: 600, column: 6)
!595 = !DILocation(line: 600, column: 12, scope: !594)
!596 = !DILocation(line: 600, column: 24, scope: !594)
!597 = !DILocation(line: 600, column: 34, scope: !594)
!598 = !DILocation(line: 600, column: 40, scope: !594)
!599 = !DILocation(line: 600, column: 27, scope: !594)
!600 = !DILocation(line: 600, column: 69, scope: !594)
!601 = !DILocation(line: 600, column: 6, scope: !445)
!602 = !DILocation(line: 601, column: 14, scope: !603)
!603 = distinct !DILexicalBlock(scope: !594, file: !2, line: 600, column: 78)
!604 = !DILocation(line: 602, column: 2, scope: !603)
!605 = !DILocation(line: 604, column: 31, scope: !445)
!606 = !DILocation(line: 604, column: 7, scope: !445)
!607 = !DILocation(line: 604, column: 5, scope: !445)
!608 = !DILocation(line: 605, column: 6, scope: !609)
!609 = distinct !DILexicalBlock(scope: !445, file: !2, line: 605, column: 6)
!610 = !DILocation(line: 605, column: 9, scope: !609)
!611 = !DILocation(line: 605, column: 6, scope: !445)
!612 = !DILocation(line: 606, column: 19, scope: !613)
!613 = distinct !DILexicalBlock(scope: !609, file: !2, line: 605, column: 15)
!614 = !DILocation(line: 607, column: 2, scope: !613)
!615 = !DILocation(line: 609, column: 9, scope: !445)
!616 = !DILocation(line: 609, column: 2, scope: !445)
!617 = !DILocation(line: 610, column: 1, scope: !445)
!618 = !DISubprogram(name: "__fprintf_chk", scope: !619, file: !619, line: 93, type: !620, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!619 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!620 = !DISubroutineType(types: !621)
!621 = !{!44, !622, !44, !675, null}
!622 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !625, line: 7, baseType: !626)
!625 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !627, line: 49, size: 1728, elements: !628)
!627 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !644, !646, !647, !648, !651, !653, !655, !659, !662, !664, !667, !670, !671, !672, !673, !674}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !626, file: !627, line: 51, baseType: !44, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !626, file: !627, line: 54, baseType: !240, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !626, file: !627, line: 55, baseType: !240, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !626, file: !627, line: 56, baseType: !240, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !626, file: !627, line: 57, baseType: !240, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !626, file: !627, line: 58, baseType: !240, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !626, file: !627, line: 59, baseType: !240, size: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !626, file: !627, line: 60, baseType: !240, size: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !626, file: !627, line: 61, baseType: !240, size: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !626, file: !627, line: 64, baseType: !240, size: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !626, file: !627, line: 65, baseType: !240, size: 64, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !626, file: !627, line: 66, baseType: !240, size: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !626, file: !627, line: 68, baseType: !642, size: 64, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !627, line: 36, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !626, file: !627, line: 70, baseType: !645, size: 64, offset: 832)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !626, file: !627, line: 72, baseType: !44, size: 32, offset: 896)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !626, file: !627, line: 73, baseType: !44, size: 32, offset: 928)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !626, file: !627, line: 74, baseType: !649, size: 64, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !274, line: 152, baseType: !650)
!650 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !626, file: !627, line: 77, baseType: !652, size: 16, offset: 1024)
!652 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !626, file: !627, line: 78, baseType: !654, size: 8, offset: 1040)
!654 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !626, file: !627, line: 79, baseType: !656, size: 8, offset: 1048)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 1)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !626, file: !627, line: 81, baseType: !660, size: 64, offset: 1088)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !627, line: 43, baseType: null)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !626, file: !627, line: 89, baseType: !663, size: 64, offset: 1152)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !274, line: 153, baseType: !650)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !626, file: !627, line: 91, baseType: !665, size: 64, offset: 1216)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !627, line: 37, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !626, file: !627, line: 92, baseType: !668, size: 64, offset: 1280)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !627, line: 38, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !626, file: !627, line: 93, baseType: !645, size: 64, offset: 1344)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !626, file: !627, line: 94, baseType: !53, size: 64, offset: 1408)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !626, file: !627, line: 95, baseType: !325, size: 64, offset: 1472)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !626, file: !627, line: 96, baseType: !44, size: 32, offset: 1536)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !626, file: !627, line: 98, baseType: !174, size: 160, offset: 1568)
!675 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !255)
!676 = !DISubprogram(name: "__printf_chk", scope: !619, file: !619, line: 95, type: !677, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!677 = !DISubroutineType(types: !678)
!678 = !{!44, !44, !675, null}
!679 = !DISubprogram(name: "rte_version", scope: !680, file: !680, line: 76, type: !681, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!680 = !DIFile(filename: "dpdk/build/include/rte_version.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "e03efe2e88903648594e34bac4348e7d")
!681 = !DISubroutineType(types: !682)
!682 = !{!255}
!683 = !DISubprogram(name: "pci_env_reinit", scope: !383, file: !383, line: 31, type: !393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!684 = distinct !DISubprogram(name: "build_eal_cmdline", scope: !2, file: !2, line: 207, type: !446, scopeLine: 208, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !40, retainedNodes: !685)
!685 = !{!686, !687, !688, !689, !693, !696, !699, !703, !704, !707}
!686 = !DILocalVariable(name: "opts", arg: 1, scope: !684, file: !2, line: 207, type: !448)
!687 = !DILocalVariable(name: "argcount", scope: !684, file: !2, line: 209, type: !44)
!688 = !DILocalVariable(name: "args", scope: !684, file: !2, line: 210, type: !239)
!689 = !DILocalVariable(name: "l_arg", scope: !690, file: !2, line: 243, type: !240)
!690 = distinct !DILexicalBlock(scope: !691, file: !2, line: 242, column: 40)
!691 = distinct !DILexicalBlock(scope: !692, file: !2, line: 242, column: 13)
!692 = distinct !DILexicalBlock(scope: !684, file: !2, line: 240, column: 6)
!693 = !DILocalVariable(name: "len", scope: !694, file: !2, line: 246, type: !44)
!694 = distinct !DILexicalBlock(scope: !695, file: !2, line: 245, column: 22)
!695 = distinct !DILexicalBlock(scope: !690, file: !2, line: 245, column: 7)
!696 = !DILocalVariable(name: "i", scope: !697, file: !2, line: 325, type: !54)
!697 = distinct !DILexicalBlock(scope: !698, file: !2, line: 324, column: 26)
!698 = distinct !DILexicalBlock(scope: !684, file: !2, line: 324, column: 6)
!699 = !DILocalVariable(name: "bdf", scope: !697, file: !2, line: 326, type: !700)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 32)
!703 = !DILocalVariable(name: "pci_addr", scope: !697, file: !2, line: 327, type: !267)
!704 = !DILocalVariable(name: "ptr", scope: !705, file: !2, line: 368, type: !240)
!705 = distinct !DILexicalBlock(scope: !706, file: !2, line: 367, column: 25)
!706 = distinct !DILexicalBlock(scope: !684, file: !2, line: 367, column: 6)
!707 = !DILocalVariable(name: "tok", scope: !705, file: !2, line: 369, type: !240)
!708 = !DILocation(line: 207, column: 47, scope: !684)
!709 = !DILocation(line: 209, column: 2, scope: !684)
!710 = !DILocation(line: 209, column: 6, scope: !684)
!711 = !DILocation(line: 210, column: 2, scope: !684)
!712 = !DILocation(line: 210, column: 9, scope: !684)
!713 = !DILocation(line: 212, column: 7, scope: !684)
!714 = !DILocation(line: 215, column: 18, scope: !684)
!715 = !DILocation(line: 215, column: 56, scope: !684)
!716 = !DILocation(line: 215, column: 62, scope: !684)
!717 = !DILocation(line: 215, column: 35, scope: !684)
!718 = !DILocation(line: 215, column: 9, scope: !684)
!719 = !DILocation(line: 215, column: 7, scope: !684)
!720 = !DILocation(line: 216, column: 6, scope: !721)
!721 = distinct !DILexicalBlock(scope: !684, file: !2, line: 216, column: 6)
!722 = !DILocation(line: 216, column: 11, scope: !721)
!723 = !DILocation(line: 216, column: 6, scope: !684)
!724 = !DILocation(line: 217, column: 3, scope: !725)
!725 = distinct !DILexicalBlock(scope: !721, file: !2, line: 216, column: 20)
!726 = !DILocation(line: 221, column: 6, scope: !727)
!727 = distinct !DILexicalBlock(scope: !684, file: !2, line: 221, column: 6)
!728 = !DILocation(line: 221, column: 12, scope: !727)
!729 = !DILocation(line: 221, column: 19, scope: !727)
!730 = !DILocation(line: 221, column: 6, scope: !684)
!731 = !DILocation(line: 222, column: 19, scope: !732)
!732 = distinct !DILexicalBlock(scope: !727, file: !2, line: 221, column: 24)
!733 = !DILocation(line: 222, column: 36, scope: !732)
!734 = !DILocation(line: 222, column: 10, scope: !732)
!735 = !DILocation(line: 222, column: 8, scope: !732)
!736 = !DILocation(line: 223, column: 7, scope: !737)
!737 = distinct !DILexicalBlock(scope: !732, file: !2, line: 223, column: 7)
!738 = !DILocation(line: 223, column: 12, scope: !737)
!739 = !DILocation(line: 223, column: 7, scope: !732)
!740 = !DILocation(line: 224, column: 4, scope: !741)
!741 = distinct !DILexicalBlock(scope: !737, file: !2, line: 223, column: 21)
!742 = !DILocation(line: 226, column: 2, scope: !732)
!743 = !DILocation(line: 240, column: 6, scope: !692)
!744 = !DILocation(line: 240, column: 12, scope: !692)
!745 = !DILocation(line: 240, column: 25, scope: !692)
!746 = !DILocation(line: 240, column: 6, scope: !684)
!747 = !DILocation(line: 241, column: 19, scope: !748)
!748 = distinct !DILexicalBlock(scope: !692, file: !2, line: 240, column: 33)
!749 = !DILocation(line: 241, column: 57, scope: !748)
!750 = !DILocation(line: 241, column: 63, scope: !748)
!751 = !DILocation(line: 241, column: 36, scope: !748)
!752 = !DILocation(line: 241, column: 10, scope: !748)
!753 = !DILocation(line: 241, column: 8, scope: !748)
!754 = !DILocation(line: 242, column: 2, scope: !748)
!755 = !DILocation(line: 242, column: 13, scope: !691)
!756 = !DILocation(line: 242, column: 19, scope: !691)
!757 = !DILocation(line: 242, column: 32, scope: !691)
!758 = !DILocation(line: 242, column: 13, scope: !692)
!759 = !DILocation(line: 243, column: 3, scope: !690)
!760 = !DILocation(line: 243, column: 9, scope: !690)
!761 = !DILocation(line: 243, column: 41, scope: !690)
!762 = !DILocation(line: 243, column: 47, scope: !690)
!763 = !DILocation(line: 243, column: 57, scope: !690)
!764 = !DILocation(line: 243, column: 17, scope: !690)
!765 = !DILocation(line: 245, column: 7, scope: !695)
!766 = !DILocation(line: 245, column: 13, scope: !695)
!767 = !DILocation(line: 245, column: 7, scope: !690)
!768 = !DILocation(line: 246, column: 4, scope: !694)
!769 = !DILocation(line: 246, column: 8, scope: !694)
!770 = !DILocation(line: 246, column: 21, scope: !694)
!771 = !DILocation(line: 246, column: 14, scope: !694)
!772 = !DILocation(line: 248, column: 8, scope: !773)
!773 = distinct !DILexicalBlock(scope: !694, file: !2, line: 248, column: 8)
!774 = !DILocation(line: 248, column: 14, scope: !773)
!775 = !DILocation(line: 248, column: 18, scope: !773)
!776 = !DILocation(line: 248, column: 23, scope: !773)
!777 = !DILocation(line: 248, column: 8, scope: !694)
!778 = !DILocation(line: 249, column: 5, scope: !779)
!779 = distinct !DILexicalBlock(scope: !773, file: !2, line: 248, column: 31)
!780 = !DILocation(line: 249, column: 11, scope: !779)
!781 = !DILocation(line: 249, column: 15, scope: !779)
!782 = !DILocation(line: 249, column: 20, scope: !779)
!783 = !DILocation(line: 250, column: 4, scope: !779)
!784 = !DILocation(line: 251, column: 3, scope: !695)
!785 = !DILocation(line: 251, column: 3, scope: !694)
!786 = !DILocation(line: 252, column: 19, scope: !690)
!787 = !DILocation(line: 252, column: 36, scope: !690)
!788 = !DILocation(line: 252, column: 10, scope: !690)
!789 = !DILocation(line: 252, column: 8, scope: !690)
!790 = !DILocation(line: 253, column: 2, scope: !691)
!791 = !DILocation(line: 253, column: 2, scope: !690)
!792 = !DILocation(line: 254, column: 19, scope: !793)
!793 = distinct !DILexicalBlock(scope: !691, file: !2, line: 253, column: 9)
!794 = !DILocation(line: 254, column: 60, scope: !793)
!795 = !DILocation(line: 254, column: 66, scope: !793)
!796 = !DILocation(line: 254, column: 36, scope: !793)
!797 = !DILocation(line: 254, column: 10, scope: !793)
!798 = !DILocation(line: 254, column: 8, scope: !793)
!799 = !DILocation(line: 257, column: 6, scope: !800)
!800 = distinct !DILexicalBlock(scope: !684, file: !2, line: 257, column: 6)
!801 = !DILocation(line: 257, column: 11, scope: !800)
!802 = !DILocation(line: 257, column: 6, scope: !684)
!803 = !DILocation(line: 258, column: 3, scope: !804)
!804 = distinct !DILexicalBlock(scope: !800, file: !2, line: 257, column: 20)
!805 = !DILocation(line: 262, column: 6, scope: !806)
!806 = distinct !DILexicalBlock(scope: !684, file: !2, line: 262, column: 6)
!807 = !DILocation(line: 262, column: 12, scope: !806)
!808 = !DILocation(line: 262, column: 24, scope: !806)
!809 = !DILocation(line: 262, column: 6, scope: !684)
!810 = !DILocation(line: 263, column: 19, scope: !811)
!811 = distinct !DILexicalBlock(scope: !806, file: !2, line: 262, column: 29)
!812 = !DILocation(line: 263, column: 60, scope: !811)
!813 = !DILocation(line: 263, column: 66, scope: !811)
!814 = !DILocation(line: 263, column: 36, scope: !811)
!815 = !DILocation(line: 263, column: 10, scope: !811)
!816 = !DILocation(line: 263, column: 8, scope: !811)
!817 = !DILocation(line: 264, column: 7, scope: !818)
!818 = distinct !DILexicalBlock(scope: !811, file: !2, line: 264, column: 7)
!819 = !DILocation(line: 264, column: 12, scope: !818)
!820 = !DILocation(line: 264, column: 7, scope: !811)
!821 = !DILocation(line: 265, column: 4, scope: !822)
!822 = distinct !DILexicalBlock(scope: !818, file: !2, line: 264, column: 21)
!823 = !DILocation(line: 267, column: 2, scope: !811)
!824 = !DILocation(line: 270, column: 6, scope: !825)
!825 = distinct !DILexicalBlock(scope: !684, file: !2, line: 270, column: 6)
!826 = !DILocation(line: 270, column: 12, scope: !825)
!827 = !DILocation(line: 270, column: 21, scope: !825)
!828 = !DILocation(line: 270, column: 6, scope: !684)
!829 = !DILocation(line: 271, column: 19, scope: !830)
!830 = distinct !DILexicalBlock(scope: !825, file: !2, line: 270, column: 27)
!831 = !DILocation(line: 271, column: 60, scope: !830)
!832 = !DILocation(line: 271, column: 66, scope: !830)
!833 = !DILocation(line: 271, column: 36, scope: !830)
!834 = !DILocation(line: 271, column: 10, scope: !830)
!835 = !DILocation(line: 271, column: 8, scope: !830)
!836 = !DILocation(line: 272, column: 7, scope: !837)
!837 = distinct !DILexicalBlock(scope: !830, file: !2, line: 272, column: 7)
!838 = !DILocation(line: 272, column: 12, scope: !837)
!839 = !DILocation(line: 272, column: 7, scope: !830)
!840 = !DILocation(line: 273, column: 4, scope: !841)
!841 = distinct !DILexicalBlock(scope: !837, file: !2, line: 272, column: 21)
!842 = !DILocation(line: 275, column: 2, scope: !830)
!843 = !DILocation(line: 278, column: 6, scope: !844)
!844 = distinct !DILexicalBlock(scope: !684, file: !2, line: 278, column: 6)
!845 = !DILocation(line: 278, column: 12, scope: !844)
!846 = !DILocation(line: 278, column: 22, scope: !844)
!847 = !DILocation(line: 278, column: 6, scope: !684)
!848 = !DILocation(line: 279, column: 19, scope: !849)
!849 = distinct !DILexicalBlock(scope: !844, file: !2, line: 278, column: 27)
!850 = !DILocation(line: 280, column: 27, scope: !849)
!851 = !DILocation(line: 280, column: 33, scope: !849)
!852 = !DILocation(line: 279, column: 36, scope: !849)
!853 = !DILocation(line: 279, column: 10, scope: !849)
!854 = !DILocation(line: 279, column: 8, scope: !849)
!855 = !DILocation(line: 281, column: 7, scope: !856)
!856 = distinct !DILexicalBlock(scope: !849, file: !2, line: 281, column: 7)
!857 = !DILocation(line: 281, column: 12, scope: !856)
!858 = !DILocation(line: 281, column: 7, scope: !849)
!859 = !DILocation(line: 282, column: 4, scope: !860)
!860 = distinct !DILexicalBlock(scope: !856, file: !2, line: 281, column: 21)
!861 = !DILocation(line: 284, column: 2, scope: !849)
!862 = !DILocation(line: 287, column: 6, scope: !863)
!863 = distinct !DILexicalBlock(scope: !684, file: !2, line: 287, column: 6)
!864 = !DILocation(line: 287, column: 12, scope: !863)
!865 = !DILocation(line: 287, column: 6, scope: !684)
!866 = !DILocation(line: 288, column: 19, scope: !867)
!867 = distinct !DILexicalBlock(scope: !863, file: !2, line: 287, column: 20)
!868 = !DILocation(line: 288, column: 36, scope: !867)
!869 = !DILocation(line: 288, column: 10, scope: !867)
!870 = !DILocation(line: 288, column: 8, scope: !867)
!871 = !DILocation(line: 289, column: 7, scope: !872)
!872 = distinct !DILexicalBlock(scope: !867, file: !2, line: 289, column: 7)
!873 = !DILocation(line: 289, column: 12, scope: !872)
!874 = !DILocation(line: 289, column: 7, scope: !867)
!875 = !DILocation(line: 290, column: 4, scope: !876)
!876 = distinct !DILexicalBlock(scope: !872, file: !2, line: 289, column: 21)
!877 = !DILocation(line: 292, column: 2, scope: !867)
!878 = !DILocation(line: 295, column: 6, scope: !879)
!879 = distinct !DILexicalBlock(scope: !684, file: !2, line: 295, column: 6)
!880 = !DILocation(line: 295, column: 12, scope: !879)
!881 = !DILocation(line: 295, column: 6, scope: !684)
!882 = !DILocation(line: 296, column: 19, scope: !883)
!883 = distinct !DILexicalBlock(scope: !879, file: !2, line: 295, column: 38)
!884 = !DILocation(line: 296, column: 36, scope: !883)
!885 = !DILocation(line: 296, column: 10, scope: !883)
!886 = !DILocation(line: 296, column: 8, scope: !883)
!887 = !DILocation(line: 297, column: 7, scope: !888)
!888 = distinct !DILexicalBlock(scope: !883, file: !2, line: 297, column: 7)
!889 = !DILocation(line: 297, column: 12, scope: !888)
!890 = !DILocation(line: 297, column: 7, scope: !883)
!891 = !DILocation(line: 298, column: 4, scope: !892)
!892 = distinct !DILexicalBlock(scope: !888, file: !2, line: 297, column: 21)
!893 = !DILocation(line: 300, column: 2, scope: !883)
!894 = !DILocation(line: 308, column: 6, scope: !895)
!895 = distinct !DILexicalBlock(scope: !684, file: !2, line: 308, column: 6)
!896 = !DILocation(line: 308, column: 12, scope: !895)
!897 = !DILocation(line: 308, column: 28, scope: !895)
!898 = !DILocation(line: 309, column: 7, scope: !895)
!899 = !DILocation(line: 309, column: 13, scope: !895)
!900 = !DILocation(line: 309, column: 20, scope: !895)
!901 = !DILocation(line: 309, column: 24, scope: !895)
!902 = !DILocation(line: 309, column: 28, scope: !895)
!903 = !DILocation(line: 309, column: 34, scope: !895)
!904 = !DILocation(line: 308, column: 6, scope: !684)
!905 = !DILocation(line: 310, column: 19, scope: !906)
!906 = distinct !DILexicalBlock(scope: !895, file: !2, line: 309, column: 61)
!907 = !DILocation(line: 310, column: 36, scope: !906)
!908 = !DILocation(line: 310, column: 10, scope: !906)
!909 = !DILocation(line: 310, column: 8, scope: !906)
!910 = !DILocation(line: 311, column: 7, scope: !911)
!911 = distinct !DILexicalBlock(scope: !906, file: !2, line: 311, column: 7)
!912 = !DILocation(line: 311, column: 12, scope: !911)
!913 = !DILocation(line: 311, column: 7, scope: !906)
!914 = !DILocation(line: 312, column: 4, scope: !915)
!915 = distinct !DILexicalBlock(scope: !911, file: !2, line: 311, column: 21)
!916 = !DILocation(line: 314, column: 2, scope: !906)
!917 = !DILocation(line: 317, column: 6, scope: !918)
!918 = distinct !DILexicalBlock(scope: !684, file: !2, line: 317, column: 6)
!919 = !DILocation(line: 317, column: 12, scope: !918)
!920 = !DILocation(line: 317, column: 6, scope: !684)
!921 = !DILocation(line: 318, column: 19, scope: !922)
!922 = distinct !DILexicalBlock(scope: !918, file: !2, line: 317, column: 21)
!923 = !DILocation(line: 318, column: 68, scope: !922)
!924 = !DILocation(line: 318, column: 74, scope: !922)
!925 = !DILocation(line: 318, column: 36, scope: !922)
!926 = !DILocation(line: 318, column: 10, scope: !922)
!927 = !DILocation(line: 318, column: 8, scope: !922)
!928 = !DILocation(line: 319, column: 7, scope: !929)
!929 = distinct !DILexicalBlock(scope: !922, file: !2, line: 319, column: 7)
!930 = !DILocation(line: 319, column: 12, scope: !929)
!931 = !DILocation(line: 319, column: 7, scope: !922)
!932 = !DILocation(line: 320, column: 4, scope: !933)
!933 = distinct !DILexicalBlock(scope: !929, file: !2, line: 319, column: 21)
!934 = !DILocation(line: 322, column: 2, scope: !922)
!935 = !DILocation(line: 324, column: 6, scope: !698)
!936 = !DILocation(line: 324, column: 12, scope: !698)
!937 = !DILocation(line: 324, column: 6, scope: !684)
!938 = !DILocation(line: 325, column: 3, scope: !697)
!939 = !DILocation(line: 325, column: 10, scope: !697)
!940 = !DILocation(line: 326, column: 3, scope: !697)
!941 = !DILocation(line: 326, column: 8, scope: !697)
!942 = !DILocation(line: 327, column: 3, scope: !697)
!943 = !DILocation(line: 327, column: 25, scope: !697)
!944 = !DILocation(line: 328, column: 5, scope: !697)
!945 = !DILocation(line: 328, column: 11, scope: !697)
!946 = !DILocation(line: 328, column: 25, scope: !697)
!947 = !DILocation(line: 328, column: 31, scope: !697)
!948 = !DILocation(line: 328, column: 45, scope: !697)
!949 = !DILocation(line: 328, column: 51, scope: !697)
!950 = !DILocation(line: 330, column: 10, scope: !951)
!951 = distinct !DILexicalBlock(scope: !697, file: !2, line: 330, column: 3)
!952 = !DILocation(line: 330, column: 8, scope: !951)
!953 = !DILocation(line: 330, column: 15, scope: !954)
!954 = distinct !DILexicalBlock(scope: !951, file: !2, line: 330, column: 3)
!955 = !DILocation(line: 330, column: 19, scope: !954)
!956 = !DILocation(line: 330, column: 25, scope: !954)
!957 = !DILocation(line: 330, column: 17, scope: !954)
!958 = !DILocation(line: 330, column: 3, scope: !951)
!959 = !DILocation(line: 331, column: 22, scope: !960)
!960 = distinct !DILexicalBlock(scope: !954, file: !2, line: 330, column: 44)
!961 = !DILocation(line: 331, column: 32, scope: !960)
!962 = !DILocation(line: 331, column: 41, scope: !960)
!963 = !DILocation(line: 331, column: 4, scope: !960)
!964 = !DILocation(line: 332, column: 20, scope: !960)
!965 = !DILocation(line: 333, column: 7, scope: !960)
!966 = !DILocation(line: 333, column: 13, scope: !960)
!967 = !DILocation(line: 334, column: 6, scope: !960)
!968 = !DILocation(line: 332, column: 37, scope: !960)
!969 = !DILocation(line: 332, column: 11, scope: !960)
!970 = !DILocation(line: 332, column: 9, scope: !960)
!971 = !DILocation(line: 335, column: 8, scope: !972)
!972 = distinct !DILexicalBlock(scope: !960, file: !2, line: 335, column: 8)
!973 = !DILocation(line: 335, column: 13, scope: !972)
!974 = !DILocation(line: 335, column: 8, scope: !960)
!975 = !DILocation(line: 336, column: 5, scope: !976)
!976 = distinct !DILexicalBlock(scope: !972, file: !2, line: 335, column: 22)
!977 = !DILocation(line: 338, column: 3, scope: !960)
!978 = !DILocation(line: 330, column: 40, scope: !954)
!979 = !DILocation(line: 330, column: 3, scope: !954)
!980 = distinct !{!980, !958, !981}
!981 = !DILocation(line: 338, column: 3, scope: !951)
!982 = !DILocation(line: 339, column: 2, scope: !698)
!983 = !DILocation(line: 339, column: 2, scope: !697)
!984 = !DILocation(line: 344, column: 18, scope: !684)
!985 = !DILocation(line: 344, column: 35, scope: !684)
!986 = !DILocation(line: 344, column: 9, scope: !684)
!987 = !DILocation(line: 344, column: 7, scope: !684)
!988 = !DILocation(line: 345, column: 6, scope: !989)
!989 = distinct !DILexicalBlock(scope: !684, file: !2, line: 345, column: 6)
!990 = !DILocation(line: 345, column: 11, scope: !989)
!991 = !DILocation(line: 345, column: 6, scope: !684)
!992 = !DILocation(line: 346, column: 3, scope: !993)
!993 = distinct !DILexicalBlock(scope: !989, file: !2, line: 345, column: 20)
!994 = !DILocation(line: 352, column: 18, scope: !684)
!995 = !DILocation(line: 352, column: 35, scope: !684)
!996 = !DILocation(line: 352, column: 9, scope: !684)
!997 = !DILocation(line: 352, column: 7, scope: !684)
!998 = !DILocation(line: 353, column: 6, scope: !999)
!999 = distinct !DILexicalBlock(scope: !684, file: !2, line: 353, column: 6)
!1000 = !DILocation(line: 353, column: 11, scope: !999)
!1001 = !DILocation(line: 353, column: 6, scope: !684)
!1002 = !DILocation(line: 354, column: 3, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !999, file: !2, line: 353, column: 20)
!1004 = !DILocation(line: 362, column: 18, scope: !684)
!1005 = !DILocation(line: 362, column: 35, scope: !684)
!1006 = !DILocation(line: 362, column: 9, scope: !684)
!1007 = !DILocation(line: 362, column: 7, scope: !684)
!1008 = !DILocation(line: 363, column: 6, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !684, file: !2, line: 363, column: 6)
!1010 = !DILocation(line: 363, column: 11, scope: !1009)
!1011 = !DILocation(line: 363, column: 6, scope: !684)
!1012 = !DILocation(line: 364, column: 3, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 363, column: 20)
!1014 = !DILocation(line: 367, column: 6, scope: !706)
!1015 = !DILocation(line: 367, column: 12, scope: !706)
!1016 = !DILocation(line: 367, column: 6, scope: !684)
!1017 = !DILocation(line: 368, column: 3, scope: !705)
!1018 = !DILocation(line: 368, column: 9, scope: !705)
!1019 = !DILocation(line: 368, column: 22, scope: !705)
!1020 = !DILocation(line: 368, column: 28, scope: !705)
!1021 = !DILocation(line: 368, column: 15, scope: !705)
!1022 = !DILocation(line: 369, column: 3, scope: !705)
!1023 = !DILocation(line: 369, column: 9, scope: !705)
!1024 = !DILocation(line: 369, column: 22, scope: !705)
!1025 = !DILocation(line: 369, column: 15, scope: !705)
!1026 = !DILocation(line: 375, column: 3, scope: !705)
!1027 = !DILocation(line: 375, column: 10, scope: !705)
!1028 = !DILocation(line: 375, column: 14, scope: !705)
!1029 = !DILocation(line: 376, column: 20, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !705, file: !2, line: 375, column: 23)
!1031 = !DILocation(line: 376, column: 44, scope: !1030)
!1032 = !DILocation(line: 376, column: 37, scope: !1030)
!1033 = !DILocation(line: 376, column: 11, scope: !1030)
!1034 = !DILocation(line: 376, column: 9, scope: !1030)
!1035 = !DILocation(line: 377, column: 10, scope: !1030)
!1036 = !DILocation(line: 377, column: 8, scope: !1030)
!1037 = distinct !{!1037, !1026, !1038}
!1038 = !DILocation(line: 378, column: 3, scope: !705)
!1039 = !DILocation(line: 380, column: 8, scope: !705)
!1040 = !DILocation(line: 380, column: 3, scope: !705)
!1041 = !DILocation(line: 381, column: 2, scope: !706)
!1042 = !DILocation(line: 381, column: 2, scope: !705)
!1043 = !DILocation(line: 385, column: 6, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !684, file: !2, line: 385, column: 6)
!1045 = !DILocation(line: 385, column: 12, scope: !1044)
!1046 = !DILocation(line: 385, column: 6, scope: !684)
!1047 = !DILocation(line: 386, column: 19, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1044, file: !2, line: 385, column: 23)
!1049 = !DILocation(line: 386, column: 69, scope: !1048)
!1050 = !DILocation(line: 386, column: 75, scope: !1048)
!1051 = !DILocation(line: 386, column: 36, scope: !1048)
!1052 = !DILocation(line: 386, column: 10, scope: !1048)
!1053 = !DILocation(line: 386, column: 8, scope: !1048)
!1054 = !DILocation(line: 387, column: 7, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1048, file: !2, line: 387, column: 7)
!1056 = !DILocation(line: 387, column: 12, scope: !1055)
!1057 = !DILocation(line: 387, column: 7, scope: !1048)
!1058 = !DILocation(line: 388, column: 4, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1055, file: !2, line: 387, column: 21)
!1060 = !DILocation(line: 390, column: 2, scope: !1048)
!1061 = !DILocation(line: 394, column: 7, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !2, line: 394, column: 7)
!1063 = distinct !DILexicalBlock(scope: !1044, file: !2, line: 390, column: 9)
!1064 = !DILocation(line: 394, column: 7, scope: !1063)
!1065 = !DILocation(line: 395, column: 20, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 394, column: 38)
!1067 = !DILocation(line: 395, column: 37, scope: !1066)
!1068 = !DILocation(line: 395, column: 11, scope: !1066)
!1069 = !DILocation(line: 395, column: 9, scope: !1066)
!1070 = !DILocation(line: 396, column: 8, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1066, file: !2, line: 396, column: 8)
!1072 = !DILocation(line: 396, column: 13, scope: !1071)
!1073 = !DILocation(line: 396, column: 8, scope: !1066)
!1074 = !DILocation(line: 397, column: 5, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1071, file: !2, line: 396, column: 22)
!1076 = !DILocation(line: 399, column: 3, scope: !1066)
!1077 = !DILocation(line: 407, column: 7, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1063, file: !2, line: 407, column: 7)
!1079 = !DILocation(line: 407, column: 25, scope: !1078)
!1080 = !DILocation(line: 407, column: 7, scope: !1063)
!1081 = !DILocation(line: 408, column: 20, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 407, column: 57)
!1083 = !DILocation(line: 408, column: 37, scope: !1082)
!1084 = !DILocation(line: 408, column: 11, scope: !1082)
!1085 = !DILocation(line: 408, column: 9, scope: !1082)
!1086 = !DILocation(line: 409, column: 8, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1082, file: !2, line: 409, column: 8)
!1088 = !DILocation(line: 409, column: 13, scope: !1087)
!1089 = !DILocation(line: 409, column: 8, scope: !1082)
!1090 = !DILocation(line: 410, column: 5, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1087, file: !2, line: 409, column: 22)
!1092 = !DILocation(line: 412, column: 3, scope: !1082)
!1093 = !DILocation(line: 430, column: 18, scope: !684)
!1094 = !DILocation(line: 430, column: 80, scope: !684)
!1095 = !DILocation(line: 430, column: 86, scope: !684)
!1096 = !DILocation(line: 430, column: 35, scope: !684)
!1097 = !DILocation(line: 430, column: 9, scope: !684)
!1098 = !DILocation(line: 430, column: 7, scope: !684)
!1099 = !DILocation(line: 431, column: 6, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !684, file: !2, line: 431, column: 6)
!1101 = !DILocation(line: 431, column: 11, scope: !1100)
!1102 = !DILocation(line: 431, column: 6, scope: !684)
!1103 = !DILocation(line: 432, column: 3, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 431, column: 20)
!1105 = !DILocation(line: 440, column: 7, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !684, file: !2, line: 440, column: 6)
!1107 = !DILocation(line: 440, column: 13, scope: !1106)
!1108 = !DILocation(line: 440, column: 25, scope: !1106)
!1109 = !DILocation(line: 440, column: 35, scope: !1106)
!1110 = !DILocation(line: 440, column: 41, scope: !1106)
!1111 = !DILocation(line: 440, column: 28, scope: !1106)
!1112 = !DILocation(line: 440, column: 70, scope: !1106)
!1113 = !DILocation(line: 440, column: 6, scope: !684)
!1114 = !DILocation(line: 441, column: 19, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1106, file: !2, line: 440, column: 79)
!1116 = !DILocation(line: 441, column: 36, scope: !1115)
!1117 = !DILocation(line: 441, column: 10, scope: !1115)
!1118 = !DILocation(line: 441, column: 8, scope: !1115)
!1119 = !DILocation(line: 442, column: 7, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1115, file: !2, line: 442, column: 7)
!1121 = !DILocation(line: 442, column: 12, scope: !1120)
!1122 = !DILocation(line: 442, column: 7, scope: !1115)
!1123 = !DILocation(line: 443, column: 4, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1120, file: !2, line: 442, column: 21)
!1125 = !DILocation(line: 445, column: 2, scope: !1115)
!1126 = !DILocation(line: 447, column: 6, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !684, file: !2, line: 447, column: 6)
!1128 = !DILocation(line: 447, column: 12, scope: !1127)
!1129 = !DILocation(line: 447, column: 19, scope: !1127)
!1130 = !DILocation(line: 447, column: 6, scope: !684)
!1131 = !DILocation(line: 448, column: 19, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1127, file: !2, line: 447, column: 24)
!1133 = !DILocation(line: 449, column: 5, scope: !1132)
!1134 = !DILocation(line: 448, column: 36, scope: !1132)
!1135 = !DILocation(line: 448, column: 10, scope: !1132)
!1136 = !DILocation(line: 448, column: 8, scope: !1132)
!1137 = !DILocation(line: 450, column: 7, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1132, file: !2, line: 450, column: 7)
!1139 = !DILocation(line: 450, column: 12, scope: !1138)
!1140 = !DILocation(line: 450, column: 7, scope: !1132)
!1141 = !DILocation(line: 451, column: 4, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1138, file: !2, line: 450, column: 21)
!1143 = !DILocation(line: 453, column: 2, scope: !1132)
!1144 = !DILocation(line: 454, column: 19, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1127, file: !2, line: 453, column: 9)
!1146 = !DILocation(line: 455, column: 5, scope: !1145)
!1147 = !DILocation(line: 455, column: 11, scope: !1145)
!1148 = !DILocation(line: 454, column: 36, scope: !1145)
!1149 = !DILocation(line: 454, column: 10, scope: !1145)
!1150 = !DILocation(line: 454, column: 8, scope: !1145)
!1151 = !DILocation(line: 456, column: 7, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1145, file: !2, line: 456, column: 7)
!1153 = !DILocation(line: 456, column: 12, scope: !1152)
!1154 = !DILocation(line: 456, column: 7, scope: !1145)
!1155 = !DILocation(line: 457, column: 4, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1152, file: !2, line: 456, column: 21)
!1157 = !DILocation(line: 461, column: 19, scope: !1145)
!1158 = !DILocation(line: 461, column: 36, scope: !1145)
!1159 = !DILocation(line: 461, column: 10, scope: !1145)
!1160 = !DILocation(line: 461, column: 8, scope: !1145)
!1161 = !DILocation(line: 462, column: 7, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1145, file: !2, line: 462, column: 7)
!1163 = !DILocation(line: 462, column: 12, scope: !1162)
!1164 = !DILocation(line: 462, column: 7, scope: !1145)
!1165 = !DILocation(line: 463, column: 4, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1162, file: !2, line: 462, column: 21)
!1167 = !DILocation(line: 468, column: 6, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !684, file: !2, line: 468, column: 6)
!1169 = !DILocation(line: 468, column: 12, scope: !1168)
!1170 = !DILocation(line: 468, column: 6, scope: !684)
!1171 = !DILocation(line: 469, column: 19, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !2, line: 468, column: 22)
!1173 = !DILocation(line: 470, column: 5, scope: !1172)
!1174 = !DILocation(line: 470, column: 11, scope: !1172)
!1175 = !DILocation(line: 469, column: 36, scope: !1172)
!1176 = !DILocation(line: 469, column: 10, scope: !1172)
!1177 = !DILocation(line: 469, column: 8, scope: !1172)
!1178 = !DILocation(line: 471, column: 7, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1172, file: !2, line: 471, column: 7)
!1180 = !DILocation(line: 471, column: 12, scope: !1179)
!1181 = !DILocation(line: 471, column: 7, scope: !1172)
!1182 = !DILocation(line: 472, column: 4, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1179, file: !2, line: 471, column: 21)
!1184 = !DILocation(line: 474, column: 2, scope: !1172)
!1185 = !DILocation(line: 477, column: 18, scope: !684)
!1186 = !DILocation(line: 477, column: 16, scope: !684)
!1187 = !DILocation(line: 478, column: 27, scope: !684)
!1188 = !DILocation(line: 478, column: 25, scope: !684)
!1189 = !DILocation(line: 479, column: 9, scope: !684)
!1190 = !DILocation(line: 479, column: 2, scope: !684)
!1191 = !DILocation(line: 480, column: 1, scope: !684)
!1192 = distinct !DISubprogram(name: "_sprintf_alloc", scope: !2, file: !2, line: 42, type: !1193, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !40, retainedNodes: !1195)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!240, !255, null}
!1195 = !{!1196, !1197, !1210, !1211, !1212, !1213}
!1196 = !DILocalVariable(name: "format", arg: 1, scope: !1192, file: !2, line: 42, type: !255)
!1197 = !DILocalVariable(name: "args", scope: !1192, file: !2, line: 44, type: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1199, line: 52, baseType: !1200)
!1199 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1201, line: 35, baseType: !1202)
!1201 = !DIFile(filename: "/usr/lib/clang/18/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "95ff2da58c2c75d7c246cff7935ff18b")
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !2, baseType: !1203)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1204, size: 192, elements: !657)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1209}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1204, file: !2, line: 44, baseType: !275, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1204, file: !2, line: 44, baseType: !275, size: 32, offset: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1204, file: !2, line: 44, baseType: !53, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1204, file: !2, line: 44, baseType: !53, size: 64, offset: 128)
!1210 = !DILocalVariable(name: "args_copy", scope: !1192, file: !2, line: 45, type: !1198)
!1211 = !DILocalVariable(name: "buf", scope: !1192, file: !2, line: 46, type: !240)
!1212 = !DILocalVariable(name: "bufsize", scope: !1192, file: !2, line: 47, type: !54)
!1213 = !DILocalVariable(name: "rc", scope: !1192, file: !2, line: 48, type: !44)
!1214 = !DILocation(line: 42, column: 28, scope: !1192)
!1215 = !DILocation(line: 44, column: 2, scope: !1192)
!1216 = !DILocation(line: 44, column: 10, scope: !1192)
!1217 = !DILocation(line: 45, column: 2, scope: !1192)
!1218 = !DILocation(line: 45, column: 10, scope: !1192)
!1219 = !DILocation(line: 46, column: 2, scope: !1192)
!1220 = !DILocation(line: 46, column: 8, scope: !1192)
!1221 = !DILocation(line: 47, column: 2, scope: !1192)
!1222 = !DILocation(line: 47, column: 9, scope: !1192)
!1223 = !DILocation(line: 48, column: 2, scope: !1192)
!1224 = !DILocation(line: 48, column: 6, scope: !1192)
!1225 = !DILocation(line: 50, column: 2, scope: !1192)
!1226 = !DILocation(line: 53, column: 10, scope: !1192)
!1227 = !DILocation(line: 56, column: 2, scope: !1192)
!1228 = !DILocation(line: 56, column: 9, scope: !1192)
!1229 = !DILocation(line: 56, column: 17, scope: !1192)
!1230 = !DILocation(line: 57, column: 16, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 56, column: 33)
!1232 = !DILocation(line: 57, column: 9, scope: !1231)
!1233 = !DILocation(line: 57, column: 7, scope: !1231)
!1234 = !DILocation(line: 58, column: 7, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1231, file: !2, line: 58, column: 7)
!1236 = !DILocation(line: 58, column: 11, scope: !1235)
!1237 = !DILocation(line: 58, column: 7, scope: !1231)
!1238 = !DILocation(line: 59, column: 4, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1235, file: !2, line: 58, column: 20)
!1240 = !DILocation(line: 60, column: 4, scope: !1239)
!1241 = !DILocation(line: 63, column: 3, scope: !1231)
!1242 = !DILocation(line: 64, column: 18, scope: !1231)
!1243 = !DILocation(line: 64, column: 23, scope: !1231)
!1244 = !DILocation(line: 64, column: 32, scope: !1231)
!1245 = !DILocation(line: 64, column: 40, scope: !1231)
!1246 = !DILocation(line: 64, column: 8, scope: !1231)
!1247 = !DILocation(line: 64, column: 6, scope: !1231)
!1248 = !DILocation(line: 65, column: 3, scope: !1231)
!1249 = !DILocation(line: 71, column: 7, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1231, file: !2, line: 71, column: 7)
!1251 = !DILocation(line: 71, column: 10, scope: !1250)
!1252 = !DILocation(line: 71, column: 15, scope: !1250)
!1253 = !DILocation(line: 71, column: 26, scope: !1250)
!1254 = !DILocation(line: 71, column: 18, scope: !1250)
!1255 = !DILocation(line: 71, column: 31, scope: !1250)
!1256 = !DILocation(line: 71, column: 29, scope: !1250)
!1257 = !DILocation(line: 71, column: 7, scope: !1231)
!1258 = !DILocation(line: 72, column: 4, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1250, file: !2, line: 71, column: 40)
!1260 = !DILocation(line: 73, column: 11, scope: !1259)
!1261 = !DILocation(line: 73, column: 4, scope: !1259)
!1262 = !DILocation(line: 83, column: 8, scope: !1231)
!1263 = !DILocation(line: 83, column: 3, scope: !1231)
!1264 = !DILocation(line: 84, column: 11, scope: !1231)
!1265 = distinct !{!1265, !1227, !1266}
!1266 = !DILocation(line: 85, column: 2, scope: !1192)
!1267 = !DILocation(line: 87, column: 2, scope: !1192)
!1268 = !DILocation(line: 88, column: 2, scope: !1192)
!1269 = !DILocation(line: 89, column: 1, scope: !1192)
!1270 = !DISubprogram(name: "free", scope: !1271, file: !1271, line: 555, type: !1272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1271 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1272 = !DISubroutineType(types: !1273)
!1273 = !{null, !53}
!1274 = !DISubprogram(name: "calloc", scope: !1271, file: !1271, line: 543, type: !1275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!53, !325, !325}
!1277 = distinct !DISubprogram(name: "memcpy", scope: !322, file: !322, line: 26, type: !1278, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !40, retainedNodes: !1284)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!53, !1280, !1281, !325}
!1280 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !53)
!1281 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1284 = !{!1285, !1286, !1287}
!1285 = !DILocalVariable(name: "__dest", arg: 1, scope: !1277, file: !322, line: 26, type: !1280)
!1286 = !DILocalVariable(name: "__src", arg: 2, scope: !1277, file: !322, line: 26, type: !1281)
!1287 = !DILocalVariable(name: "__len", arg: 3, scope: !1277, file: !322, line: 26, type: !325)
!1288 = !DILocation(line: 26, column: 1, scope: !1277)
!1289 = !DILocation(line: 29, column: 34, scope: !1277)
!1290 = !DILocation(line: 29, column: 42, scope: !1277)
!1291 = !DILocation(line: 29, column: 49, scope: !1277)
!1292 = !DILocation(line: 30, column: 6, scope: !1277)
!1293 = !DILocation(line: 29, column: 10, scope: !1277)
!1294 = !DILocation(line: 29, column: 3, scope: !1277)
!1295 = !DISubprogram(name: "fflush", scope: !1199, file: !1199, line: 230, type: !1296, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!44, !623}
!1298 = !DISubprogram(name: "rte_eal_init", scope: !1299, file: !1299, line: 113, type: !1300, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1299 = !DIFile(filename: "dpdk/build/include/rte_eal.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "4f1433b8a7b4f02c3ad7040436370c86")
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!44, !44, !239}
!1302 = !DISubprogram(name: "strstr", scope: !1303, file: !1303, line: 350, type: !1304, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1303 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!240, !255, !255}
!1306 = distinct !DISubprogram(name: "dpdk_cleanup", scope: !2, file: !2, line: 618, type: !393, scopeLine: 619, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !40)
!1307 = !DILocation(line: 621, column: 7, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1306, file: !2, line: 621, column: 6)
!1309 = !DILocation(line: 621, column: 6, scope: !1306)
!1310 = !DILocation(line: 622, column: 3, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1308, file: !2, line: 621, column: 24)
!1312 = !DILocation(line: 623, column: 2, scope: !1311)
!1313 = !DILocation(line: 624, column: 1, scope: !1306)
!1314 = !DISubprogram(name: "rte_eal_cleanup", scope: !1299, file: !1299, line: 127, type: !384, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1315 = distinct !DISubprogram(name: "spdk_env_fini", scope: !2, file: !2, line: 627, type: !393, scopeLine: 628, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !40)
!1316 = !DILocation(line: 629, column: 2, scope: !1315)
!1317 = !DILocation(line: 630, column: 1, scope: !1315)
!1318 = distinct !DISubprogram(name: "spdk_env_dpdk_external_init", scope: !2, file: !2, line: 633, type: !1319, scopeLine: 634, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !40)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!121}
!1321 = !DILocation(line: 635, column: 9, scope: !1318)
!1322 = !DILocation(line: 635, column: 2, scope: !1318)
!1323 = !DISubprogram(name: "__builtin___memset_chk", scope: !1324, file: !1324, line: 32, type: !1325, flags: DIFlagArtificial | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1324 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/strings_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "2c53309439f074d781ca95a346401d78")
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!53, !53, !44, !56, !56}
!1327 = distinct !DISubprogram(name: "push_arg", scope: !2, file: !2, line: 128, type: !1328, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !40, retainedNodes: !1331)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!239, !239, !1330, !240}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!1331 = !{!1332, !1333, !1334, !1335}
!1332 = !DILocalVariable(name: "args", arg: 1, scope: !1327, file: !2, line: 128, type: !239)
!1333 = !DILocalVariable(name: "argcount", arg: 2, scope: !1327, file: !2, line: 128, type: !1330)
!1334 = !DILocalVariable(name: "arg", arg: 3, scope: !1327, file: !2, line: 128, type: !240)
!1335 = !DILocalVariable(name: "tmp", scope: !1327, file: !2, line: 130, type: !239)
!1336 = !DILocation(line: 128, column: 16, scope: !1327)
!1337 = !DILocation(line: 128, column: 29, scope: !1327)
!1338 = !DILocation(line: 128, column: 45, scope: !1327)
!1339 = !DILocation(line: 130, column: 2, scope: !1327)
!1340 = !DILocation(line: 130, column: 9, scope: !1327)
!1341 = !DILocation(line: 132, column: 6, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1327, file: !2, line: 132, column: 6)
!1343 = !DILocation(line: 132, column: 10, scope: !1342)
!1344 = !DILocation(line: 132, column: 6, scope: !1327)
!1345 = !DILocation(line: 133, column: 3, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1342, file: !2, line: 132, column: 19)
!1347 = !DILocation(line: 134, column: 13, scope: !1346)
!1348 = !DILocation(line: 134, column: 20, scope: !1346)
!1349 = !DILocation(line: 134, column: 19, scope: !1346)
!1350 = !DILocation(line: 134, column: 3, scope: !1346)
!1351 = !DILocation(line: 135, column: 3, scope: !1346)
!1352 = !DILocation(line: 138, column: 16, scope: !1327)
!1353 = !DILocation(line: 138, column: 41, scope: !1327)
!1354 = !DILocation(line: 138, column: 40, scope: !1327)
!1355 = !DILocation(line: 138, column: 50, scope: !1327)
!1356 = !DILocation(line: 138, column: 39, scope: !1327)
!1357 = !DILocation(line: 138, column: 37, scope: !1327)
!1358 = !DILocation(line: 138, column: 8, scope: !1327)
!1359 = !DILocation(line: 138, column: 6, scope: !1327)
!1360 = !DILocation(line: 139, column: 6, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1327, file: !2, line: 139, column: 6)
!1362 = !DILocation(line: 139, column: 10, scope: !1361)
!1363 = !DILocation(line: 139, column: 6, scope: !1327)
!1364 = !DILocation(line: 140, column: 8, scope: !1365)
!1365 = distinct !DILexicalBlock(scope: !1361, file: !2, line: 139, column: 19)
!1366 = !DILocation(line: 140, column: 3, scope: !1365)
!1367 = !DILocation(line: 141, column: 13, scope: !1365)
!1368 = !DILocation(line: 141, column: 20, scope: !1365)
!1369 = !DILocation(line: 141, column: 19, scope: !1365)
!1370 = !DILocation(line: 141, column: 3, scope: !1365)
!1371 = !DILocation(line: 142, column: 3, scope: !1365)
!1372 = !DILocation(line: 145, column: 19, scope: !1327)
!1373 = !DILocation(line: 145, column: 2, scope: !1327)
!1374 = !DILocation(line: 145, column: 7, scope: !1327)
!1375 = !DILocation(line: 145, column: 6, scope: !1327)
!1376 = !DILocation(line: 145, column: 17, scope: !1327)
!1377 = !DILocation(line: 146, column: 4, scope: !1327)
!1378 = !DILocation(line: 146, column: 13, scope: !1327)
!1379 = !DILocation(line: 148, column: 9, scope: !1327)
!1380 = !DILocation(line: 148, column: 2, scope: !1327)
!1381 = !DILocation(line: 149, column: 1, scope: !1327)
!1382 = !DISubprogram(name: "strlen", scope: !1303, file: !1303, line: 407, type: !1383, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!56, !255}
!1385 = !DISubprogram(name: "spdk_pci_addr_fmt", scope: !252, file: !252, line: 1165, type: !1386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!44, !240, !54, !1388}
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!1390 = !DISubprogram(name: "strdup", scope: !1303, file: !1303, line: 187, type: !1391, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!240, !255}
!1393 = !DISubprogram(name: "strtok", scope: !1303, file: !1303, line: 356, type: !1394, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{!240, !1396, !675}
!1396 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !240)
!1397 = !DISubprogram(name: "rte_vfio_noiommu_is_enabled", scope: !1398, file: !1398, line: 174, type: !384, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1398 = !DIFile(filename: "dpdk/build/include/rte_vfio.h", directory: "/local-ssd/spdk-ojxrvkx3artgaydwmt3o4m323fkowu7u-build/aidengro/spack-stage-spdk-23.01-ojxrvkx3artgaydwmt3o4m323fkowu7u/spack-src", checksumkind: CSK_MD5, checksum: "eb457f83c880aa2032bbcda35e1676f8")
!1399 = distinct !DISubprogram(name: "get_iommu_width", scope: !2, file: !2, line: 161, type: !384, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !40, retainedNodes: !1400)
!1400 = !{!1401, !1402, !1474, !1476, !1479, !1480, !1481, !1486}
!1401 = !DILocalVariable(name: "width", scope: !1399, file: !2, line: 163, type: !44)
!1402 = !DILocalVariable(name: "glob_results", scope: !1399, file: !2, line: 164, type: !1403)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "glob_t", file: !55, line: 105, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 82, size: 576, elements: !1405)
!1405 = !{!1406, !1408, !1409, !1410, !1411, !1413, !1430, !1434, !1473}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathc", scope: !1404, file: !55, line: 84, baseType: !1407, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !55, line: 27, baseType: !56)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathv", scope: !1404, file: !55, line: 85, baseType: !239, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "gl_offs", scope: !1404, file: !55, line: 86, baseType: !1407, size: 64, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "gl_flags", scope: !1404, file: !55, line: 87, baseType: !44, size: 32, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "gl_closedir", scope: !1404, file: !55, line: 91, baseType: !1412, size: 64, offset: 256)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "gl_readdir", scope: !1404, file: !55, line: 93, baseType: !1414, size: 64, offset: 320)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!1417, !53}
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !1419, line: 22, size: 2240, elements: !1420)
!1419 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "bc8b10a1ddd2747862e3ae7b91dbf464")
!1420 = !{!1421, !1423, !1424, !1425, !1426}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1418, file: !1419, line: 25, baseType: !1422, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !274, line: 148, baseType: !56)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1418, file: !1419, line: 26, baseType: !649, size: 64, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1418, file: !1419, line: 31, baseType: !652, size: 16, offset: 128)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1418, file: !1419, line: 32, baseType: !279, size: 8, offset: 144)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1418, file: !1419, line: 33, baseType: !1427, size: 2048, offset: 152)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1428)
!1428 = !{!1429}
!1429 = !DISubrange(count: 256)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "gl_opendir", scope: !1404, file: !55, line: 97, baseType: !1431, size: 64, offset: 384)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!53, !255}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "gl_lstat", scope: !1404, file: !55, line: 99, baseType: !1435, size: 64, offset: 448)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!44, !675, !1438}
!1438 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1439)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1441, line: 26, size: 1152, elements: !1442)
!1441 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!1442 = !{!1443, !1445, !1446, !1448, !1450, !1452, !1454, !1455, !1456, !1457, !1459, !1461, !1469, !1470, !1471}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1440, file: !1441, line: 31, baseType: !1444, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !274, line: 145, baseType: !56)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1440, file: !1441, line: 36, baseType: !1422, size: 64, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1440, file: !1441, line: 44, baseType: !1447, size: 64, offset: 128)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !274, line: 151, baseType: !56)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1440, file: !1441, line: 45, baseType: !1449, size: 32, offset: 192)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !274, line: 150, baseType: !275)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1440, file: !1441, line: 47, baseType: !1451, size: 32, offset: 224)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !274, line: 146, baseType: !275)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1440, file: !1441, line: 48, baseType: !1453, size: 32, offset: 256)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !274, line: 147, baseType: !275)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1440, file: !1441, line: 50, baseType: !44, size: 32, offset: 288)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1440, file: !1441, line: 52, baseType: !1444, size: 64, offset: 320)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1440, file: !1441, line: 57, baseType: !649, size: 64, offset: 384)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1440, file: !1441, line: 61, baseType: !1458, size: 64, offset: 448)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !274, line: 175, baseType: !650)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1440, file: !1441, line: 63, baseType: !1460, size: 64, offset: 512)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !274, line: 180, baseType: !650)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1440, file: !1441, line: 74, baseType: !1462, size: 128, offset: 576)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1463, line: 11, size: 128, elements: !1464)
!1463 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1464 = !{!1465, !1467}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1462, file: !1463, line: 16, baseType: !1466, size: 64)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !274, line: 160, baseType: !650)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1462, file: !1463, line: 21, baseType: !1468, size: 64, offset: 64)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !274, line: 197, baseType: !650)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1440, file: !1441, line: 75, baseType: !1462, size: 128, offset: 704)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1440, file: !1441, line: 76, baseType: !1462, size: 128, offset: 832)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1440, file: !1441, line: 89, baseType: !1472, size: 192, offset: 960)
!1472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1468, size: 192, elements: !125)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "gl_stat", scope: !1404, file: !55, line: 100, baseType: !1435, size: 64, offset: 512)
!1474 = !DILocalVariable(name: "i", scope: !1475, file: !2, line: 170, type: !54)
!1475 = distinct !DILexicalBlock(scope: !1399, file: !2, line: 170, column: 2)
!1476 = !DILocalVariable(name: "filename", scope: !1477, file: !2, line: 171, type: !255)
!1477 = distinct !DILexicalBlock(scope: !1478, file: !2, line: 170, column: 53)
!1478 = distinct !DILexicalBlock(scope: !1475, file: !2, line: 170, column: 2)
!1479 = !DILocalVariable(name: "file", scope: !1477, file: !2, line: 172, type: !623)
!1480 = !DILocalVariable(name: "cap_reg", scope: !1477, file: !2, line: 173, type: !285)
!1481 = !DILocalVariable(name: "mgaw", scope: !1482, file: !2, line: 182, type: !44)
!1482 = distinct !DILexicalBlock(scope: !1483, file: !2, line: 180, column: 49)
!1483 = distinct !DILexicalBlock(scope: !1484, file: !2, line: 180, column: 8)
!1484 = distinct !DILexicalBlock(scope: !1485, file: !2, line: 179, column: 48)
!1485 = distinct !DILexicalBlock(scope: !1477, file: !2, line: 179, column: 7)
!1486 = !DILocalVariable(name: "mgaw", scope: !1487, file: !2, line: 189, type: !44)
!1487 = distinct !DILexicalBlock(scope: !1488, file: !2, line: 187, column: 54)
!1488 = distinct !DILexicalBlock(scope: !1483, file: !2, line: 187, column: 15)
!1489 = !DILocation(line: 163, column: 2, scope: !1399)
!1490 = !DILocation(line: 163, column: 6, scope: !1399)
!1491 = !DILocation(line: 164, column: 2, scope: !1399)
!1492 = !DILocation(line: 164, column: 9, scope: !1399)
!1493 = !DILocation(line: 167, column: 2, scope: !1399)
!1494 = !DILocation(line: 168, column: 2, scope: !1399)
!1495 = !DILocation(line: 170, column: 7, scope: !1475)
!1496 = !DILocation(line: 170, column: 14, scope: !1475)
!1497 = !DILocation(line: 170, column: 21, scope: !1478)
!1498 = !DILocation(line: 170, column: 38, scope: !1478)
!1499 = !DILocation(line: 170, column: 23, scope: !1478)
!1500 = !DILocation(line: 170, column: 2, scope: !1475)
!1501 = !DILocation(line: 170, column: 2, scope: !1478)
!1502 = !DILocation(line: 171, column: 3, scope: !1477)
!1503 = !DILocation(line: 171, column: 15, scope: !1477)
!1504 = !DILocation(line: 171, column: 39, scope: !1477)
!1505 = !DILocation(line: 171, column: 26, scope: !1477)
!1506 = !DILocation(line: 172, column: 3, scope: !1477)
!1507 = !DILocation(line: 172, column: 9, scope: !1477)
!1508 = !DILocation(line: 172, column: 22, scope: !1477)
!1509 = !DILocation(line: 172, column: 16, scope: !1477)
!1510 = !DILocation(line: 173, column: 3, scope: !1477)
!1511 = !DILocation(line: 173, column: 12, scope: !1477)
!1512 = !DILocation(line: 175, column: 7, scope: !1513)
!1513 = distinct !DILexicalBlock(scope: !1477, file: !2, line: 175, column: 7)
!1514 = !DILocation(line: 175, column: 12, scope: !1513)
!1515 = !DILocation(line: 175, column: 7, scope: !1477)
!1516 = !DILocation(line: 176, column: 4, scope: !1517)
!1517 = distinct !DILexicalBlock(scope: !1513, file: !2, line: 175, column: 21)
!1518 = !DILocation(line: 179, column: 14, scope: !1485)
!1519 = !DILocation(line: 179, column: 7, scope: !1485)
!1520 = !DILocation(line: 179, column: 42, scope: !1485)
!1521 = !DILocation(line: 179, column: 7, scope: !1477)
!1522 = !DILocation(line: 180, column: 15, scope: !1483)
!1523 = !DILocation(line: 180, column: 8, scope: !1483)
!1524 = !DILocation(line: 180, column: 40, scope: !1483)
!1525 = !DILocation(line: 180, column: 8, scope: !1484)
!1526 = !DILocation(line: 182, column: 5, scope: !1482)
!1527 = !DILocation(line: 182, column: 9, scope: !1482)
!1528 = !DILocation(line: 182, column: 18, scope: !1482)
!1529 = !DILocation(line: 182, column: 26, scope: !1482)
!1530 = !DILocation(line: 182, column: 47, scope: !1482)
!1531 = !DILocation(line: 182, column: 70, scope: !1482)
!1532 = !DILocation(line: 182, column: 16, scope: !1482)
!1533 = !DILocation(line: 184, column: 9, scope: !1534)
