; ModuleID = 'samples/798.bc'
source_filename = "src/stream/ngx_stream_upstream_hash_module.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_stream_module_t = type { ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_command_s = type { %struct.ngx_str_t, i64, ptr, i64, i64, ptr }
%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_conf_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr }
%struct.ngx_stream_upstream_hash_srv_conf_t = type { %struct.ngx_stream_complex_value_t, ptr }
%struct.ngx_stream_complex_value_t = type { %struct.ngx_str_t, ptr, ptr, ptr }
%struct.ngx_stream_compile_complex_value_t = type { ptr, ptr, ptr, i8 }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }
%struct.ngx_stream_conf_ctx_t = type { ptr, ptr }
%struct.ngx_stream_upstream_srv_conf_s = type { %struct.ngx_stream_upstream_peer_t, ptr, ptr, i64, %struct.ngx_str_t, ptr, i64, i16, i64, ptr }
%struct.ngx_stream_upstream_peer_t = type { ptr, ptr, ptr }
%union.anon.2 = type { i32 }
%struct.ngx_stream_upstream_rr_peers_s = type { i64, ptr, i64, ptr, i64, i8, ptr, ptr, ptr }
%struct.ngx_stream_upstream_chash_points_t = type { i64, [1 x %struct.ngx_stream_upstream_chash_point_t] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 92, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/stream/ngx_stream_upstream_hash_module.c", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf2af6eaba04b07ad6b2d23783acf78d")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 41)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "ngx_stream_upstream_hash_module_ctx", scope: !9, file: !2, line: 79, type: !657, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !10, globals: !52, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !16, !17, !23, !31, !13, !33}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !12, line: 79, baseType: !13)
!12 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !14, line: 90, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!15 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !19, line: 33, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !21, line: 31, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_conf_ctx_t", file: !25, line: 41, baseType: !26)
!25 = !DIFile(filename: "src/stream/ngx_stream.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "5b43959b152802dd9a372cd63f29aa49")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 38, size: 128, elements: !27)
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !26, file: !25, line: 39, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !26, file: !25, line: 40, baseType: !29, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_chash_point_t", file: !2, line: 16, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 13, size: 128, elements: !36)
!36 = !{!37, !42}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !35, file: !2, line: 14, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !39, line: 26, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !21, line: 42, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !35, file: !2, line: 15, baseType: !43, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !45, line: 19, baseType: !46)
!45 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "aecf67ab89c624000ba2e2684dbcfdc8")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 16, size: 128, elements: !47)
!47 = !{!48, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !45, line: 17, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 29, baseType: !15)
!50 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !45, line: 18, baseType: !17, size: 64, offset: 64)
!52 = !{!0, !53, !7, !617, !622, !627, !632, !637, !642, !647, !652}
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "ngx_stream_upstream_hash_module", scope: !9, file: !2, line: 91, type: !55, isLocal: false, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !56, line: 15, baseType: !57)
!56 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1c4d8383f329aa1de050d17038ecb169")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !58, line: 222, size: 1600, elements: !59)
!58 = !DIFile(filename: "src/core/ngx_module.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1b2032f87974a892f93f4098e8fc0619")
!59 = !{!60, !61, !62, !64, !65, !66, !67, !68, !69, !592, !593, !597, !601, !602, !603, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !57, file: !58, line: 223, baseType: !11, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !57, file: !58, line: 224, baseType: !11, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !58, line: 226, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !57, file: !58, line: 228, baseType: !11, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !57, file: !58, line: 229, baseType: !11, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !57, file: !58, line: 231, baseType: !11, size: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !57, file: !58, line: 232, baseType: !31, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !57, file: !58, line: 234, baseType: !16, size: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !57, file: !58, line: 235, baseType: !70, size: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !56, line: 22, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !73, line: 77, size: 448, elements: !74)
!73 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6ae6b72e2fd6bbb6ecc9de2e6386072c")
!74 = !{!75, !76, !77, !589, !590, !591}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !73, line: 78, baseType: !44, size: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !73, line: 79, baseType: !11, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !72, file: !73, line: 80, baseType: !78, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!63, !81, !70, !16}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !56, line: 16, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !73, line: 116, size: 768, elements: !84)
!84 = !{!85, !86, !261, !571, !572, !573, !582, !583, !584, !585, !586, !588}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !83, file: !73, line: 117, baseType: !63, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !83, file: !73, line: 118, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !89, line: 22, baseType: !90)
!89 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 16, size: 320, elements: !91)
!91 = !{!92, !93, !94, !95, !96}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !90, file: !89, line: 17, baseType: !16, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !90, file: !89, line: 18, baseType: !11, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !90, file: !89, line: 19, baseType: !49, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !90, file: !89, line: 20, baseType: !11, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !90, file: !89, line: 21, baseType: !97, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !56, line: 18, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !100, line: 57, size: 640, elements: !101)
!100 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!101 = !{!102, !110, !111, !112, !241, !248, !260}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !99, file: !100, line: 58, baseType: !103, size: 256)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !100, line: 54, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 49, size: 256, elements: !105)
!105 = !{!106, !107, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !104, file: !100, line: 50, baseType: !17, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !104, file: !100, line: 51, baseType: !17, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !100, line: 52, baseType: !97, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !104, file: !100, line: 53, baseType: !11, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !99, file: !100, line: 59, baseType: !49, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !99, file: !100, line: 60, baseType: !97, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !99, file: !100, line: 61, baseType: !113, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !56, line: 19, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !116, line: 59, size: 128, elements: !117)
!116 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6fc45f3cccbbf41b239dcfa9e2c5b7b1")
!117 = !{!118, !240}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !115, file: !116, line: 60, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !116, line: 18, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !116, line: 20, size: 640, elements: !122)
!122 = !{!123, !124, !125, !129, !130, !131, !132, !134, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !121, file: !116, line: 21, baseType: !17, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !121, file: !116, line: 22, baseType: !17, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !121, file: !116, line: 23, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !19, line: 87, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !21, line: 153, baseType: !128)
!128 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !121, file: !116, line: 24, baseType: !126, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !121, file: !116, line: 26, baseType: !17, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !121, file: !116, line: 27, baseType: !17, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !121, file: !116, line: 28, baseType: !133, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !116, line: 16, baseType: !16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !121, file: !116, line: 29, baseType: !135, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !56, line: 23, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !138, line: 16, size: 1600, elements: !139)
!138 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!139 = !{!140, !144, !145, !184, !185, !186, !225, !226}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !137, file: !138, line: 17, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !142, line: 16, baseType: !143)
!142 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "7b9a751e8c1ad1afef5467d60ed94e69")
!143 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !138, line: 18, baseType: !44, size: 128, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !137, file: !138, line: 19, baseType: !146, size: 1152, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !142, line: 17, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !148, line: 26, size: 1152, elements: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!149 = !{!150, !152, !154, !156, !158, !160, !162, !163, !164, !166, !168, !170, !178, !179, !180}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !147, file: !148, line: 31, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !21, line: 145, baseType: !15)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !147, file: !148, line: 36, baseType: !153, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !21, line: 148, baseType: !15)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !147, file: !148, line: 44, baseType: !155, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !21, line: 151, baseType: !15)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !147, file: !148, line: 45, baseType: !157, size: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !21, line: 150, baseType: !41)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !147, file: !148, line: 47, baseType: !159, size: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !21, line: 146, baseType: !41)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !147, file: !148, line: 48, baseType: !161, size: 32, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !21, line: 147, baseType: !41)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !147, file: !148, line: 50, baseType: !143, size: 32, offset: 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !147, file: !148, line: 52, baseType: !151, size: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !147, file: !148, line: 57, baseType: !165, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !21, line: 152, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !147, file: !148, line: 61, baseType: !167, size: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !21, line: 175, baseType: !128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !147, file: !148, line: 63, baseType: !169, size: 64, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !21, line: 180, baseType: !128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !147, file: !148, line: 74, baseType: !171, size: 128, offset: 576)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !172, line: 11, size: 128, elements: !173)
!172 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!173 = !{!174, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !171, file: !172, line: 16, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !21, line: 160, baseType: !128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !171, file: !172, line: 21, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !21, line: 197, baseType: !128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !147, file: !148, line: 75, baseType: !171, size: 128, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !147, file: !148, line: 76, baseType: !171, size: 128, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !147, file: !148, line: 89, baseType: !181, size: 192, offset: 960)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 192, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 3)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !137, file: !138, line: 21, baseType: !126, size: 64, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !137, file: !138, line: 22, baseType: !126, size: 64, offset: 1408)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !137, file: !138, line: 24, baseType: !187, size: 64, offset: 1472)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !56, line: 20, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !190, line: 50, size: 640, elements: !191)
!190 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f35895306f847777914ce99ffeccfabd")
!191 = !{!192, !193, !205, !208, !211, !216, !217, !222, !223, !224}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !189, file: !190, line: 51, baseType: !11, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !189, file: !190, line: 52, baseType: !194, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !56, line: 21, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !73, line: 89, size: 320, elements: !197)
!197 = !{!198, !199, !200, !204}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !196, file: !73, line: 90, baseType: !141, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !73, line: 91, baseType: !44, size: 128, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !196, file: !73, line: 93, baseType: !201, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !194, !187}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !73, line: 94, baseType: !16, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !189, file: !190, line: 54, baseType: !206, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !207, line: 98, baseType: !15)
!207 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "eac8f0294f941da9268c3a72c9fca0e1")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !189, file: !190, line: 56, baseType: !209, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !210, line: 10, baseType: !175)
!210 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!211 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !189, file: !190, line: 58, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !190, line: 45, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!17, !187, !17, !49}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !189, file: !190, line: 59, baseType: !16, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !189, file: !190, line: 61, baseType: !218, size: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !190, line: 46, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !187, !11, !17, !49}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !189, file: !190, line: 62, baseType: !16, size: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !189, file: !190, line: 70, baseType: !63, size: 64, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !190, line: 72, baseType: !187, size: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !137, file: !138, line: 37, baseType: !41, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !137, file: !138, line: 38, baseType: !41, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !121, file: !116, line: 30, baseType: !119, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !121, file: !116, line: 34, baseType: !41, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !121, file: !116, line: 40, baseType: !41, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !121, file: !116, line: 43, baseType: !41, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !121, file: !116, line: 45, baseType: !41, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !121, file: !116, line: 46, baseType: !41, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !121, file: !116, line: 47, baseType: !41, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !121, file: !116, line: 48, baseType: !41, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !121, file: !116, line: 49, baseType: !41, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !121, file: !116, line: 50, baseType: !41, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !121, file: !116, line: 52, baseType: !41, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !121, file: !116, line: 53, baseType: !41, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !121, file: !116, line: 55, baseType: !143, size: 32, offset: 608)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !116, line: 61, baseType: !113, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !99, file: !100, line: 62, baseType: !242, size: 64, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !100, line: 41, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !100, line: 43, size: 128, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !100, line: 44, baseType: !242, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !244, file: !100, line: 45, baseType: !16, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !99, file: !100, line: 63, baseType: !249, size: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !100, line: 32, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !100, line: 34, size: 192, elements: !252)
!252 = !{!253, !258, !259}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !251, file: !100, line: 35, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !100, line: 30, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !16}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !251, file: !100, line: 36, baseType: !16, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !100, line: 37, baseType: !249, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !99, file: !100, line: 64, baseType: !187, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !83, file: !73, line: 120, baseType: !262, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !56, line: 17, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !265, line: 47, size: 5184, elements: !266)
!265 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "084646d0d3ecf791b89c14281fd46376")
!266 = !{!267, !270, !271, !272, !273, !274, !520, !521, !522, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !569, !570}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !264, file: !265, line: 48, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !264, file: !265, line: 49, baseType: !97, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !264, file: !265, line: 51, baseType: !187, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !264, file: !265, line: 52, baseType: !188, size: 640, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !264, file: !265, line: 54, baseType: !11, size: 64, offset: 832)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !264, file: !265, line: 56, baseType: !275, size: 64, offset: 896)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !56, line: 26, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !279, line: 124, size: 1920, elements: !280)
!279 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf513a87e959064e14502903e9282b0e")
!280 = !{!281, !282, !339, !340, !343, !351, !353, !358, !363, !442, !443, !444, !445, !446, !447, !448, !449, !450, !455, !496, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !278, file: !279, line: 125, baseType: !16, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !278, file: !279, line: 126, baseType: !283, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !56, line: 24, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !286, line: 30, size: 768, elements: !287)
!286 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c79f651cc4aca504d9d912404beb8bf3")
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !316, !317, !318, !331}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !285, file: !286, line: 31, baseType: !16, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !285, file: !286, line: 33, baseType: !41, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !285, file: !286, line: 35, baseType: !41, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !285, file: !286, line: 38, baseType: !41, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !285, file: !286, line: 44, baseType: !41, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !285, file: !286, line: 46, baseType: !41, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !285, file: !286, line: 49, baseType: !41, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !285, file: !286, line: 51, baseType: !41, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !285, file: !286, line: 54, baseType: !41, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !285, file: !286, line: 56, baseType: !41, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !285, file: !286, line: 57, baseType: !41, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !285, file: !286, line: 59, baseType: !41, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !285, file: !286, line: 60, baseType: !41, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !285, file: !286, line: 62, baseType: !41, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !285, file: !286, line: 64, baseType: !41, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !285, file: !286, line: 67, baseType: !41, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !285, file: !286, line: 69, baseType: !41, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !285, file: !286, line: 71, baseType: !41, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !285, file: !286, line: 74, baseType: !41, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !285, file: !286, line: 75, baseType: !41, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "skip_socket_leak_check", scope: !285, file: !286, line: 77, baseType: !41, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !285, file: !286, line: 80, baseType: !41, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !285, file: !286, line: 110, baseType: !41, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !285, file: !286, line: 113, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !56, line: 32, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !283}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !285, file: !286, line: 120, baseType: !11, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !285, file: !286, line: 122, baseType: !187, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !285, file: !286, line: 124, baseType: !319, size: 320, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !320, line: 20, baseType: !321)
!320 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ee5b3151c1c48b156833d321f8e1946a")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !320, line: 22, size: 320, elements: !322)
!322 = !{!323, !325, !327, !328, !329, !330}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !321, file: !320, line: 23, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !320, line: 16, baseType: !11)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !321, file: !320, line: 24, baseType: !326, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !321, file: !320, line: 25, baseType: !326, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !321, file: !320, line: 26, baseType: !326, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !321, file: !320, line: 27, baseType: !18, size: 8, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !320, line: 28, baseType: !18, size: 8, offset: 264)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !285, file: !286, line: 127, baseType: !332, size: 128, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !333, line: 16, baseType: !334)
!333 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !333, line: 18, size: 128, elements: !335)
!335 = !{!336, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !334, file: !333, line: 19, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !333, line: 20, baseType: !337, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !278, file: !279, line: 127, baseType: !283, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !278, file: !279, line: 129, baseType: !341, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !342, line: 17, baseType: !143)
!342 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ad64fd7b9f2b4876e8c9dcdeeb2305ce")
!343 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !278, file: !279, line: 131, baseType: !344, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !345, line: 19, baseType: !346)
!345 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !276, !17, !49}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !19, line: 108, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !21, line: 194, baseType: !128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !278, file: !279, line: 132, baseType: !352, size: 64, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !345, line: 22, baseType: !346)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !278, file: !279, line: 133, baseType: !354, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !345, line: 20, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!349, !276, !113, !126}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !278, file: !279, line: 134, baseType: !359, size: 64, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !345, line: 23, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!113, !276, !113, !126}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !278, file: !279, line: 136, baseType: !364, size: 64, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !279, line: 16, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !279, line: 18, size: 2432, elements: !367)
!367 = !{!368, !369, !382, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !400, !401, !402, !403, !404, !405, !408, !409, !410, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !366, file: !279, line: 19, baseType: !341, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !366, file: !279, line: 21, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !372, line: 180, size: 128, elements: !373)
!372 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!373 = !{!374, !378}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !371, file: !372, line: 182, baseType: !375, size: 16)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !376, line: 28, baseType: !377)
!376 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!377 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !371, file: !372, line: 183, baseType: !379, size: 112, offset: 16)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 14)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !366, file: !279, line: 22, baseType: !383, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !384, line: 274, baseType: !385)
!384 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !21, line: 210, baseType: !41)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !366, file: !279, line: 23, baseType: !49, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !366, file: !279, line: 24, baseType: !44, size: 128, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !279, line: 26, baseType: !143, size: 32, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !366, file: !279, line: 28, baseType: !143, size: 32, offset: 416)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !366, file: !279, line: 29, baseType: !143, size: 32, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !366, file: !279, line: 30, baseType: !143, size: 32, offset: 480)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !366, file: !279, line: 32, baseType: !143, size: 32, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !366, file: !279, line: 33, baseType: !143, size: 32, offset: 544)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !366, file: !279, line: 34, baseType: !143, size: 32, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !366, file: !279, line: 38, baseType: !396, size: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !56, line: 33, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !276}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !366, file: !279, line: 40, baseType: !16, size: 64, offset: 704)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !366, file: !279, line: 42, baseType: !188, size: 640, offset: 768)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !366, file: !279, line: 43, baseType: !187, size: 64, offset: 1408)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !366, file: !279, line: 45, baseType: !49, size: 64, offset: 1472)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !366, file: !279, line: 47, baseType: !49, size: 64, offset: 1536)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !366, file: !279, line: 49, baseType: !406, size: 64, offset: 1600)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !407, line: 16, baseType: !324)
!407 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !366, file: !279, line: 51, baseType: !364, size: 64, offset: 1664)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !366, file: !279, line: 52, baseType: !276, size: 64, offset: 1728)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !366, file: !279, line: 54, baseType: !411, size: 192, offset: 1792)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !320, line: 32, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !320, line: 37, size: 192, elements: !413)
!413 = !{!414, !415, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !412, file: !320, line: 38, baseType: !326, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !412, file: !320, line: 39, baseType: !326, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !412, file: !320, line: 40, baseType: !417, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !320, line: 34, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !326, !326, !326}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !366, file: !279, line: 55, baseType: !319, size: 320, offset: 1984)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !366, file: !279, line: 57, baseType: !11, size: 64, offset: 2304)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !366, file: !279, line: 59, baseType: !41, size: 1, offset: 2368, flags: DIFlagBitField, extraData: i64 2368)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !366, file: !279, line: 60, baseType: !41, size: 1, offset: 2369, flags: DIFlagBitField, extraData: i64 2368)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !366, file: !279, line: 61, baseType: !41, size: 1, offset: 2370, flags: DIFlagBitField, extraData: i64 2368)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !366, file: !279, line: 63, baseType: !41, size: 1, offset: 2371, flags: DIFlagBitField, extraData: i64 2368)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !366, file: !279, line: 64, baseType: !41, size: 1, offset: 2372, flags: DIFlagBitField, extraData: i64 2368)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !366, file: !279, line: 65, baseType: !41, size: 1, offset: 2373, flags: DIFlagBitField, extraData: i64 2368)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !366, file: !279, line: 66, baseType: !41, size: 1, offset: 2374, flags: DIFlagBitField, extraData: i64 2368)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !366, file: !279, line: 67, baseType: !41, size: 1, offset: 2375, flags: DIFlagBitField, extraData: i64 2368)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !366, file: !279, line: 68, baseType: !41, size: 1, offset: 2376, flags: DIFlagBitField, extraData: i64 2368)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !366, file: !279, line: 69, baseType: !41, size: 1, offset: 2377, flags: DIFlagBitField, extraData: i64 2368)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !366, file: !279, line: 70, baseType: !41, size: 1, offset: 2378, flags: DIFlagBitField, extraData: i64 2368)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !366, file: !279, line: 73, baseType: !41, size: 1, offset: 2379, flags: DIFlagBitField, extraData: i64 2368)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !366, file: !279, line: 75, baseType: !41, size: 1, offset: 2380, flags: DIFlagBitField, extraData: i64 2368)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !366, file: !279, line: 76, baseType: !41, size: 1, offset: 2381, flags: DIFlagBitField, extraData: i64 2368)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !366, file: !279, line: 77, baseType: !41, size: 2, offset: 2382, flags: DIFlagBitField, extraData: i64 2368)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !366, file: !279, line: 79, baseType: !41, size: 1, offset: 2384, flags: DIFlagBitField, extraData: i64 2368)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !366, file: !279, line: 80, baseType: !41, size: 1, offset: 2385, flags: DIFlagBitField, extraData: i64 2368)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !366, file: !279, line: 81, baseType: !41, size: 1, offset: 2386, flags: DIFlagBitField, extraData: i64 2368)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !366, file: !279, line: 90, baseType: !143, size: 32, offset: 2400)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !278, file: !279, line: 138, baseType: !126, size: 64, offset: 576)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !278, file: !279, line: 140, baseType: !187, size: 64, offset: 640)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !278, file: !279, line: 142, baseType: !97, size: 64, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !279, line: 144, baseType: !143, size: 32, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !278, file: !279, line: 146, baseType: !370, size: 64, offset: 832)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !278, file: !279, line: 147, baseType: !383, size: 32, offset: 896)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !278, file: !279, line: 148, baseType: !44, size: 128, offset: 960)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !278, file: !279, line: 150, baseType: !44, size: 128, offset: 1088)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !278, file: !279, line: 151, baseType: !451, size: 16, offset: 1216)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !452, line: 123, baseType: !453)
!452 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !39, line: 25, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !21, line: 40, baseType: !377)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !278, file: !279, line: 154, baseType: !456, size: 64, offset: 1280)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !56, line: 29, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !459, line: 74, size: 704, elements: !460)
!459 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "51639b814b1b55c5b35047c033281672")
!460 = !{!461, !466, !470, !474, !475, !476, !477, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !458, file: !459, line: 75, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !464, line: 184, baseType: !465)
!464 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !464, line: 184, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !458, file: !459, line: 76, baseType: !467, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !464, line: 185, baseType: !469)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !464, line: 185, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !458, file: !459, line: 78, baseType: !471, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !12, line: 78, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !384, line: 267, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !21, line: 207, baseType: !128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !458, file: !459, line: 79, baseType: !119, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !458, file: !459, line: 80, baseType: !49, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !458, file: !459, line: 82, baseType: !396, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !458, file: !459, line: 84, baseType: !478, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !480, line: 231, baseType: !481)
!480 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "848d42aedd0da44ffda19088217823c7")
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !480, line: 231, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !458, file: !459, line: 85, baseType: !396, size: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !458, file: !459, line: 87, baseType: !312, size: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !458, file: !459, line: 88, baseType: !312, size: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !458, file: !459, line: 90, baseType: !18, size: 8, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !458, file: !459, line: 92, baseType: !41, size: 1, offset: 648, flags: DIFlagBitField, extraData: i64 648)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !458, file: !459, line: 93, baseType: !41, size: 1, offset: 649, flags: DIFlagBitField, extraData: i64 648)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !458, file: !459, line: 94, baseType: !41, size: 1, offset: 650, flags: DIFlagBitField, extraData: i64 648)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !458, file: !459, line: 95, baseType: !41, size: 1, offset: 651, flags: DIFlagBitField, extraData: i64 648)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !458, file: !459, line: 96, baseType: !41, size: 1, offset: 652, flags: DIFlagBitField, extraData: i64 648)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !458, file: !459, line: 97, baseType: !41, size: 1, offset: 653, flags: DIFlagBitField, extraData: i64 648)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !458, file: !459, line: 98, baseType: !41, size: 1, offset: 654, flags: DIFlagBitField, extraData: i64 648)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !458, file: !459, line: 99, baseType: !41, size: 1, offset: 655, flags: DIFlagBitField, extraData: i64 648)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !458, file: !459, line: 100, baseType: !41, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 648)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !458, file: !459, line: 101, baseType: !41, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 648)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !278, file: !279, line: 157, baseType: !497, size: 64, offset: 1344)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !56, line: 30, baseType: !499)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !56, line: 30, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !278, file: !279, line: 159, baseType: !370, size: 64, offset: 1408)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !278, file: !279, line: 160, baseType: !383, size: 32, offset: 1472)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !278, file: !279, line: 162, baseType: !119, size: 64, offset: 1536)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !278, file: !279, line: 164, baseType: !332, size: 128, offset: 1600)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !278, file: !279, line: 166, baseType: !206, size: 64, offset: 1728)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !278, file: !279, line: 168, baseType: !11, size: 64, offset: 1792)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !278, file: !279, line: 170, baseType: !41, size: 8, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !278, file: !279, line: 172, baseType: !41, size: 3, offset: 1864, flags: DIFlagBitField, extraData: i64 1856)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !278, file: !279, line: 174, baseType: !41, size: 1, offset: 1867, flags: DIFlagBitField, extraData: i64 1856)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !278, file: !279, line: 175, baseType: !41, size: 1, offset: 1868, flags: DIFlagBitField, extraData: i64 1856)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !278, file: !279, line: 176, baseType: !41, size: 1, offset: 1869, flags: DIFlagBitField, extraData: i64 1856)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !278, file: !279, line: 178, baseType: !41, size: 1, offset: 1870, flags: DIFlagBitField, extraData: i64 1856)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !278, file: !279, line: 179, baseType: !41, size: 1, offset: 1871, flags: DIFlagBitField, extraData: i64 1856)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !278, file: !279, line: 180, baseType: !41, size: 1, offset: 1872, flags: DIFlagBitField, extraData: i64 1856)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !278, file: !279, line: 181, baseType: !41, size: 1, offset: 1873, flags: DIFlagBitField, extraData: i64 1856)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !278, file: !279, line: 183, baseType: !41, size: 1, offset: 1874, flags: DIFlagBitField, extraData: i64 1856)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !278, file: !279, line: 184, baseType: !41, size: 1, offset: 1875, flags: DIFlagBitField, extraData: i64 1856)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !278, file: !279, line: 185, baseType: !41, size: 2, offset: 1876, flags: DIFlagBitField, extraData: i64 1856)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !278, file: !279, line: 186, baseType: !41, size: 2, offset: 1878, flags: DIFlagBitField, extraData: i64 1856)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !278, file: !279, line: 188, baseType: !41, size: 1, offset: 1880, flags: DIFlagBitField, extraData: i64 1856)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !264, file: !265, line: 57, baseType: !276, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !264, file: !265, line: 58, baseType: !11, size: 64, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !264, file: !265, line: 60, baseType: !523, size: 64, offset: 1088)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !264, file: !265, line: 61, baseType: !11, size: 64, offset: 1152)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !264, file: !265, line: 62, baseType: !11, size: 64, offset: 1216)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !264, file: !265, line: 64, baseType: !332, size: 128, offset: 1280)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !264, file: !265, line: 65, baseType: !11, size: 64, offset: 1408)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !264, file: !265, line: 67, baseType: !88, size: 320, offset: 1472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !264, file: !265, line: 68, baseType: !88, size: 320, offset: 1792)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !264, file: !265, line: 70, baseType: !88, size: 320, offset: 2112)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !264, file: !265, line: 71, baseType: !411, size: 192, offset: 2432)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !264, file: !265, line: 72, baseType: !319, size: 320, offset: 2624)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !264, file: !265, line: 74, baseType: !535, size: 448, offset: 2944)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !536, line: 31, baseType: !537)
!536 = !DIFile(filename: "src/core/ngx_list.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "580525d954b127a1c35170a83ca4d8b1")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 25, size: 448, elements: !538)
!538 = !{!539, !547, !548, !549, !550}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !537, file: !536, line: 26, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !536, line: 16, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !536, line: 18, size: 192, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !542, file: !536, line: 19, baseType: !16, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !542, file: !536, line: 20, baseType: !11, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !542, file: !536, line: 21, baseType: !540, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !537, file: !536, line: 27, baseType: !541, size: 192, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !537, file: !536, line: 28, baseType: !49, size: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !537, file: !536, line: 29, baseType: !11, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !537, file: !536, line: 30, baseType: !97, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !264, file: !265, line: 75, baseType: !535, size: 448, offset: 3392)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !264, file: !265, line: 77, baseType: !11, size: 64, offset: 3840)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !264, file: !265, line: 78, baseType: !11, size: 64, offset: 3904)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !264, file: !265, line: 80, baseType: !276, size: 64, offset: 3968)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !264, file: !265, line: 81, baseType: !283, size: 64, offset: 4032)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !264, file: !265, line: 82, baseType: !283, size: 64, offset: 4096)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !264, file: !265, line: 84, baseType: !262, size: 64, offset: 4160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !264, file: !265, line: 86, baseType: !44, size: 128, offset: 4224)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !264, file: !265, line: 87, baseType: !44, size: 128, offset: 4352)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !264, file: !265, line: 88, baseType: !44, size: 128, offset: 4480)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !264, file: !265, line: 89, baseType: !44, size: 128, offset: 4608)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !264, file: !265, line: 90, baseType: !44, size: 128, offset: 4736)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !264, file: !265, line: 91, baseType: !44, size: 128, offset: 4864)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_handler", scope: !264, file: !265, line: 93, baseType: !565, size: 64, offset: 4992)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_intercept_pt", file: !265, line: 34, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!471, !187, !11, !17, !49}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_data", scope: !264, file: !265, line: 94, baseType: !16, size: 64, offset: 5056)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "entered_logger", scope: !264, file: !265, line: 95, baseType: !41, size: 32, offset: 5120)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !83, file: !73, line: 121, baseType: !97, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !83, file: !73, line: 122, baseType: !97, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !83, file: !73, line: 123, baseType: !574, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !73, line: 103, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 98, size: 1792, elements: !577)
!577 = !{!578, !579, !580, !581}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !576, file: !73, line: 99, baseType: !136, size: 1600)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !576, file: !73, line: 100, baseType: !119, size: 64, offset: 1600)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !576, file: !73, line: 101, baseType: !119, size: 64, offset: 1664)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !576, file: !73, line: 102, baseType: !11, size: 64, offset: 1728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !83, file: !73, line: 124, baseType: !187, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !83, file: !73, line: 126, baseType: !16, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !83, file: !73, line: 127, baseType: !11, size: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !83, file: !73, line: 128, baseType: !11, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !83, file: !73, line: 130, baseType: !587, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !73, line: 112, baseType: !78)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !83, file: !73, line: 131, baseType: !16, size: 64, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !72, file: !73, line: 81, baseType: !11, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !72, file: !73, line: 82, baseType: !11, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !72, file: !73, line: 83, baseType: !16, size: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !57, file: !58, line: 236, baseType: !11, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !57, file: !58, line: 238, baseType: !594, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!471, !187}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !57, file: !58, line: 240, baseType: !598, size: 64, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!471, !262}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !57, file: !58, line: 242, baseType: !598, size: 64, offset: 768)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !57, file: !58, line: 243, baseType: !598, size: 64, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !57, file: !58, line: 244, baseType: !604, size: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !262}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !57, file: !58, line: 245, baseType: !604, size: 64, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !57, file: !58, line: 247, baseType: !604, size: 64, offset: 1024)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !57, file: !58, line: 249, baseType: !13, size: 64, offset: 1088)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !57, file: !58, line: 250, baseType: !13, size: 64, offset: 1152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !57, file: !58, line: 251, baseType: !13, size: 64, offset: 1216)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !57, file: !58, line: 252, baseType: !13, size: 64, offset: 1280)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !57, file: !58, line: 253, baseType: !13, size: 64, offset: 1344)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !57, file: !58, line: 254, baseType: !13, size: 64, offset: 1408)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !57, file: !58, line: 255, baseType: !13, size: 64, offset: 1472)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !57, file: !58, line: 256, baseType: !13, size: 64, offset: 1536)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !619, isLocal: true, isDefinition: true)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 5)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "ngx_stream_upstream_hash_commands", scope: !9, file: !2, line: 66, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 896, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 2)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 662, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 32)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !2, line: 675, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 11)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 680, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 23)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !2, line: 201, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 4)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !2, line: 330, type: !649, isLocal: true, isDefinition: true)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 6)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 1)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_module_t", file: !25, line: 242, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 232, size: 384, elements: !659)
!659 = !{!660, !664, !665, !669, !673, !674}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !658, file: !25, line: 233, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!471, !81}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !658, file: !25, line: 234, baseType: !661, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !658, file: !25, line: 236, baseType: !666, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!16, !81}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !658, file: !25, line: 237, baseType: !670, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!63, !81, !16}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !658, file: !25, line: 239, baseType: !666, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !658, file: !25, line: 240, baseType: !675, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!63, !81, !16, !16}
!678 = !{i32 7, !"Dwarf Version", i32 5}
!679 = !{i32 2, !"Debug Info Version", i32 3}
!680 = !{i32 1, !"wchar_size", i32 4}
!681 = !{i32 8, !"PIC Level", i32 2}
!682 = !{i32 7, !"PIE Level", i32 2}
!683 = !{i32 7, !"uwtable", i32 2}
!684 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!685 = distinct !DISubprogram(name: "ngx_stream_upstream_hash_create_conf", scope: !2, file: !2, line: 622, type: !667, scopeLine: 623, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !686)
!686 = !{!687, !688}
!687 = !DILocalVariable(name: "cf", arg: 1, scope: !685, file: !2, line: 622, type: !81)
!688 = !DILocalVariable(name: "conf", scope: !685, file: !2, line: 624, type: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_hash_srv_conf_t", file: !2, line: 28, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 25, size: 384, elements: !692)
!692 = !{!693, !703}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !691, file: !2, line: 26, baseType: !694, size: 320)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_complex_value_t", file: !695, line: 59, baseType: !696)
!695 = !DIFile(filename: "src/stream/ngx_stream_script.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "906ce9701d29af90406e83a550e671a7")
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !695, line: 54, size: 320, elements: !697)
!697 = !{!698, !699, !701, !702}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !696, file: !695, line: 55, baseType: !44, size: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flushes", scope: !696, file: !695, line: 56, baseType: !700, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lengths", scope: !696, file: !695, line: 57, baseType: !16, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !696, file: !695, line: 58, baseType: !16, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !691, file: !2, line: 27, baseType: !704, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_chash_points_t", file: !2, line: 22, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 19, size: 192, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !706, file: !2, line: 20, baseType: !11, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !706, file: !2, line: 21, baseType: !710, size: 128, offset: 64)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 128, elements: !655)
!711 = !{!712, !712, i64 0}
!712 = !{!"any pointer", !713, i64 0}
!713 = !{!"omnipotent char", !714, i64 0}
!714 = !{!"Simple C/C++ TBAA"}
!715 = !DILocation(line: 622, column: 50, scope: !685)
!716 = !DILocation(line: 624, column: 5, scope: !685)
!717 = !DILocation(line: 624, column: 43, scope: !685)
!718 = !DILocation(line: 626, column: 23, scope: !685)
!719 = !DILocation(line: 626, column: 27, scope: !685)
!720 = !{!721, !712, i64 24}
!721 = !{!"ngx_conf_s", !712, i64 0, !712, i64 8, !712, i64 16, !712, i64 24, !712, i64 32, !712, i64 40, !712, i64 48, !712, i64 56, !722, i64 64, !722, i64 72, !712, i64 80, !712, i64 88}
!722 = !{!"long", !713, i64 0}
!723 = !DILocation(line: 626, column: 12, scope: !685)
!724 = !DILocation(line: 626, column: 10, scope: !685)
!725 = !DILocation(line: 627, column: 9, scope: !726)
!726 = distinct !DILexicalBlock(scope: !685, file: !2, line: 627, column: 9)
!727 = !DILocation(line: 627, column: 14, scope: !726)
!728 = !DILocation(line: 627, column: 9, scope: !685)
!729 = !DILocation(line: 628, column: 9, scope: !730)
!730 = distinct !DILexicalBlock(scope: !726, file: !2, line: 627, column: 23)
!731 = !DILocation(line: 631, column: 5, scope: !685)
!732 = !DILocation(line: 631, column: 11, scope: !685)
!733 = !DILocation(line: 631, column: 18, scope: !685)
!734 = !{!735, !712, i64 40}
!735 = !{!"", !736, i64 0, !712, i64 40}
!736 = !{!"", !737, i64 0, !712, i64 16, !712, i64 24, !712, i64 32}
!737 = !{!"", !722, i64 0, !712, i64 8}
!738 = !DILocation(line: 633, column: 12, scope: !685)
!739 = !DILocation(line: 633, column: 5, scope: !685)
!740 = !DILocation(line: 634, column: 1, scope: !685)
!741 = !DISubprogram(name: "ngx_palloc", scope: !100, file: !100, line: 79, type: !742, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!742 = !DISubroutineType(types: !743)
!743 = !{!16, !97, !49}
!744 = distinct !DISubprogram(name: "ngx_stream_upstream_hash", scope: !2, file: !2, line: 638, type: !79, scopeLine: 639, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !1091}
!746 = !DILocalVariable(name: "cf", arg: 1, scope: !744, file: !2, line: 638, type: !81)
!747 = !DILocalVariable(name: "cmd", arg: 2, scope: !744, file: !2, line: 638, type: !70)
!748 = !DILocalVariable(name: "conf", arg: 3, scope: !744, file: !2, line: 638, type: !16)
!749 = !DILocalVariable(name: "hcf", scope: !744, file: !2, line: 640, type: !689)
!750 = !DILocalVariable(name: "value", scope: !744, file: !2, line: 642, type: !43)
!751 = !DILocalVariable(name: "uscf", scope: !744, file: !2, line: 643, type: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_srv_conf_t", file: !754, line: 36, baseType: !755)
!754 = !DIFile(filename: "src/stream/ngx_stream_upstream.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "3f8e5475e314f6b689847c899b77180e")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_stream_upstream_srv_conf_s", file: !754, line: 70, size: 832, elements: !756)
!756 = !{!757, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !755, file: !754, line: 71, baseType: !758, size: 192)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_peer_t", file: !754, line: 49, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 45, size: 192, elements: !760)
!760 = !{!761, !766, !1058}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !759, file: !754, line: 46, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_init_pt", file: !754, line: 39, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!471, !81, !752}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !759, file: !754, line: 47, baseType: !767, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_init_peer_pt", file: !754, line: 41, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!471, !771, !752}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_session_t", file: !25, line: 20, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_stream_session_s", file: !25, line: 195, size: 960, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !1039, !1040, !1053, !1054, !1055, !1056, !1057}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !773, file: !25, line: 196, baseType: !38, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !773, file: !25, line: 198, baseType: !276, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "received", scope: !773, file: !25, line: 200, baseType: !126, size: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !773, file: !25, line: 201, baseType: !209, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "start_msec", scope: !773, file: !25, line: 202, baseType: !406, size: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "log_handler", scope: !773, file: !25, line: 204, baseType: !212, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !773, file: !25, line: 206, baseType: !29, size: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !773, file: !25, line: 207, baseType: !29, size: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !773, file: !25, line: 208, baseType: !29, size: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !773, file: !25, line: 210, baseType: !785, size: 64, offset: 576)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_t", file: !754, line: 142, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 117, size: 3328, elements: !788)
!788 = !{!789, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !1026, !1037, !1038}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !787, file: !754, line: 118, baseType: !790, size: 1024)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !791, line: 22, baseType: !792)
!791 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ac5aedde14d2cb26bc31b0019c79e36b")
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !791, line: 36, size: 1024, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800, !806, !811, !813, !814, !816, !821, !830, !831, !832, !833, !834, !835, !836}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !792, file: !791, line: 37, baseType: !276, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !792, file: !791, line: 39, baseType: !370, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !792, file: !791, line: 40, baseType: !383, size: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !792, file: !791, line: 41, baseType: !43, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !792, file: !791, line: 43, baseType: !11, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !792, file: !791, line: 44, baseType: !406, size: 64, offset: 320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !792, file: !791, line: 46, baseType: !801, size: 64, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !791, line: 24, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!471, !805, !16}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !792, file: !791, line: 47, baseType: !807, size: 64, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !791, line: 26, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !805, !16, !11}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !792, file: !791, line: 48, baseType: !812, size: 64, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !791, line: 28, baseType: !808)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !792, file: !791, line: 49, baseType: !16, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "set_session", scope: !792, file: !791, line: 52, baseType: !815, size: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_set_peer_session_pt", file: !791, line: 30, baseType: !802)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !792, file: !791, line: 53, baseType: !817, size: 64, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_save_peer_session_pt", file: !791, line: 32, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !805, !16}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !792, file: !791, line: 56, baseType: !822, size: 64, offset: 768)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !824, line: 78, baseType: !825)
!824 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6d8b5de9d803e9eabdd54c00fd750bd0")
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !824, line: 74, size: 256, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !825, file: !824, line: 75, baseType: !370, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !825, file: !824, line: 76, baseType: !383, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !825, file: !824, line: 77, baseType: !44, size: 128, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !792, file: !791, line: 58, baseType: !143, size: 32, offset: 832)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !792, file: !791, line: 59, baseType: !143, size: 32, offset: 864)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !792, file: !791, line: 61, baseType: !187, size: 64, offset: 896)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !792, file: !791, line: 63, baseType: !41, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !792, file: !791, line: 64, baseType: !41, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "so_keepalive", scope: !792, file: !791, line: 65, baseType: !41, size: 1, offset: 962, flags: DIFlagBitField, extraData: i64 960)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !792, file: !791, line: 68, baseType: !41, size: 2, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_buf", scope: !787, file: !754, line: 120, baseType: !120, size: 640, offset: 1024)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_buf", scope: !787, file: !754, line: 121, baseType: !120, size: 640, offset: 1664)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !787, file: !754, line: 123, baseType: !113, size: 64, offset: 2304)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_out", scope: !787, file: !754, line: 124, baseType: !113, size: 64, offset: 2368)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_busy", scope: !787, file: !754, line: 125, baseType: !113, size: 64, offset: 2432)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_out", scope: !787, file: !754, line: 126, baseType: !113, size: 64, offset: 2496)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_busy", scope: !787, file: !754, line: 127, baseType: !113, size: 64, offset: 2560)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "received", scope: !787, file: !754, line: 129, baseType: !126, size: 64, offset: 2624)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !787, file: !754, line: 130, baseType: !209, size: 64, offset: 2688)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !787, file: !754, line: 131, baseType: !11, size: 64, offset: 2752)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "responses", scope: !787, file: !754, line: 132, baseType: !11, size: 64, offset: 2816)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !787, file: !754, line: 133, baseType: !406, size: 64, offset: 2880)
