; ModuleID = 'samples/801.bc'
source_filename = "libnet_build_sebek.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.libnet_sebek_hdr = type { i32, i16, i16, i32, i32, i32, i32, i32, i32, [12 x i8], i32 }
%struct.libnet_context = type { i32, i32, ptr, ptr, i32, i32, i32, i32, ptr, %struct.libnet_stats, i32, [64 x i8], [256 x i8], i32, %struct.libnet_ether_addr }
%struct.libnet_stats = type { i64, i64, i64 }
%struct.libnet_ether_addr = type { [6 x i8] }

@.str = private unnamed_addr constant [29 x i8] c"%s(): payload inconsistency\0A\00", align 1, !dbg !0
@__func__.libnet_build_sebek = private unnamed_addr constant [19 x i8] c"libnet_build_sebek\00", align 1, !dbg !7

; Function Attrs: nounwind uwtable
define i32 @libnet_build_sebek(i32 noundef %magic, i16 noundef zeroext %version, i16 noundef zeroext %type, i32 noundef %counter, i32 noundef %time_sec, i32 noundef %time_usec, i32 noundef %pid, i32 noundef %uid, i32 noundef %fd, ptr noundef %cmd, i32 noundef %length, ptr noundef %payload, i32 noundef %payload_s, ptr noundef %l, i32 noundef %ptag) #0 !dbg !34 {
entry:
  %retval = alloca i32, align 4
  %magic.addr = alloca i32, align 4
  %version.addr = alloca i16, align 2
  %type.addr = alloca i16, align 2
  %counter.addr = alloca i32, align 4
  %time_sec.addr = alloca i32, align 4
  %time_usec.addr = alloca i32, align 4
  %pid.addr = alloca i32, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 81, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "libnet_build_sebek.c", directory: "/local-ssd/libnet-44s2foedgafgp7xnjpoflowb4eoodgos-build/aidengro/spack-stage-libnet-1.2-44s2foedgafgp7xnjpoflowb4eoodgos/spack-src/src", checksumkind: CSK_MD5, checksum: "5a217a1ac1d18a362a5ca05efc8e342c")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 29)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 81, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 152, elements: !11)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!11 = !{!12}
!12 = !DISubrange(count: 19)
!13 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !14, globals: !27, splitDebugInlining: false, nameTableKind: None)
!14 = !{!15, !16, !22, !25}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 24, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !20, line: 38, baseType: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 26, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 42, baseType: !24)
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !20, line: 40, baseType: !26)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !{!0, !7}
!28 = !{i32 7, !"Dwarf Version", i32 5}
!29 = !{i32 2, !"Debug Info Version", i32 3}
!30 = !{i32 1, !"wchar_size", i32 4}
!31 = !{i32 8, !"PIC Level", i32 2}
!32 = !{i32 7, !"uwtable", i32 2}
!33 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!34 = distinct !DISubprogram(name: "libnet_build_sebek", scope: !2, file: !2, line: 35, type: !35, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !13, retainedNodes: !100)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !22, !43, !43, !22, !22, !22, !22, !22, !22, !16, !22, !44, !22, !46, !37}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_ptag_t", file: !38, line: 62, baseType: !39)
!38 = !DIFile(filename: "./../include/./libnet/libnet-structures.h", directory: "/local-ssd/libnet-44s2foedgafgp7xnjpoflowb4eoodgos-build/aidengro/spack-stage-libnet-1.2-44s2foedgafgp7xnjpoflowb4eoodgos/spack-src/src", checksumkind: CSK_MD5, checksum: "488c6626acc3212495ff795e590c88af")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !40, line: 26, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !20, line: 41, baseType: !42)
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 25, baseType: !25)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_t", file: !38, line: 229, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_context", file: !38, line: 178, size: 3264, elements: !49)
!49 = !{!50, !51, !52, !67, !68, !69, !70, !71, !72, !74, !82, !83, !87, !91, !92}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !48, file: !38, line: 184, baseType: !42, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "injection_type", scope: !48, file: !38, line: 186, baseType: !42, size: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blocks", scope: !48, file: !38, line: 198, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_pblock_t", file: !38, line: 170, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_protocol_block", file: !38, line: 69, size: 384, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !66}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !55, file: !38, line: 71, baseType: !16, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "b_len", scope: !55, file: !38, line: 72, baseType: !22, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "h_len", scope: !55, file: !38, line: 73, baseType: !43, size: 16, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "copied", scope: !55, file: !38, line: 84, baseType: !22, size: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !38, line: 86, baseType: !17, size: 8, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !55, file: !38, line: 160, baseType: !17, size: 8, offset: 168)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ptag", scope: !55, file: !38, line: 162, baseType: !37, size: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !38, line: 167, baseType: !65, size: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !55, file: !38, line: 168, baseType: !65, size: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pblock_end", scope: !48, file: !38, line: 199, baseType: !53, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "n_pblocks", scope: !48, file: !38, line: 200, baseType: !22, size: 32, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !48, file: !38, line: 202, baseType: !42, size: 32, offset: 224)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "link_offset", scope: !48, file: !38, line: 216, baseType: !42, size: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "aligner", scope: !48, file: !38, line: 217, baseType: !42, size: 32, offset: 288)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !48, file: !38, line: 218, baseType: !73, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !48, file: !38, line: 220, baseType: !75, size: 192, offset: 384)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_stats", file: !38, line: 50, size: 192, elements: !76)
!76 = !{!77, !80, !81}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "packets_sent", scope: !75, file: !38, line: 52, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !20, line: 44, baseType: !79)
!79 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "packet_errors", scope: !75, file: !38, line: 53, baseType: !78, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !75, file: !38, line: 54, baseType: !78, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ptag_state", scope: !48, file: !38, line: 221, baseType: !37, size: 32, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !48, file: !38, line: 222, baseType: !84, size: 512, offset: 608)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "err_buf", scope: !48, file: !38, line: 224, baseType: !88, size: 2048, offset: 1120)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !48, file: !38, line: 225, baseType: !22, size: 32, offset: 3168)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "link_addr", scope: !48, file: !38, line: 227, baseType: !93, size: 48, offset: 3200)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ether_addr", file: !94, line: 531, size: 48, elements: !95)
!94 = !DIFile(filename: "./../include/./libnet/libnet-headers.h", directory: "/local-ssd/libnet-44s2foedgafgp7xnjpoflowb4eoodgos-build/aidengro/spack-stage-libnet-1.2-44s2foedgafgp7xnjpoflowb4eoodgos/spack-src/src", checksumkind: CSK_MD5, checksum: "396ddbf745e2a3cedeaa9f9730cfa1f7")
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ether_addr_octet", scope: !93, file: !94, line: 533, baseType: !97, size: 48)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 48, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 6)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !135}
!101 = !DILocalVariable(name: "magic", arg: 1, scope: !34, file: !2, line: 35, type: !22)
!102 = !DILocalVariable(name: "version", arg: 2, scope: !34, file: !2, line: 35, type: !43)
!103 = !DILocalVariable(name: "type", arg: 3, scope: !34, file: !2, line: 35, type: !43)
!104 = !DILocalVariable(name: "counter", arg: 4, scope: !34, file: !2, line: 36, type: !22)
!105 = !DILocalVariable(name: "time_sec", arg: 5, scope: !34, file: !2, line: 36, type: !22)
!106 = !DILocalVariable(name: "time_usec", arg: 6, scope: !34, file: !2, line: 36, type: !22)
!107 = !DILocalVariable(name: "pid", arg: 7, scope: !34, file: !2, line: 36, type: !22)
!108 = !DILocalVariable(name: "uid", arg: 8, scope: !34, file: !2, line: 37, type: !22)
!109 = !DILocalVariable(name: "fd", arg: 9, scope: !34, file: !2, line: 37, type: !22)
!110 = !DILocalVariable(name: "cmd", arg: 10, scope: !34, file: !2, line: 37, type: !16)
!111 = !DILocalVariable(name: "length", arg: 11, scope: !34, file: !2, line: 37, type: !22)
!112 = !DILocalVariable(name: "payload", arg: 12, scope: !34, file: !2, line: 38, type: !44)
!113 = !DILocalVariable(name: "payload_s", arg: 13, scope: !34, file: !2, line: 38, type: !22)
!114 = !DILocalVariable(name: "l", arg: 14, scope: !34, file: !2, line: 38, type: !46)
!115 = !DILocalVariable(name: "ptag", arg: 15, scope: !34, file: !2, line: 38, type: !37)
!116 = !DILocalVariable(name: "n", scope: !34, file: !2, line: 40, type: !22)
!117 = !DILocalVariable(name: "p", scope: !34, file: !2, line: 41, type: !53)
!118 = !DILocalVariable(name: "sebek_hdr", scope: !34, file: !2, line: 42, type: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_sebek_hdr", file: !94, line: 1741, size: 384, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !134}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !119, file: !94, line: 1743, baseType: !22, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !119, file: !94, line: 1744, baseType: !43, size: 16, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !94, line: 1746, baseType: !43, size: 16, offset: 48)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !119, file: !94, line: 1749, baseType: !22, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "time_sec", scope: !119, file: !94, line: 1750, baseType: !22, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "time_usec", scope: !119, file: !94, line: 1751, baseType: !22, size: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !119, file: !94, line: 1752, baseType: !22, size: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !119, file: !94, line: 1753, baseType: !22, size: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !119, file: !94, line: 1754, baseType: !22, size: 32, offset: 224)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !119, file: !94, line: 1756, baseType: !131, size: 96, offset: 256)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 96, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 12)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !119, file: !94, line: 1757, baseType: !22, size: 32, offset: 352)
!135 = !DILabel(scope: !34, name: "bad", file: !2, line: 84)
!136 = !{!137, !137, i64 0}
!137 = !{!"int", !138, i64 0}
!138 = !{!"omnipotent char", !139, i64 0}
!139 = !{!"Simple C/C++ TBAA"}
!140 = !DILocation(line: 35, column: 29, scope: !34)
!141 = !{!142, !142, i64 0}
!142 = !{!"short", !138, i64 0}
!143 = !DILocation(line: 35, column: 45, scope: !34)
!144 = !DILocation(line: 35, column: 63, scope: !34)
!145 = !DILocation(line: 36, column: 10, scope: !34)
!146 = !DILocation(line: 36, column: 28, scope: !34)
!147 = !DILocation(line: 36, column: 47, scope: !34)
!148 = !DILocation(line: 36, column: 67, scope: !34)
!149 = !DILocation(line: 37, column: 10, scope: !34)
!150 = !DILocation(line: 37, column: 24, scope: !34)
!151 = !{!152, !152, i64 0}
!152 = !{!"any pointer", !138, i64 0}
!153 = !DILocation(line: 37, column: 36, scope: !34)
!154 = !DILocation(line: 37, column: 68, scope: !34)
!155 = !DILocation(line: 38, column: 16, scope: !34)
!156 = !DILocation(line: 38, column: 34, scope: !34)
!157 = !DILocation(line: 38, column: 55, scope: !34)
!158 = !DILocation(line: 38, column: 72, scope: !34)
!159 = !DILocation(line: 40, column: 5, scope: !34)
!160 = !DILocation(line: 40, column: 14, scope: !34)
!161 = !DILocation(line: 41, column: 5, scope: !34)
!162 = !DILocation(line: 41, column: 22, scope: !34)
!163 = !DILocation(line: 42, column: 5, scope: !34)
!164 = !DILocation(line: 42, column: 29, scope: !34)
!165 = !DILocation(line: 44, column: 9, scope: !166)
!166 = distinct !DILexicalBlock(scope: !34, file: !2, line: 44, column: 9)
!167 = !DILocation(line: 44, column: 11, scope: !166)
!168 = !DILocation(line: 44, column: 9, scope: !34)
!169 = !DILocation(line: 46, column: 9, scope: !170)
!170 = distinct !DILexicalBlock(scope: !166, file: !2, line: 45, column: 5)
!171 = !DILocation(line: 49, column: 26, scope: !34)
!172 = !DILocation(line: 49, column: 24, scope: !34)
!173 = !DILocation(line: 49, column: 7, scope: !34)
!174 = !DILocation(line: 55, column: 29, scope: !34)
!175 = !DILocation(line: 55, column: 32, scope: !34)
!176 = !DILocation(line: 55, column: 38, scope: !34)
!177 = !DILocation(line: 55, column: 9, scope: !34)
!178 = !DILocation(line: 55, column: 7, scope: !34)
!179 = !DILocation(line: 56, column: 9, scope: !180)
!180 = distinct !DILexicalBlock(scope: !34, file: !2, line: 56, column: 9)
!181 = !DILocation(line: 56, column: 11, scope: !180)
!182 = !DILocation(line: 56, column: 9, scope: !34)
!183 = !DILocation(line: 58, column: 9, scope: !184)
!184 = distinct !DILexicalBlock(scope: !180, file: !2, line: 57, column: 5)
!185 = !DILocation(line: 61, column: 5, scope: !34)
!186 = !DILocation(line: 62, column: 27, scope: !34)
!187 = !DILocation(line: 62, column: 15, scope: !34)
!188 = !DILocation(line: 62, column: 25, scope: !34)
!189 = !{!190, !137, i64 0}
!190 = !{!"libnet_sebek_hdr", !137, i64 0, !142, i64 4, !142, i64 6, !137, i64 8, !137, i64 12, !137, i64 16, !137, i64 20, !137, i64 24, !137, i64 28, !138, i64 32, !137, i64 44}
!191 = !DILocation(line: 63, column: 27, scope: !34)
!192 = !DILocation(line: 63, column: 15, scope: !34)
!193 = !DILocation(line: 63, column: 25, scope: !34)
!194 = !{!190, !142, i64 4}
!195 = !DILocation(line: 64, column: 27, scope: !34)
!196 = !DILocation(line: 64, column: 15, scope: !34)
!197 = !DILocation(line: 64, column: 25, scope: !34)
!198 = !{!190, !142, i64 6}
!199 = !DILocation(line: 65, column: 27, scope: !34)
!200 = !DILocation(line: 65, column: 15, scope: !34)
!201 = !DILocation(line: 65, column: 25, scope: !34)
!202 = !{!190, !137, i64 8}
!203 = !DILocation(line: 66, column: 27, scope: !34)
!204 = !DILocation(line: 66, column: 15, scope: !34)
!205 = !DILocation(line: 66, column: 25, scope: !34)
!206 = !{!190, !137, i64 12}
!207 = !DILocation(line: 67, column: 27, scope: !34)
!208 = !DILocation(line: 67, column: 15, scope: !34)
