; ModuleID = 'samples/810.bc'
source_filename = "cmsmd5.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._cmsMD5 = type { [4 x i32], [2 x i32], [64 x i8], ptr }
%struct._cms_iccprofile_struct = type { ptr, ptr, %struct.tm, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, %union.cmsProfileID, i32, [100 x i32], [100 x i32], [100 x i32], [100 x i32], [100 x i32], [100 x ptr], [100 x ptr], i32, ptr }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%union.cmsProfileID = type { [4 x i32] }

@.str = private unnamed_addr constant [25 x i8] c"(hProfile != ((void*)0))\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [9 x i8] c"cmsmd5.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.cmsMD5computeID = private unnamed_addr constant [37 x i8] c"cmsBool cmsMD5computeID(cmsHPROFILE)\00", align 1, !dbg !12

; Function Attrs: nounwind uwtable
define ptr @cmsMD5alloc(ptr noundef %ContextID) #0 !dbg !409 {
entry:
  %retval = alloca ptr, align 8
  %ContextID.addr = alloca ptr, align 8
  %ctx = alloca ptr, align 8
  %cleanup.dest.slot = alloca i32, align 4
  store ptr %ContextID, ptr %ContextID.addr, align 8, !tbaa !415
  tail call void @llvm.dbg.declare(metadata ptr %ContextID.addr, metadata !413, metadata !DIExpression()), !dbg !419
  call void @llvm.lifetime.start.p0(i64 8, ptr %ctx) #7, !dbg !420

!115 = !DIEnumerator(name: "cmsSigLuminanceTag", value: 1819635049)
!116 = !DIEnumerator(name: "cmsSigMeasurementTag", value: 1835360627)
!117 = !DIEnumerator(name: "cmsSigMediaBlackPointTag", value: 1651208308)
!118 = !DIEnumerator(name: "cmsSigMediaWhitePointTag", value: 2004119668)
!119 = !DIEnumerator(name: "cmsSigNamedColorTag", value: 1852010348)
!120 = !DIEnumerator(name: "cmsSigNamedColor2Tag", value: 1852009522)
!121 = !DIEnumerator(name: "cmsSigOutputResponseTag", value: 1919251312)
!122 = !DIEnumerator(name: "cmsSigPerceptualRenderingIntentGamutTag", value: 1919510320)
!123 = !DIEnumerator(name: "cmsSigPreview0Tag", value: 1886545200)
!124 = !DIEnumerator(name: "cmsSigPreview1Tag", value: 1886545201)
!125 = !DIEnumerator(name: "cmsSigPreview2Tag", value: 1886545202)
!126 = !DIEnumerator(name: "cmsSigProfileDescriptionTag", value: 1684370275)
!127 = !DIEnumerator(name: "cmsSigProfileDescriptionMLTag", value: 1685283693)
!128 = !DIEnumerator(name: "cmsSigProfileSequenceDescTag", value: 1886610801)
!129 = !DIEnumerator(name: "cmsSigProfileSequenceIdTag", value: 1886611812)
!130 = !DIEnumerator(name: "cmsSigPs2CRD0Tag", value: 1886610480)
!131 = !DIEnumerator(name: "cmsSigPs2CRD1Tag", value: 1886610481)
!132 = !DIEnumerator(name: "cmsSigPs2CRD2Tag", value: 1886610482)
!133 = !DIEnumerator(name: "cmsSigPs2CRD3Tag", value: 1886610483)
!134 = !DIEnumerator(name: "cmsSigPs2CSATag", value: 1886597747)
!135 = !DIEnumerator(name: "cmsSigPs2RenderingIntentTag", value: 1886597737)
!136 = !DIEnumerator(name: "cmsSigRedColorantTag", value: 1918392666)
!137 = !DIEnumerator(name: "cmsSigRedMatrixColumnTag", value: 1918392666)
!138 = !DIEnumerator(name: "cmsSigRedTRCTag", value: 1918128707)
!139 = !DIEnumerator(name: "cmsSigSaturationRenderingIntentGamutTag", value: 1919510322)
!140 = !DIEnumerator(name: "cmsSigScreeningDescTag", value: 1935897188)
!141 = !DIEnumerator(name: "cmsSigScreeningTag", value: 1935897198)
!142 = !DIEnumerator(name: "cmsSigTechnologyTag", value: 1952801640)
!143 = !DIEnumerator(name: "cmsSigUcrBgTag", value: 1650877472)
!144 = !DIEnumerator(name: "cmsSigViewingCondDescTag", value: 1987405156)
!145 = !DIEnumerator(name: "cmsSigViewingConditionsTag", value: 1986618743)
!146 = !DIEnumerator(name: "cmsSigVcgtTag", value: 1986226036)
!147 = !DIEnumerator(name: "cmsSigMetaTag", value: 1835365473)
!148 = !DIEnumerator(name: "cmsSigArgyllArtsTag", value: 1634890867)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 291, baseType: !22, size: 32, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!151 = !DIEnumerator(name: "cmsSigChromaticityType", value: 1667789421)
!152 = !DIEnumerator(name: "cmsSigColorantOrderType", value: 1668051567)
!153 = !DIEnumerator(name: "cmsSigColorantTableType", value: 1668051572)
!154 = !DIEnumerator(name: "cmsSigCrdInfoType", value: 1668441193)
!155 = !DIEnumerator(name: "cmsSigCurveType", value: 1668641398)
!156 = !DIEnumerator(name: "cmsSigDataType", value: 1684108385)
!157 = !DIEnumerator(name: "cmsSigDictType", value: 1684628340)
!158 = !DIEnumerator(name: "cmsSigDateTimeType", value: 1685350765)
!159 = !DIEnumerator(name: "cmsSigDeviceSettingsType", value: 1684371059)
!160 = !DIEnumerator(name: "cmsSigLut16Type", value: 1835430962)
!161 = !DIEnumerator(name: "cmsSigLut8Type", value: 1835430961)
!162 = !DIEnumerator(name: "cmsSigLutAtoBType", value: 1832993312)
!163 = !DIEnumerator(name: "cmsSigLutBtoAType", value: 1833058592)
!164 = !DIEnumerator(name: "cmsSigMeasurementType", value: 1835360627)
!165 = !DIEnumerator(name: "cmsSigMultiLocalizedUnicodeType", value: 1835824483)
!166 = !DIEnumerator(name: "cmsSigMultiProcessElementType", value: 1836082548)
!167 = !DIEnumerator(name: "cmsSigNamedColorType", value: 1852010348)
!168 = !DIEnumerator(name: "cmsSigNamedColor2Type", value: 1852009522)
!169 = !DIEnumerator(name: "cmsSigParametricCurveType", value: 1885434465)
!170 = !DIEnumerator(name: "cmsSigProfileSequenceDescType", value: 1886610801)
!171 = !DIEnumerator(name: "cmsSigProfileSequenceIdType", value: 1886611812)
!172 = !DIEnumerator(name: "cmsSigResponseCurveSet16Type", value: 1919120178)
!173 = !DIEnumerator(name: "cmsSigS15Fixed16ArrayType", value: 1936077618)
!174 = !DIEnumerator(name: "cmsSigScreeningType", value: 1935897198)
!175 = !DIEnumerator(name: "cmsSigSignatureType", value: 1936287520)
!176 = !DIEnumerator(name: "cmsSigTextType", value: 1952807028)
!177 = !DIEnumerator(name: "cmsSigTextDescriptionType", value: 1684370275)
!178 = !DIEnumerator(name: "cmsSigU16Fixed16ArrayType", value: 1969632050)
!179 = !DIEnumerator(name: "cmsSigUcrBgType", value: 1650877472)
!180 = !DIEnumerator(name: "cmsSigUInt16ArrayType", value: 1969828150)
!181 = !DIEnumerator(name: "cmsSigUInt32ArrayType", value: 1969828658)
!182 = !DIEnumerator(name: "cmsSigUInt64ArrayType", value: 1969829428)
!183 = !DIEnumerator(name: "cmsSigUInt8ArrayType", value: 1969827896)
!184 = !DIEnumerator(name: "cmsSigVcgtType", value: 1986226036)
!185 = !DIEnumerator(name: "cmsSigViewingConditionsType", value: 1986618743)
!186 = !DIEnumerator(name: "cmsSigXYZType", value: 1482250784)
!187 = !{!188, !233, !270, !226, !271, !272}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsMD5", file: !2, line: 56, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 49, size: 768, elements: !191)
!191 = !{!192, !197, !201, !207}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !190, file: !2, line: 51, baseType: !193, size: 128)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 128, elements: !195)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsUInt32Number", file: !21, line: 120, baseType: !22)
!195 = !{!196}
!196 = !DISubrange(count: 4)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !190, file: !2, line: 52, baseType: !198, size: 64, offset: 128)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 64, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 2)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !190, file: !2, line: 53, baseType: !202, size: 512, offset: 192)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 512, elements: !205)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsUInt8Number", file: !21, line: 90, baseType: !204)
!204 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!205 = !{!206}
!206 = !DISubrange(count: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !190, file: !2, line: 54, baseType: !208, size: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsContext", file: !21, line: 1056, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cmsContext_struct", file: !211, line: 511, size: 1472, elements: !212)
!211 = !DIFile(filename: "./lcms2_internal.h", directory: "/local-ssd/lcms-ztpfygwoja345726vi3y4tc34unbjaib-build/aidengro/spack-stage-lcms-2.13.1-ztpfygwoja345726vi3y4tc34unbjaib/spack-src/src", checksumkind: CSK_MD5, checksum: "479b61780e49804306b4c5804e975f85")
!212 = !{!213, !214, !231, !236}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !210, file: !211, line: 513, baseType: !209, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "MemPool", scope: !210, file: !211, line: 514, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsSubAllocator", file: !211, line: 460, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !211, line: 455, size: 128, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !217, file: !211, line: 457, baseType: !208, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !217, file: !211, line: 458, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsSubAllocator_chunk", file: !211, line: 452, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cmsSubAllocator_chunk_st", file: !211, line: 444, size: 192, elements: !224)
!224 = !{!225, !227, !228, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !223, file: !211, line: 446, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", scope: !223, file: !211, line: 447, baseType: !194, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Used", scope: !223, file: !211, line: 448, baseType: !194, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !211, line: 450, baseType: !230, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "chunks", scope: !210, file: !211, line: 516, baseType: !232, size: 960, offset: 128)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 960, elements: !234)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!234 = !{!235}
!235 = !DISubrange(count: 15)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultMemoryManager", scope: !210, file: !211, line: 519, baseType: !237, size: 384, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsMemPluginChunkType", file: !211, line: 505, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !211, line: 496, size: 384, elements: !239)
!239 = !{!240, !246, !248, !253, !258, !263}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "MallocPtr", scope: !238, file: !211, line: 498, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsMallocFnPtrType", file: !242, line: 229, baseType: !243)
!242 = !DIFile(filename: "../include/lcms2_plugin.h", directory: "/local-ssd/lcms-ztpfygwoja345726vi3y4tc34unbjaib-build/aidengro/spack-stage-lcms-2.13.1-ztpfygwoja345726vi3y4tc34unbjaib/spack-src/src", checksumkind: CSK_MD5, checksum: "3a8f6b8afdf5dfc22373e8103ac5e8ca")
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!233, !208, !194}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "MallocZeroPtr", scope: !238, file: !211, line: 499, baseType: !247, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsMalloZerocFnPtrType", file: !242, line: 233, baseType: !243)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "FreePtr", scope: !238, file: !211, line: 500, baseType: !249, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsFreeFnPtrType", file: !242, line: 230, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !208, !233}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ReallocPtr", scope: !238, file: !211, line: 501, baseType: !254, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsReallocFnPtrType", file: !242, line: 231, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!233, !208, !233, !194}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "CallocPtr", scope: !238, file: !211, line: 502, baseType: !259, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsCallocFnPtrType", file: !242, line: 234, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!233, !208, !194, !194}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "DupPtr", scope: !238, file: !211, line: 503, baseType: !264, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsDupFnPtrType", file: !242, line: 235, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!233, !208, !268, !194}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsHANDLE", file: !21, line: 660, baseType: !233)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cmsICCPROFILE", file: !211, line: 823, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cms_iccprofile_struct", file: !211, line: 781, size: 30016, elements: !275)
!275 = !{!276, !312, !313, !330, !331, !333, !335, !336, !337, !338, !339, !340, !343, !344, !359, !360, !365, !366, !368, !369, !371, !373, !400, !401}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "IOhandler", scope: !274, file: !211, line: 784, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsIOHANDLER", file: !21, line: 1548, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cms_io_handler", file: !242, line: 118, size: 2560, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !289, !294, !300, !304, !308}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !279, file: !242, line: 120, baseType: !233, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !279, file: !242, line: 122, baseType: !208, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "UsedSpace", scope: !279, file: !242, line: 123, baseType: !194, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ReportedSize", scope: !279, file: !242, line: 124, baseType: !194, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalFile", scope: !279, file: !242, line: 125, baseType: !286, size: 2048, offset: 192)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !279, file: !242, line: 127, baseType: !290, size: 64, offset: 2240)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!194, !293, !233, !194, !194}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", scope: !279, file: !242, line: 130, baseType: !295, size: 64, offset: 2304)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!298, !293, !194}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsBool", file: !21, line: 174, baseType: !299)
!299 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Close", scope: !279, file: !242, line: 131, baseType: !301, size: 64, offset: 2368)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!298, !293}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Tell", scope: !279, file: !242, line: 132, baseType: !305, size: 64, offset: 2432)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!194, !293}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !279, file: !242, line: 133, baseType: !309, size: 64, offset: 2496)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!298, !293, !194, !268}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !274, file: !211, line: 787, baseType: !208, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Created", scope: !274, file: !211, line: 790, baseType: !314, size: 448, offset: 128)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !315, line: 7, size: 448, elements: !316)
!315 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !328}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !314, file: !315, line: 9, baseType: !299, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !314, file: !315, line: 10, baseType: !299, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !314, file: !315, line: 11, baseType: !299, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !314, file: !315, line: 12, baseType: !299, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !314, file: !315, line: 13, baseType: !299, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !314, file: !315, line: 14, baseType: !299, size: 32, offset: 160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !314, file: !315, line: 15, baseType: !299, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !314, file: !315, line: 16, baseType: !299, size: 32, offset: 224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !314, file: !315, line: 17, baseType: !299, size: 32, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !314, file: !315, line: 20, baseType: !327, size: 64, offset: 320)
!327 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !314, file: !315, line: 21, baseType: !329, size: 64, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !274, file: !211, line: 793, baseType: !194, size: 32, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceClass", scope: !274, file: !211, line: 794, baseType: !332, size: 32, offset: 608)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsProfileClassSignature", file: !21, line: 499, baseType: !20)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ColorSpace", scope: !274, file: !211, line: 795, baseType: !334, size: 32, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsColorSpaceSignature", file: !21, line: 487, baseType: !31)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "PCS", scope: !274, file: !211, line: 796, baseType: !334, size: 32, offset: 672)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "RenderingIntent", scope: !274, file: !211, line: 797, baseType: !194, size: 32, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !211, line: 799, baseType: !194, size: 32, offset: 736)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "manufacturer", scope: !274, file: !211, line: 800, baseType: !194, size: 32, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !274, file: !211, line: 800, baseType: !194, size: 32, offset: 800)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !274, file: !211, line: 801, baseType: !341, size: 64, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsUInt64Number", file: !21, line: 138, baseType: !342)
!342 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "creator", scope: !274, file: !211, line: 802, baseType: !194, size: 32, offset: 896)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ProfileID", scope: !274, file: !211, line: 804, baseType: !345, size: 128, offset: 928)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsProfileID", file: !21, line: 611, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !21, line: 606, size: 128, elements: !347)
!347 = !{!348, !352, !358}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ID8", scope: !346, file: !21, line: 607, baseType: !349, size: 128)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 128, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ID16", scope: !346, file: !21, line: 608, baseType: !353, size: 128)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 128, elements: !356)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsUInt16Number", file: !21, line: 103, baseType: !355)
!355 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!356 = !{!357}
!357 = !DISubrange(count: 8)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ID32", scope: !346, file: !21, line: 609, baseType: !193, size: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "TagCount", scope: !274, file: !211, line: 807, baseType: !194, size: 32, offset: 1056)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "TagNames", scope: !274, file: !211, line: 808, baseType: !361, size: 3200, offset: 1088)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 3200, elements: !363)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsTagSignature", file: !21, line: 406, baseType: !76)
!363 = !{!364}
!364 = !DISubrange(count: 100)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "TagLinked", scope: !274, file: !211, line: 809, baseType: !361, size: 3200, offset: 4288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "TagSizes", scope: !274, file: !211, line: 810, baseType: !367, size: 3200, offset: 7488)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 3200, elements: !363)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "TagOffsets", scope: !274, file: !211, line: 811, baseType: !367, size: 3200, offset: 10688)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "TagSaveAsRaw", scope: !274, file: !211, line: 812, baseType: !370, size: 3200, offset: 13888)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 3200, elements: !363)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "TagPtrs", scope: !274, file: !211, line: 813, baseType: !372, size: 6400, offset: 17088)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 6400, elements: !363)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "TagTypeHandlers", scope: !274, file: !211, line: 814, baseType: !374, size: 6400, offset: 23488)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 6400, elements: !363)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsTagTypeHandler", file: !242, line: 415, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cms_typehandler_struct", file: !242, line: 386, size: 448, elements: !378)
!378 = !{!379, !381, !386, !390, !394, !398, !399}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !377, file: !242, line: 388, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmsTagTypeSignature", file: !21, line: 330, baseType: !149)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ReadPtr", scope: !377, file: !242, line: 391, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!233, !385, !277, !271, !194}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "WritePtr", scope: !377, file: !242, line: 397, baseType: !387, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!298, !385, !277, !233, !194}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "DupPtr", scope: !377, file: !242, line: 403, baseType: !391, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!233, !385, !268, !194}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "FreePtr", scope: !377, file: !242, line: 408, baseType: !395, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !385, !233}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ContextID", scope: !377, file: !242, line: 412, baseType: !208, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ICCVersion", scope: !377, file: !242, line: 413, baseType: !194, size: 32, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "IsWrite", scope: !274, file: !211, line: 818, baseType: !298, size: 32, offset: 29888)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "UsrMutex", scope: !274, file: !211, line: 821, baseType: !233, size: 64, offset: 29952)
!402 = !{!0, !7, !12}
!403 = !{i32 7, !"Dwarf Version", i32 5}
!404 = !{i32 2, !"Debug Info Version", i32 3}
!405 = !{i32 1, !"wchar_size", i32 4}
!406 = !{i32 8, !"PIC Level", i32 2}
!407 = !{i32 7, !"uwtable", i32 2}
!408 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!409 = distinct !DISubprogram(name: "cmsMD5alloc", scope: !2, file: !2, line: 154, type: !410, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !18, retainedNodes: !412)
!410 = !DISubroutineType(types: !411)
!411 = !{!270, !208}
!412 = !{!413, !414}
!413 = !DILocalVariable(name: "ContextID", arg: 1, scope: !409, file: !2, line: 154, type: !208)
!414 = !DILocalVariable(name: "ctx", scope: !409, file: !2, line: 156, type: !188)
!415 = !{!416, !416, i64 0}
!416 = !{!"any pointer", !417, i64 0}
!417 = !{!"omnipotent char", !418, i64 0}
!418 = !{!"Simple C/C++ TBAA"}
!419 = !DILocation(line: 154, column: 44, scope: !409)
!420 = !DILocation(line: 156, column: 5, scope: !409)
!421 = !DILocation(line: 156, column: 14, scope: !409)
!422 = !DILocation(line: 156, column: 46, scope: !409)
!423 = !DILocation(line: 156, column: 31, scope: !409)
!424 = !DILocation(line: 157, column: 9, scope: !425)
!425 = distinct !DILexicalBlock(scope: !409, file: !2, line: 157, column: 9)
!426 = !DILocation(line: 157, column: 13, scope: !425)
!427 = !DILocation(line: 157, column: 9, scope: !409)
!428 = !DILocation(line: 157, column: 22, scope: !425)
!429 = !DILocation(line: 159, column: 23, scope: !409)
!430 = !DILocation(line: 159, column: 5, scope: !409)
!431 = !DILocation(line: 159, column: 11, scope: !409)
!432 = !DILocation(line: 159, column: 21, scope: !409)
!433 = !{!434, !416, i64 88}
!434 = !{!"", !417, i64 0, !417, i64 16, !417, i64 24, !416, i64 88}
!435 = !DILocation(line: 161, column: 5, scope: !409)
!436 = !DILocation(line: 161, column: 10, scope: !409)
!437 = !DILocation(line: 161, column: 17, scope: !409)
!438 = !{!439, !439, i64 0}
!439 = !{!"int", !417, i64 0}
!440 = !DILocation(line: 162, column: 5, scope: !409)
!441 = !DILocation(line: 162, column: 10, scope: !409)
!442 = !DILocation(line: 162, column: 17, scope: !409)
!443 = !DILocation(line: 163, column: 5, scope: !409)
!444 = !DILocation(line: 163, column: 10, scope: !409)
!445 = !DILocation(line: 163, column: 17, scope: !409)
!446 = !DILocation(line: 164, column: 5, scope: !409)
!447 = !DILocation(line: 164, column: 10, scope: !409)
!448 = !DILocation(line: 164, column: 17, scope: !409)
!449 = !DILocation(line: 166, column: 5, scope: !409)
!450 = !DILocation(line: 166, column: 10, scope: !409)
!451 = !DILocation(line: 166, column: 18, scope: !409)
!452 = !DILocation(line: 167, column: 5, scope: !409)
!453 = !DILocation(line: 167, column: 10, scope: !409)
!454 = !DILocation(line: 167, column: 18, scope: !409)
!455 = !DILocation(line: 169, column: 24, scope: !409)
!456 = !DILocation(line: 169, column: 5, scope: !409)
!457 = !DILocation(line: 170, column: 1, scope: !409)
!458 = !DISubprogram(name: "_cmsMallocZero", scope: !242, file: !242, line: 110, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!459 = distinct !DISubprogram(name: "cmsMD5add", scope: !2, file: !2, line: 172, type: !460, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !18, retainedNodes: !464)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !270, !462, !194}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!464 = !{!465, !466, !467, !468, !469, !470}
!465 = !DILocalVariable(name: "Handle", arg: 1, scope: !459, file: !2, line: 172, type: !270)
