; ModuleID = 'samples/814.bc'
source_filename = "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build/aidengro/spack-stage-py-cython-3.0.4-dy46r2wwmuglnne2coy4h6brykhora2n/spack-src/Cython/Plex/DFA.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { i64, ptr }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.PyModuleDef_Slot = type { i32, ptr }
%struct.__pyx_mstate = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 676, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/object.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "059c0d359e891772b7814c88f6fa55ff")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !13, line: 304, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/unicodeobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "f386b2e1a1c191e8bf459eb4bae7acee")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!17 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!18 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!19 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__Pyx_ImportType_CheckSize_3_0_4", file: !21, line: 2335, baseType: !14, size: 32, elements: !22)
!21 = !DIFile(filename: "Cython/Plex/DFA.c", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build/aidengro/spack-stage-py-cython-3.0.4-dy46r2wwmuglnne2coy4h6brykhora2n/spack-src", checksumkind: CSK_MD5, checksum: "fc35f476fb2285c4b9f4875d3e14b446")
!22 = !{!23, !24, !25}
!23 = !DIEnumerator(name: "__Pyx_ImportType_CheckSize_Error_3_0_4", value: 0)
!24 = !DIEnumerator(name: "__Pyx_ImportType_CheckSize_Warn_3_0_4", value: 1)
!25 = !DIEnumerator(name: "__Pyx_ImportType_CheckSize_Ignore_3_0_4", value: 2)
!26 = !{!27, !28, !70, !7, !42, !60, !96, !241, !120, !343, !354, !380, !341, !390, !94, !409, !410, !411, !268, !290, !295, !412, !415, !423, !440, !488, !498, !445, !450, !506, !473, !40, !432, !524, !532, !34, !559, !478, !560, !564, !568, !572, !576, !580, !584, !603, !607, !591, !611, !613, !615, !617, !619, !624, !238, !632}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !30, line: 18, baseType: !31)
!30 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/pytypedefs.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "38482a77e5b3188ef0e82980904fb142")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 100, size: 128, elements: !32)
!32 = !{!33, !41}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !31, file: !6, line: 102, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !35, line: 131, baseType: !36)
!35 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/pyport.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "a198b01de4c7067d893cd27dc3108f8a")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !37, line: 108, baseType: !38)
!37 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !39, line: 194, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!40 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !31, file: !6, line: 103, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !30, line: 20, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !45, line: 148, size: 3264, elements: !46)
!45 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/object.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "5cecebbdf3585641a3ef3ab354ac3a06")
!46 = !{!47, !53, !57, !58, !59, !64, !65, !71, !76, !95, !97, !150, !181, !193, !199, !200, !201, !203, !205, !237, !239, !240, !249, !250, !255, !256, !258, !260, !271, !282, !301, !302, !303, !305, !307, !308, !310, !315, !320, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !44, file: !45, line: 149, baseType: !48, size: 192)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 112, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 109, size: 192, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !49, file: !6, line: 110, baseType: !29, size: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !49, file: !6, line: 111, baseType: !34, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !44, file: !45, line: 150, baseType: !54, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !44, file: !45, line: 151, baseType: !34, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !44, file: !45, line: 151, baseType: !34, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !44, file: !45, line: 155, baseType: !60, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 213, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !28}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !44, file: !45, line: 156, baseType: !34, size: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !44, file: !45, line: 157, baseType: !66, size: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 214, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!28, !28, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !44, file: !45, line: 158, baseType: !72, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 216, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!7, !28, !70, !28}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !44, file: !45, line: 159, baseType: !77, size: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !45, line: 135, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 130, size: 256, elements: !80)
!80 = !{!81, !86, !87, !88}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !79, file: !45, line: 131, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 196, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!28, !28}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !79, file: !45, line: 132, baseType: !82, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !79, file: !45, line: 133, baseType: !82, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !79, file: !45, line: 134, baseType: !89, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !45, line: 128, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !28, !28, !94}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 680, baseType: !5)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !44, file: !45, line: 161, baseType: !96, size: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 218, baseType: !83)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !44, file: !45, line: 165, baseType: !98, size: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !45, line: 106, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 61, size: 2304, elements: !101)
!101 = !{!102, !107, !108, !109, !110, !111, !116, !117, !118, !119, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !100, file: !45, line: 66, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 197, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!28, !28, !28}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !100, file: !45, line: 67, baseType: !103, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !100, file: !45, line: 68, baseType: !103, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !100, file: !45, line: 69, baseType: !103, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !100, file: !45, line: 70, baseType: !103, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !100, file: !45, line: 71, baseType: !112, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 198, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!28, !28, !28, !28}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !100, file: !45, line: 72, baseType: !82, size: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !100, file: !45, line: 73, baseType: !82, size: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !100, file: !45, line: 74, baseType: !82, size: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !100, file: !45, line: 75, baseType: !120, size: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 199, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!7, !28}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !100, file: !45, line: 76, baseType: !82, size: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !100, file: !45, line: 77, baseType: !103, size: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !100, file: !45, line: 78, baseType: !103, size: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !100, file: !45, line: 79, baseType: !103, size: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !100, file: !45, line: 80, baseType: !103, size: 64, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !100, file: !45, line: 81, baseType: !103, size: 64, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !100, file: !45, line: 82, baseType: !82, size: 64, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !100, file: !45, line: 83, baseType: !27, size: 64, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !100, file: !45, line: 84, baseType: !82, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !100, file: !45, line: 86, baseType: !103, size: 64, offset: 1216)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !100, file: !45, line: 87, baseType: !103, size: 64, offset: 1280)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !100, file: !45, line: 88, baseType: !103, size: 64, offset: 1344)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !100, file: !45, line: 89, baseType: !103, size: 64, offset: 1408)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !100, file: !45, line: 90, baseType: !112, size: 64, offset: 1472)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !100, file: !45, line: 91, baseType: !103, size: 64, offset: 1536)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !100, file: !45, line: 92, baseType: !103, size: 64, offset: 1600)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !100, file: !45, line: 93, baseType: !103, size: 64, offset: 1664)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !100, file: !45, line: 94, baseType: !103, size: 64, offset: 1728)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !100, file: !45, line: 95, baseType: !103, size: 64, offset: 1792)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !100, file: !45, line: 97, baseType: !103, size: 64, offset: 1856)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !100, file: !45, line: 98, baseType: !103, size: 64, offset: 1920)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !100, file: !45, line: 99, baseType: !103, size: 64, offset: 1984)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !100, file: !45, line: 100, baseType: !103, size: 64, offset: 2048)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !100, file: !45, line: 102, baseType: !82, size: 64, offset: 2112)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !100, file: !45, line: 104, baseType: !103, size: 64, offset: 2176)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !100, file: !45, line: 105, baseType: !103, size: 64, offset: 2240)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !44, file: !45, line: 166, baseType: !151, size: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !45, line: 120, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 108, size: 640, elements: !154)
!154 = !{!155, !160, !161, !166, !167, !168, !173, !174, !179, !180}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !153, file: !45, line: 109, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 200, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!34, !28}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !153, file: !45, line: 110, baseType: !103, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !153, file: !45, line: 111, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 201, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!28, !28, !34}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !153, file: !45, line: 112, baseType: !162, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !153, file: !45, line: 113, baseType: !27, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !153, file: !45, line: 114, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 203, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!7, !28, !34, !28}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !153, file: !45, line: 115, baseType: !27, size: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !153, file: !45, line: 116, baseType: !175, size: 64, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 207, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!7, !28, !28}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !153, file: !45, line: 118, baseType: !103, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !153, file: !45, line: 119, baseType: !162, size: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !44, file: !45, line: 167, baseType: !182, size: 64, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !45, line: 126, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 122, size: 192, elements: !185)
!185 = !{!186, !187, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !184, file: !45, line: 123, baseType: !156, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !184, file: !45, line: 124, baseType: !103, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !184, file: !45, line: 125, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 205, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!7, !28, !28, !28}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !44, file: !45, line: 171, baseType: !194, size: 64, offset: 960)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 219, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !28}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !35, line: 145, baseType: !34)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !44, file: !45, line: 172, baseType: !112, size: 64, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !44, file: !45, line: 173, baseType: !96, size: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !44, file: !45, line: 174, baseType: !202, size: 64, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 215, baseType: !104)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !44, file: !45, line: 175, baseType: !204, size: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 217, baseType: !190)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !44, file: !45, line: 178, baseType: !206, size: 64, offset: 1280)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !45, line: 140, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 137, size: 128, elements: !209)
!209 = !{!210, !232}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !208, file: !45, line: 138, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !45, line: 54, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!7, !28, !215, !7}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !217, line: 33, baseType: !218)
!217 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/pybuffer.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "b062a75218ff363c388d03c953e9be96")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 20, size: 640, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !229, !230, !231}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !218, file: !217, line: 21, baseType: !27, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !218, file: !217, line: 22, baseType: !28, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !218, file: !217, line: 23, baseType: !34, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !218, file: !217, line: 24, baseType: !34, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !218, file: !217, line: 26, baseType: !7, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !218, file: !217, line: 27, baseType: !7, size: 32, offset: 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !218, file: !217, line: 28, baseType: !70, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !218, file: !217, line: 29, baseType: !228, size: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !218, file: !217, line: 30, baseType: !228, size: 64, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !218, file: !217, line: 31, baseType: !228, size: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !218, file: !217, line: 32, baseType: !27, size: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !208, file: !45, line: 139, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !45, line: 55, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !28, !215}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !44, file: !45, line: 181, baseType: !238, size: 64, offset: 1344)
!238 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !44, file: !45, line: 183, baseType: !54, size: 64, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !44, file: !45, line: 187, baseType: !241, size: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 209, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!7, !28, !245, !27}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 208, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!7, !28, !27}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !44, file: !45, line: 190, baseType: !120, size: 64, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !44, file: !45, line: 194, baseType: !251, size: 64, offset: 1600)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 220, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!28, !28, !28, !7}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !44, file: !45, line: 197, baseType: !34, size: 64, offset: 1664)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !44, file: !45, line: 200, baseType: !257, size: 64, offset: 1728)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 221, baseType: !83)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !44, file: !45, line: 201, baseType: !259, size: 64, offset: 1792)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 222, baseType: !83)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !44, file: !45, line: 204, baseType: !261, size: 64, offset: 1856)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !30, line: 14, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !264, line: 54, size: 256, elements: !265)
!264 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/methodobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "d16253797aba078267dcb5d0afce23bc")
!265 = !{!266, !267, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !263, file: !264, line: 55, baseType: !54, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !263, file: !264, line: 56, baseType: !268, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !264, line: 19, baseType: !104)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !263, file: !264, line: 57, baseType: !7, size: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !263, file: !264, line: 59, baseType: !54, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !44, file: !45, line: 205, baseType: !272, size: 64, offset: 1920)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !30, line: 16, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !275, line: 18, size: 320, elements: !276)
!275 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/structmember.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "7454eedd17059aa65fa47c9e0f3b5384")
!276 = !{!277, !278, !279, !280, !281}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !275, line: 19, baseType: !54, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !274, file: !275, line: 20, baseType: !7, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !274, file: !275, line: 21, baseType: !34, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !275, line: 22, baseType: !7, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !274, file: !275, line: 23, baseType: !54, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !44, file: !45, line: 206, baseType: !283, size: 64, offset: 1984)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !30, line: 15, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !286, line: 11, size: 320, elements: !287)
!286 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/descrobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "242ee4d5fc45bad34457db881bf071ca")
!287 = !{!288, !289, !294, !299, !300}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !285, file: !286, line: 12, baseType: !54, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !285, file: !286, line: 13, baseType: !290, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !286, line: 8, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!28, !28, !27}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !285, file: !286, line: 14, baseType: !295, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !286, line: 9, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!7, !28, !28, !27}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !285, file: !286, line: 15, baseType: !54, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !285, file: !286, line: 16, baseType: !27, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !44, file: !45, line: 208, baseType: !42, size: 64, offset: 2048)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !44, file: !45, line: 209, baseType: !28, size: 64, offset: 2112)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !44, file: !45, line: 210, baseType: !304, size: 64, offset: 2176)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 223, baseType: !113)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !44, file: !45, line: 211, baseType: !306, size: 64, offset: 2240)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 224, baseType: !190)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !44, file: !45, line: 212, baseType: !34, size: 64, offset: 2304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !44, file: !45, line: 213, baseType: !309, size: 64, offset: 2368)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 225, baseType: !190)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !44, file: !45, line: 214, baseType: !311, size: 64, offset: 2432)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 227, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!28, !42, !34}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !44, file: !45, line: 215, baseType: !316, size: 64, offset: 2496)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 226, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!28, !42, !28, !28}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !44, file: !45, line: 216, baseType: !321, size: 64, offset: 2560)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 212, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !27}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !44, file: !45, line: 217, baseType: !120, size: 64, offset: 2624)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !44, file: !45, line: 218, baseType: !28, size: 64, offset: 2688)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !44, file: !45, line: 219, baseType: !28, size: 64, offset: 2752)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !44, file: !45, line: 220, baseType: !28, size: 64, offset: 2816)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !44, file: !45, line: 221, baseType: !28, size: 64, offset: 2880)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !44, file: !45, line: 222, baseType: !28, size: 64, offset: 2944)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !44, file: !45, line: 223, baseType: !60, size: 64, offset: 3008)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !44, file: !45, line: 226, baseType: !14, size: 32, offset: 3072)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !44, file: !45, line: 228, baseType: !60, size: 64, offset: 3136)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !44, file: !45, line: 229, baseType: !335, size: 64, offset: 3200)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !45, line: 57, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!28, !28, !339, !341, !28}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !342, line: 70, baseType: !238)
!342 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !345, line: 14, baseType: !346)
!345 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/methodobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "de162f3f7705d370de4a5b2391985004")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 7, size: 448, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !346, file: !345, line: 8, baseType: !29, size: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !346, file: !345, line: 9, baseType: !261, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !346, file: !345, line: 10, baseType: !28, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !346, file: !345, line: 11, baseType: !28, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !346, file: !345, line: 12, baseType: !28, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !346, file: !345, line: 13, baseType: !335, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_CyFunctionObject", file: !21, line: 2440, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 2406, size: 1536, elements: !357)
!357 = !{!358, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !356, file: !21, line: 2413, baseType: !359, size: 512)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCMethodObject", file: !345, line: 26, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 23, size: 512, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !360, file: !345, line: 24, baseType: !344, size: 448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mm_class", scope: !360, file: !345, line: 25, baseType: !42, size: 64, offset: 448)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "func_dict", scope: !356, file: !21, line: 2421, baseType: !28, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "func_name", scope: !356, file: !21, line: 2422, baseType: !28, size: 64, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "func_qualname", scope: !356, file: !21, line: 2423, baseType: !28, size: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "func_doc", scope: !356, file: !21, line: 2424, baseType: !28, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "func_globals", scope: !356, file: !21, line: 2425, baseType: !28, size: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "func_code", scope: !356, file: !21, line: 2426, baseType: !28, size: 64, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "func_closure", scope: !356, file: !21, line: 2427, baseType: !28, size: 64, offset: 896)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !356, file: !21, line: 2431, baseType: !27, size: 64, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_pyobjects", scope: !356, file: !21, line: 2432, baseType: !7, size: 32, offset: 1024)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_size", scope: !356, file: !21, line: 2433, baseType: !341, size: 64, offset: 1088)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !356, file: !21, line: 2434, baseType: !7, size: 32, offset: 1152)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_tuple", scope: !356, file: !21, line: 2435, baseType: !28, size: 64, offset: 1216)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_kwdict", scope: !356, file: !21, line: 2436, baseType: !28, size: 64, offset: 1280)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "defaults_getter", scope: !356, file: !21, line: 2437, baseType: !83, size: 64, offset: 1344)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "func_annotations", scope: !356, file: !21, line: 2438, baseType: !28, size: 64, offset: 1408)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "func_is_coroutine", scope: !356, file: !21, line: 2439, baseType: !28, size: 64, offset: 1472)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !382, line: 11, baseType: !383)
!382 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/tupleobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "dc5125d9874a31c3ab3d1fe314ca89bb")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 5, size: 256, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 6, baseType: !48, size: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !383, file: !382, line: 10, baseType: !387, size: 64, offset: 192)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 1)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !392, line: 29, baseType: !393)
!392 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/dictobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "ca445c2681ff34d200fbf38fa4280db0")
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 11, size: 384, elements: !394)
!394 = !{!395, !396, !397, !401, !405}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !393, file: !392, line: 12, baseType: !29, size: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !393, file: !392, line: 15, baseType: !34, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ma_version_tag", scope: !393, file: !392, line: 19, baseType: !398, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !399, line: 27, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !39, line: 45, baseType: !238)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !393, file: !392, line: 21, baseType: !402, size: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !392, line: 5, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !45, line: 254, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !393, file: !392, line: 28, baseType: !406, size: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictValues", file: !392, line: 6, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictvalues", file: !392, line: 6, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionWithKeywords", file: !264, line: 21, baseType: !113)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_obj_6Cython_4Plex_8Machines_FastMachine", file: !21, line: 1643, size: 384, elements: !417)
!417 = !{!418, !419, !420, !421, !422}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !416, file: !21, line: 1644, baseType: !29, size: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "initial_states", scope: !416, file: !21, line: 1645, baseType: !28, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "new_state_template", scope: !416, file: !21, line: 1646, baseType: !28, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !416, file: !21, line: 1647, baseType: !28, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "next_number", scope: !416, file: !21, line: 1648, baseType: !34, size: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_obj_6Cython_4Plex_3DFA_StateMap", file: !21, line: 1659, size: 384, elements: !425)
!425 = !{!426, !427, !437, !438, !439}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !424, file: !21, line: 1660, baseType: !29, size: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_vtab", scope: !424, file: !21, line: 1661, baseType: !428, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_4Plex_3DFA_StateMap", file: !21, line: 1807, size: 192, elements: !430)
!430 = !{!431, !435, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "old_to_new", scope: !429, file: !21, line: 1808, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!28, !423, !28}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "highest_priority_action", scope: !429, file: !21, line: 1809, baseType: !432, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "make_key", scope: !429, file: !21, line: 1810, baseType: !432, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "new_machine", scope: !424, file: !21, line: 1662, baseType: !415, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "old_to_new_dict", scope: !424, file: !21, line: 1663, baseType: !28, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "new_to_old_dict", scope: !424, file: !21, line: 1664, baseType: !28, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_obj_6Cython_4Plex_8Machines_Node", file: !21, line: 1626, size: 448, elements: !442)
!442 = !{!443, !444, !472, !485, !486, !487}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !441, file: !21, line: 1627, baseType: !29, size: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !441, file: !21, line: 1628, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_obj_6Cython_4Plex_11Transitions_TransitionMap", file: !21, line: 1595, size: 320, elements: !447)
!447 = !{!448, !449, !470, !471}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !446, file: !21, line: 1596, baseType: !29, size: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_vtab", scope: !446, file: !21, line: 1597, baseType: !450, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_4Plex_11Transitions_TransitionMap", file: !21, line: 1774, size: 320, elements: !452)
!452 = !{!453, !457, !458, !462, !466}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !451, file: !21, line: 1775, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!28, !445, !28, !28, !7}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "add_set", scope: !451, file: !21, line: 1776, baseType: !454, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "iteritems", scope: !451, file: !21, line: 1777, baseType: !459, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!28, !445, !7}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !451, file: !21, line: 1778, baseType: !463, size: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!28, !445, !40}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "get_special", scope: !451, file: !21, line: 1779, baseType: !467, size: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!28, !445, !28}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !446, file: !21, line: 1598, baseType: !28, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "special", scope: !446, file: !21, line: 1599, baseType: !28, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !441, file: !21, line: 1629, baseType: !473, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_obj_6Cython_4Plex_7Actions_Action", file: !21, line: 1506, size: 192, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !474, file: !21, line: 1507, baseType: !29, size: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_vtab", scope: !474, file: !21, line: 1508, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_4Plex_7Actions_Action", file: !21, line: 1677, size: 64, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "perform", scope: !479, file: !21, line: 1678, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!28, !473, !28, !28}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_closure", scope: !441, file: !21, line: 1630, baseType: !28, size: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !441, file: !21, line: 1631, baseType: !34, size: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "action_priority", scope: !441, file: !21, line: 1632, baseType: !7, size: 32, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodObject", file: !490, line: 18, baseType: !491)
!490 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/classobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "f84d2b52de3a2730fbf0010ddbe9b14d")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 12, size: 384, elements: !492)
!492 = !{!493, !494, !495, !496, !497}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !491, file: !490, line: 13, baseType: !29, size: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "im_func", scope: !491, file: !490, line: 14, baseType: !28, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "im_self", scope: !491, file: !490, line: 15, baseType: !28, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "im_weakreflist", scope: !491, file: !490, line: 16, baseType: !28, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !491, file: !490, line: 17, baseType: !335, size: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !500, line: 22, baseType: !501)
!500 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/listobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "fb4fd95f673a2d5fdee5b26f4d68bde2")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !500, line: 5, size: 320, elements: !502)
!502 = !{!503, !504, !505}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !501, file: !500, line: 6, baseType: !48, size: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !501, file: !500, line: 8, baseType: !94, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !501, file: !500, line: 21, baseType: !34, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !13, line: 206, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 72, size: 384, elements: !509)
!509 = !{!510, !511, !512, !513, !521}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !508, file: !13, line: 146, baseType: !29, size: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !508, file: !13, line: 147, baseType: !34, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !508, file: !13, line: 148, baseType: !198, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !508, file: !13, line: 204, baseType: !514, size: 32, offset: 256)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !508, file: !13, line: 149, size: 32, elements: !515)
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !514, file: !13, line: 158, baseType: !14, size: 2, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !514, file: !13, line: 186, baseType: !14, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !514, file: !13, line: 191, baseType: !14, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !514, file: !13, line: 195, baseType: !14, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !514, file: !13, line: 200, baseType: !14, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !508, file: !13, line: 205, baseType: !522, size: 64, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !342, line: 96, baseType: !7)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !13, line: 218, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 211, size: 576, elements: !527)
!527 = !{!528, !529, !530, !531}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !526, file: !13, line: 212, baseType: !507, size: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !526, file: !13, line: 213, baseType: !34, size: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !526, file: !13, line: 215, baseType: !70, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !526, file: !13, line: 216, baseType: !34, size: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !13, line: 231, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 223, size: 640, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !534, file: !13, line: 224, baseType: !525, size: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !534, file: !13, line: 230, baseType: !538, size: 64, offset: 576)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !13, line: 225, size: 64, elements: !539)
!539 = !{!540, !541, !548, !554}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !538, file: !13, line: 226, baseType: !27, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !538, file: !13, line: 227, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !544, line: 104, baseType: !545)
!544 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/unicodeobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "0cca020c29e2c9bcb16b6fcf0d642f7b")
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !399, line: 24, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !39, line: 38, baseType: !547)
!547 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !538, file: !13, line: 228, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !544, line: 103, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !399, line: 25, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !39, line: 40, baseType: !553)
!553 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !538, file: !13, line: 229, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !544, line: 102, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !399, line: 26, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !39, line: 42, baseType: !14)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_4Plex_7Actions_Return", file: !21, line: 1691, size: 64, elements: !562)
!562 = !{!563}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_base", scope: !561, file: !21, line: 1692, baseType: !479, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_4Plex_7Actions_Call", file: !21, line: 1705, size: 64, elements: !566)
!566 = !{!567}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_base", scope: !565, file: !21, line: 1706, baseType: !479, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_4Plex_7Actions_Method", file: !21, line: 1719, size: 64, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_base", scope: !569, file: !21, line: 1720, baseType: !479, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_4Plex_7Actions_Begin", file: !21, line: 1733, size: 64, elements: !574)
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_base", scope: !573, file: !21, line: 1734, baseType: !479, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_4Plex_7Actions_Ignore", file: !21, line: 1747, size: 64, elements: !578)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_base", scope: !577, file: !21, line: 1748, baseType: !479, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_4Plex_7Actions_Text", file: !21, line: 1760, size: 64, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_base", scope: !581, file: !21, line: 1761, baseType: !479, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_4Plex_8Machines_Machine", file: !21, line: 1792, size: 128, elements: !586)
!586 = !{!587, !599}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "new_state", scope: !585, file: !21, line: 1793, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!28, !591, !7}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_obj_6Cython_4Plex_8Machines_Machine", file: !21, line: 1610, size: 384, elements: !593)
!593 = !{!594, !595, !596, !597, !598}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !592, file: !21, line: 1611, baseType: !29, size: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_vtab", scope: !592, file: !21, line: 1612, baseType: !584, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !592, file: !21, line: 1613, baseType: !28, size: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "initial_states", scope: !592, file: !21, line: 1614, baseType: !28, size: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next_state_number", scope: !592, file: !21, line: 1615, baseType: !34, size: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "new_initial_state", scope: !585, file: !21, line: 1794, baseType: !600, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!28, !591, !28, !7}
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCMethod", file: !264, line: 26, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!28, !28, !42, !339, !341, !28}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyCFunctionFastWithKeywords", file: !264, line: 23, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!28, !28, !339, !34, !28}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "sdigit", file: !620, line: 44, baseType: !621)
!620 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/longintrepr.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "8513e3439a1d73970093054a9381adac")
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !622, line: 26, baseType: !623)
!622 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !39, line: 41, baseType: !7)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !30, line: 19, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !620, line: 82, size: 256, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !626, file: !620, line: 83, baseType: !48, size: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !626, file: !620, line: 84, baseType: !630, size: 32, offset: 192)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 32, elements: !388)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !620, line: 43, baseType: !557)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !21, line: 2495, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 2492, size: 128, elements: !635)
!635 = !{!636, !673}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !634, file: !21, line: 2493, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !30, line: 21, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !640, line: 103, size: 1536, elements: !641)
!640 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/code.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "0b18b017cf6ecc9860048f5ec02e4f52")
!641 = !{!642, !643, !644, !645, !646, !647, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !639, file: !640, line: 103, baseType: !48, size: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "co_warmup", scope: !639, file: !640, line: 103, baseType: !648, size: 16, offset: 416)
!648 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_co_linearray_entry_size", scope: !639, file: !640, line: 103, baseType: !648, size: 16, offset: 432)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 480)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 512)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 544)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 608)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 640)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "co_nplaincellvars", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 672)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 736)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 768)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 832)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 896)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 960)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 1024)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 1088)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 1152)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !639, file: !640, line: 103, baseType: !28, size: 64, offset: 1216)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_co_linearray", scope: !639, file: !640, line: 103, baseType: !70, size: 64, offset: 1280)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !639, file: !640, line: 103, baseType: !7, size: 32, offset: 1344)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !639, file: !640, line: 103, baseType: !27, size: 64, offset: 1408)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !639, file: !640, line: 103, baseType: !672, size: 8, offset: 1472)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, elements: !388)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !634, file: !21, line: 2494, baseType: !7, size: 32, offset: 64)
!674 = !{!0, !675, !680, !710, !715, !718, !723, !728, !733, !738, !740, !745, !747, !752, !757, !759, !768, !773, !775, !780, !782, !787, !792, !794, !799, !804, !919, !921, !926, !928, !933, !938, !943, !946, !951, !953, !955, !960, !965, !970, !975, !977, !982, !987, !989, !991, !996, !1001, !1006, !1008, !1013, !1015, !1018, !1020, !1025, !1030, !1032, !1034, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1060, !1063, !1065, !1070, !1075, !1077, !1082, !1084, !1086, !1091, !1096, !1106, !1109, !1112, !1115, !1120, !1122, !1125, !1128, !1131, !1133, !1136, !1141, !1144, !1149, !1152, !1154, !1156, !1158, !1163, !1165, !1168, !1170, !1172, !1174, !1176, !1178, !1180, !1183, !1186, !1189, !1191, !1194, !1197, !1199, !1202, !1204, !1207, !1209, !1211, !1213, !1215, !1217, !1219, !1221, !1223, !1225, !1227, !1229, !1231, !1233, !1235, !1237, !1242, !1245, !1247, !1249, !1251, !1254, !1256, !1258, !1260, !1262, !1264, !1266, !1268, !1270, !1272, !1274, !1276, !1278, !1280, !1282, !1284, !1286, !1288, !1290, !1292, !1294, !1299, !1302, !1307, !1309, !1314, !1316, !1321, !1323, !1325, !1328, !1333, !1335, !1337, !1342, !1344, !1349, !1352, !1354, !1356, !1361, !1363, !1365, !1367, !1369, !1402, !1404, !1407, !1412, !1414, !1416, !1418, !1420, !1422, !1424, !1426, !1428, !1433, !1435, !1437, !1439, !1442, !1444, !1447, !1449, !1454, !1456, !1461, !1489, !1491, !1493, !1495, !1497, !1499, !1501, !1503, !1508, !1510, !1512, !1514, !1516, !1518, !1520, !1522, !1524, !1526, !1528, !1530, !1535, !1540, !1542, !1544, !1546, !1548, !1550, !1552, !1554, !1556, !1558, !1560, !1562, !1564, !1566, !1568, !1570, !1572, !1577, !1582, !1587, !1592, !1594, !1596, !1598, !1600, !1602, !1604, !1606, !1608, !1610, !1612, !1614, !1616, !1621, !1626, !1629, !1632, !1634, !1636, !1638, !1640, !1645, !1650, !1652, !1654, !1656, !1658, !1660, !1662, !1664, !1666, !1671, !1673, !1678, !1680, !1682, !1684, !1689, !1691, !1693, !1857, !1859, !1866, !1868, !1873}
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6683, type: !677, isLocal: true, isDefinition: true)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 32, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 4)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !21, line: 6679, type: !682, isLocal: true, isDefinition: true)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !683, line: 74, size: 832, elements: !684)
!683 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/moduleobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "daa9b768501fad61bad25a7caf4dc4db")
!684 = !{!685, !696, !697, !698, !699, !700, !707, !708, !709}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !682, file: !683, line: 75, baseType: !686, size: 320)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !683, line: 49, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !683, line: 44, size: 320, elements: !688)
!688 = !{!689, !690, !694, !695}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !687, file: !683, line: 45, baseType: !29, size: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !687, file: !683, line: 46, baseType: !691, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!28}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !687, file: !683, line: 47, baseType: !34, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !687, file: !683, line: 48, baseType: !28, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !682, file: !683, line: 76, baseType: !54, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !682, file: !683, line: 77, baseType: !54, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !682, file: !683, line: 78, baseType: !34, size: 64, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !682, file: !683, line: 79, baseType: !261, size: 64, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !682, file: !683, line: 80, baseType: !701, size: 64, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !30, line: 13, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !683, line: 60, size: 128, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !703, file: !683, line: 61, baseType: !7, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !703, file: !683, line: 62, baseType: !27, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !682, file: !683, line: 81, baseType: !241, size: 64, offset: 640)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !682, file: !683, line: 82, baseType: !120, size: 64, offset: 704)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !682, file: !683, line: 83, baseType: !321, size: 64, offset: 768)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "__pyx_k_Python_Lexical_Analyser_Convert", scope: !2, file: !21, line: 2676, type: !712, isLocal: true, isDefinition: true)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 392, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 49)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !21, line: 6287, type: !717, isLocal: true, isDefinition: true)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 256, elements: !388)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !21, line: 6668, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 384, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 3)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6794, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 40, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 5)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6805, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 56, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 7)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6805, type: !735, isLocal: true, isDefinition: true)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 88, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 11)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6806, type: !730, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6806, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 72, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 9)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6807, type: !730, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6807, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 96, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 12)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6808, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 216, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 27)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6808, type: !742, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !761, file: !21, line: 6742, type: !766, isLocal: true, isDefinition: true)
!761 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !21, file: !21, line: 6740, type: !762, scopeLine: 6740, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !764)
!762 = !DISubroutineType(types: !763)
!763 = !{!7}
!764 = !{!765}
!765 = !DILocalVariable(name: "current_id", scope: !761, file: !21, line: 6743, type: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !622, line: 27, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !39, line: 44, baseType: !40)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6758, type: !770, isLocal: true, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 760, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 95)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !21, line: 1446, type: !28, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6834, type: !777, isLocal: true, isDefinition: true)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 608, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 76)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6864, type: !742, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6866, type: !784, isLocal: true, isDefinition: true)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 120, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 15)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6868, type: !789, isLocal: true, isDefinition: true)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 104, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 13)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6884, type: !672, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6922, type: !796, isLocal: true, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 128, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 16)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !21, line: 7091, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 168, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 21)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !21, line: 2853, type: !806, isLocal: true, isDefinition: true)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstate", file: !21, line: 2830, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 2690, size: 6976, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !808, file: !21, line: 2691, baseType: !28, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !808, file: !21, line: 2692, baseType: !28, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !808, file: !21, line: 2693, baseType: !28, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !808, file: !21, line: 2694, baseType: !28, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !808, file: !21, line: 2695, baseType: !28, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !808, file: !21, line: 2696, baseType: !28, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_CyFunctionType", scope: !808, file: !21, line: 2698, baseType: !42, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_7Actions_Action", scope: !808, file: !21, line: 2721, baseType: !42, size: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_7Actions_Return", scope: !808, file: !21, line: 2722, baseType: !42, size: 64, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_7Actions_Call", scope: !808, file: !21, line: 2723, baseType: !42, size: 64, offset: 576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_7Actions_Method", scope: !808, file: !21, line: 2724, baseType: !42, size: 64, offset: 640)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_7Actions_Begin", scope: !808, file: !21, line: 2725, baseType: !42, size: 64, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_7Actions_Ignore", scope: !808, file: !21, line: 2726, baseType: !42, size: 64, offset: 768)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_7Actions_Text", scope: !808, file: !21, line: 2727, baseType: !42, size: 64, offset: 832)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_11Transitions_TransitionMap", scope: !808, file: !21, line: 2730, baseType: !42, size: 64, offset: 896)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_8Machines_Machine", scope: !808, file: !21, line: 2733, baseType: !42, size: 64, offset: 960)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_8Machines_Node", scope: !808, file: !21, line: 2734, baseType: !42, size: 64, offset: 1024)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_8Machines_FastMachine", scope: !808, file: !21, line: 2735, baseType: !42, size: 64, offset: 1088)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_4Plex_3DFA_StateMap", scope: !808, file: !21, line: 2739, baseType: !42, size: 64, offset: 1152)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_", scope: !808, file: !21, line: 2740, baseType: !28, size: 64, offset: 1216)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_Cython_Plex_DFA", scope: !808, file: !21, line: 2741, baseType: !28, size: 64, offset: 1280)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_s_Cython_Plex_DFA_py", scope: !808, file: !21, line: 2742, baseType: !28, size: 64, offset: 1344)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_s_Incompatible_checksums_0x_x_vs_0", scope: !808, file: !21, line: 2743, baseType: !28, size: 64, offset: 1408)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_LOWEST_PRIORITY", scope: !808, file: !21, line: 2744, baseType: !28, size: 64, offset: 1472)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_Machines", scope: !808, file: !21, line: 2745, baseType: !28, size: 64, offset: 1536)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_PickleError", scope: !808, file: !21, line: 2746, baseType: !28, size: 64, offset: 1600)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_State", scope: !808, file: !21, line: 2747, baseType: !28, size: 64, offset: 1664)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_StateMap", scope: !808, file: !21, line: 2748, baseType: !28, size: 64, offset: 1728)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_StateMap___reduce_cython", scope: !808, file: !21, line: 2749, baseType: !28, size: 64, offset: 1792)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_StateMap___setstate_cython", scope: !808, file: !21, line: 2750, baseType: !28, size: 64, offset: 1856)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_StateMap_dump", scope: !808, file: !21, line: 2751, baseType: !28, size: 64, offset: 1920)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_StateMap_new_to_old", scope: !808, file: !21, line: 2752, baseType: !28, size: 64, offset: 1984)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_State_Mapping", scope: !808, file: !21, line: 2753, baseType: !28, size: 64, offset: 2048)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_TransitionMap", scope: !808, file: !21, line: 2754, baseType: !28, size: 64, offset: 2112)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_Transitions", scope: !808, file: !21, line: 2755, baseType: !28, size: 64, offset: 2176)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s__19", scope: !808, file: !21, line: 2756, baseType: !28, size: 64, offset: 2240)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u__2", scope: !808, file: !21, line: 2757, baseType: !28, size: 64, offset: 2304)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u__3", scope: !808, file: !21, line: 2758, baseType: !28, size: 64, offset: 2368)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s__5", scope: !808, file: !21, line: 2759, baseType: !28, size: 64, offset: 2432)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_add_transitions", scope: !808, file: !21, line: 2760, baseType: !28, size: 64, offset: 2496)
