; ModuleID = 'samples/816.bc'
source_filename = "file.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.isc_logcategory = type { ptr, i32 }
%struct.isc_logmodule = type { ptr, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.timeval = type { i64, i64 }

@.str = private unnamed_addr constant [7 x i8] c"file.c\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [19 x i8] c"size != ((void*)0)\00", align 1, !dbg !8
@.str.2 = private unnamed_addr constant [20 x i8] c"modep != ((void*)0)\00", align 1, !dbg !13
@.str.3 = private unnamed_addr constant [19 x i8] c"file != ((void*)0)\00", align 1, !dbg !18
@.str.4 = private unnamed_addr constant [22 x i8] c"modtime != ((void*)0)\00", align 1, !dbg !20
@.str.5 = private unnamed_addr constant [41 x i8] c"file != ((void*)0) && when != ((void*)0)\00", align 1, !dbg !25
@.str.6 = private unnamed_addr constant [15 x i8] c"tmp-XXXXXXXXXX\00", align 1, !dbg !30
@.str.7 = private unnamed_addr constant [22 x i8] c"templet != ((void*)0)\00", align 1, !dbg !35
@.str.8 = private unnamed_addr constant [18 x i8] c"buf != ((void*)0)\00", align 1, !dbg !37
@.str.9 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !42

!87 = distinct !DIGlobalVariable(scope: null, file: !2, line: 388, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 23)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(scope: null, file: !2, line: 401, type: !22, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !22, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(scope: null, file: !2, line: 415, type: !88, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !2, line: 605, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 2)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 630, type: !99, isLocal: true, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(scope: null, file: !2, line: 638, type: !99, isLocal: true, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(scope: null, file: !2, line: 733, type: !10, isLocal: true, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(scope: null, file: !2, line: 734, type: !10, isLocal: true, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(scope: null, file: !2, line: 765, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 11)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 788, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 29)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !15, isLocal: true, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(scope: null, file: !2, line: 537, type: !22, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(scope: null, file: !2, line: 538, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 12)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(scope: null, file: !2, line: 714, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 5)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 63)
!137 = !{i32 7, !"Dwarf Version", i32 5}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{i32 1, !"wchar_size", i32 4}
!140 = !{i32 8, !"PIC Level", i32 2}
!141 = !{i32 7, !"uwtable", i32 2}
!142 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!143 = distinct !DISubprogram(name: "isc_file_getsizefd", scope: !2, file: !2, line: 110, type: !144, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !152)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !66, !148}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_result_t", file: !147, line: 67, baseType: !53)
!147 = !DIFile(filename: "../include/isc/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/isc/unix", checksumkind: CSK_MD5, checksum: "6a355582c4f962c465b18bab43b68c96")
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !150, line: 56, baseType: !151)
!150 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !65, line: 152, baseType: !61)
!152 = !{!153, !154, !155, !156}
!153 = !DILocalVariable(name: "fd", arg: 1, scope: !143, file: !2, line: 110, type: !66)
!154 = !DILocalVariable(name: "size", arg: 2, scope: !143, file: !2, line: 110, type: !148)
!155 = !DILocalVariable(name: "result", scope: !143, file: !2, line: 111, type: !146)
!156 = !DILocalVariable(name: "stats", scope: !143, file: !2, line: 112, type: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !158, line: 26, size: 1152, elements: !159)
!158 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!159 = !{!160, !162, !164, !166, !168, !170, !172, !173, !174, !175, !177, !179, !187, !188, !189}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !157, file: !158, line: 31, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !65, line: 145, baseType: !72)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !157, file: !158, line: 36, baseType: !163, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !65, line: 148, baseType: !72)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !157, file: !158, line: 44, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !65, line: 151, baseType: !72)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !157, file: !158, line: 45, baseType: !167, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !65, line: 150, baseType: !53)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !157, file: !158, line: 47, baseType: !169, size: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !65, line: 146, baseType: !53)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !157, file: !158, line: 48, baseType: !171, size: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !65, line: 147, baseType: !53)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !157, file: !158, line: 50, baseType: !66, size: 32, offset: 288)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !157, file: !158, line: 52, baseType: !161, size: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !157, file: !158, line: 57, baseType: !151, size: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !157, file: !158, line: 61, baseType: !176, size: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !65, line: 175, baseType: !61)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !157, file: !158, line: 63, baseType: !178, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !65, line: 180, baseType: !61)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !157, file: !158, line: 74, baseType: !180, size: 128, offset: 576)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !181, line: 11, size: 128, elements: !182)
!181 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!182 = !{!183, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !180, file: !181, line: 16, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !65, line: 160, baseType: !61)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !180, file: !181, line: 21, baseType: !186, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !65, line: 197, baseType: !61)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !157, file: !158, line: 75, baseType: !180, size: 128, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !157, file: !158, line: 76, baseType: !180, size: 128, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !157, file: !158, line: 89, baseType: !190, size: 192, offset: 960)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 192, elements: !82)
!191 = !DILocation(line: 110, column: 24, scope: !143)
!192 = !DILocation(line: 110, column: 35, scope: !143)
!193 = !DILocation(line: 111, column: 2, scope: !143)
!194 = !DILocation(line: 111, column: 15, scope: !143)
!195 = !DILocation(line: 112, column: 2, scope: !143)
!196 = !DILocation(line: 112, column: 14, scope: !143)
!197 = !DILocation(line: 114, column: 2, scope: !143)
!198 = !DILocation(line: 116, column: 20, scope: !143)
!199 = !DILocation(line: 116, column: 11, scope: !143)
!200 = !DILocation(line: 116, column: 9, scope: !143)
!201 = !DILocation(line: 118, column: 6, scope: !202)
!202 = distinct !DILexicalBlock(scope: !143, file: !2, line: 118, column: 6)
!203 = !DILocation(line: 118, column: 13, scope: !202)
!204 = !DILocation(line: 118, column: 6, scope: !143)
!205 = !DILocation(line: 119, column: 17, scope: !202)
!206 = !DILocation(line: 119, column: 4, scope: !202)
!207 = !DILocation(line: 119, column: 9, scope: !202)
!208 = !DILocation(line: 119, column: 3, scope: !202)
!209 = !DILocation(line: 121, column: 10, scope: !143)
!210 = !DILocation(line: 122, column: 1, scope: !143)
!211 = !DILocation(line: 121, column: 2, scope: !143)
!212 = !DISubprogram(name: "isc_assertion_failed", scope: !52, file: !52, line: 37, type: !213, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215, !66, !216, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_assertiontype_t", file: !52, line: 30, baseType: !51)
!217 = distinct !DISubprogram(name: "fd_stats", scope: !2, file: !2, line: 98, type: !218, scopeLine: 98, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !221)
!218 = !DISubroutineType(types: !219)
!219 = !{!146, !66, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!221 = !{!222, !223, !224}
!222 = !DILocalVariable(name: "fd", arg: 1, scope: !217, file: !2, line: 98, type: !66)
!223 = !DILocalVariable(name: "stats", arg: 2, scope: !217, file: !2, line: 98, type: !220)
!224 = !DILocalVariable(name: "result", scope: !217, file: !2, line: 99, type: !146)
!225 = !DILocation(line: 98, column: 14, scope: !217)
!226 = !DILocation(line: 98, column: 31, scope: !217)
!227 = !DILocation(line: 99, column: 2, scope: !217)
!228 = !DILocation(line: 99, column: 15, scope: !217)
!229 = !DILocation(line: 101, column: 2, scope: !217)
!230 = !DILocation(line: 103, column: 12, scope: !231)
!231 = distinct !DILexicalBlock(scope: !217, file: !2, line: 103, column: 6)
!232 = !DILocation(line: 103, column: 16, scope: !231)
!233 = !DILocation(line: 103, column: 6, scope: !231)
!234 = !DILocation(line: 103, column: 23, scope: !231)
!235 = !DILocation(line: 103, column: 6, scope: !217)
!236 = !DILocation(line: 104, column: 12, scope: !231)
!237 = !DILocation(line: 104, column: 10, scope: !231)
!238 = !DILocation(line: 104, column: 3, scope: !231)
!239 = !DILocation(line: 106, column: 10, scope: !217)
!240 = !DILocation(line: 107, column: 1, scope: !217)
!241 = !DILocation(line: 106, column: 2, scope: !217)
!242 = distinct !DISubprogram(name: "isc_file_mode", scope: !2, file: !2, line: 125, type: !243, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !247)
!243 = !DISubroutineType(types: !244)
!244 = !{!146, !215, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !150, line: 50, baseType: !167)
!247 = !{!248, !249, !250, !251}
!248 = !DILocalVariable(name: "file", arg: 1, scope: !242, file: !2, line: 125, type: !215)
!249 = !DILocalVariable(name: "modep", arg: 2, scope: !242, file: !2, line: 125, type: !245)
!250 = !DILocalVariable(name: "result", scope: !242, file: !2, line: 126, type: !146)
!251 = !DILocalVariable(name: "stats", scope: !242, file: !2, line: 127, type: !157)
!252 = !DILocation(line: 125, column: 27, scope: !242)
!253 = !DILocation(line: 125, column: 41, scope: !242)
!254 = !DILocation(line: 126, column: 2, scope: !242)
!255 = !DILocation(line: 126, column: 15, scope: !242)
!256 = !DILocation(line: 127, column: 2, scope: !242)
!257 = !DILocation(line: 127, column: 14, scope: !242)
!258 = !DILocation(line: 129, column: 2, scope: !242)
!259 = !DILocation(line: 131, column: 22, scope: !242)
!260 = !DILocation(line: 131, column: 11, scope: !242)
!261 = !DILocation(line: 131, column: 9, scope: !242)
!262 = !DILocation(line: 132, column: 6, scope: !263)
!263 = distinct !DILexicalBlock(scope: !242, file: !2, line: 132, column: 6)
!264 = !DILocation(line: 132, column: 13, scope: !263)
!265 = !DILocation(line: 132, column: 6, scope: !242)
!266 = !DILocation(line: 133, column: 19, scope: !263)
!267 = !DILocation(line: 133, column: 27, scope: !263)
!268 = !DILocation(line: 133, column: 4, scope: !263)
!269 = !DILocation(line: 133, column: 10, scope: !263)
!270 = !DILocation(line: 133, column: 3, scope: !263)
!271 = !DILocation(line: 135, column: 10, scope: !242)
!272 = !DILocation(line: 136, column: 1, scope: !242)
!273 = !DILocation(line: 135, column: 2, scope: !242)
!274 = distinct !DISubprogram(name: "file_stats", scope: !2, file: !2, line: 85, type: !275, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !277)
!275 = !DISubroutineType(types: !276)
!276 = !{!146, !215, !220}
!277 = !{!278, !279, !280}
!278 = !DILocalVariable(name: "file", arg: 1, scope: !274, file: !2, line: 85, type: !215)
!279 = !DILocalVariable(name: "stats", arg: 2, scope: !274, file: !2, line: 85, type: !220)
!280 = !DILocalVariable(name: "result", scope: !274, file: !2, line: 86, type: !146)
!281 = !DILocation(line: 85, column: 24, scope: !274)
!282 = !DILocation(line: 85, column: 43, scope: !274)
!283 = !DILocation(line: 86, column: 2, scope: !274)
!284 = !DILocation(line: 86, column: 15, scope: !274)
!285 = !DILocation(line: 88, column: 2, scope: !274)
!286 = !DILocation(line: 89, column: 2, scope: !274)
!287 = !DILocation(line: 91, column: 11, scope: !288)
!288 = distinct !DILexicalBlock(scope: !274, file: !2, line: 91, column: 6)
!289 = !DILocation(line: 91, column: 17, scope: !288)
!290 = !DILocation(line: 91, column: 6, scope: !288)
!291 = !DILocation(line: 91, column: 24, scope: !288)
!292 = !DILocation(line: 91, column: 6, scope: !274)
!293 = !DILocation(line: 92, column: 12, scope: !288)
!294 = !DILocation(line: 92, column: 10, scope: !288)
!295 = !DILocation(line: 92, column: 3, scope: !288)
!296 = !DILocation(line: 94, column: 10, scope: !274)
!297 = !DILocation(line: 95, column: 1, scope: !274)
!298 = !DILocation(line: 94, column: 2, scope: !274)
!299 = distinct !DISubprogram(name: "isc_file_getmodtime", scope: !2, file: !2, line: 139, type: !300, scopeLine: 139, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !309)
!300 = !DISubroutineType(types: !301)
!301 = !{!146, !215, !302}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_time_t", file: !147, line: 81, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_time", file: !305, line: 86, size: 64, elements: !306)
!305 = !DIFile(filename: "./include/isc/time.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/isc/unix", checksumkind: CSK_MD5, checksum: "a0595c59a7eba4194a4b687b13cdc892")
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !304, file: !305, line: 87, baseType: !53, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "nanoseconds", scope: !304, file: !305, line: 88, baseType: !53, size: 32, offset: 32)
!309 = !{!310, !311, !312, !313}
!310 = !DILocalVariable(name: "file", arg: 1, scope: !299, file: !2, line: 139, type: !215)
!311 = !DILocalVariable(name: "modtime", arg: 2, scope: !299, file: !2, line: 139, type: !302)
!312 = !DILocalVariable(name: "result", scope: !299, file: !2, line: 140, type: !146)
!313 = !DILocalVariable(name: "stats", scope: !299, file: !2, line: 141, type: !157)
!314 = !DILocation(line: 139, column: 33, scope: !299)
!315 = !DILocation(line: 139, column: 51, scope: !299)
!316 = !DILocation(line: 140, column: 2, scope: !299)
!317 = !DILocation(line: 140, column: 15, scope: !299)
!318 = !DILocation(line: 141, column: 2, scope: !299)
!319 = !DILocation(line: 141, column: 14, scope: !299)
!320 = !DILocation(line: 143, column: 2, scope: !299)
!321 = !DILocation(line: 144, column: 2, scope: !299)
!322 = !DILocation(line: 146, column: 22, scope: !299)
!323 = !DILocation(line: 146, column: 11, scope: !299)
!324 = !DILocation(line: 146, column: 9, scope: !299)
!325 = !DILocation(line: 148, column: 6, scope: !326)
!326 = distinct !DILexicalBlock(scope: !299, file: !2, line: 148, column: 6)
!327 = !DILocation(line: 148, column: 13, scope: !326)
!328 = !DILocation(line: 148, column: 6, scope: !299)
!329 = !DILocation(line: 150, column: 16, scope: !326)
!330 = !DILocation(line: 150, column: 31, scope: !326)
!331 = !DILocation(line: 150, column: 25, scope: !326)
!332 = !DILocation(line: 150, column: 47, scope: !326)
!333 = !DILocation(line: 150, column: 55, scope: !326)
!334 = !DILocation(line: 150, column: 41, scope: !326)
!335 = !DILocation(line: 150, column: 3, scope: !326)
!336 = !DILocation(line: 155, column: 10, scope: !299)
!337 = !DILocation(line: 156, column: 1, scope: !299)
!338 = !DILocation(line: 155, column: 2, scope: !299)
!339 = !DISubprogram(name: "isc_time_set", scope: !305, file: !305, line: 94, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !302, !53, !53}
!342 = distinct !DISubprogram(name: "isc_file_getsize", scope: !2, file: !2, line: 159, type: !343, scopeLine: 159, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !345)
!343 = !DISubroutineType(types: !344)
!344 = !{!146, !215, !148}
!345 = !{!346, !347, !348, !349}
!346 = !DILocalVariable(name: "file", arg: 1, scope: !342, file: !2, line: 159, type: !215)
!347 = !DILocalVariable(name: "size", arg: 2, scope: !342, file: !2, line: 159, type: !148)
!348 = !DILocalVariable(name: "result", scope: !342, file: !2, line: 160, type: !146)
!349 = !DILocalVariable(name: "stats", scope: !342, file: !2, line: 161, type: !157)
!350 = !DILocation(line: 159, column: 30, scope: !342)
!351 = !DILocation(line: 159, column: 43, scope: !342)
!352 = !DILocation(line: 160, column: 2, scope: !342)
!353 = !DILocation(line: 160, column: 15, scope: !342)
!354 = !DILocation(line: 161, column: 2, scope: !342)
!355 = !DILocation(line: 161, column: 14, scope: !342)
!356 = !DILocation(line: 163, column: 2, scope: !342)
!357 = !DILocation(line: 164, column: 2, scope: !342)
!358 = !DILocation(line: 166, column: 22, scope: !342)
!359 = !DILocation(line: 166, column: 11, scope: !342)
!360 = !DILocation(line: 166, column: 9, scope: !342)
!361 = !DILocation(line: 168, column: 6, scope: !362)
!362 = distinct !DILexicalBlock(scope: !342, file: !2, line: 168, column: 6)
!363 = !DILocation(line: 168, column: 13, scope: !362)
!364 = !DILocation(line: 168, column: 6, scope: !342)
!365 = !DILocation(line: 169, column: 17, scope: !362)
!366 = !DILocation(line: 169, column: 4, scope: !362)
!367 = !DILocation(line: 169, column: 9, scope: !362)
!368 = !DILocation(line: 169, column: 3, scope: !362)
!369 = !DILocation(line: 171, column: 10, scope: !342)
!370 = !DILocation(line: 172, column: 1, scope: !342)
!371 = !DILocation(line: 171, column: 2, scope: !342)
!372 = distinct !DISubprogram(name: "isc_file_settime", scope: !2, file: !2, line: 175, type: !300, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !373)
!373 = !{!374, !375, !376}
!374 = !DILocalVariable(name: "file", arg: 1, scope: !372, file: !2, line: 175, type: !215)
!375 = !DILocalVariable(name: "when", arg: 2, scope: !372, file: !2, line: 175, type: !302)
!376 = !DILocalVariable(name: "times", scope: !372, file: !2, line: 176, type: !377)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 256, elements: !100)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !379, line: 8, size: 128, elements: !380)
!379 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !378, file: !379, line: 14, baseType: !184, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !378, file: !379, line: 15, baseType: !383, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !65, line: 162, baseType: !61)
!384 = !DILocation(line: 175, column: 30, scope: !372)
!385 = !DILocation(line: 175, column: 48, scope: !372)
!386 = !DILocation(line: 176, column: 2, scope: !372)
!387 = !DILocation(line: 176, column: 17, scope: !372)
!388 = !DILocation(line: 178, column: 2, scope: !372)
!389 = !DILocation(line: 0, scope: !372)
!390 = !DILocation(line: 190, column: 61, scope: !372)
!391 = !DILocation(line: 190, column: 44, scope: !372)
!392 = !DILocation(line: 190, column: 38, scope: !372)
!393 = !DILocation(line: 190, column: 20, scope: !372)
!394 = !DILocation(line: 190, column: 29, scope: !372)
!395 = !DILocation(line: 190, column: 36, scope: !372)
!396 = !DILocation(line: 190, column: 2, scope: !372)
!397 = !DILocation(line: 190, column: 11, scope: !372)
!398 = !DILocation(line: 190, column: 18, scope: !372)
!399 = !DILocation(line: 195, column: 7, scope: !400)
!400 = distinct !DILexicalBlock(scope: !372, file: !2, line: 195, column: 6)
!401 = !DILocation(line: 195, column: 16, scope: !400)
!402 = !DILocation(line: 195, column: 23, scope: !400)
!403 = !DILocation(line: 196, column: 59, scope: !400)
!404 = !DILocation(line: 195, column: 6, scope: !372)
!405 = !DILocation(line: 197, column: 3, scope: !400)
!406 = !DILocation(line: 204, column: 34, scope: !372)
!407 = !DILocation(line: 204, column: 13, scope: !372)
!408 = !DILocation(line: 204, column: 40, scope: !372)
!409 = !DILocation(line: 204, column: 3, scope: !372)
!410 = !DILocation(line: 203, column: 21, scope: !372)
!411 = !DILocation(line: 203, column: 30, scope: !372)
!412 = !DILocation(line: 203, column: 38, scope: !372)
!413 = !DILocation(line: 203, column: 2, scope: !372)
!414 = !DILocation(line: 203, column: 11, scope: !372)
!415 = !DILocation(line: 203, column: 19, scope: !372)
!416 = !DILocation(line: 206, column: 13, scope: !417)
!417 = distinct !DILexicalBlock(scope: !372, file: !2, line: 206, column: 6)
!418 = !DILocation(line: 206, column: 19, scope: !417)
!419 = !DILocation(line: 206, column: 6, scope: !417)
!420 = !DILocation(line: 206, column: 26, scope: !417)
!421 = !DILocation(line: 206, column: 6, scope: !372)
!422 = !DILocation(line: 207, column: 11, scope: !417)
!423 = !DILocation(line: 207, column: 3, scope: !417)
!424 = !DILocation(line: 209, column: 2, scope: !372)
!425 = !DILocation(line: 210, column: 1, scope: !372)
!426 = !DISubprogram(name: "isc_time_seconds", scope: !305, file: !305, line: 244, type: !427, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!427 = !DISubroutineType(types: !428)
!428 = !{!429, !432}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !430, line: 26, baseType: !431)
!430 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !65, line: 42, baseType: !53)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!434 = !DISubprogram(name: "isc_time_nanoseconds", scope: !305, file: !305, line: 277, type: !427, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!435 = !DISubprogram(name: "utimes", scope: !436, file: !436, line: 162, type: !437, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!436 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/time.h", directory: "", checksumkind: CSK_MD5, checksum: "b36e339815f62ba7208e5294180e353c")
!437 = !DISubroutineType(types: !438)
!438 = !{!66, !215, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!441 = !DISubprogram(name: "isc___errno2result", scope: !442, file: !442, line: 30, type: !443, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DIFile(filename: "./errno2result.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/isc/unix", checksumkind: CSK_MD5, checksum: "785b67342fa3bc61840c425b2d0ec5b3")
!443 = !DISubroutineType(types: !444)
!444 = !{!146, !66, !445, !215, !53}
!445 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!446 = !DISubprogram(name: "__errno_location", scope: !447, file: !447, line: 37, type: !448, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!447 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!448 = !DISubroutineType(types: !449)
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!451 = distinct !DISubprogram(name: "isc_file_mktemplate", scope: !2, file: !2, line: 216, type: !452, scopeLine: 216, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !455)
!452 = !DISubroutineType(types: !453)
!453 = !{!146, !215, !454, !70}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!455 = !{!456, !457, !458}
!456 = !DILocalVariable(name: "path", arg: 1, scope: !451, file: !2, line: 216, type: !215)
!457 = !DILocalVariable(name: "buf", arg: 2, scope: !451, file: !2, line: 216, type: !454)
!458 = !DILocalVariable(name: "buflen", arg: 3, scope: !451, file: !2, line: 216, type: !70)
!459 = !DILocation(line: 216, column: 33, scope: !451)
!460 = !DILocation(line: 216, column: 45, scope: !451)
!461 = !DILocation(line: 216, column: 57, scope: !451)
!462 = !DILocation(line: 217, column: 28, scope: !451)
!463 = !DILocation(line: 217, column: 44, scope: !451)
!464 = !DILocation(line: 217, column: 49, scope: !451)
!465 = !DILocation(line: 217, column: 10, scope: !451)
!466 = !DILocation(line: 217, column: 2, scope: !451)
!467 = distinct !DISubprogram(name: "isc_file_template", scope: !2, file: !2, line: 221, type: !468, scopeLine: 223, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{!146, !215, !215, !454, !70}
!470 = !{!471, !472, !473, !474, !475, !476}
!471 = !DILocalVariable(name: "path", arg: 1, scope: !467, file: !2, line: 221, type: !215)
!472 = !DILocalVariable(name: "templet", arg: 2, scope: !467, file: !2, line: 221, type: !215)
!473 = !DILocalVariable(name: "buf", arg: 3, scope: !467, file: !2, line: 221, type: !454)
!474 = !DILocalVariable(name: "buflen", arg: 4, scope: !467, file: !2, line: 222, type: !70)
!475 = !DILocalVariable(name: "s", scope: !467, file: !2, line: 224, type: !215)
!476 = !DILocalVariable(name: "prefixlen", scope: !477, file: !2, line: 239, type: !70)
!477 = distinct !DILexicalBlock(scope: !478, file: !2, line: 238, column: 17)
!478 = distinct !DILexicalBlock(scope: !467, file: !2, line: 238, column: 6)
!479 = !DILocation(line: 221, column: 31, scope: !467)
!480 = !DILocation(line: 221, column: 49, scope: !467)
!481 = !DILocation(line: 221, column: 64, scope: !467)
!482 = !DILocation(line: 222, column: 12, scope: !467)
!483 = !DILocation(line: 224, column: 2, scope: !467)
!484 = !DILocation(line: 224, column: 14, scope: !467)
!485 = !DILocation(line: 226, column: 2, scope: !467)
!486 = !DILocation(line: 227, column: 2, scope: !467)
!487 = !DILocation(line: 229, column: 6, scope: !488)
!488 = distinct !DILexicalBlock(scope: !467, file: !2, line: 229, column: 6)
!489 = !DILocation(line: 229, column: 11, scope: !488)
!490 = !DILocation(line: 229, column: 6, scope: !467)
!491 = !DILocation(line: 230, column: 8, scope: !488)
!492 = !DILocation(line: 230, column: 3, scope: !488)
!493 = !DILocation(line: 232, column: 14, scope: !467)
!494 = !DILocation(line: 232, column: 6, scope: !467)
!495 = !DILocation(line: 232, column: 4, scope: !467)
!496 = !DILocation(line: 233, column: 6, scope: !497)
!497 = distinct !DILexicalBlock(scope: !467, file: !2, line: 233, column: 6)
!498 = !DILocation(line: 233, column: 8, scope: !497)
!499 = !DILocation(line: 233, column: 6, scope: !467)
!500 = !DILocation(line: 234, column: 13, scope: !497)
!501 = !DILocation(line: 234, column: 15, scope: !497)
!502 = !DILocation(line: 234, column: 11, scope: !497)
!503 = !DILocation(line: 234, column: 3, scope: !497)
!504 = !DILocation(line: 236, column: 14, scope: !467)
!505 = !DILocation(line: 236, column: 6, scope: !467)
!506 = !DILocation(line: 236, column: 4, scope: !467)
!507 = !DILocation(line: 238, column: 6, scope: !478)
!508 = !DILocation(line: 238, column: 8, scope: !478)
!509 = !DILocation(line: 238, column: 6, scope: !467)
!510 = !DILocation(line: 239, column: 3, scope: !477)
!511 = !DILocation(line: 239, column: 10, scope: !477)
!512 = !DILocation(line: 239, column: 22, scope: !477)
!513 = !DILocation(line: 239, column: 26, scope: !477)
!514 = !DILocation(line: 239, column: 24, scope: !477)
!515 = !DILocation(line: 239, column: 31, scope: !477)
!516 = !DILocation(line: 240, column: 8, scope: !517)
!517 = distinct !DILexicalBlock(scope: !477, file: !2, line: 240, column: 7)
!518 = !DILocation(line: 240, column: 27, scope: !517)
!519 = !DILocation(line: 240, column: 20, scope: !517)
!520 = !DILocation(line: 240, column: 18, scope: !517)
!521 = !DILocation(line: 240, column: 36, scope: !517)
!522 = !DILocation(line: 240, column: 43, scope: !517)
!523 = !DILocation(line: 240, column: 41, scope: !517)
!524 = !DILocation(line: 240, column: 7, scope: !477)
!525 = !DILocation(line: 241, column: 4, scope: !517)
!526 = !DILocation(line: 244, column: 11, scope: !477)
!527 = !DILocation(line: 244, column: 16, scope: !477)
!528 = !DILocation(line: 244, column: 22, scope: !477)
!529 = !DILocation(line: 244, column: 3, scope: !477)
!530 = !DILocation(line: 245, column: 11, scope: !477)
!531 = !DILocation(line: 245, column: 16, scope: !477)
!532 = !DILocation(line: 245, column: 25, scope: !477)
!533 = !DILocation(line: 245, column: 3, scope: !477)
!534 = !DILocation(line: 246, column: 2, scope: !478)
!535 = !DILocation(line: 246, column: 2, scope: !477)
!536 = !DILocation(line: 247, column: 15, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !2, line: 247, column: 7)
!538 = distinct !DILexicalBlock(scope: !478, file: !2, line: 246, column: 9)
!539 = !DILocation(line: 247, column: 8, scope: !537)
!540 = !DILocation(line: 247, column: 24, scope: !537)
!541 = !DILocation(line: 247, column: 31, scope: !537)
!542 = !DILocation(line: 247, column: 29, scope: !537)
!543 = !DILocation(line: 247, column: 7, scope: !538)
!544 = !DILocation(line: 248, column: 4, scope: !537)
!545 = !DILocation(line: 250, column: 11, scope: !538)
!546 = !DILocation(line: 250, column: 16, scope: !538)
!547 = !DILocation(line: 250, column: 25, scope: !538)
!548 = !DILocation(line: 250, column: 3, scope: !538)
!549 = !DILocation(line: 253, column: 2, scope: !467)
!550 = !DILocation(line: 254, column: 1, scope: !467)
!551 = !DISubprogram(name: "strrchr", scope: !552, file: !552, line: 273, type: !553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!552 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!553 = !DISubroutineType(types: !554)
!554 = !{!454, !215, !66}
!555 = !DISubprogram(name: "strlen", scope: !552, file: !552, line: 407, type: !556, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!556 = !DISubroutineType(types: !557)
!557 = !{!72, !215}
!558 = !DISubprogram(name: "strlcpy", scope: !559, file: !559, line: 25, type: !560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!559 = !DIFile(filename: "../include/isc/string.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/isc/unix", checksumkind: CSK_MD5, checksum: "f245dcbdceb547553a76113e9d71cd5e")
!560 = !DISubroutineType(types: !561)
!561 = !{!72, !454, !215, !70}
!562 = !DISubprogram(name: "strlcat", scope: !559, file: !559, line: 30, type: !560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!563 = distinct !DISubprogram(name: "isc_file_renameunique", scope: !2, file: !2, line: 260, type: !564, scopeLine: 260, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !566)
!564 = !DISubroutineType(types: !565)
!565 = !{!146, !215, !454}
!566 = !{!567, !568, !569, !570, !571}
!567 = !DILocalVariable(name: "file", arg: 1, scope: !563, file: !2, line: 260, type: !215)
!568 = !DILocalVariable(name: "templet", arg: 2, scope: !563, file: !2, line: 260, type: !454)
!569 = !DILocalVariable(name: "x", scope: !563, file: !2, line: 261, type: !454)
!570 = !DILocalVariable(name: "cp", scope: !563, file: !2, line: 262, type: !454)
!571 = !DILocalVariable(name: "t", scope: !572, file: !2, line: 282, type: !215)
!572 = distinct !DILexicalBlock(scope: !573, file: !2, line: 281, column: 18)
!573 = distinct !DILexicalBlock(scope: !574, file: !2, line: 281, column: 3)
!574 = distinct !DILexicalBlock(scope: !575, file: !2, line: 281, column: 3)
!575 = distinct !DILexicalBlock(scope: !563, file: !2, line: 278, column: 36)
!576 = !DILocation(line: 260, column: 35, scope: !563)
!577 = !DILocation(line: 260, column: 47, scope: !563)
!578 = !DILocation(line: 261, column: 2, scope: !563)
!579 = !DILocation(line: 261, column: 8, scope: !563)
!580 = !DILocation(line: 262, column: 2, scope: !563)
!581 = !DILocation(line: 262, column: 8, scope: !563)
!582 = !DILocation(line: 264, column: 2, scope: !563)
!583 = !DILocation(line: 265, column: 2, scope: !563)
!584 = !DILocation(line: 267, column: 7, scope: !563)
!585 = !DILocation(line: 267, column: 5, scope: !563)
!586 = !DILocation(line: 268, column: 2, scope: !563)
!587 = !DILocation(line: 268, column: 10, scope: !563)
!588 = !DILocation(line: 268, column: 9, scope: !563)
!589 = !DILocation(line: 268, column: 13, scope: !563)
!590 = !DILocation(line: 269, column: 5, scope: !563)
!591 = distinct !{!591, !586, !590, !592}
!592 = !{!"llvm.loop.mustprogress"}
!593 = !DILocation(line: 270, column: 6, scope: !594)
!594 = distinct !DILexicalBlock(scope: !563, file: !2, line: 270, column: 6)
!595 = !DILocation(line: 270, column: 12, scope: !594)
!596 = !DILocation(line: 270, column: 9, scope: !594)
!597 = !DILocation(line: 270, column: 6, scope: !563)
!598 = !DILocation(line: 271, column: 3, scope: !594)
!599 = !DILocation(line: 273, column: 8, scope: !563)
!600 = !DILocation(line: 273, column: 4, scope: !563)
!601 = !DILocation(line: 274, column: 2, scope: !563)
!602 = !DILocation(line: 274, column: 9, scope: !563)
!603 = !DILocation(line: 274, column: 15, scope: !563)
!604 = !DILocation(line: 274, column: 12, scope: !563)
!605 = !DILocation(line: 274, column: 23, scope: !563)
!606 = !DILocation(line: 274, column: 27, scope: !563)
!607 = !DILocation(line: 274, column: 26, scope: !563)
!608 = !DILocation(line: 274, column: 30, scope: !563)
!609 = !DILocation(line: 0, scope: !563)
!610 = !DILocation(line: 275, column: 17, scope: !611)
!611 = distinct !DILexicalBlock(scope: !563, file: !2, line: 274, column: 38)
!612 = !DILocation(line: 275, column: 9, scope: !611)
!613 = !DILocation(line: 275, column: 4, scope: !611)
!614 = !DILocation(line: 275, column: 7, scope: !611)
!615 = !DILocation(line: 276, column: 9, scope: !611)
!616 = !DILocation(line: 276, column: 5, scope: !611)
!617 = distinct !{!617, !601, !618, !592}
!618 = !DILocation(line: 277, column: 2, scope: !563)
!619 = !DILocation(line: 278, column: 2, scope: !563)
!620 = !DILocation(line: 278, column: 14, scope: !563)
!621 = !DILocation(line: 278, column: 20, scope: !563)
!622 = !DILocation(line: 278, column: 9, scope: !563)
!623 = !DILocation(line: 278, column: 29, scope: !563)
!624 = !DILocation(line: 279, column: 7, scope: !625)
!625 = distinct !DILexicalBlock(scope: !575, file: !2, line: 279, column: 7)
!626 = !DILocation(line: 279, column: 13, scope: !625)
!627 = !DILocation(line: 279, column: 7, scope: !575)
!628 = !DILocation(line: 280, column: 12, scope: !625)
!629 = !DILocation(line: 280, column: 4, scope: !625)
!630 = !DILocation(line: 281, column: 13, scope: !574)
!631 = !DILocation(line: 281, column: 11, scope: !574)
!632 = !DILocation(line: 281, column: 8, scope: !574)
!633 = !DILocation(line: 282, column: 4, scope: !572)
!634 = !DILocation(line: 282, column: 16, scope: !572)
!635 = !DILocation(line: 283, column: 9, scope: !636)
!636 = distinct !DILexicalBlock(scope: !572, file: !2, line: 283, column: 8)
!637 = !DILocation(line: 283, column: 8, scope: !636)
!638 = !DILocation(line: 283, column: 12, scope: !636)
!639 = !DILocation(line: 283, column: 8, scope: !572)
!640 = !DILocation(line: 284, column: 5, scope: !636)
!641 = !DILocation(line: 285, column: 25, scope: !572)
!642 = !DILocation(line: 285, column: 24, scope: !572)
!643 = !DILocation(line: 285, column: 8, scope: !572)
!644 = !DILocation(line: 285, column: 6, scope: !572)
!645 = !DILocation(line: 286, column: 8, scope: !646)
!646 = distinct !DILexicalBlock(scope: !572, file: !2, line: 286, column: 8)
!647 = !DILocation(line: 286, column: 10, scope: !646)
!648 = !DILocation(line: 286, column: 18, scope: !646)
!649 = !DILocation(line: 286, column: 22, scope: !646)
!650 = !DILocation(line: 286, column: 21, scope: !646)
!651 = !DILocation(line: 286, column: 26, scope: !646)
!652 = !DILocation(line: 286, column: 8, scope: !572)
!653 = !DILocation(line: 287, column: 13, scope: !646)
!654 = !DILocation(line: 287, column: 8, scope: !646)
!655 = !DILocation(line: 287, column: 11, scope: !646)
!656 = !DILocation(line: 287, column: 5, scope: !646)
!657 = !DILocation(line: 289, column: 12, scope: !658)
!658 = distinct !DILexicalBlock(scope: !646, file: !2, line: 288, column: 9)
!659 = !DILocation(line: 289, column: 11, scope: !658)
!660 = !DILocation(line: 289, column: 6, scope: !658)
!661 = !DILocation(line: 289, column: 9, scope: !658)
!662 = !DILocation(line: 290, column: 5, scope: !658)
!663 = !DILocation(line: 292, column: 3, scope: !573)
!664 = !DILocation(line: 281, column: 3, scope: !573)
!665 = distinct !{!665, !666, !667}
!666 = !DILocation(line: 281, column: 3, scope: !574)
!667 = !DILocation(line: 292, column: 3, scope: !574)
!668 = distinct !{!668, !619, !669, !592}
!669 = !DILocation(line: 293, column: 2, scope: !563)
!670 = !DILocation(line: 294, column: 13, scope: !671)
!671 = distinct !DILexicalBlock(scope: !563, file: !2, line: 294, column: 6)
!672 = !DILocation(line: 294, column: 6, scope: !671)
!673 = !DILocation(line: 294, column: 19, scope: !671)
!674 = !DILocation(line: 294, column: 6, scope: !563)
!675 = !DILocation(line: 295, column: 7, scope: !676)
!676 = distinct !DILexicalBlock(scope: !671, file: !2, line: 295, column: 7)
!677 = !DILocation(line: 295, column: 13, scope: !676)
!678 = !DILocation(line: 295, column: 7, scope: !671)
!679 = !DILocation(line: 296, column: 12, scope: !676)
!680 = !DILocation(line: 296, column: 4, scope: !676)
!681 = !DILocation(line: 295, column: 16, scope: !676)
!682 = !DILocation(line: 297, column: 2, scope: !563)
!683 = !DILocation(line: 298, column: 1, scope: !563)
!684 = !DISubprogram(name: "isc_random_uniform", scope: !685, file: !685, line: 53, type: !686, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!685 = !DIFile(filename: "../include/isc/random.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/isc/unix", checksumkind: CSK_MD5, checksum: "edf29be04d446fd54280a24722b64007")
!686 = !DISubroutineType(types: !687)
!687 = !{!429, !429}
!688 = !DISubprogram(name: "link", scope: !689, file: !689, line: 819, type: !690, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!689 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!690 = !DISubroutineType(types: !691)
!691 = !{!66, !215, !215}
!692 = !DISubprogram(name: "strchr", scope: !552, file: !552, line: 246, type: !553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!693 = !DISubprogram(name: "unlink", scope: !689, file: !689, line: 858, type: !694, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!694 = !DISubroutineType(types: !695)
!695 = !{!66, !215}
!696 = distinct !DISubprogram(name: "isc_file_openunique", scope: !2, file: !2, line: 301, type: !697, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !749)
!697 = !DISubroutineType(types: !698)
!698 = !{!146, !454, !699}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !702, line: 7, baseType: !703)
!702 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !704, line: 49, size: 1728, elements: !705)
!704 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !721, !723, !724, !725, !726, !728, !730, !732, !735, !737, !740, !743, !744, !745, !746, !747}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !703, file: !704, line: 51, baseType: !66, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !703, file: !704, line: 54, baseType: !454, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !703, file: !704, line: 55, baseType: !454, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !703, file: !704, line: 56, baseType: !454, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !703, file: !704, line: 57, baseType: !454, size: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !703, file: !704, line: 58, baseType: !454, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !703, file: !704, line: 59, baseType: !454, size: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !703, file: !704, line: 60, baseType: !454, size: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !703, file: !704, line: 61, baseType: !454, size: 64, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !703, file: !704, line: 64, baseType: !454, size: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !703, file: !704, line: 65, baseType: !454, size: 64, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !703, file: !704, line: 66, baseType: !454, size: 64, offset: 704)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !703, file: !704, line: 68, baseType: !719, size: 64, offset: 768)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !704, line: 36, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !703, file: !704, line: 70, baseType: !722, size: 64, offset: 832)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !703, file: !704, line: 72, baseType: !66, size: 32, offset: 896)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !703, file: !704, line: 73, baseType: !66, size: 32, offset: 928)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !703, file: !704, line: 74, baseType: !151, size: 64, offset: 960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !703, file: !704, line: 77, baseType: !727, size: 16, offset: 1024)
!727 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !703, file: !704, line: 78, baseType: !729, size: 8, offset: 1040)
!729 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !703, file: !704, line: 79, baseType: !731, size: 8, offset: 1048)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !45)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !703, file: !704, line: 81, baseType: !733, size: 64, offset: 1088)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !704, line: 43, baseType: null)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !703, file: !704, line: 89, baseType: !736, size: 64, offset: 1152)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !65, line: 153, baseType: !61)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !703, file: !704, line: 91, baseType: !738, size: 64, offset: 1216)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !704, line: 37, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !703, file: !704, line: 92, baseType: !741, size: 64, offset: 1280)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !704, line: 38, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !703, file: !704, line: 93, baseType: !722, size: 64, offset: 1344)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !703, file: !704, line: 94, baseType: !60, size: 64, offset: 1408)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !703, file: !704, line: 95, baseType: !70, size: 64, offset: 1472)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !703, file: !704, line: 96, baseType: !66, size: 32, offset: 1536)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !703, file: !704, line: 98, baseType: !748, size: 160, offset: 1568)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !16)
!749 = !{!750, !751, !752}
!750 = !DILocalVariable(name: "templet", arg: 1, scope: !696, file: !2, line: 301, type: !454)
!751 = !DILocalVariable(name: "fp", arg: 2, scope: !696, file: !2, line: 301, type: !699)
!752 = !DILocalVariable(name: "mode", scope: !696, file: !2, line: 302, type: !66)
!753 = !DILocation(line: 301, column: 27, scope: !696)
!754 = !DILocation(line: 301, column: 43, scope: !696)
!755 = !DILocation(line: 302, column: 2, scope: !696)
!756 = !DILocation(line: 302, column: 6, scope: !696)
!757 = !DILocation(line: 303, column: 34, scope: !696)
!758 = !DILocation(line: 303, column: 43, scope: !696)
!759 = !DILocation(line: 303, column: 49, scope: !696)
!760 = !DILocation(line: 303, column: 10, scope: !696)
!761 = !DILocation(line: 304, column: 1, scope: !696)
!762 = !DILocation(line: 303, column: 2, scope: !696)
!763 = distinct !DISubprogram(name: "isc_file_openuniquemode", scope: !2, file: !2, line: 313, type: !764, scopeLine: 313, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{!146, !454, !66, !699}
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775}
!767 = !DILocalVariable(name: "templet", arg: 1, scope: !763, file: !2, line: 313, type: !454)
!768 = !DILocalVariable(name: "mode", arg: 2, scope: !763, file: !2, line: 313, type: !66)
!769 = !DILocalVariable(name: "fp", arg: 3, scope: !763, file: !2, line: 313, type: !699)
!770 = !DILocalVariable(name: "fd", scope: !763, file: !2, line: 314, type: !66)
!771 = !DILocalVariable(name: "f", scope: !763, file: !2, line: 315, type: !700)
!772 = !DILocalVariable(name: "result", scope: !763, file: !2, line: 316, type: !146)
!773 = !DILocalVariable(name: "x", scope: !763, file: !2, line: 317, type: !454)
!774 = !DILocalVariable(name: "cp", scope: !763, file: !2, line: 318, type: !454)
!775 = !DILocalVariable(name: "t", scope: !776, file: !2, line: 340, type: !454)
!776 = distinct !DILexicalBlock(scope: !777, file: !2, line: 339, column: 18)
!777 = distinct !DILexicalBlock(scope: !778, file: !2, line: 339, column: 3)
!778 = distinct !DILexicalBlock(scope: !779, file: !2, line: 339, column: 3)
!779 = distinct !DILexicalBlock(scope: !763, file: !2, line: 336, column: 66)
!780 = !DILocation(line: 313, column: 31, scope: !763)
!781 = !DILocation(line: 313, column: 44, scope: !763)
!782 = !DILocation(line: 313, column: 57, scope: !763)
!783 = !DILocation(line: 314, column: 2, scope: !763)
!784 = !DILocation(line: 314, column: 6, scope: !763)
!785 = !DILocation(line: 315, column: 2, scope: !763)
!786 = !DILocation(line: 315, column: 8, scope: !763)
!787 = !DILocation(line: 316, column: 2, scope: !763)
!788 = !DILocation(line: 316, column: 15, scope: !763)
!789 = !DILocation(line: 317, column: 2, scope: !763)
!790 = !DILocation(line: 317, column: 8, scope: !763)
!791 = !DILocation(line: 318, column: 2, scope: !763)
!792 = !DILocation(line: 318, column: 8, scope: !763)
!793 = !DILocation(line: 320, column: 2, scope: !763)
!794 = !DILocation(line: 321, column: 2, scope: !763)
!795 = !DILocation(line: 0, scope: !763)
!796 = !DILocation(line: 323, column: 7, scope: !763)
!797 = !DILocation(line: 323, column: 5, scope: !763)
!798 = !DILocation(line: 324, column: 2, scope: !763)
!799 = !DILocation(line: 324, column: 10, scope: !763)
!800 = !DILocation(line: 324, column: 9, scope: !763)
!801 = !DILocation(line: 324, column: 13, scope: !763)
!802 = !DILocation(line: 325, column: 5, scope: !763)
!803 = distinct !{!803, !798, !802, !592}
!804 = !DILocation(line: 326, column: 6, scope: !805)
!805 = distinct !DILexicalBlock(scope: !763, file: !2, line: 326, column: 6)
!806 = !DILocation(line: 326, column: 12, scope: !805)
!807 = !DILocation(line: 326, column: 9, scope: !805)
!808 = !DILocation(line: 326, column: 6, scope: !763)
!809 = !DILocation(line: 327, column: 3, scope: !805)
!810 = !DILocation(line: 329, column: 8, scope: !763)
!811 = !DILocation(line: 329, column: 4, scope: !763)
!812 = !DILocation(line: 330, column: 2, scope: !763)
!813 = !DILocation(line: 330, column: 9, scope: !763)
!814 = !DILocation(line: 330, column: 15, scope: !763)
!815 = !DILocation(line: 330, column: 12, scope: !763)
!816 = !DILocation(line: 330, column: 23, scope: !763)
!817 = !DILocation(line: 330, column: 27, scope: !763)
!818 = !DILocation(line: 330, column: 26, scope: !763)
!819 = !DILocation(line: 330, column: 30, scope: !763)
!820 = !DILocation(line: 331, column: 17, scope: !821)
!821 = distinct !DILexicalBlock(scope: !763, file: !2, line: 330, column: 38)
!822 = !DILocation(line: 331, column: 9, scope: !821)
!823 = !DILocation(line: 331, column: 4, scope: !821)
!824 = !DILocation(line: 331, column: 7, scope: !821)
!825 = !DILocation(line: 332, column: 9, scope: !821)
!826 = !DILocation(line: 332, column: 5, scope: !821)
!827 = distinct !{!827, !812, !828, !592}
!828 = !DILocation(line: 333, column: 2, scope: !763)
!829 = !DILocation(line: 336, column: 2, scope: !763)
!830 = !DILocation(line: 336, column: 20, scope: !763)
!831 = !DILocation(line: 336, column: 52, scope: !763)
!832 = !DILocation(line: 336, column: 15, scope: !763)
!833 = !DILocation(line: 336, column: 13, scope: !763)
!834 = !DILocation(line: 336, column: 59, scope: !763)
!835 = !DILocation(line: 337, column: 7, scope: !836)
!836 = distinct !DILexicalBlock(scope: !779, file: !2, line: 337, column: 7)
!837 = !DILocation(line: 337, column: 13, scope: !836)
!838 = !DILocation(line: 337, column: 7, scope: !779)
!839 = !DILocation(line: 338, column: 12, scope: !836)
!840 = !DILocation(line: 338, column: 4, scope: !836)
!841 = !DILocation(line: 339, column: 13, scope: !778)
!842 = !DILocation(line: 339, column: 11, scope: !778)
!843 = !DILocation(line: 339, column: 8, scope: !778)
!844 = !DILocation(line: 340, column: 4, scope: !776)
!845 = !DILocation(line: 340, column: 10, scope: !776)
!846 = !DILocation(line: 341, column: 9, scope: !847)
!847 = distinct !DILexicalBlock(scope: !776, file: !2, line: 341, column: 8)
!848 = !DILocation(line: 341, column: 8, scope: !847)
!849 = !DILocation(line: 341, column: 12, scope: !847)
!850 = !DILocation(line: 341, column: 8, scope: !776)
!851 = !DILocation(line: 342, column: 5, scope: !847)
!852 = !DILocation(line: 343, column: 25, scope: !776)
!853 = !DILocation(line: 343, column: 24, scope: !776)
!854 = !DILocation(line: 343, column: 8, scope: !776)
!855 = !DILocation(line: 343, column: 6, scope: !776)
!856 = !DILocation(line: 344, column: 8, scope: !857)
!857 = distinct !DILexicalBlock(scope: !776, file: !2, line: 344, column: 8)
!858 = !DILocation(line: 344, column: 10, scope: !857)
!859 = !DILocation(line: 344, column: 18, scope: !857)
!860 = !DILocation(line: 344, column: 22, scope: !857)
!861 = !DILocation(line: 344, column: 21, scope: !857)
!862 = !DILocation(line: 344, column: 26, scope: !857)
!863 = !DILocation(line: 344, column: 8, scope: !776)
!864 = !DILocation(line: 345, column: 13, scope: !857)
!865 = !DILocation(line: 345, column: 8, scope: !857)
!866 = !DILocation(line: 345, column: 11, scope: !857)
!867 = !DILocation(line: 345, column: 5, scope: !857)
!868 = !DILocation(line: 347, column: 12, scope: !869)
!869 = distinct !DILexicalBlock(scope: !857, file: !2, line: 346, column: 9)
!870 = !DILocation(line: 347, column: 11, scope: !869)
!871 = !DILocation(line: 347, column: 6, scope: !869)
!872 = !DILocation(line: 347, column: 9, scope: !869)
!873 = !DILocation(line: 348, column: 5, scope: !869)
!874 = !DILocation(line: 350, column: 3, scope: !777)
!875 = !DILocation(line: 339, column: 3, scope: !777)
!876 = distinct !{!876, !877, !878}
!877 = !DILocation(line: 339, column: 3, scope: !778)
!878 = !DILocation(line: 350, column: 3, scope: !778)
!879 = distinct !{!879, !829, !880, !592}
!880 = !DILocation(line: 351, column: 2, scope: !763)
!881 = !DILocation(line: 352, column: 13, scope: !763)
!882 = !DILocation(line: 352, column: 6, scope: !763)
!883 = !DILocation(line: 352, column: 4, scope: !763)
!884 = !DILocation(line: 353, column: 6, scope: !885)
!885 = distinct !DILexicalBlock(scope: !763, file: !2, line: 353, column: 6)
!886 = !DILocation(line: 353, column: 8, scope: !885)
!887 = !DILocation(line: 353, column: 6, scope: !763)
!888 = !DILocation(line: 354, column: 12, scope: !889)
!889 = distinct !DILexicalBlock(scope: !885, file: !2, line: 353, column: 17)
!890 = !DILocation(line: 354, column: 10, scope: !889)
!891 = !DILocation(line: 355, column: 14, scope: !892)
!892 = distinct !DILexicalBlock(scope: !889, file: !2, line: 355, column: 7)
!893 = !DILocation(line: 355, column: 7, scope: !892)
!894 = !DILocation(line: 355, column: 23, scope: !892)
!895 = !DILocation(line: 355, column: 7, scope: !889)
!896 = !DILocation(line: 356, column: 18, scope: !897)
!897 = distinct !DILexicalBlock(scope: !892, file: !2, line: 355, column: 28)
!898 = !DILocation(line: 358, column: 34, scope: !897)
!899 = !DILocation(line: 356, column: 4, scope: !897)
!900 = !DILocation(line: 359, column: 3, scope: !897)
!901 = !DILocation(line: 360, column: 15, scope: !889)
!902 = !DILocation(line: 360, column: 9, scope: !889)
!903 = !DILocation(line: 361, column: 2, scope: !889)
!904 = !DILocation(line: 362, column: 9, scope: !885)
!905 = !DILocation(line: 362, column: 4, scope: !885)
!906 = !DILocation(line: 362, column: 7, scope: !885)
!907 = !DILocation(line: 364, column: 10, scope: !763)
!908 = !DILocation(line: 364, column: 2, scope: !763)
!909 = !DILocation(line: 365, column: 1, scope: !763)
!910 = distinct !DISubprogram(name: "isc_file_openuniqueprivate", scope: !2, file: !2, line: 307, type: !697, scopeLine: 307, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !911)
!911 = !{!912, !913, !914}
!912 = !DILocalVariable(name: "templet", arg: 1, scope: !910, file: !2, line: 307, type: !454)
!913 = !DILocalVariable(name: "fp", arg: 2, scope: !910, file: !2, line: 307, type: !699)
!914 = !DILocalVariable(name: "mode", scope: !910, file: !2, line: 308, type: !66)
!915 = !DILocation(line: 307, column: 34, scope: !910)
!916 = !DILocation(line: 307, column: 50, scope: !910)
!917 = !DILocation(line: 308, column: 2, scope: !910)
!918 = !DILocation(line: 308, column: 6, scope: !910)
!919 = !DILocation(line: 309, column: 34, scope: !910)
!920 = !DILocation(line: 309, column: 43, scope: !910)
!921 = !DILocation(line: 309, column: 49, scope: !910)
!922 = !DILocation(line: 309, column: 10, scope: !910)
!923 = !DILocation(line: 310, column: 1, scope: !910)
!924 = !DILocation(line: 309, column: 2, scope: !910)
!925 = !DISubprogram(name: "open", scope: !150, file: !150, line: 181, type: !926, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!926 = !DISubroutineType(types: !927)
!927 = !{!66, !215, !66, null}
!928 = !DISubprogram(name: "fdopen", scope: !929, file: !929, line: 293, type: !930, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!929 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!930 = !DISubroutineType(types: !931)
!931 = !{!700, !66, !215}
!932 = !DISubprogram(name: "remove", scope: !929, file: !929, line: 152, type: !694, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!933 = !DISubprogram(name: "isc_log_write", scope: !934, file: !934, line: 576, type: !935, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!934 = !DIFile(filename: "../include/isc/log.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/isc/unix", checksumkind: CSK_MD5, checksum: "6c5d6bf932d34a38240a36d83b90e60a")
!935 = !DISubroutineType(types: !936)
!936 = !{null, !937, !940, !946, !66, !215, null}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_log_t", file: !147, line: 55, baseType: !939)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_log", file: !147, line: 55, flags: DIFlagFwdDecl)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_logcategory_t", file: !147, line: 56, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_logcategory", file: !934, line: 104, size: 128, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !934, line: 105, baseType: !215, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !942, file: !934, line: 106, baseType: !53, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_logmodule_t", file: !147, line: 58, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_logmodule", file: !934, line: 112, size: 128, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !948, file: !934, line: 113, baseType: !215, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !948, file: !934, line: 114, baseType: !53, size: 32, offset: 64)
!952 = !DISubprogram(name: "close", scope: !689, file: !689, line: 358, type: !953, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!953 = !DISubroutineType(types: !954)
!954 = !{!66, !66}
!955 = distinct !DISubprogram(name: "isc_file_bopenunique", scope: !2, file: !2, line: 368, type: !697, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !956)
!956 = !{!957, !958, !959}
!957 = !DILocalVariable(name: "templet", arg: 1, scope: !955, file: !2, line: 368, type: !454)
!958 = !DILocalVariable(name: "fp", arg: 2, scope: !955, file: !2, line: 368, type: !699)
!959 = !DILocalVariable(name: "mode", scope: !955, file: !2, line: 369, type: !66)
!960 = !DILocation(line: 368, column: 28, scope: !955)
!961 = !DILocation(line: 368, column: 44, scope: !955)
!962 = !DILocation(line: 369, column: 2, scope: !955)
!963 = !DILocation(line: 369, column: 6, scope: !955)
!964 = !DILocation(line: 370, column: 34, scope: !955)
!965 = !DILocation(line: 370, column: 43, scope: !955)
!966 = !DILocation(line: 370, column: 49, scope: !955)
!967 = !DILocation(line: 370, column: 10, scope: !955)
!968 = !DILocation(line: 371, column: 1, scope: !955)
!969 = !DILocation(line: 370, column: 2, scope: !955)
!970 = distinct !DISubprogram(name: "isc_file_bopenuniqueprivate", scope: !2, file: !2, line: 374, type: !697, scopeLine: 374, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !971)
!971 = !{!972, !973, !974}
!972 = !DILocalVariable(name: "templet", arg: 1, scope: !970, file: !2, line: 374, type: !454)
!973 = !DILocalVariable(name: "fp", arg: 2, scope: !970, file: !2, line: 374, type: !699)
!974 = !DILocalVariable(name: "mode", scope: !970, file: !2, line: 375, type: !66)
!975 = !DILocation(line: 374, column: 35, scope: !970)
!976 = !DILocation(line: 374, column: 51, scope: !970)
!977 = !DILocation(line: 375, column: 2, scope: !970)
!978 = !DILocation(line: 375, column: 6, scope: !970)
!979 = !DILocation(line: 376, column: 34, scope: !970)
!980 = !DILocation(line: 376, column: 43, scope: !970)
!981 = !DILocation(line: 376, column: 49, scope: !970)
!982 = !DILocation(line: 376, column: 10, scope: !970)
!983 = !DILocation(line: 377, column: 1, scope: !970)
!984 = !DILocation(line: 376, column: 2, scope: !970)
!985 = distinct !DISubprogram(name: "isc_file_bopenuniquemode", scope: !2, file: !2, line: 380, type: !764, scopeLine: 380, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !986)
!986 = !{!987, !988, !989}
!987 = !DILocalVariable(name: "templet", arg: 1, scope: !985, file: !2, line: 380, type: !454)
!988 = !DILocalVariable(name: "mode", arg: 2, scope: !985, file: !2, line: 380, type: !66)
!989 = !DILocalVariable(name: "fp", arg: 3, scope: !985, file: !2, line: 380, type: !699)
!990 = !DILocation(line: 380, column: 32, scope: !985)
!991 = !DILocation(line: 380, column: 45, scope: !985)
!992 = !DILocation(line: 380, column: 58, scope: !985)
!993 = !DILocation(line: 381, column: 34, scope: !985)
!994 = !DILocation(line: 381, column: 43, scope: !985)
!995 = !DILocation(line: 381, column: 49, scope: !985)
!996 = !DILocation(line: 381, column: 10, scope: !985)
!997 = !DILocation(line: 381, column: 2, scope: !985)
!998 = distinct !DISubprogram(name: "isc_file_remove", scope: !2, file: !2, line: 385, type: !999, scopeLine: 385, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1001)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!146, !215}
!1001 = !{!1002, !1003}
!1002 = !DILocalVariable(name: "filename", arg: 1, scope: !998, file: !2, line: 385, type: !215)
!1003 = !DILocalVariable(name: "r", scope: !998, file: !2, line: 386, type: !66)
!1004 = !DILocation(line: 385, column: 29, scope: !998)
!1005 = !DILocation(line: 386, column: 2, scope: !998)
!1006 = !DILocation(line: 386, column: 6, scope: !998)
!1007 = !DILocation(line: 388, column: 2, scope: !998)
!1008 = !DILocation(line: 390, column: 13, scope: !998)
!1009 = !DILocation(line: 390, column: 6, scope: !998)
!1010 = !DILocation(line: 390, column: 4, scope: !998)
!1011 = !DILocation(line: 391, column: 6, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !998, file: !2, line: 391, column: 6)
!1013 = !DILocation(line: 391, column: 8, scope: !1012)
!1014 = !DILocation(line: 391, column: 6, scope: !998)
!1015 = !DILocation(line: 392, column: 3, scope: !1012)
!1016 = !DILocation(line: 394, column: 11, scope: !1012)
!1017 = !DILocation(line: 394, column: 3, scope: !1012)
!1018 = !DILocation(line: 395, column: 1, scope: !998)
!1019 = distinct !DISubprogram(name: "isc_file_rename", scope: !2, file: !2, line: 398, type: !1020, scopeLine: 398, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1022)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!146, !215, !215}
!1022 = !{!1023, !1024, !1025}
!1023 = !DILocalVariable(name: "oldname", arg: 1, scope: !1019, file: !2, line: 398, type: !215)
!1024 = !DILocalVariable(name: "newname", arg: 2, scope: !1019, file: !2, line: 398, type: !215)
!1025 = !DILocalVariable(name: "r", scope: !1019, file: !2, line: 399, type: !66)
!1026 = !DILocation(line: 398, column: 29, scope: !1019)
!1027 = !DILocation(line: 398, column: 50, scope: !1019)
!1028 = !DILocation(line: 399, column: 2, scope: !1019)
!1029 = !DILocation(line: 399, column: 6, scope: !1019)
!1030 = !DILocation(line: 401, column: 2, scope: !1019)
!1031 = !DILocation(line: 402, column: 2, scope: !1019)
!1032 = !DILocation(line: 404, column: 13, scope: !1019)
!1033 = !DILocation(line: 404, column: 22, scope: !1019)
!1034 = !DILocation(line: 404, column: 6, scope: !1019)
!1035 = !DILocation(line: 404, column: 4, scope: !1019)
!1036 = !DILocation(line: 405, column: 6, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1019, file: !2, line: 405, column: 6)
!1038 = !DILocation(line: 405, column: 8, scope: !1037)
!1039 = !DILocation(line: 405, column: 6, scope: !1019)
!1040 = !DILocation(line: 406, column: 3, scope: !1037)
!1041 = !DILocation(line: 408, column: 11, scope: !1037)
!1042 = !DILocation(line: 408, column: 3, scope: !1037)
!1043 = !DILocation(line: 409, column: 1, scope: !1019)
!1044 = !DISubprogram(name: "rename", scope: !929, file: !929, line: 154, type: !690, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1045 = distinct !DISubprogram(name: "isc_file_exists", scope: !2, file: !2, line: 412, type: !1046, scopeLine: 412, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1048)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!445, !215}
!1048 = !{!1049, !1050}
!1049 = !DILocalVariable(name: "pathname", arg: 1, scope: !1045, file: !2, line: 412, type: !215)
!1050 = !DILocalVariable(name: "stats", scope: !1045, file: !2, line: 413, type: !157)
!1051 = !DILocation(line: 412, column: 29, scope: !1045)
!1052 = !DILocation(line: 413, column: 2, scope: !1045)
!1053 = !DILocation(line: 413, column: 14, scope: !1045)
!1054 = !DILocation(line: 415, column: 2, scope: !1045)
!1055 = !DILocation(line: 417, column: 21, scope: !1045)
!1056 = !DILocation(line: 417, column: 10, scope: !1045)
!1057 = !DILocation(line: 417, column: 39, scope: !1045)
!1058 = !DILocation(line: 418, column: 1, scope: !1045)
!1059 = !DILocation(line: 417, column: 2, scope: !1045)
!1060 = distinct !DISubprogram(name: "isc_file_isplainfile", scope: !2, file: !2, line: 421, type: !999, scopeLine: 421, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1061)
!1061 = !{!1062, !1063}
!1062 = !DILocalVariable(name: "filename", arg: 1, scope: !1060, file: !2, line: 421, type: !215)
!1063 = !DILocalVariable(name: "filestat", scope: !1060, file: !2, line: 425, type: !157)
!1064 = !DILocation(line: 421, column: 34, scope: !1060)
!1065 = !DILocation(line: 425, column: 2, scope: !1060)
!1066 = !DILocation(line: 425, column: 14, scope: !1060)
!1067 = !DILocation(line: 426, column: 2, scope: !1060)
!1068 = !DILocation(line: 428, column: 12, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1060, file: !2, line: 428, column: 6)
!1070 = !DILocation(line: 428, column: 7, scope: !1069)
!1071 = !DILocation(line: 428, column: 34, scope: !1069)
!1072 = !DILocation(line: 428, column: 6, scope: !1060)
!1073 = !DILocation(line: 429, column: 10, scope: !1069)
!1074 = !DILocation(line: 429, column: 3, scope: !1069)
!1075 = !DILocation(line: 431, column: 7, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1060, file: !2, line: 431, column: 5)
!1077 = !DILocation(line: 431, column: 5, scope: !1060)
!1078 = !DILocation(line: 432, column: 3, scope: !1076)
!1079 = !DILocation(line: 434, column: 2, scope: !1060)
!1080 = !DILocation(line: 435, column: 1, scope: !1060)
!1081 = !DISubprogram(name: "stat", scope: !1082, file: !1082, line: 205, type: !1083, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1082 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!66, !1085, !1086}
!1085 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !215)
!1086 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !220)
!1087 = distinct !DISubprogram(name: "isc_file_isplainfilefd", scope: !2, file: !2, line: 438, type: !1088, scopeLine: 438, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1090)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!146, !66}
!1090 = !{!1091, !1092}
!1091 = !DILocalVariable(name: "fd", arg: 1, scope: !1087, file: !2, line: 438, type: !66)
!1092 = !DILocalVariable(name: "filestat", scope: !1087, file: !2, line: 442, type: !157)
!1093 = !DILocation(line: 438, column: 28, scope: !1087)
!1094 = !DILocation(line: 442, column: 2, scope: !1087)
!1095 = !DILocation(line: 442, column: 14, scope: !1087)
!1096 = !DILocation(line: 443, column: 2, scope: !1087)
!1097 = !DILocation(line: 445, column: 13, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1087, file: !2, line: 445, column: 6)
!1099 = !DILocation(line: 445, column: 7, scope: !1098)
!1100 = !DILocation(line: 445, column: 29, scope: !1098)
!1101 = !DILocation(line: 445, column: 6, scope: !1087)
!1102 = !DILocation(line: 446, column: 10, scope: !1098)
!1103 = !DILocation(line: 446, column: 3, scope: !1098)
!1104 = !DILocation(line: 448, column: 7, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1087, file: !2, line: 448, column: 5)
!1106 = !DILocation(line: 448, column: 5, scope: !1087)
!1107 = !DILocation(line: 449, column: 3, scope: !1105)
!1108 = !DILocation(line: 451, column: 2, scope: !1087)
!1109 = !DILocation(line: 452, column: 1, scope: !1087)
!1110 = !DISubprogram(name: "fstat", scope: !1082, file: !1082, line: 210, type: !1111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!66, !66, !220}
!1113 = distinct !DISubprogram(name: "isc_file_isdirectory", scope: !2, file: !2, line: 455, type: !999, scopeLine: 455, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1114)
!1114 = !{!1115, !1116}
!1115 = !DILocalVariable(name: "filename", arg: 1, scope: !1113, file: !2, line: 455, type: !215)
!1116 = !DILocalVariable(name: "filestat", scope: !1113, file: !2, line: 460, type: !157)
!1117 = !DILocation(line: 455, column: 34, scope: !1113)
!1118 = !DILocation(line: 460, column: 2, scope: !1113)
!1119 = !DILocation(line: 460, column: 14, scope: !1113)
!1120 = !DILocation(line: 461, column: 2, scope: !1113)
!1121 = !DILocation(line: 463, column: 12, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1113, file: !2, line: 463, column: 6)
!1123 = !DILocation(line: 463, column: 7, scope: !1122)
!1124 = !DILocation(line: 463, column: 34, scope: !1122)
!1125 = !DILocation(line: 463, column: 6, scope: !1113)
!1126 = !DILocation(line: 464, column: 10, scope: !1122)
!1127 = !DILocation(line: 464, column: 3, scope: !1122)
!1128 = !DILocation(line: 466, column: 7, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1113, file: !2, line: 466, column: 5)
!1130 = !DILocation(line: 466, column: 5, scope: !1113)
!1131 = !DILocation(line: 467, column: 3, scope: !1129)
!1132 = !DILocation(line: 469, column: 2, scope: !1113)
!1133 = !DILocation(line: 470, column: 1, scope: !1113)
!1134 = distinct !DISubprogram(name: "isc_file_isabsolute", scope: !2, file: !2, line: 474, type: !1046, scopeLine: 474, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1135)
!1135 = !{!1136}
!1136 = !DILocalVariable(name: "filename", arg: 1, scope: !1134, file: !2, line: 474, type: !215)
!1137 = !DILocation(line: 474, column: 33, scope: !1134)
!1138 = !DILocation(line: 475, column: 2, scope: !1134)
!1139 = !DILocation(line: 476, column: 10, scope: !1134)
!1140 = !DILocation(line: 476, column: 22, scope: !1134)
!1141 = !DILocation(line: 476, column: 2, scope: !1134)
!1142 = distinct !DISubprogram(name: "isc_file_iscurrentdir", scope: !2, file: !2, line: 480, type: !1046, scopeLine: 480, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1143)
!1143 = !{!1144}
!1144 = !DILocalVariable(name: "filename", arg: 1, scope: !1142, file: !2, line: 480, type: !215)
!1145 = !DILocation(line: 480, column: 35, scope: !1142)
!1146 = !DILocation(line: 481, column: 2, scope: !1142)
!1147 = !DILocation(line: 482, column: 10, scope: !1142)
!1148 = !DILocation(line: 482, column: 22, scope: !1142)
!1149 = !DILocation(line: 482, column: 29, scope: !1142)
!1150 = !DILocation(line: 482, column: 32, scope: !1142)
!1151 = !DILocation(line: 482, column: 44, scope: !1142)
!1152 = !DILocation(line: 0, scope: !1142)
!1153 = !DILocation(line: 482, column: 2, scope: !1142)
!1154 = distinct !DISubprogram(name: "isc_file_ischdiridempotent", scope: !2, file: !2, line: 486, type: !1046, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1155)
!1155 = !{!1156}
!1156 = !DILocalVariable(name: "filename", arg: 1, scope: !1154, file: !2, line: 486, type: !215)
!1157 = !DILocation(line: 486, column: 40, scope: !1154)
!1158 = !DILocation(line: 487, column: 2, scope: !1154)
!1159 = !DILocation(line: 488, column: 26, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 488, column: 6)
!1161 = !DILocation(line: 488, column: 6, scope: !1160)
!1162 = !DILocation(line: 488, column: 6, scope: !1154)
!1163 = !DILocation(line: 489, column: 3, scope: !1160)
!1164 = !DILocation(line: 490, column: 28, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 490, column: 6)
!1166 = !DILocation(line: 490, column: 6, scope: !1165)
!1167 = !DILocation(line: 490, column: 6, scope: !1154)
!1168 = !DILocation(line: 491, column: 3, scope: !1165)
!1169 = !DILocation(line: 492, column: 2, scope: !1154)
!1170 = !DILocation(line: 493, column: 1, scope: !1154)
!1171 = distinct !DISubprogram(name: "isc_file_basename", scope: !2, file: !2, line: 496, type: !1172, scopeLine: 496, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1174)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!215, !215}
!1174 = !{!1175, !1176}
!1175 = !DILocalVariable(name: "filename", arg: 1, scope: !1171, file: !2, line: 496, type: !215)
!1176 = !DILocalVariable(name: "s", scope: !1171, file: !2, line: 497, type: !215)
!1177 = !DILocation(line: 496, column: 31, scope: !1171)
!1178 = !DILocation(line: 497, column: 2, scope: !1171)
!1179 = !DILocation(line: 497, column: 14, scope: !1171)
!1180 = !DILocation(line: 499, column: 2, scope: !1171)
!1181 = !DILocation(line: 501, column: 14, scope: !1171)
!1182 = !DILocation(line: 501, column: 6, scope: !1171)
!1183 = !DILocation(line: 501, column: 4, scope: !1171)
!1184 = !DILocation(line: 502, column: 6, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1171, file: !2, line: 502, column: 6)
!1186 = !DILocation(line: 502, column: 8, scope: !1185)
!1187 = !DILocation(line: 502, column: 6, scope: !1171)
!1188 = !DILocation(line: 503, column: 11, scope: !1185)
!1189 = !DILocation(line: 503, column: 3, scope: !1185)
!1190 = !DILocation(line: 505, column: 10, scope: !1171)
!1191 = !DILocation(line: 505, column: 12, scope: !1171)
!1192 = !DILocation(line: 505, column: 2, scope: !1171)
!1193 = !DILocation(line: 506, column: 1, scope: !1171)
!1194 = distinct !DISubprogram(name: "isc_file_progname", scope: !2, file: !2, line: 509, type: !452, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1195)
!1195 = !{!1196, !1197, !1198, !1199, !1200}
!1196 = !DILocalVariable(name: "filename", arg: 1, scope: !1194, file: !2, line: 509, type: !215)
!1197 = !DILocalVariable(name: "buf", arg: 2, scope: !1194, file: !2, line: 509, type: !454)
!1198 = !DILocalVariable(name: "buflen", arg: 3, scope: !1194, file: !2, line: 509, type: !70)
!1199 = !DILocalVariable(name: "base", scope: !1194, file: !2, line: 510, type: !215)
!1200 = !DILocalVariable(name: "len", scope: !1194, file: !2, line: 511, type: !70)
!1201 = !DILocation(line: 509, column: 31, scope: !1194)
!1202 = !DILocation(line: 509, column: 47, scope: !1194)
!1203 = !DILocation(line: 509, column: 59, scope: !1194)
!1204 = !DILocation(line: 510, column: 2, scope: !1194)
!1205 = !DILocation(line: 510, column: 14, scope: !1194)
!1206 = !DILocation(line: 511, column: 2, scope: !1194)
!1207 = !DILocation(line: 511, column: 9, scope: !1194)
!1208 = !DILocation(line: 513, column: 2, scope: !1194)
!1209 = !DILocation(line: 514, column: 2, scope: !1194)
!1210 = !DILocation(line: 516, column: 27, scope: !1194)
!1211 = !DILocation(line: 516, column: 9, scope: !1194)
!1212 = !DILocation(line: 516, column: 7, scope: !1194)
!1213 = !DILocation(line: 517, column: 15, scope: !1194)
!1214 = !DILocation(line: 517, column: 8, scope: !1194)
!1215 = !DILocation(line: 517, column: 21, scope: !1194)
!1216 = !DILocation(line: 517, column: 6, scope: !1194)
!1217 = !DILocation(line: 519, column: 6, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1194, file: !2, line: 519, column: 6)
!1219 = !DILocation(line: 519, column: 12, scope: !1218)
!1220 = !DILocation(line: 519, column: 10, scope: !1218)
!1221 = !DILocation(line: 519, column: 6, scope: !1194)
!1222 = !DILocation(line: 520, column: 3, scope: !1218)
!1223 = !DILocation(line: 521, column: 10, scope: !1194)
!1224 = !DILocation(line: 521, column: 15, scope: !1194)
!1225 = !DILocation(line: 521, column: 21, scope: !1194)
!1226 = !DILocation(line: 521, column: 2, scope: !1194)
!1227 = !DILocation(line: 523, column: 2, scope: !1194)
!1228 = !DILocation(line: 524, column: 1, scope: !1194)
!1229 = distinct !DISubprogram(name: "isc_file_absolutepath", scope: !2, file: !2, line: 560, type: !452, scopeLine: 560, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1230)
!1230 = !{!1231, !1232, !1233, !1234}
!1231 = !DILocalVariable(name: "filename", arg: 1, scope: !1229, file: !2, line: 560, type: !215)
!1232 = !DILocalVariable(name: "path", arg: 2, scope: !1229, file: !2, line: 560, type: !454)
!1233 = !DILocalVariable(name: "pathlen", arg: 3, scope: !1229, file: !2, line: 560, type: !70)
!1234 = !DILocalVariable(name: "result", scope: !1229, file: !2, line: 561, type: !146)
!1235 = !DILocation(line: 560, column: 35, scope: !1229)
!1236 = !DILocation(line: 560, column: 51, scope: !1229)
!1237 = !DILocation(line: 560, column: 64, scope: !1229)
!1238 = !DILocation(line: 561, column: 2, scope: !1229)
!1239 = !DILocation(line: 561, column: 15, scope: !1229)
!1240 = !DILocation(line: 562, column: 23, scope: !1229)
!1241 = !DILocation(line: 562, column: 29, scope: !1229)
!1242 = !DILocation(line: 562, column: 11, scope: !1229)
!1243 = !DILocation(line: 562, column: 9, scope: !1229)
!1244 = !DILocation(line: 563, column: 6, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1229, file: !2, line: 563, column: 6)
!1246 = !DILocation(line: 563, column: 13, scope: !1245)
!1247 = !DILocation(line: 563, column: 6, scope: !1229)
!1248 = !DILocation(line: 564, column: 11, scope: !1245)
!1249 = !DILocation(line: 564, column: 3, scope: !1245)
!1250 = !DILocation(line: 565, column: 13, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1229, file: !2, line: 565, column: 6)
!1252 = !DILocation(line: 565, column: 6, scope: !1251)
!1253 = !DILocation(line: 565, column: 28, scope: !1251)
!1254 = !DILocation(line: 565, column: 21, scope: !1251)
!1255 = !DILocation(line: 565, column: 19, scope: !1251)
!1256 = !DILocation(line: 565, column: 38, scope: !1251)
!1257 = !DILocation(line: 565, column: 44, scope: !1251)
!1258 = !DILocation(line: 565, column: 42, scope: !1251)
!1259 = !DILocation(line: 565, column: 6, scope: !1229)
!1260 = !DILocation(line: 566, column: 3, scope: !1251)
!1261 = !DILocation(line: 567, column: 10, scope: !1229)
!1262 = !DILocation(line: 567, column: 16, scope: !1229)
!1263 = !DILocation(line: 567, column: 26, scope: !1229)
!1264 = !DILocation(line: 567, column: 2, scope: !1229)
!1265 = !DILocation(line: 568, column: 2, scope: !1229)
!1266 = !DILocation(line: 569, column: 1, scope: !1229)
!1267 = distinct !DISubprogram(name: "dir_current", scope: !2, file: !2, line: 533, type: !1268, scopeLine: 533, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1270)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!146, !454, !70}
!1270 = !{!1271, !1272, !1273, !1274}
!1271 = !DILocalVariable(name: "dirname", arg: 1, scope: !1267, file: !2, line: 533, type: !454)
!1272 = !DILocalVariable(name: "length", arg: 2, scope: !1267, file: !2, line: 533, type: !70)
!1273 = !DILocalVariable(name: "cwd", scope: !1267, file: !2, line: 534, type: !454)
!1274 = !DILocalVariable(name: "result", scope: !1267, file: !2, line: 535, type: !146)
!1275 = !DILocation(line: 533, column: 19, scope: !1267)
!1276 = !DILocation(line: 533, column: 35, scope: !1267)
!1277 = !DILocation(line: 534, column: 2, scope: !1267)
!1278 = !DILocation(line: 534, column: 8, scope: !1267)
!1279 = !DILocation(line: 535, column: 2, scope: !1267)
!1280 = !DILocation(line: 535, column: 15, scope: !1267)
!1281 = !DILocation(line: 537, column: 2, scope: !1267)
!1282 = !DILocation(line: 538, column: 2, scope: !1267)
!1283 = !DILocation(line: 540, column: 15, scope: !1267)
!1284 = !DILocation(line: 540, column: 24, scope: !1267)
!1285 = !DILocation(line: 540, column: 8, scope: !1267)
!1286 = !DILocation(line: 540, column: 6, scope: !1267)
!1287 = !DILocation(line: 542, column: 6, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1267, file: !2, line: 542, column: 6)
!1289 = !DILocation(line: 542, column: 10, scope: !1288)
!1290 = !DILocation(line: 542, column: 6, scope: !1267)
!1291 = !DILocation(line: 543, column: 7, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1293, file: !2, line: 543, column: 7)
!1293 = distinct !DILexicalBlock(scope: !1288, file: !2, line: 542, column: 19)
!1294 = !DILocation(line: 543, column: 13, scope: !1292)
!1295 = !DILocation(line: 543, column: 7, scope: !1293)
!1296 = !DILocation(line: 544, column: 11, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1292, file: !2, line: 543, column: 24)
!1298 = !DILocation(line: 545, column: 3, scope: !1297)
!1299 = !DILocation(line: 546, column: 13, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1292, file: !2, line: 545, column: 10)
!1301 = !DILocation(line: 546, column: 11, scope: !1300)
!1302 = !DILocation(line: 548, column: 2, scope: !1293)
!1303 = !DILocation(line: 549, column: 14, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1305, file: !2, line: 549, column: 7)
!1305 = distinct !DILexicalBlock(scope: !1288, file: !2, line: 548, column: 9)
!1306 = !DILocation(line: 549, column: 7, scope: !1304)
!1307 = !DILocation(line: 549, column: 23, scope: !1304)
!1308 = !DILocation(line: 549, column: 30, scope: !1304)
!1309 = !DILocation(line: 549, column: 27, scope: !1304)
!1310 = !DILocation(line: 549, column: 7, scope: !1305)
!1311 = !DILocation(line: 550, column: 11, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1304, file: !2, line: 549, column: 38)
!1313 = !DILocation(line: 551, column: 3, scope: !1312)
!1314 = !DILocation(line: 551, column: 14, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1304, file: !2, line: 551, column: 14)
!1316 = !DILocation(line: 551, column: 25, scope: !1315)
!1317 = !DILocation(line: 551, column: 14, scope: !1304)
!1318 = !DILocation(line: 552, column: 12, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1315, file: !2, line: 551, column: 34)
!1320 = !DILocation(line: 552, column: 26, scope: !1319)
!1321 = !DILocation(line: 552, column: 4, scope: !1319)
!1322 = !DILocation(line: 553, column: 3, scope: !1319)
!1323 = !DILocation(line: 556, column: 10, scope: !1267)
!1324 = !DILocation(line: 557, column: 1, scope: !1267)
!1325 = !DILocation(line: 556, column: 2, scope: !1267)
!1326 = distinct !DISubprogram(name: "isc_file_truncate", scope: !2, file: !2, line: 572, type: !1327, scopeLine: 572, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1331)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!146, !215, !1329}
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_offset_t", file: !1330, line: 24, baseType: !149)
!1330 = !DIFile(filename: "./include/isc/offset.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/isc/unix", checksumkind: CSK_MD5, checksum: "bcf92adabe55bfd4bb2a4ec0fa8b7b63")
!1331 = !{!1332, !1333, !1334}
!1332 = !DILocalVariable(name: "filename", arg: 1, scope: !1326, file: !2, line: 572, type: !215)
!1333 = !DILocalVariable(name: "size", arg: 2, scope: !1326, file: !2, line: 572, type: !1329)
!1334 = !DILocalVariable(name: "result", scope: !1326, file: !2, line: 573, type: !146)
!1335 = !DILocation(line: 572, column: 31, scope: !1326)
!1336 = !DILocation(line: 572, column: 54, scope: !1326)
!1337 = !DILocation(line: 573, column: 2, scope: !1326)
!1338 = !DILocation(line: 573, column: 15, scope: !1326)
!1339 = !DILocation(line: 575, column: 15, scope: !1340)
!1340 = distinct !DILexicalBlock(scope: !1326, file: !2, line: 575, column: 6)
!1341 = !DILocation(line: 575, column: 25, scope: !1340)
!1342 = !DILocation(line: 575, column: 6, scope: !1340)
!1343 = !DILocation(line: 575, column: 31, scope: !1340)
!1344 = !DILocation(line: 575, column: 6, scope: !1326)
!1345 = !DILocation(line: 576, column: 12, scope: !1340)
!1346 = !DILocation(line: 576, column: 10, scope: !1340)
!1347 = !DILocation(line: 576, column: 3, scope: !1340)
!1348 = !DILocation(line: 577, column: 10, scope: !1326)
!1349 = !DILocation(line: 578, column: 1, scope: !1326)
!1350 = !DILocation(line: 577, column: 2, scope: !1326)
!1351 = !DISubprogram(name: "truncate", scope: !689, file: !689, line: 1026, type: !1352, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!66, !215, !151}
!1354 = distinct !DISubprogram(name: "isc_file_safecreate", scope: !2, file: !2, line: 581, type: !1355, scopeLine: 581, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1357)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!146, !215, !699}
!1357 = !{!1358, !1359, !1360, !1361, !1362, !1363, !1364}
!1358 = !DILocalVariable(name: "filename", arg: 1, scope: !1354, file: !2, line: 581, type: !215)
!1359 = !DILocalVariable(name: "fp", arg: 2, scope: !1354, file: !2, line: 581, type: !699)
!1360 = !DILocalVariable(name: "result", scope: !1354, file: !2, line: 582, type: !146)
!1361 = !DILocalVariable(name: "flags", scope: !1354, file: !2, line: 583, type: !66)
!1362 = !DILocalVariable(name: "sb", scope: !1354, file: !2, line: 584, type: !157)
!1363 = !DILocalVariable(name: "f", scope: !1354, file: !2, line: 585, type: !700)
!1364 = !DILocalVariable(name: "fd", scope: !1354, file: !2, line: 586, type: !66)
!1365 = !DILocation(line: 581, column: 33, scope: !1354)
!1366 = !DILocation(line: 581, column: 50, scope: !1354)
!1367 = !DILocation(line: 582, column: 2, scope: !1354)
!1368 = !DILocation(line: 582, column: 15, scope: !1354)
!1369 = !DILocation(line: 583, column: 2, scope: !1354)
!1370 = !DILocation(line: 583, column: 6, scope: !1354)
!1371 = !DILocation(line: 584, column: 2, scope: !1354)
!1372 = !DILocation(line: 584, column: 14, scope: !1354)
!1373 = !DILocation(line: 585, column: 2, scope: !1354)
!1374 = !DILocation(line: 585, column: 8, scope: !1354)
!1375 = !DILocation(line: 586, column: 2, scope: !1354)
!1376 = !DILocation(line: 586, column: 6, scope: !1354)
!1377 = !DILocation(line: 588, column: 2, scope: !1354)
!1378 = !DILocation(line: 589, column: 2, scope: !1354)
!1379 = !DILocation(line: 0, scope: !1354)
!1380 = !DILocation(line: 591, column: 22, scope: !1354)
!1381 = !DILocation(line: 591, column: 11, scope: !1354)
!1382 = !DILocation(line: 591, column: 9, scope: !1354)
!1383 = !DILocation(line: 592, column: 6, scope: !1384)
!1384 = distinct !DILexicalBlock(scope: !1354, file: !2, line: 592, column: 6)
!1385 = !DILocation(line: 592, column: 13, scope: !1384)
!1386 = !DILocation(line: 592, column: 6, scope: !1354)
!1387 = !DILocation(line: 593, column: 11, scope: !1388)
!1388 = distinct !DILexicalBlock(scope: !1389, file: !2, line: 593, column: 7)
!1389 = distinct !DILexicalBlock(scope: !1384, file: !2, line: 592, column: 31)
!1390 = !DILocation(line: 593, column: 19, scope: !1388)
!1391 = !DILocation(line: 593, column: 30, scope: !1388)
!1392 = !DILocation(line: 593, column: 7, scope: !1389)
!1393 = !DILocation(line: 594, column: 4, scope: !1388)
!1394 = !DILocation(line: 595, column: 9, scope: !1389)
!1395 = !DILocation(line: 596, column: 2, scope: !1389)
!1396 = !DILocation(line: 596, column: 13, scope: !1397)
!1397 = distinct !DILexicalBlock(scope: !1384, file: !2, line: 596, column: 13)
!1398 = !DILocation(line: 596, column: 20, scope: !1397)
!1399 = !DILocation(line: 596, column: 13, scope: !1384)
!1400 = !DILocation(line: 597, column: 9, scope: !1401)
!1401 = distinct !DILexicalBlock(scope: !1397, file: !2, line: 596, column: 43)
!1402 = !DILocation(line: 598, column: 2, scope: !1401)
!1403 = !DILocation(line: 599, column: 11, scope: !1397)
!1404 = !DILocation(line: 599, column: 3, scope: !1397)
!1405 = !DILocation(line: 601, column: 12, scope: !1354)
!1406 = !DILocation(line: 601, column: 22, scope: !1354)
!1407 = !DILocation(line: 601, column: 7, scope: !1354)
!1408 = !DILocation(line: 601, column: 5, scope: !1354)
!1409 = !DILocation(line: 602, column: 6, scope: !1410)
!1410 = distinct !DILexicalBlock(scope: !1354, file: !2, line: 602, column: 6)
!1411 = !DILocation(line: 602, column: 9, scope: !1410)
!1412 = !DILocation(line: 602, column: 6, scope: !1354)
!1413 = !DILocation(line: 603, column: 11, scope: !1410)
!1414 = !DILocation(line: 603, column: 3, scope: !1410)
!1415 = !DILocation(line: 605, column: 13, scope: !1354)
!1416 = !DILocation(line: 605, column: 6, scope: !1354)
!1417 = !DILocation(line: 605, column: 4, scope: !1354)
!1418 = !DILocation(line: 606, column: 6, scope: !1419)
!1419 = distinct !DILexicalBlock(scope: !1354, file: !2, line: 606, column: 6)
!1420 = !DILocation(line: 606, column: 8, scope: !1419)
!1421 = !DILocation(line: 606, column: 6, scope: !1354)
!1422 = !DILocation(line: 607, column: 12, scope: !1423)
!1423 = distinct !DILexicalBlock(scope: !1419, file: !2, line: 606, column: 17)
!1424 = !DILocation(line: 607, column: 10, scope: !1423)
!1425 = !DILocation(line: 608, column: 9, scope: !1423)
!1426 = !DILocation(line: 608, column: 3, scope: !1423)
!1427 = !DILocation(line: 609, column: 11, scope: !1423)
!1428 = !DILocation(line: 609, column: 3, scope: !1423)
!1429 = !DILocation(line: 612, column: 8, scope: !1354)
!1430 = !DILocation(line: 612, column: 3, scope: !1354)
!1431 = !DILocation(line: 612, column: 6, scope: !1354)
!1432 = !DILocation(line: 613, column: 2, scope: !1354)
!1433 = !DILocation(line: 614, column: 1, scope: !1354)
!1434 = distinct !DISubprogram(name: "isc_file_splitpath", scope: !2, file: !2, line: 617, type: !1435, scopeLine: 619, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1477)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!146, !1437, !215, !1475, !1476}
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mem_t", file: !147, line: 59, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mem", file: !1440, line: 191, size: 128, elements: !1441)
!1440 = !DIFile(filename: "../include/isc/mem.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/lib/isc/unix", checksumkind: CSK_MD5, checksum: "587a841195795b087519b89f298822b2")
!1441 = !{!1442, !1443, !1444}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !1439, file: !1440, line: 192, baseType: !53, size: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1439, file: !1440, line: 193, baseType: !53, size: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !1439, file: !1440, line: 194, baseType: !1445, size: 64, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_memmethods_t", file: !1440, line: 180, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_memmethods", file: !1440, line: 170, size: 448, elements: !1448)
!1448 = !{!1449, !1453, !1457, !1462, !1463, !1467, !1471}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "memget", scope: !1447, file: !1440, line: 171, baseType: !1450, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{!60, !1437, !70, !215, !53}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "memput", scope: !1447, file: !1440, line: 172, baseType: !1454, size: 64, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{null, !1437, !60, !70, !215, !53}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "memputanddetach", scope: !1447, file: !1440, line: 173, baseType: !1458, size: 64, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{null, !1461, !60, !70, !215, !53}
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "memallocate", scope: !1447, file: !1440, line: 175, baseType: !1450, size: 64, offset: 192)
