; ModuleID = 'samples/831.bc'
source_filename = "rma/rma_send.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ucp_request_param_t = type { i32, i32, ptr, %union.anon.58, i64, ptr, ptr, i32, %union.anon.59, ptr }
%union.anon.58 = type { ptr }
%union.anon.59 = type { ptr }
%struct.ucs_global_opts_t = type { %struct.ucs_log_component_config, ptr, i64, i32, i64, i64, i32, i32, i32, %struct.anon.75, ptr, ptr, ptr, i32, i32, i32, i32, ptr, ptr, ptr, i64, i32, ptr, i64, i32, ptr, i64, %struct.ucs_config_names_array_t, i32, %struct.ucs_config_names_array_t, i32, i32, ptr, i32, %struct.ucs_config_allow_list_t, %struct.ucs_arch_global_opts, i32, i64, i64 }
%struct.ucs_log_component_config = type { i32, [16 x i8], ptr }
%struct.anon.75 = type { ptr, i32, i32 }
%struct.ucs_config_names_array_t = type { ptr, i32, i32 }
%struct.ucs_config_allow_list_t = type { %struct.ucs_config_names_array_t, i32 }
%struct.ucs_arch_global_opts = type { i64, i64 }
%struct.ucs_array_ep_config_arr_t = type { ptr, i32, i32 }
%struct.uct_iface_attr = type { %struct.anon, i64, i64, i64, i64, %struct.sockaddr_storage, double, %struct.uct_ppn_bandwidth, %struct.ucs_linear_func_t, i8, i64, i32 }
%struct.anon = type { %struct.anon.0, %struct.anon.1, %struct.anon.2, %struct.anon.3, %struct.anon.7, %struct.anon.7, i64, i64 }
%struct.anon.0 = type { i64, i64, i64, i64, i64, i64, i64 }

!287 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE_REQ", value: 7)
!288 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE_DATA", value: 8)
!289 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE_ASYNC", value: 9)
!290 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE_FUNC", value: 10)
!291 = !DIEnumerator(name: "UCS_LOG_LEVEL_TRACE_POLL", value: 11)
!292 = !DIEnumerator(name: "UCS_LOG_LEVEL_LAST", value: 12)
!293 = !DIEnumerator(name: "UCS_LOG_LEVEL_PRINT", value: 13)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !238, line: 36, baseType: !139, size: 32, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!296 = !DIEnumerator(name: "UCP_REQUEST_FLAG_COMPLETED", value: 1)
!297 = !DIEnumerator(name: "UCP_REQUEST_FLAG_RELEASED", value: 2)
!298 = !DIEnumerator(name: "UCP_REQUEST_FLAG_PROTO_SEND", value: 4)
!299 = !DIEnumerator(name: "UCP_REQUEST_FLAG_USER_MEMH", value: 8)
!300 = !DIEnumerator(name: "UCP_REQUEST_FLAG_SYNC_LOCAL_COMPLETED", value: 16)
!301 = !DIEnumerator(name: "UCP_REQUEST_FLAG_SYNC_REMOTE_COMPLETED", value: 32)
!302 = !DIEnumerator(name: "UCP_REQUEST_FLAG_CALLBACK", value: 64)
!303 = !DIEnumerator(name: "UCP_REQUEST_FLAG_PROTO_INITIALIZED", value: 128)
!304 = !DIEnumerator(name: "UCP_REQUEST_FLAG_SYNC", value: 256)
!305 = !DIEnumerator(name: "UCP_REQUEST_FLAG_PROTO_AMO_PACKED", value: 512)
!306 = !DIEnumerator(name: "UCP_REQUEST_FLAG_OFFLOADED", value: 1024)
!307 = !DIEnumerator(name: "UCP_REQUEST_FLAG_BLOCK_OFFLOAD", value: 2048)
!308 = !DIEnumerator(name: "UCP_REQUEST_FLAG_STREAM_RECV_WAITALL", value: 4096)
!309 = !DIEnumerator(name: "UCP_REQUEST_FLAG_SEND_AM", value: 8192)
!310 = !DIEnumerator(name: "UCP_REQUEST_FLAG_SEND_TAG", value: 16384)
!311 = !DIEnumerator(name: "UCP_REQUEST_FLAG_RNDV_FRAG", value: 32768)
!312 = !DIEnumerator(name: "UCP_REQUEST_FLAG_RECV_AM", value: 65536)
!313 = !DIEnumerator(name: "UCP_REQUEST_FLAG_RECV_TAG", value: 131072)
!314 = !DIEnumerator(name: "UCP_REQUEST_FLAG_RKEY_INUSE", value: 262144)
!315 = !DIEnumerator(name: "UCP_REQUEST_FLAG_USER_HEADER_COPIED", value: 524288)
!316 = !DIEnumerator(name: "UCP_REQUEST_FLAG_STREAM_RECV", value: 0)
!317 = !DIEnumerator(name: "UCP_REQUEST_DEBUG_FLAG_EXTERNAL", value: 0)
!318 = !DIEnumerator(name: "UCP_REQUEST_FLAG_SUPER_VALID", value: 0)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !320, line: 62, baseType: !139, size: 32, elements: !321)
!320 = !DIFile(filename: "proto/proto.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src/ucp", checksumkind: CSK_MD5, checksum: "8905f1560da12fa20104b5956b40f906")
!321 = !{!322, !323}
!322 = !DIEnumerator(name: "UCP_PROTO_STAGE_START", value: 0)
!323 = !DIEnumerator(name: "UCP_PROTO_STAGE_LAST", value: 8)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !153, line: 703, baseType: !139, size: 32, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!326 = !DIEnumerator(name: "UCT_MD_FLAG_ALLOC", value: 1)
!327 = !DIEnumerator(name: "UCT_MD_FLAG_REG", value: 2)
!328 = !DIEnumerator(name: "UCT_MD_FLAG_NEED_MEMH", value: 4)
!329 = !DIEnumerator(name: "UCT_MD_FLAG_NEED_RKEY", value: 8)
!330 = !DIEnumerator(name: "UCT_MD_FLAG_ADVISE", value: 16)
!331 = !DIEnumerator(name: "UCT_MD_FLAG_FIXED", value: 32)
!332 = !DIEnumerator(name: "UCT_MD_FLAG_RKEY_PTR", value: 64)
!333 = !DIEnumerator(name: "UCT_MD_FLAG_SOCKADDR", value: 128)
!334 = !DIEnumerator(name: "UCT_MD_FLAG_INVALIDATE", value: 256)
!335 = !DIEnumerator(name: "UCT_MD_FLAG_EXPORTED_MKEY", value: 512)
!336 = !DIEnumerator(name: "UCT_MD_FLAG_REG_DMABUF", value: 1024)
!337 = !{!338, !339, !340, !343, !345, !346, !350, !355, !1913, !2788, !2793, !1147, !2796, !528, !364, !2469, !2395, !551, !2433, !1059, !780, !918, !709, !344, !2342, !351}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !341, line: 87, baseType: !342)
!341 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!342 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !341, line: 90, baseType: !344)
!344 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_status_t", file: !101, line: 86, baseType: !100)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_send_nbx_callback_t", file: !138, line: 340, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !339, !345, !339}
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_datatype_t", file: !138, line: 278, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !352, line: 27, baseType: !353)
!352 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !354, line: 45, baseType: !344)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_request_t", file: !170, line: 65, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucp_request", file: !238, line: 126, size: 2112, elements: !358)
!358 = !{!359, !360, !363, !366, !371}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !357, file: !238, line: 128, baseType: !345, size: 8)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !357, file: !238, line: 130, baseType: !361, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !352, line: 26, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !354, line: 42, baseType: !139)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !357, file: !238, line: 132, baseType: !364, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_ptr_map_key_t", file: !365, line: 36, baseType: !343)
!365 = !DIFile(filename: "ucs/datastruct/ptr_map.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "ba93f70097103e87793db5a90e3b76dc")
!366 = !DIDerivedType(tag: DW_TAG_member, scope: !357, file: !238, line: 134, baseType: !367, size: 64, offset: 128)
!367 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !357, file: !238, line: 134, size: 64, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !367, file: !238, line: 135, baseType: !339, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "super_req", scope: !367, file: !238, line: 136, baseType: !355, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !357, file: !238, line: 140, baseType: !372, size: 1920, offset: 192)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !357, file: !238, line: 140, size: 1920, elements: !373)
!373 = !{!374, !2686, !2779}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !372, file: !238, line: 370, baseType: !375, size: 1920)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !372, file: !238, line: 144, size: 1920, elements: !376)
!376 = !{!377, !2370, !2376, !2377, !2378, !2379, !2380, !2383, !2512, !2675, !2681, !2682, !2683, !2684, !2685}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !375, file: !238, line: 145, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_ep_h", file: !138, line: 92, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucp_ep", file: !381, line: 509, size: 512, elements: !382)
!381 = !DIFile(filename: "core/ucp_ep.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src/ucp", checksumkind: CSK_MD5, checksum: "4fa9d87318fa17d2fc925a59b220730c")
!382 = !{!383, !2246, !2247, !2248, !2251, !2252, !2254, !2256}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !380, file: !381, line: 510, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_worker_h", file: !138, line: 246, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucp_worker", file: !387, line: 268, size: 373056, elements: !388)
!387 = !DIFile(filename: "core/ucp_worker.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src/ucp", checksumkind: CSK_MD5, checksum: "936aef50bc32c28d8d12579a0d12b40a")
!388 = !{!389, !390, !497, !981, !982, !983, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1026, !1027, !1028, !1029, !1030, !1043, !1044, !1045, !1046, !1047, !1116, !1671, !1672, !1673, !1674, !1687, !1696, !1697, !1715, !1716, !1718, !1780, !1819, !1820, !1822, !1823, !1846, !1859, !1890, !1899, !2206, !2207, !2229, !2239}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !386, file: !387, line: 269, baseType: !351, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "async", scope: !386, file: !387, line: 270, baseType: !391, size: 640, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_async_context_t", file: !392, line: 23, baseType: !393)
!392 = !DIFile(filename: "ucs/async/async_fwd.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "d5ece52cd24b2b44b3790e38965d2d54")
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_async_context", file: !394, line: 29, size: 640, elements: !395)
!394 = !DIFile(filename: "ucs/async/async.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "6142364f8a620cd90b5a9b861761fc16")
!395 = !{!396, !473, !475, !494}
!396 = !DIDerivedType(tag: DW_TAG_member, scope: !393, file: !394, line: 30, baseType: !397, size: 320)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !393, file: !394, line: 30, size: 320, elements: !398)
!398 = !{!399, !457, !472}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !397, file: !394, line: 31, baseType: !400, size: 320)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_async_thread_context_t", file: !401, line: 29, baseType: !402)
!401 = !DIFile(filename: "ucs/async/thread.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "da7eb6f0edce9d74f8bf9034adb02701")
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_async_thread_context", file: !401, line: 24, size: 320, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !401, line: 25, baseType: !405, size: 320)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !402, file: !401, line: 25, size: 320, elements: !406)
!406 = !{!407, !424}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "spinlock", scope: !405, file: !401, line: 26, baseType: !408, size: 128)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_recursive_spinlock_t", file: !409, line: 40, baseType: !410)
!409 = !DIFile(filename: "ucs/type/spinlock.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "bb2c8956ed1d856531912b1024d70c3f")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_recursive_spinlock", file: !409, line: 36, size: 128, elements: !411)
!411 = !{!412, !421, !422}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "super", scope: !410, file: !409, line: 37, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_spinlock_t", file: !409, line: 31, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_spinlock", file: !409, line: 29, size: 32, elements: !415)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !414, file: !409, line: 30, baseType: !417, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_spinlock_t", file: !418, line: 103, baseType: !419)
!418 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!419 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !420)
!420 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !410, file: !409, line: 38, baseType: !420, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !410, file: !409, line: 39, baseType: !423, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !418, line: 27, baseType: !344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !405, file: !401, line: 27, baseType: !425, size: 320)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_async_thread_mutex_t", file: !401, line: 21, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_async_thread_mutex", file: !401, line: 15, size: 320, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !426, file: !401, line: 16, baseType: !429, size: 320)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !418, line: 72, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !418, line: 67, size: 320, elements: !431)
!431 = !{!432, !452, !456}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !430, file: !418, line: 69, baseType: !433, size: 320)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !434, line: 22, size: 320, elements: !435)
!434 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!435 = !{!436, !437, !438, !439, !440, !441, !443, !444}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !433, file: !434, line: 24, baseType: !420, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !433, file: !434, line: 25, baseType: !139, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !433, file: !434, line: 26, baseType: !420, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !433, file: !434, line: 28, baseType: !139, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !433, file: !434, line: 32, baseType: !420, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !433, file: !434, line: 34, baseType: !442, size: 16, offset: 160)
!442 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !433, file: !434, line: 35, baseType: !442, size: 16, offset: 176)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !433, file: !434, line: 36, baseType: !445, size: 128, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !446, line: 55, baseType: !447)
!446 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !446, line: 51, size: 128, elements: !448)
!448 = !{!449, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !447, file: !446, line: 53, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !447, file: !446, line: 54, baseType: !450, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !430, file: !418, line: 70, baseType: !453, size: 320)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 40)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !430, file: !418, line: 71, baseType: !342, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !397, file: !394, line: 32, baseType: !458, size: 192)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_async_signal_context_t", file: !459, line: 22, baseType: !460)
!459 = !DIFile(filename: "ucs/async/signal.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "135e943ef775271592b38f65322cd0b9")
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_async_signal_context", file: !459, line: 17, size: 192, elements: !461)
!461 = !{!462, !466, !467, !468}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !460, file: !459, line: 18, baseType: !463, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !464, line: 97, baseType: !465)
!464 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !354, line: 154, baseType: !420)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !460, file: !459, line: 19, baseType: !420, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pthread", scope: !460, file: !459, line: 20, baseType: !423, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !460, file: !459, line: 21, baseType: !469, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_t", file: !470, line: 7, baseType: !471)
!470 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/timer_t.h", directory: "", checksumkind: CSK_MD5, checksum: "b257b0db40a7b7cec2ff2d7c51baed44")
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__timer_t", file: !354, line: 172, baseType: !339)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "poll_block", scope: !397, file: !394, line: 33, baseType: !420, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !393, file: !394, line: 36, baseType: !474, size: 32, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_async_mode_t", file: !144, line: 44, baseType: !143)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !393, file: !394, line: 37, baseType: !476, size: 192, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_mpmc_queue_t", file: !477, line: 22, baseType: !478)
!477 = !DIFile(filename: "ucs/datastruct/mpmc.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "3da65d63ad2ba374c6d7f15a483e2ef3")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_mpmc_queue", file: !477, line: 19, size: 192, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !478, file: !477, line: 20, baseType: !413, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !478, file: !477, line: 21, baseType: !482, size: 128, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_queue_head_t", file: !483, line: 12, baseType: !484)
!483 = !DIFile(filename: "ucs/datastruct/queue_types.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "337bfa8de2de4146e201b945da9ca259")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_queue_head", file: !483, line: 27, size: 128, elements: !485)
!485 = !{!486, !492}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !484, file: !483, line: 28, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_queue_elem_t", file: !483, line: 11, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_queue_elem", file: !483, line: 19, size: 64, elements: !490)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !483, line: 20, baseType: !487, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ptail", scope: !484, file: !483, line: 29, baseType: !493, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "last_wakeup", scope: !393, file: !394, line: 38, baseType: !495, size: 64, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_time_t", file: !496, line: 23, baseType: !344)
!496 = !DIFile(filename: "ucs/time/time_def.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "c32183e06bcce8778e98b1f419c838cb")
!497 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !386, file: !387, line: 271, baseType: !498, size: 64, offset: 704)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_context_h", file: !138, line: 60, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucp_context", file: !501, line: 263, size: 7552, elements: !502)
!501 = !DIFile(filename: "core/ucp_context.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src/ucp", checksumkind: CSK_MD5, checksum: "14d6de6ecb5d76517811c5ca138085bb")
!502 = !{!503, !527, !532, !584, !586, !591, !592, !593, !595, !596, !597, !598, !627, !638, !639, !641, !865, !968, !979, !980}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tl_cmpts", scope: !500, file: !501, line: 264, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_tl_cmpt_t", file: !501, line: 226, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucp_tl_cmpt", file: !501, line: 223, size: 448, elements: !507)
!507 = !{!508, !513}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cmpt", scope: !506, file: !501, line: 224, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_component_h", file: !510, line: 78, baseType: !511)
!510 = !DIFile(filename: "uct/api/uct_def.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "2cfa90575e26a3e39073bbd74de78a87")
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "uct_component", file: !510, line: 78, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !506, file: !501, line: 225, baseType: !514, size: 384, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_component_attr_t", file: !153, line: 278, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uct_component_attr", file: !153, line: 244, size: 384, elements: !516)
!516 = !{!517, !518, !519, !520, !526}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "field_mask", scope: !515, file: !153, line: 251, baseType: !351, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !515, file: !153, line: 254, baseType: !9, size: 128, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "md_resource_count", scope: !515, file: !153, line: 257, baseType: !139, size: 32, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "md_resources", scope: !515, file: !153, line: 272, baseType: !521, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_md_resource_desc_t", file: !153, line: 219, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uct_md_resource_desc", file: !153, line: 217, size: 128, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "md_name", scope: !523, file: !153, line: 218, baseType: !9, size: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !515, file: !153, line: 277, baseType: !351, size: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "num_cmpts", scope: !500, file: !501, line: 265, baseType: !528, size: 8, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_rsc_index_t", file: !170, line: 31, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !352, line: 24, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !354, line: 38, baseType: !531)
!531 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "tl_mds", scope: !500, file: !501, line: 267, baseType: !533, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_tl_md_t", file: !501, line: 257, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucp_tl_md", file: !501, line: 232, size: 4416, elements: !536)
!536 = !{!537, !541, !542, !543, !583}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !535, file: !501, line: 236, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_md_h", file: !510, line: 86, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "uct_md", file: !510, line: 86, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cmpt_index", scope: !535, file: !501, line: 241, baseType: !528, size: 8, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rsc", scope: !535, file: !501, line: 246, baseType: !522, size: 128, offset: 72)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !535, file: !501, line: 251, baseType: !544, size: 4096, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_md_attr_v2_t", file: !545, line: 775, baseType: !546)
!545 = !DIFile(filename: "uct/api/v2/uct_v2.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "804aa3ddb0badaf3e75bc94a03b7c4b9")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 688, size: 4096, elements: !547)
!547 = !{!548, !549, !550, !553, !554, !555, !556, !557, !558, !559, !560, !568, !569, !570, !578, !579}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "field_mask", scope: !546, file: !545, line: 693, baseType: !351, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "max_alloc", scope: !546, file: !545, line: 698, baseType: !351, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "max_reg", scope: !546, file: !545, line: 703, baseType: !551, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !552, line: 70, baseType: !344)
!552 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !546, file: !545, line: 709, baseType: !351, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "reg_mem_types", scope: !546, file: !545, line: 714, baseType: !351, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cache_mem_types", scope: !546, file: !545, line: 719, baseType: !351, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "detect_mem_types", scope: !546, file: !545, line: 725, baseType: !351, size: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mem_types", scope: !546, file: !545, line: 730, baseType: !351, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "access_mem_types", scope: !546, file: !545, line: 735, baseType: !351, size: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dmabuf_mem_types", scope: !546, file: !545, line: 740, baseType: !351, size: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reg_cost", scope: !546, file: !545, line: 746, baseType: !561, size: 128, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_linear_func_t", file: !562, line: 24, baseType: !563)
!562 = !DIFile(filename: "ucs/datastruct/linear_func.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "e7c0ec7e78b0e5e3678ea6172235e328")
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !562, line: 21, size: 128, elements: !564)
!564 = !{!565, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !563, file: !562, line: 22, baseType: !566, size: 64)
!566 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !563, file: !562, line: 23, baseType: !566, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "component_name", scope: !546, file: !545, line: 751, baseType: !9, size: 128, offset: 768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rkey_packed_size", scope: !546, file: !545, line: 756, baseType: !551, size: 64, offset: 896)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "local_cpus", scope: !546, file: !545, line: 761, baseType: !571, size: 1024, offset: 960)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_cpu_set_t", file: !572, line: 28, baseType: !573)
!572 = !DIFile(filename: "ucs/type/cpu_set.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "c2c762a5c7a8721b60757b564d788120")
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !572, line: 26, size: 1024, elements: !574)
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ucs_bits", scope: !573, file: !572, line: 27, baseType: !576, size: 1024)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 1024, elements: !10)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_cpu_mask_t", file: !572, line: 14, baseType: !344)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "exported_mkey_packed_size", scope: !546, file: !545, line: 767, baseType: !551, size: 64, offset: 1984)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "global_id", scope: !546, file: !545, line: 774, baseType: !580, size: 2048, offset: 2048)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pack_flags_mask", scope: !535, file: !501, line: 256, baseType: !139, size: 32, offset: 4352)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "num_mds", scope: !500, file: !501, line: 268, baseType: !585, size: 8, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_md_index_t", file: !170, line: 36, baseType: !528)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reg_md_map", scope: !500, file: !501, line: 272, baseType: !587, size: 320, offset: 256)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 320, elements: !589)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_md_map_t", file: !170, line: 39, baseType: !351)
!589 = !{!590}
!590 = !DISubrange(count: 5)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cache_md_map", scope: !500, file: !501, line: 275, baseType: !587, size: 320, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dmabuf_reg_md_map", scope: !500, file: !501, line: 278, baseType: !588, size: 64, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mem_type_detect_mds", scope: !500, file: !501, line: 281, baseType: !594, size: 40, offset: 960)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 40, elements: !589)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "num_mem_type_detect_mds", scope: !500, file: !501, line: 282, baseType: !585, size: 8, offset: 1000)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dmabuf_mds", scope: !500, file: !501, line: 287, baseType: !594, size: 40, offset: 1008)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mem_type_mask", scope: !500, file: !501, line: 289, baseType: !351, size: 64, offset: 1088)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tl_rscs", scope: !500, file: !501, line: 291, baseType: !599, size: 64, offset: 1152)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_tl_resource_desc_t", file: !501, line: 208, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucp_tl_resource_desc", file: !501, line: 201, size: 480, elements: !602)
!602 = !{!603, !620, !624, !625, !626}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tl_rsc", scope: !601, file: !501, line: 202, baseType: !604, size: 416)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_tl_resource_desc_t", file: !153, line: 334, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uct_tl_resource_desc", file: !153, line: 327, size: 416, elements: !606)
!606 = !{!607, !611, !615, !617}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tl_name", scope: !605, file: !153, line: 328, baseType: !608, size: 80)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 10)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dev_name", scope: !605, file: !153, line: 329, baseType: !612, size: 256, offset: 80)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dev_type", scope: !605, file: !153, line: 330, baseType: !616, size: 32, offset: 352)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_device_type_t", file: !153, line: 313, baseType: !152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sys_device", scope: !605, file: !153, line: 332, baseType: !618, size: 8, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_sys_device_t", file: !619, line: 47, baseType: !529)
!619 = !DIFile(filename: "ucs/sys/topo/base/topo.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "b8cb5c6a5a0b5b89ce20c0d863ab207f")
!620 = !DIDerivedType(tag: DW_TAG_member, name: "tl_name_csum", scope: !601, file: !501, line: 203, baseType: !621, size: 16, offset: 416)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !352, line: 25, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !354, line: 40, baseType: !623)
!623 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "md_index", scope: !601, file: !501, line: 204, baseType: !585, size: 8, offset: 432)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dev_index", scope: !601, file: !501, line: 205, baseType: !528, size: 8, offset: 440)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !601, file: !501, line: 207, baseType: !529, size: 8, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "tl_bitmap", scope: !500, file: !501, line: 292, baseType: !628, size: 128, offset: 1216)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_tl_bitmap_t", file: !170, line: 88, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_bitmap_128_t", file: !630, line: 567, baseType: !631)
!630 = !DIFile(filename: "ucs/datastruct/bitmap.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "06a7f794d2a0e1b0fbcdd52ec34d62a5")
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 567, size: 128, elements: !632)
!632 = !{!633}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !631, file: !630, line: 567, baseType: !634, size: 128)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 128, elements: !636)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_bitmap_word_t", file: !630, line: 21, baseType: !351)
!636 = !{!637}
!637 = !DISubrange(count: 2)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "num_tls", scope: !500, file: !501, line: 295, baseType: !528, size: 8, offset: 1344)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "proto_bitmap", scope: !500, file: !501, line: 296, baseType: !640, size: 64, offset: 1408)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_proto_id_mask_t", file: !320, line: 54, baseType: !351)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rcache", scope: !500, file: !501, line: 299, baseType: !642, size: 64, offset: 1472)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_rcache_t", file: !644, line: 34, baseType: !645)
!644 = !DIFile(filename: "ucs/memory/rcache.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "06bf7169eb23f649f674ba38456d23c5")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_rcache", file: !646, line: 65, size: 2560, elements: !647)
!646 = !DIFile(filename: "ucs/memory/rcache_int.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "c40c9ea5cb873a9c711cb38596ac7a7b")
!647 = !{!648, !715, !741, !773, !774, !846, !847, !848, !849, !850, !851, !856, !857, !858}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !645, file: !646, line: 66, baseType: !649, size: 640)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_rcache_params_t", file: !644, line: 36, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_rcache_params", file: !644, line: 125, size: 640, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !710, !711, !712, !713, !714}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "region_struct_size", scope: !650, file: !644, line: 126, baseType: !551, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !650, file: !644, line: 129, baseType: !551, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "max_alignment", scope: !650, file: !644, line: 132, baseType: !551, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ucm_events", scope: !650, file: !644, line: 133, baseType: !420, size: 32, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ucm_event_priority", scope: !650, file: !644, line: 136, baseType: !420, size: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !650, file: !644, line: 137, baseType: !658, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_rcache_ops_t", file: !644, line: 35, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_rcache_ops", file: !644, line: 76, size: 192, elements: !662)
!662 = !{!663, !701, !705}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mem_reg", scope: !661, file: !644, line: 96, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!345, !339, !642, !339, !667, !621}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_rcache_region_t", file: !644, line: 37, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_rcache_region", file: !644, line: 147, size: 640, elements: !670)
!670 = !{!671, !679, !687, !688, !689, !691, !692, !693, !694, !695}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "super", scope: !669, file: !644, line: 148, baseType: !672, size: 128, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_region_t", file: !673, line: 58, baseType: !674)
!673 = !DIFile(filename: "ucs/datastruct/pgtable.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "a88370ba33ea72e5a4a96f02d1bf5ee7")
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_pgt_region", file: !673, line: 100, size: 128, align: 64, elements: !675)
!675 = !{!676, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !674, file: !673, line: 101, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_addr_t", file: !673, line: 54, baseType: !344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !674, file: !673, line: 102, baseType: !677, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lru_list", scope: !669, file: !644, line: 149, baseType: !680, size: 128, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_list_link_t", file: !681, line: 32, baseType: !682)
!681 = !DIFile(filename: "ucs/datastruct/list.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "560ed122fcbf30ccdb1a98bce3f12155")
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_list_link", file: !681, line: 29, size: 128, elements: !683)
!683 = !{!684, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !682, file: !681, line: 30, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !682, file: !681, line: 31, baseType: !685, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_list", scope: !669, file: !644, line: 150, baseType: !680, size: 128, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "comp_list", scope: !669, file: !644, line: 151, baseType: !680, size: 128, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !669, file: !644, line: 152, baseType: !690, size: 32, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !361)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !669, file: !644, line: 154, baseType: !345, size: 8, offset: 544)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !669, file: !644, line: 155, baseType: !529, size: 8, offset: 552)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !669, file: !644, line: 156, baseType: !529, size: 8, offset: 560)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lru_flags", scope: !669, file: !644, line: 157, baseType: !529, size: 8, offset: 568)
!695 = !DIDerivedType(tag: DW_TAG_member, scope: !669, file: !644, line: 158, baseType: !696, size: 64, offset: 576)
!696 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !669, file: !644, line: 158, size: 64, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !696, file: !644, line: 159, baseType: !351, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", scope: !696, file: !644, line: 160, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "mem_dereg", scope: !661, file: !644, line: 106, baseType: !702, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !339, !642, !667}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dump_region", scope: !661, file: !644, line: 119, baseType: !706, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !339, !642, !667, !709, !551}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !650, file: !644, line: 138, baseType: !339, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !650, file: !644, line: 140, baseType: !420, size: 32, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "max_regions", scope: !650, file: !644, line: 141, baseType: !344, size: 64, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !650, file: !644, line: 142, baseType: !551, size: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "max_unreleased", scope: !650, file: !644, line: 143, baseType: !551, size: 64, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pgt_lock", scope: !645, file: !646, line: 68, baseType: !716, size: 448, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !418, line: 91, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !418, line: 86, size: 448, elements: !718)
!718 = !{!719, !736, !740}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !717, file: !418, line: 88, baseType: !720, size: 448)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_rwlock_arch_t", file: !721, line: 23, size: 448, elements: !722)
!721 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_rwlock.h", directory: "", checksumkind: CSK_MD5, checksum: "2034038f4a99ff6cb7b9de3a3e8c2a8e")
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !734, !735}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__readers", scope: !720, file: !721, line: 25, baseType: !139, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__writers", scope: !720, file: !721, line: 26, baseType: !139, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__wrphase_futex", scope: !720, file: !721, line: 27, baseType: !139, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__writers_futex", scope: !720, file: !721, line: 28, baseType: !139, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !720, file: !721, line: 29, baseType: !139, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !720, file: !721, line: 30, baseType: !139, size: 32, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__cur_writer", scope: !720, file: !721, line: 32, baseType: !420, size: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !720, file: !721, line: 33, baseType: !420, size: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !720, file: !721, line: 34, baseType: !102, size: 8, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !720, file: !721, line: 39, baseType: !733, size: 56, offset: 264)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 56, elements: !85)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !720, file: !721, line: 42, baseType: !344, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !720, file: !721, line: 45, baseType: !139, size: 32, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !717, file: !418, line: 89, baseType: !737, size: 448)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 56)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !717, file: !418, line: 90, baseType: !342, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pgtable", scope: !645, file: !646, line: 70, baseType: !742, size: 384, offset: 1088)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgtable_t", file: !673, line: 57, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_pgtable", file: !673, line: 133, size: 384, elements: !744)
!744 = !{!745, !750, !751, !752, !753, !754, !768}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !743, file: !673, line: 138, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_entry_t", file: !673, line: 59, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_pgt_entry", file: !673, line: 116, size: 64, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !747, file: !673, line: 117, baseType: !677, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !743, file: !673, line: 139, baseType: !677, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !743, file: !673, line: 140, baseType: !677, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !743, file: !673, line: 141, baseType: !139, size: 32, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !743, file: !673, line: 142, baseType: !139, size: 32, offset: 224)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pgd_alloc_cb", scope: !743, file: !673, line: 143, baseType: !755, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_dir_alloc_callback_t", file: !673, line: 71, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!759, !766}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_dir_t", file: !673, line: 60, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_pgt_dir", file: !673, line: 126, size: 1088, elements: !762)
!762 = !{!763, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !761, file: !673, line: 127, baseType: !764, size: 1024)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 1024, elements: !10)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !761, file: !673, line: 128, baseType: !139, size: 32, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pgd_release_cb", scope: !743, file: !673, line: 144, baseType: !769, size: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_pgt_dir_release_callback_t", file: !673, line: 81, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !766, !759}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !645, file: !646, line: 73, baseType: !413, size: 32, offset: 1472)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !645, file: !646, line: 80, baseType: !775, size: 128, offset: 1536)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_mpool_t", file: !776, line: 22, baseType: !777)
!776 = !DIFile(filename: "ucs/datastruct/mpool.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "2baffe91ff5201fdab652b49084a919a")
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_mpool", file: !776, line: 66, size: 128, elements: !778)
!778 = !{!779, !787}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !777, file: !776, line: 67, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_mpool_elem_t", file: !776, line: 21, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ucs_mpool_elem", file: !776, line: 47, size: 64, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !782, file: !776, line: 48, baseType: !780, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "mpool", scope: !782, file: !776, line: 49, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !777, file: !776, line: 68, baseType: !788, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_mpool_data_t", file: !776, line: 23, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_mpool_data", file: !776, line: 75, size: 704, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !809, !845}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !790, file: !776, line: 76, baseType: !551, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !790, file: !776, line: 77, baseType: !551, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "align_offset", scope: !790, file: !776, line: 78, baseType: !551, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "grow_factor", scope: !790, file: !776, line: 79, baseType: !566, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "max_chunk_size", scope: !790, file: !776, line: 80, baseType: !551, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "elems_per_chunk", scope: !790, file: !776, line: 82, baseType: !139, size: 32, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "quota", scope: !790, file: !776, line: 83, baseType: !139, size: 32, offset: 352)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_safe", scope: !790, file: !776, line: 84, baseType: !420, size: 32, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !790, file: !776, line: 85, baseType: !780, size: 64, offset: 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "chunks", scope: !790, file: !776, line: 86, baseType: !802, size: 64, offset: 512)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_mpool_chunk_t", file: !776, line: 20, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_mpool_chunk", file: !776, line: 56, size: 192, elements: !805)
!805 = !{!806, !807, !808}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !804, file: !776, line: 57, baseType: !802, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !804, file: !776, line: 58, baseType: !339, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "num_elems", scope: !804, file: !776, line: 59, baseType: !139, size: 32, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !790, file: !776, line: 87, baseType: !810, size: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_mpool_ops_t", file: !776, line: 24, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_mpool_ops", file: !776, line: 95, size: 320, elements: !814)
!814 = !{!815, !820, !824, !828, !829}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_alloc", scope: !813, file: !776, line: 107, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!345, !786, !819, !338}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_release", scope: !813, file: !776, line: 115, baseType: !821, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !786, !339}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "obj_init", scope: !813, file: !776, line: 126, baseType: !825, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !786, !339, !339}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "obj_cleanup", scope: !813, file: !776, line: 135, baseType: !821, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "obj_str", scope: !813, file: !776, line: 145, baseType: !830, size: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !786, !339, !833}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_string_buffer_t", file: !835, line: 94, baseType: !836)
!835 = !DIFile(filename: "ucs/datastruct/string_buffer.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "42bc35b3b5ce12d3933ffbf77d160184")
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_string_buffer", file: !835, line: 92, size: 192, elements: !837)
!837 = !{!838}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !836, file: !835, line: 93, baseType: !839, size: 192)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_array_string_buffer_t", file: !835, line: 21, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !835, line: 21, size: 192, elements: !841)
!841 = !{!842, !843, !844}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !840, file: !835, line: 21, baseType: !709, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !840, file: !835, line: 21, baseType: !551, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !840, file: !835, line: 21, baseType: !551, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !790, file: !776, line: 88, baseType: !709, size: 64, offset: 640)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "inv_q", scope: !645, file: !646, line: 85, baseType: !482, size: 128, offset: 1664)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gc_list", scope: !645, file: !646, line: 87, baseType: !680, size: 128, offset: 1792)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !645, file: !646, line: 90, baseType: !344, size: 64, offset: 1920)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !645, file: !646, line: 91, baseType: !551, size: 64, offset: 1984)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "unreleased_size", scope: !645, file: !646, line: 92, baseType: !551, size: 64, offset: 2048)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !645, file: !646, line: 100, baseType: !852, size: 192, offset: 2112)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !645, file: !646, line: 94, size: 192, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !852, file: !646, line: 95, baseType: !413, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !852, file: !646, line: 96, baseType: !680, size: 128, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !645, file: !646, line: 102, baseType: !709, size: 64, offset: 2304)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !645, file: !646, line: 106, baseType: !680, size: 128, offset: 2368)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "distribution", scope: !645, file: !646, line: 107, baseType: !859, size: 64, offset: 2496)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_rcache_distribution_t", file: !646, line: 63, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_rcache_distribution", file: !646, line: 60, size: 128, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !861, file: !646, line: 61, baseType: !551, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !861, file: !646, line: 62, baseType: !551, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !500, file: !501, line: 350, baseType: !866, size: 5248, offset: 1536)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !500, file: !501, line: 301, size: 5248, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !883, !890, !891, !892, !896, !897, !961, !962, !963}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !866, file: !501, line: 304, baseType: !351, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "tag_sender_mask", scope: !866, file: !501, line: 305, baseType: !351, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "est_num_eps", scope: !866, file: !501, line: 308, baseType: !420, size: 32, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "est_num_ppn", scope: !866, file: !501, line: 311, baseType: !420, size: 32, offset: 160)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !866, file: !501, line: 317, baseType: !873, size: 192, offset: 192)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !866, file: !501, line: 313, size: 192, elements: !874)
!874 = !{!875, !876, !881}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !873, file: !501, line: 314, baseType: !551, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !873, file: !501, line: 315, baseType: !877, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_request_init_callback_t", file: !138, line: 289, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{null, !339}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !873, file: !501, line: 316, baseType: !882, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_request_cleanup_callback_t", file: !138, line: 301, baseType: !878)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_methods", scope: !866, file: !501, line: 326, baseType: !884, size: 64, offset: 384)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !866, file: !501, line: 320, size: 160, elements: !886)
!886 = !{!887, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !885, file: !501, line: 322, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_alloc_method_t", file: !153, line: 481, baseType: !160)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "cmpt_name", scope: !885, file: !501, line: 325, baseType: !9, size: 128, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "num_alloc_methods", scope: !866, file: !501, line: 327, baseType: !139, size: 32, offset: 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "cm_cmpts_bitmap", scope: !866, file: !501, line: 330, baseType: !628, size: 128, offset: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "cm_cmpt_idxs", scope: !866, file: !501, line: 334, baseType: !893, size: 1024, offset: 640)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 1024, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "num_cm_cmpts", scope: !866, file: !501, line: 335, baseType: !528, size: 8, offset: 1664)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !866, file: !501, line: 338, baseType: !898, size: 3264, offset: 1728)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_context_config_t", file: !501, line: 160, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucp_context_config", file: !501, line: 42, size: 3264, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !911, !912, !913, !914, !916, !917, !919, !920, !921, !922, !923, !924, !925, !926, !927, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !940, !941, !942, !943, !944, !945, !946, !947, !949, !950, !951, !952, !953, !955, !956, !957, !958, !959, !960}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "bcopy_thresh", scope: !899, file: !501, line: 44, baseType: !551, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_thresh", scope: !899, file: !501, line: 46, baseType: !551, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_send_nbr_thresh", scope: !899, file: !501, line: 49, baseType: !551, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_thresh_fallback", scope: !899, file: !501, line: 52, baseType: !551, size: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_perf_diff", scope: !899, file: !501, line: 55, baseType: !566, size: 64, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "multi_lane_max_ratio", scope: !899, file: !501, line: 58, baseType: !566, size: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "multi_path_ratio", scope: !899, file: !501, line: 60, baseType: !566, size: 64, offset: 384)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "zcopy_thresh", scope: !899, file: !501, line: 62, baseType: !551, size: 64, offset: 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_mode", scope: !899, file: !501, line: 64, baseType: !910, size: 32, offset: 512)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_rndv_mode_t", file: !170, line: 236, baseType: !169)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rkey_ptr_seg_size", scope: !899, file: !501, line: 66, baseType: !551, size: 64, offset: 576)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "bcopy_bw", scope: !899, file: !501, line: 68, baseType: !566, size: 64, offset: 640)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "seg_size", scope: !899, file: !501, line: 70, baseType: !551, size: 64, offset: 704)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_frag_size", scope: !899, file: !501, line: 72, baseType: !915, size: 320, offset: 768)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 320, elements: !589)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_num_frags", scope: !899, file: !501, line: 74, baseType: !915, size: 320, offset: 1088)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_frag_mem_type", scope: !899, file: !501, line: 76, baseType: !918, size: 32, offset: 1408)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_memory_type_t", file: !181, line: 45, baseType: !180)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_pipeline_send_thresh", scope: !899, file: !501, line: 78, baseType: !551, size: 64, offset: 1472)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_shm_ppln_enable", scope: !899, file: !501, line: 80, baseType: !420, size: 32, offset: 1536)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tm_thresh", scope: !899, file: !501, line: 83, baseType: !551, size: 64, offset: 1600)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "tm_force_thresh", scope: !899, file: !501, line: 85, baseType: !551, size: 64, offset: 1664)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tm_max_bb_size", scope: !899, file: !501, line: 88, baseType: !551, size: 64, offset: 1728)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sw_rndv", scope: !899, file: !501, line: 90, baseType: !420, size: 32, offset: 1792)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "address_debug_info", scope: !899, file: !501, line: 92, baseType: !420, size: 32, offset: 1824)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "max_worker_address_name", scope: !899, file: !501, line: 94, baseType: !139, size: 32, offset: 1856)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_mode", scope: !899, file: !501, line: 96, baseType: !928, size: 32, offset: 1888)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_atomic_mode_t", file: !170, line: 210, baseType: !190)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "use_mt_mutex", scope: !899, file: !501, line: 98, baseType: !420, size: 32, offset: 1920)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_progress", scope: !899, file: !501, line: 100, baseType: !420, size: 32, offset: 1952)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "max_eager_lanes", scope: !899, file: !501, line: 102, baseType: !139, size: 32, offset: 1984)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "max_rndv_lanes", scope: !899, file: !501, line: 104, baseType: !139, size: 32, offset: 2016)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "max_rma_lanes", scope: !899, file: !501, line: 106, baseType: !139, size: 32, offset: 2048)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "min_rndv_chunk_size", scope: !899, file: !501, line: 109, baseType: !551, size: 64, offset: 2112)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "estimated_num_eps", scope: !899, file: !501, line: 111, baseType: !551, size: 64, offset: 2176)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "estimated_num_ppn", scope: !899, file: !501, line: 113, baseType: !551, size: 64, offset: 2240)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "flush_worker_eps", scope: !899, file: !501, line: 115, baseType: !420, size: 32, offset: 2304)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fence_mode", scope: !899, file: !501, line: 117, baseType: !939, size: 32, offset: 2336)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_fence_mode_t", file: !170, line: 221, baseType: !196)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "unified_mode", scope: !899, file: !501, line: 119, baseType: !420, size: 32, offset: 2368)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "cm_use_all_devices", scope: !899, file: !501, line: 122, baseType: !420, size: 32, offset: 2400)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "listener_backlog", scope: !899, file: !501, line: 124, baseType: !551, size: 64, offset: 2432)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "proto_enable", scope: !899, file: !501, line: 126, baseType: !420, size: 32, offset: 2496)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "proto_request_reset", scope: !899, file: !501, line: 128, baseType: !420, size: 32, offset: 2528)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive_interval", scope: !899, file: !501, line: 130, baseType: !495, size: 64, offset: 2560)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive_num_eps", scope: !899, file: !501, line: 133, baseType: !139, size: 32, offset: 2624)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "resolve_remote_ep_id", scope: !899, file: !501, line: 136, baseType: !948, size: 32, offset: 2656)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_on_off_auto_value_t", file: !144, line: 70, baseType: !202)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "proto_indirect_id", scope: !899, file: !501, line: 138, baseType: !948, size: 32, offset: 2688)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "reg_whole_alloc_bitmap", scope: !899, file: !501, line: 140, baseType: !139, size: 32, offset: 2720)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_put_force_flush", scope: !899, file: !501, line: 142, baseType: !420, size: 32, offset: 2752)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_memtype_direct_size", scope: !899, file: !501, line: 144, baseType: !551, size: 64, offset: 2816)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "sa_client_min_hdr_version", scope: !899, file: !501, line: 146, baseType: !954, size: 32, offset: 2880)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_object_version_t", file: !170, line: 246, baseType: !208)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rkey_mpool_max_md", scope: !899, file: !501, line: 149, baseType: !420, size: 32, offset: 2912)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "worker_addr_version", scope: !899, file: !501, line: 151, baseType: !954, size: 32, offset: 2944)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "rndv_align_thresh", scope: !899, file: !501, line: 153, baseType: !551, size: 64, offset: 3008)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "proto_info", scope: !899, file: !501, line: 155, baseType: !420, size: 32, offset: 3072)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "select_distance_md", scope: !899, file: !501, line: 157, baseType: !709, size: 64, offset: 3136)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "proto_info_dir", scope: !899, file: !501, line: 159, baseType: !709, size: 64, offset: 3200)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "env_prefix", scope: !866, file: !501, line: 341, baseType: !709, size: 64, offset: 4992)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "worker_strong_fence", scope: !866, file: !501, line: 344, baseType: !139, size: 32, offset: 5056)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "am_mpools", scope: !866, file: !501, line: 349, baseType: !964, size: 128, offset: 5120)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !866, file: !501, line: 346, size: 128, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !964, file: !501, line: 347, baseType: !139, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !964, file: !501, line: 348, baseType: !819, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "mt_lock", scope: !500, file: !501, line: 353, baseType: !969, size: 384, offset: 6784)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_mt_lock_t", file: !214, line: 40, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucp_mt_lock", file: !214, line: 32, size: 384, elements: !971)
!971 = !{!972, !974}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "mt_type", scope: !970, file: !214, line: 33, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_mt_type_t", file: !214, line: 26, baseType: !213)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !970, file: !214, line: 39, baseType: !975, size: 320, offset: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !970, file: !214, line: 34, size: 320, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "mt_spinlock", scope: !975, file: !214, line: 37, baseType: !408, size: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "mt_mutex", scope: !975, file: !214, line: 38, baseType: !429, size: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !500, file: !501, line: 355, baseType: !612, size: 256, offset: 7168)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "cached_key_list", scope: !500, file: !501, line: 358, baseType: !680, size: 128, offset: 7424)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !386, file: !387, line: 272, baseType: !351, size: 64, offset: 768)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "client_id", scope: !386, file: !387, line: 273, baseType: !351, size: 64, offset: 832)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "uct", scope: !386, file: !387, line: 274, baseType: !984, size: 64, offset: 896)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_worker_h", file: !510, line: 95, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uct_worker", file: !987, line: 382, size: 2112, elements: !988)
!987 = !DIFile(filename: "uct/api/tl.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "bef986acadba067c9ea90f0f2da8fd99")
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "progress_q", scope: !986, file: !987, line: 383, baseType: !990, size: 2112)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_callbackq_t", file: !991, line: 35, baseType: !992)
!991 = !DIFile(filename: "ucs/datastruct/callbackq.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "13d215dba2774a4ee7e64554b00c0267")
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_callbackq", file: !991, line: 88, size: 2112, elements: !993)
!993 = !{!994, !1009}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "fast_elems", scope: !992, file: !991, line: 93, baseType: !995, size: 1536)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 1536, elements: !1007)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_callbackq_elem_t", file: !991, line: 36, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_callbackq_elem", file: !991, line: 77, size: 192, elements: !998)
!998 = !{!999, !1004, !1005, !1006}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !997, file: !991, line: 78, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_callback_t", file: !991, line: 48, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!139, !339}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !997, file: !991, line: 79, baseType: !339, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !997, file: !991, line: 80, baseType: !139, size: 32, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !997, file: !991, line: 81, baseType: !420, size: 32, offset: 160)
!1007 = !{!1008}
!1008 = !DISubrange(count: 8)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !992, file: !991, line: 99, baseType: !1010, size: 576, offset: 1536)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 72)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "req_mp", scope: !386, file: !387, line: 275, baseType: !775, size: 128, offset: 960)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "rkey_mp", scope: !386, file: !387, line: 276, baseType: !775, size: 128, offset: 1088)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_tls", scope: !386, file: !387, line: 277, baseType: !628, size: 128, offset: 1216)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "inprogress", scope: !386, file: !387, line: 279, baseType: !420, size: 32, offset: 1344)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !386, file: !387, line: 281, baseType: !612, size: 256, offset: 1376)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "address_name", scope: !386, file: !387, line: 283, baseType: !612, size: 256, offset: 1632)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "flush_ops_count", scope: !386, file: !387, line: 285, baseType: !139, size: 32, offset: 1888)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "event_fd", scope: !386, file: !387, line: 287, baseType: !420, size: 32, offset: 1920)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "event_set", scope: !386, file: !387, line: 288, baseType: !1022, size: 64, offset: 1984)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_sys_event_set_t", file: !1024, line: 20, baseType: !1025)
!1024 = !DIFile(filename: "ucs/sys/event_set.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "6a38670269bf5b6062c11d0c966eecae")
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_sys_event_set", file: !1024, line: 20, flags: DIFlagFwdDecl)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "eventfd", scope: !386, file: !387, line: 289, baseType: !420, size: 32, offset: 2048)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "uct_events", scope: !386, file: !387, line: 290, baseType: !139, size: 32, offset: 2080)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "arm_ifaces", scope: !386, file: !387, line: 291, baseType: !680, size: 128, offset: 2112)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !386, file: !387, line: 293, baseType: !339, size: 64, offset: 2240)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ep_alloc", scope: !386, file: !387, line: 294, baseType: !1031, size: 320, offset: 2304)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_strided_alloc_t", file: !1032, line: 81, baseType: !1033)
!1032 = !DIFile(filename: "ucs/datastruct/strided_alloc.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "5d4876be3265327ba19da7d58c89fa3a")
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_strided_alloc", file: !1032, line: 75, size: 320, elements: !1034)
!1034 = !{!1035, !1039, !1040, !1041, !1042}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !1033, file: !1032, line: 76, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_strided_alloc_elem_t", file: !1032, line: 67, baseType: !1038)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_strided_alloc_elem", file: !1032, line: 67, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "chunks", scope: !1033, file: !1032, line: 77, baseType: !482, size: 128, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !1033, file: !1032, line: 78, baseType: !551, size: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "stride_count", scope: !1033, file: !1032, line: 79, baseType: !139, size: 32, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "inuse_count", scope: !1033, file: !1032, line: 80, baseType: !139, size: 32, offset: 288)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "stream_ready_eps", scope: !386, file: !387, line: 295, baseType: !680, size: 128, offset: 2624)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "num_all_eps", scope: !386, file: !387, line: 296, baseType: !139, size: 32, offset: 2752)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "all_eps", scope: !386, file: !387, line: 298, baseType: !680, size: 128, offset: 2816)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "internal_eps", scope: !386, file: !387, line: 300, baseType: !680, size: 128, offset: 2944)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "conn_match_ctx", scope: !386, file: !387, line: 301, baseType: !1048, size: 704, offset: 3072)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_conn_match_ctx_t", file: !1049, line: 58, baseType: !1050)
!1049 = !DIFile(filename: "ucs/datastruct/conn_match.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "cade13d47fabd64af4f8d427191d5c0f")
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_conn_match_ctx", file: !1049, line: 132, size: 704, elements: !1051)
!1051 = !{!1052, !1071, !1073, !1074}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1050, file: !1049, line: 133, baseType: !1053, size: 320)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ucs_conn_match_t", file: !1049, line: 126, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ucs_conn_match_s", file: !1049, line: 126, size: 320, elements: !1055)
!1055 = !{!1056, !1060, !1061, !1062, !1063, !1065, !1070}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1054, file: !1049, line: 126, baseType: !1057, size: 32)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !1058, line: 173, baseType: !1059)
!1058 = !DIFile(filename: "ucs/datastruct/khash.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "4f19cb5628fe4fe4afa8a5753fb799da")
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !1058, line: 146, baseType: !139)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1054, file: !1049, line: 126, baseType: !1057, size: 32, offset: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !1054, file: !1049, line: 126, baseType: !1057, size: 32, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !1054, file: !1049, line: 126, baseType: !1057, size: 32, offset: 96)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1054, file: !1049, line: 126, baseType: !1064, size: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1054, file: !1049, line: 126, baseType: !1066, size: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_conn_match_peer_t", file: !1049, line: 123, baseType: !1069)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_conn_match_peer", file: !1049, line: 123, flags: DIFlagFwdDecl)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !1054, file: !1049, line: 126, baseType: !709, size: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "max_conn_sn", scope: !1050, file: !1049, line: 134, baseType: !1072, size: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_conn_sn_t", file: !1049, line: 28, baseType: !351)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !1050, file: !1049, line: 136, baseType: !551, size: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1050, file: !1049, line: 138, baseType: !1075, size: 256, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_conn_match_ops_t", file: !1049, line: 116, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_conn_match_ops", file: !1049, line: 111, size: 256, elements: !1077)
!1077 = !{!1078, !1096, !1101, !1109}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "get_address", scope: !1076, file: !1049, line: 112, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_conn_match_get_address_t", file: !1049, line: 69, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!1083, !1085}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_conn_match_elem_t", file: !1049, line: 55, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_conn_match_elem", file: !1049, line: 52, size: 128, elements: !1089)
!1089 = !{!1090}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1088, file: !1049, line: 53, baseType: !1091, size: 128)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_hlist_link_t", file: !1092, line: 32, baseType: !1093)
!1092 = !DIFile(filename: "ucs/datastruct/hlist.h", directory: "/local-ssd/ucx-imxvliwpzgzcqa2wiesponuyfnek2h3t-build/aidengro/spack-stage-ucx-1.14.1-imxvliwpzgzcqa2wiesponuyfnek2h3t/spack-src/src", checksumkind: CSK_MD5, checksum: "bd9b5de63bce6f13ed1530d78caef72b")
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucs_hlist_link", file: !1092, line: 30, size: 128, elements: !1094)
!1094 = !{!1095}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1093, file: !1092, line: 31, baseType: !680, size: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "get_conn_sn", scope: !1076, file: !1049, line: 113, baseType: !1097, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_conn_match_get_conn_sn_t", file: !1049, line: 80, baseType: !1098)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!1072, !1085}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "address_str", scope: !1076, file: !1049, line: 114, baseType: !1102, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_conn_match_address_str_t", file: !1049, line: 94, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!1106, !1107, !1083, !709, !551}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "purge_cb", scope: !1076, file: !1049, line: 115, baseType: !1110, size: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs_conn_match_purge_cb_t", file: !1049, line: 104, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{null, !1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ifaces", scope: !386, file: !387, line: 302, baseType: !1117, size: 64, offset: 3776)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucp_worker_iface_t", file: !170, line: 72, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucp_worker_iface", file: !387, line: 233, size: 4800, elements: !1121)
!1121 = !{!1122, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "iface", scope: !1120, file: !387, line: 234, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_iface_h", file: !510, line: 79, baseType: !1124)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uct_iface", file: !987, line: 390, size: 3200, elements: !1126)
!1126 = !{!1127}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1125, file: !987, line: 391, baseType: !1128, size: 3200)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_iface_ops_t", file: !987, line: 375, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uct_iface_ops", file: !987, line: 295, size: 3200, elements: !1130)
!1130 = !{!1131, !1142, !1153, !1180, !1185, !1194, !1196, !1201, !1206, !1211, !1216, !1222, !1228, !1233, !1238, !1243, !1248, !1254, !1259, !1264, !1270, !1275, !1280, !1302, !1307, !1322, !1331, !1336, !1341, !1343, !1463, !1476, !1478, !1483, !1488, !1496, !1503, !1508, !1510, !1515, !1520, !1525, !1527, !1532, !1538, !1540, !1545, !1643, !1649, !1655}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ep_put_short", scope: !1129, file: !987, line: 298, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_ep_put_short_func_t", file: !987, line: 28, baseType: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!345, !1136, !1083, !139, !351, !1141}
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_ep_h", file: !510, line: 83, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uct_ep", file: !987, line: 398, size: 64, elements: !1139)
!1139 = !{!1140}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "iface", scope: !1138, file: !987, line: 399, baseType: !1123, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_rkey_t", file: !510, line: 85, baseType: !343)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ep_put_bcopy", scope: !1129, file: !987, line: 299, baseType: !1143, size: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_ep_put_bcopy_func_t", file: !987, line: 34, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!1147, !1136, !1149, !339, !351, !1141}
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !464, line: 108, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !354, line: 194, baseType: !342)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_pack_callback_t", file: !510, line: 598, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!551, !339, !339}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ep_put_zcopy", scope: !1129, file: !987, line: 300, baseType: !1154, size: 64, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_ep_put_zcopy_func_t", file: !987, line: 40, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!345, !1136, !1158, !551, !351, !1141, !1169}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_iov_t", file: !510, line: 154, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uct_iov", file: !510, line: 147, size: 320, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1167, !1168}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1161, file: !510, line: 148, baseType: !339, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1161, file: !510, line: 149, baseType: !551, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "memh", scope: !1161, file: !510, line: 150, baseType: !1166, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_mem_h", file: !510, line: 84, baseType: !339)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !1161, file: !510, line: 151, baseType: !551, size: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1161, file: !510, line: 153, baseType: !139, size: 32, offset: 256)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_completion_t", file: !510, line: 93, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uct_completion", file: !153, line: 1705, size: 128, elements: !1172)
!1172 = !{!1173, !1178, !1179}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1171, file: !153, line: 1706, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uct_completion_callback_t", file: !510, line: 536, baseType: !1175)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{null, !1169}
