; ModuleID = 'samples/832.bc'
source_filename = "src/annotationsketch/canvas.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtCanvasClass = type { i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.GtRange = type { i64, i64 }
%struct.GtCanvas = type { ptr, ptr }
%struct.GtCanvasMembers = type { %struct.GtRange, double, double, double, i64, i64, ptr, ptr, i8, ptr, ptr, ptr }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c"txt\00", align 1, !dbg !7
@__func__.gt_format_ruler_label = private unnamed_addr constant [22 x i8] c"gt_format_ruler_label\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [30 x i8] c"src/annotationsketch/canvas.c\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [4 x i8] c"-%.\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [3 x i8] c"%.\00", align 1, !dbg !25
@.str.5 = private unnamed_addr constant [5 x i8] c"fG%s\00", align 1, !dbg !30

!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 208, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 26)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !106, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !66, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 200, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 25)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 254, type: !116, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !76, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !14, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 18)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 24)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 282, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 13)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 282, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 232, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 29)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !2, line: 291, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 20)
!159 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !160, globals: !167, splitDebugInlining: false, nameTableKind: None)
!160 = !{!161, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !162, line: 83, baseType: !163)
!162 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!163 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!164 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!165 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!167 = !{!0, !7, !12, !18, !23, !25, !30, !35, !37, !39, !44, !49, !54, !59, !64, !69, !74, !79, !81, !86, !89, !94, !99, !101, !104, !109, !112, !114, !119, !121, !123, !128, !130, !132, !134, !139, !144, !149, !154}
!168 = !{i32 7, !"Dwarf Version", i32 5}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{i32 1, !"wchar_size", i32 4}
!171 = !{i32 8, !"PIC Level", i32 2}
!172 = !{i32 7, !"uwtable", i32 2}
!173 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!174 = distinct !DISubprogram(name: "gt_canvas_class_new", scope: !2, file: !2, line: 52, type: !175, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !159, retainedNodes: !305)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !184, !187, !187, !253, !253, !259, !259, !269, !278, !287, !296, !301}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvasClass", file: !180, line: 34, baseType: !181)
!180 = !DIFile(filename: "src/annotationsketch/canvas.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0deb9c7fb96a771c207e05f982461a9a")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtCanvasClass", file: !2, line: 37, size: 768, elements: !182)
!182 = !{!183, !186, !251, !252, !257, !258, !267, !268, !277, !286, !295, !300}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !181, file: !2, line: 38, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !185, line: 70, baseType: !163)
!185 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "visit_layout_pre", scope: !181, file: !2, line: 39, baseType: !187, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvasVisitLayoutFunc", file: !188, line: 29, baseType: !189)
!188 = !DIFile(filename: "src/annotationsketch/canvas_rep.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1273562b3b724a5667271ade0a3a1481")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!164, !192, !243, !247}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvas", file: !194, line: 26, baseType: !195)
!194 = !DIFile(filename: "src/annotationsketch/canvas_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "f126b39be3fd664e2d47ff26173ec50f")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtCanvas", file: !188, line: 41, size: 128, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "c_class", scope: !195, file: !188, line: 42, baseType: !177, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pvt", scope: !195, file: !188, line: 43, baseType: !199, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvasMembers", file: !188, line: 39, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtCanvasMembers", file: !202, line: 28, size: 832, elements: !203)
!202 = !DIFile(filename: "src/annotationsketch/canvas_members.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "83e23799ae8d740922e4ccc9382d212f")
!203 = !{!204, !211, !212, !213, !214, !215, !216, !221, !226, !228, !233, !238}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "viewrange", scope: !201, file: !202, line: 29, baseType: !205, size: 128)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtRange", file: !206, line: 29, baseType: !207)
!206 = !DIFile(filename: "src/core/range_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "05971597f0a8f239b91be35d4168fb4b")
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtRange", file: !206, line: 31, size: 128, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !207, file: !206, line: 32, baseType: !161, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !207, file: !206, line: 33, baseType: !161, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !201, file: !202, line: 30, baseType: !165, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !201, file: !202, line: 30, baseType: !165, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "margins", scope: !201, file: !202, line: 30, baseType: !165, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !201, file: !202, line: 31, baseType: !161, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !201, file: !202, line: 31, baseType: !161, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sty", scope: !201, file: !202, line: 32, baseType: !217, size: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStyle", file: !219, line: 39, baseType: !220)
!219 = !DIFile(filename: "src/annotationsketch/style_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "8b0af1f75506a70a0a185d1ffc610b45")
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStyle", file: !219, line: 39, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "current_track", scope: !201, file: !202, line: 33, baseType: !222, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtTrack", file: !224, line: 23, baseType: !225)
!224 = !DIFile(filename: "src/annotationsketch/track.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "40cbea53bff2671b41c696caee771a66")
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtTrack", file: !224, line: 23, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "show_track_captions", scope: !201, file: !202, line: 34, baseType: !227, size: 8, offset: 576)
!227 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bt", scope: !201, file: !202, line: 35, baseType: !229, size: 64, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBittab", file: !231, line: 26, baseType: !232)
!231 = !DIFile(filename: "src/core/bittab_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "f860891bf3c2458e3eaa7c6ba3953bc8")
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtBittab", file: !231, line: 26, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !201, file: !202, line: 36, baseType: !234, size: 64, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtGraphics", file: !236, line: 58, baseType: !237)
!236 = !DIFile(filename: "src/annotationsketch/graphics_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "422302beb591e321e2ca909075478c12")
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtGraphics", file: !236, line: 58, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ii", scope: !201, file: !202, line: 37, baseType: !239, size: 64, offset: 768)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtImageInfo", file: !241, line: 31, baseType: !242)
!241 = !DIFile(filename: "src/annotationsketch/image_info_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "2bddc85a737fdf5ad989a78ce50c289f")
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtImageInfo", file: !241, line: 31, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtLayout", file: !245, line: 35, baseType: !246)
!245 = !DIFile(filename: "src/annotationsketch/layout_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "6f1bf948ce76bc4787b620855d2b9fe2")
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtLayout", file: !245, line: 35, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !249, line: 44, baseType: !250)
!249 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !249, line: 44, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "visit_layout_post", scope: !181, file: !2, line: 40, baseType: !187, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "visit_track_pre", scope: !181, file: !2, line: 41, baseType: !253, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvasVisitTrackFunc", file: !188, line: 30, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!164, !192, !222, !247}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "visit_track_post", scope: !181, file: !2, line: 42, baseType: !253, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "visit_line_pre", scope: !181, file: !2, line: 43, baseType: !259, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvasVisitLineFunc", file: !188, line: 31, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!164, !192, !263, !247}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtLine", file: !265, line: 23, baseType: !266)
!265 = !DIFile(filename: "src/annotationsketch/line.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "a4f64f8aedce35079626c281bfd0d238")
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtLine", file: !265, line: 23, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "visit_line_post", scope: !181, file: !2, line: 44, baseType: !259, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "visit_block", scope: !181, file: !2, line: 45, baseType: !269, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvasVisitBlockFunc", file: !188, line: 32, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!164, !192, !273, !247}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBlock", file: !275, line: 31, baseType: !276)
!275 = !DIFile(filename: "src/annotationsketch/block_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "d34a182def1510c151654d34d8d80f2e")
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtBlock", file: !275, line: 31, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "visit_element", scope: !181, file: !2, line: 46, baseType: !278, size: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvasVisitElementFunc", file: !188, line: 33, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!164, !192, !282, !247}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtElement", file: !284, line: 23, baseType: !285)
!284 = !DIFile(filename: "src/annotationsketch/element.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "f83ec593b7b83c3824db8252981b4151")
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtElement", file: !284, line: 23, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "visit_ct", scope: !181, file: !2, line: 47, baseType: !287, size: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvasVisitCustomTrackFunc", file: !188, line: 34, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!164, !192, !291, !247}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCustomTrack", file: !293, line: 25, baseType: !294)
!293 = !DIFile(filename: "src/annotationsketch/custom_track_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "147295325f6bf2a4e660d91645982b91")
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtCustomTrack", file: !293, line: 25, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "draw_ruler_func", scope: !181, file: !2, line: 48, baseType: !296, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvasDrawRulerFunc", file: !188, line: 36, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!164, !192, !205, !247}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !181, file: !2, line: 49, baseType: !301, size: 64, offset: 704)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCanvasFreeFunc", file: !188, line: 37, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !192}
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!306 = !DILocalVariable(name: "size", arg: 1, scope: !174, file: !2, line: 52, type: !184)
!307 = !DILocalVariable(name: "la_visit_pre", arg: 2, scope: !174, file: !2, line: 53, type: !187)
!308 = !DILocalVariable(name: "la_visit_post", arg: 3, scope: !174, file: !2, line: 54, type: !187)
!309 = !DILocalVariable(name: "t_visit_pre", arg: 4, scope: !174, file: !2, line: 55, type: !253)
!310 = !DILocalVariable(name: "t_visit_post", arg: 5, scope: !174, file: !2, line: 56, type: !253)
!311 = !DILocalVariable(name: "l_visit_pre", arg: 6, scope: !174, file: !2, line: 57, type: !259)
!312 = !DILocalVariable(name: "l_visit_post", arg: 7, scope: !174, file: !2, line: 58, type: !259)
!313 = !DILocalVariable(name: "b_visit", arg: 8, scope: !174, file: !2, line: 59, type: !269)
!314 = !DILocalVariable(name: "e_visit", arg: 9, scope: !174, file: !2, line: 60, type: !278)
!315 = !DILocalVariable(name: "ct_visit", arg: 10, scope: !174, file: !2, line: 61, type: !287)
!316 = !DILocalVariable(name: "draw_ruler_func", arg: 11, scope: !174, file: !2, line: 62, type: !296)
!317 = !DILocalVariable(name: "free", arg: 12, scope: !174, file: !2, line: 63, type: !301)
!318 = !DILocalVariable(name: "c_class", scope: !174, file: !2, line: 65, type: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!320 = !{!321, !321, i64 0}
!321 = !{!"long", !322, i64 0}
!322 = !{!"omnipotent char", !323, i64 0}
!323 = !{!"Simple C/C++ TBAA"}
!324 = !DILocation(line: 52, column: 49, scope: !174)
!325 = !{!326, !326, i64 0}
!326 = !{!"any pointer", !322, i64 0}
!327 = !DILocation(line: 53, column: 66, scope: !174)
!328 = !DILocation(line: 54, column: 66, scope: !174)
!329 = !DILocation(line: 55, column: 65, scope: !174)
!330 = !DILocation(line: 56, column: 65, scope: !174)
!331 = !DILocation(line: 57, column: 64, scope: !174)
!332 = !DILocation(line: 58, column: 64, scope: !174)
!333 = !DILocation(line: 59, column: 65, scope: !174)
!334 = !DILocation(line: 60, column: 67, scope: !174)
!335 = !DILocation(line: 61, column: 71, scope: !174)
!336 = !DILocation(line: 62, column: 64, scope: !174)
!337 = !DILocation(line: 63, column: 59, scope: !174)
!338 = !DILocation(line: 65, column: 3, scope: !174)
!339 = !DILocation(line: 65, column: 18, scope: !174)
!340 = !DILocation(line: 65, column: 28, scope: !174)
!341 = !DILocation(line: 66, column: 19, scope: !174)
!342 = !DILocation(line: 66, column: 3, scope: !174)
!343 = !DILocation(line: 66, column: 12, scope: !174)
!344 = !DILocation(line: 66, column: 17, scope: !174)
!345 = !{!346, !321, i64 0}
!346 = !{!"GtCanvasClass", !321, i64 0, !326, i64 8, !326, i64 16, !326, i64 24, !326, i64 32, !326, i64 40, !326, i64 48, !326, i64 56, !326, i64 64, !326, i64 72, !326, i64 80, !326, i64 88}
!347 = !DILocation(line: 67, column: 33, scope: !174)
!348 = !DILocation(line: 67, column: 3, scope: !174)
!349 = !DILocation(line: 67, column: 12, scope: !174)
!350 = !DILocation(line: 67, column: 31, scope: !174)
!351 = !{!346, !326, i64 8}
!352 = !DILocation(line: 68, column: 33, scope: !174)
!353 = !DILocation(line: 68, column: 3, scope: !174)
!354 = !DILocation(line: 68, column: 12, scope: !174)
!355 = !DILocation(line: 68, column: 31, scope: !174)
!356 = !{!346, !326, i64 16}
!357 = !DILocation(line: 69, column: 33, scope: !174)
!358 = !DILocation(line: 69, column: 3, scope: !174)
!359 = !DILocation(line: 69, column: 12, scope: !174)
!360 = !DILocation(line: 69, column: 31, scope: !174)
!361 = !{!346, !326, i64 24}
!362 = !DILocation(line: 70, column: 33, scope: !174)
!363 = !DILocation(line: 70, column: 3, scope: !174)
!364 = !DILocation(line: 70, column: 12, scope: !174)
!365 = !DILocation(line: 70, column: 31, scope: !174)
!366 = !{!346, !326, i64 32}
!367 = !DILocation(line: 71, column: 33, scope: !174)
!368 = !DILocation(line: 71, column: 3, scope: !174)
!369 = !DILocation(line: 71, column: 12, scope: !174)
!370 = !DILocation(line: 71, column: 31, scope: !174)
!371 = !{!346, !326, i64 40}
!372 = !DILocation(line: 72, column: 33, scope: !174)
!373 = !DILocation(line: 72, column: 3, scope: !174)
!374 = !DILocation(line: 72, column: 12, scope: !174)
!375 = !DILocation(line: 72, column: 31, scope: !174)
!376 = !{!346, !326, i64 48}
!377 = !DILocation(line: 73, column: 33, scope: !174)
!378 = !DILocation(line: 73, column: 3, scope: !174)
!379 = !DILocation(line: 73, column: 12, scope: !174)
!380 = !DILocation(line: 73, column: 31, scope: !174)
!381 = !{!346, !326, i64 56}
!382 = !DILocation(line: 74, column: 33, scope: !174)
!383 = !DILocation(line: 74, column: 3, scope: !174)
!384 = !DILocation(line: 74, column: 12, scope: !174)
!385 = !DILocation(line: 74, column: 31, scope: !174)
!386 = !{!346, !326, i64 64}
!387 = !DILocation(line: 75, column: 33, scope: !174)
!388 = !DILocation(line: 75, column: 3, scope: !174)
!389 = !DILocation(line: 75, column: 12, scope: !174)
!390 = !DILocation(line: 75, column: 31, scope: !174)
!391 = !{!346, !326, i64 72}
!392 = !DILocation(line: 76, column: 33, scope: !174)
!393 = !DILocation(line: 76, column: 3, scope: !174)
!394 = !DILocation(line: 76, column: 12, scope: !174)
!395 = !DILocation(line: 76, column: 31, scope: !174)
!396 = !{!346, !326, i64 80}
!397 = !DILocation(line: 77, column: 19, scope: !174)
!398 = !DILocation(line: 77, column: 3, scope: !174)
!399 = !DILocation(line: 77, column: 12, scope: !174)
!400 = !DILocation(line: 77, column: 17, scope: !174)
!401 = !{!346, !326, i64 88}
!402 = !DILocation(line: 78, column: 10, scope: !174)
!403 = !DILocation(line: 79, column: 1, scope: !174)
!404 = !DILocation(line: 78, column: 3, scope: !174)
!405 = !DISubprogram(name: "gt_class_alloc", scope: !406, file: !406, line: 26, type: !407, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!406 = !DIFile(filename: "src/core/class_alloc_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c166e2d22de09702d84db7e9b43a0bbe")
!407 = !DISubroutineType(types: !408)
!408 = !{!166, !184}
!409 = distinct !DISubprogram(name: "gt_format_ruler_label", scope: !2, file: !2, line: 82, type: !410, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !159, retainedNodes: !416)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412, !413, !415, !184}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtWord", file: !162, line: 94, baseType: !414)
!414 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !428, !429}
!417 = !DILocalVariable(name: "txt", arg: 1, scope: !409, file: !2, line: 82, type: !412)
!418 = !DILocalVariable(name: "pos", arg: 2, scope: !409, file: !2, line: 82, type: !413)
!419 = !DILocalVariable(name: "unitstr", arg: 3, scope: !409, file: !2, line: 83, type: !415)
!420 = !DILocalVariable(name: "buflen", arg: 4, scope: !409, file: !2, line: 83, type: !184)
!421 = !DILocalVariable(name: "fpos", scope: !409, file: !2, line: 85, type: !165)
!422 = !DILocalVariable(name: "logval", scope: !409, file: !2, line: 86, type: !164)
!423 = !DILocalVariable(name: "formatstring", scope: !409, file: !2, line: 87, type: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStr", file: !426, line: 27, baseType: !427)
!426 = !DIFile(filename: "src/core/str_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "654ceffd2f9ff17a42a8522fe21401e1")
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStr", file: !426, line: 27, flags: DIFlagFwdDecl)
!428 = !DILocalVariable(name: "upos", scope: !409, file: !2, line: 88, type: !161)
!429 = !DILocalVariable(name: "negative", scope: !409, file: !2, line: 90, type: !227)
!430 = !DILocation(line: 82, column: 34, scope: !409)
!431 = !DILocation(line: 82, column: 46, scope: !409)
!432 = !DILocation(line: 83, column: 40, scope: !409)
!433 = !DILocation(line: 83, column: 56, scope: !409)
!434 = !DILocation(line: 85, column: 3, scope: !409)
!435 = !DILocation(line: 85, column: 10, scope: !409)
!436 = !DILocation(line: 86, column: 3, scope: !409)
!437 = !DILocation(line: 86, column: 7, scope: !409)
!438 = !DILocation(line: 87, column: 3, scope: !409)
!439 = !DILocation(line: 87, column: 10, scope: !409)
!440 = !DILocation(line: 88, column: 3, scope: !409)
!441 = !DILocation(line: 88, column: 11, scope: !409)
!442 = !DILocation(line: 89, column: 3, scope: !409)
!443 = !DILocation(line: 89, column: 3, scope: !444)
!444 = distinct !DILexicalBlock(scope: !445, file: !2, line: 89, column: 3)
!445 = distinct !DILexicalBlock(scope: !409, file: !2, line: 89, column: 3)
!446 = !DILocation(line: 89, column: 3, scope: !445)
!447 = !DILocation(line: 89, column: 3, scope: !448)
!448 = distinct !DILexicalBlock(scope: !444, file: !2, line: 89, column: 3)
!449 = !DILocation(line: 90, column: 3, scope: !409)
!450 = !DILocation(line: 90, column: 8, scope: !409)
!451 = !{!452, !452, i64 0}
!452 = !{!"_Bool", !322, i64 0}
!453 = !DILocation(line: 92, column: 7, scope: !454)
!454 = distinct !DILexicalBlock(scope: !409, file: !2, line: 92, column: 7)
!455 = !DILocation(line: 92, column: 11, scope: !454)
!456 = !DILocation(line: 92, column: 7, scope: !409)
!457 = !DILocation(line: 94, column: 22, scope: !458)
!458 = distinct !DILexicalBlock(scope: !454, file: !2, line: 93, column: 3)
!459 = !DILocation(line: 94, column: 21, scope: !458)
!460 = !DILocation(line: 94, column: 10, scope: !458)
!461 = !DILocation(line: 95, column: 14, scope: !458)
!462 = !DILocation(line: 96, column: 20, scope: !458)
!463 = !DILocation(line: 96, column: 18, scope: !458)
!464 = !DILocation(line: 97, column: 3, scope: !458)
!465 = !DILocation(line: 100, column: 21, scope: !466)
!466 = distinct !DILexicalBlock(scope: !454, file: !2, line: 99, column: 3)
!467 = !DILocation(line: 100, column: 10, scope: !466)
!468 = !DILocation(line: 101, column: 20, scope: !466)
!469 = !DILocation(line: 101, column: 18, scope: !466)
!470 = !DILocation(line: 103, column: 30, scope: !409)
!471 = !DILocation(line: 103, column: 24, scope: !409)
!472 = !DILocation(line: 103, column: 18, scope: !409)
!473 = !DILocation(line: 103, column: 12, scope: !409)
!474 = !DILocation(line: 103, column: 10, scope: !409)
!475 = !{!476, !476, i64 0}
!476 = !{!"int", !322, i64 0}
!477 = !DILocation(line: 104, column: 7, scope: !478)
!478 = distinct !DILexicalBlock(scope: !409, file: !2, line: 104, column: 7)
!479 = !DILocation(line: 104, column: 12, scope: !478)
!480 = !DILocation(line: 104, column: 7, scope: !409)
!481 = !DILocation(line: 106, column: 21, scope: !482)
!482 = distinct !DILexicalBlock(scope: !478, file: !2, line: 105, column: 3)
!483 = !DILocation(line: 106, column: 12, scope: !482)
!484 = !DILocation(line: 106, column: 26, scope: !482)
!485 = !DILocation(line: 106, column: 10, scope: !482)
!486 = !{!487, !487, i64 0}
!487 = !{!"double", !322, i64 0}
!488 = !DILocation(line: 107, column: 5, scope: !482)
!489 = !DILocation(line: 107, column: 12, scope: !482)
!490 = !DILocation(line: 107, column: 17, scope: !482)
!491 = !DILocation(line: 107, column: 22, scope: !482)
!492 = !DILocation(line: 109, column: 12, scope: !493)
!493 = distinct !DILexicalBlock(scope: !482, file: !2, line: 108, column: 5)
!494 = !DILocation(line: 110, column: 13, scope: !493)
!495 = distinct !{!495, !488, !496, !497}
!496 = !DILocation(line: 111, column: 5, scope: !482)
!497 = !{!"llvm.loop.mustprogress"}
!498 = !DILocation(line: 113, column: 25, scope: !482)
!499 = !DILocation(line: 113, column: 49, scope: !482)
!500 = !DILocation(line: 113, column: 39, scope: !482)
!501 = !DILocation(line: 113, column: 5, scope: !482)
!502 = !DILocation(line: 114, column: 24, scope: !482)
!503 = !DILocation(line: 114, column: 5, scope: !482)
!504 = !DILocation(line: 115, column: 21, scope: !482)
!505 = !DILocation(line: 115, column: 26, scope: !482)
!506 = !DILocation(line: 115, column: 45, scope: !482)
!507 = !DILocation(line: 115, column: 34, scope: !482)
!508 = !DILocation(line: 115, column: 60, scope: !482)
!509 = !DILocation(line: 115, column: 66, scope: !482)
!510 = !DILocation(line: 115, column: 12, scope: !482)
!511 = !DILocation(line: 117, column: 3, scope: !482)
!512 = !DILocation(line: 118, column: 12, scope: !513)
!513 = distinct !DILexicalBlock(scope: !478, file: !2, line: 118, column: 12)
!514 = !DILocation(line: 118, column: 17, scope: !513)
!515 = !DILocation(line: 118, column: 12, scope: !478)
!516 = !DILocation(line: 120, column: 21, scope: !517)
!517 = distinct !DILexicalBlock(scope: !513, file: !2, line: 119, column: 3)
!518 = !DILocation(line: 120, column: 12, scope: !517)
!519 = !DILocation(line: 120, column: 26, scope: !517)
!520 = !DILocation(line: 120, column: 10, scope: !517)
!521 = !DILocation(line: 121, column: 5, scope: !517)
!522 = !DILocation(line: 121, column: 12, scope: !517)
!523 = !DILocation(line: 121, column: 17, scope: !517)
!524 = !DILocation(line: 121, column: 22, scope: !517)
!525 = !DILocation(line: 123, column: 12, scope: !526)
!526 = distinct !DILexicalBlock(scope: !517, file: !2, line: 122, column: 5)
!527 = !DILocation(line: 124, column: 13, scope: !526)
!528 = distinct !{!528, !521, !529, !497}
!529 = !DILocation(line: 125, column: 5, scope: !517)
!530 = !DILocation(line: 127, column: 25, scope: !517)
!531 = !DILocation(line: 127, column: 49, scope: !517)
!532 = !DILocation(line: 127, column: 39, scope: !517)
!533 = !DILocation(line: 127, column: 5, scope: !517)
!534 = !DILocation(line: 128, column: 24, scope: !517)
!535 = !DILocation(line: 128, column: 5, scope: !517)
!536 = !DILocation(line: 129, column: 21, scope: !517)
!537 = !DILocation(line: 129, column: 26, scope: !517)
!538 = !DILocation(line: 129, column: 45, scope: !517)
!539 = !DILocation(line: 129, column: 34, scope: !517)
!540 = !DILocation(line: 129, column: 60, scope: !517)
!541 = !DILocation(line: 129, column: 66, scope: !517)
!542 = !DILocation(line: 129, column: 12, scope: !517)
!543 = !DILocation(line: 131, column: 3, scope: !517)
!544 = !DILocation(line: 132, column: 12, scope: !545)
!545 = distinct !DILexicalBlock(scope: !513, file: !2, line: 132, column: 12)
!546 = !DILocation(line: 132, column: 17, scope: !545)
!547 = !DILocation(line: 132, column: 12, scope: !513)
!548 = !DILocation(line: 134, column: 21, scope: !549)
!549 = distinct !DILexicalBlock(scope: !545, file: !2, line: 133, column: 3)
!550 = !DILocation(line: 134, column: 12, scope: !549)
!551 = !DILocation(line: 134, column: 26, scope: !549)
!552 = !DILocation(line: 134, column: 10, scope: !549)
!553 = !DILocation(line: 135, column: 5, scope: !549)
!554 = !DILocation(line: 135, column: 12, scope: !549)
!555 = !DILocation(line: 135, column: 17, scope: !549)
!556 = !DILocation(line: 135, column: 22, scope: !549)
!557 = !DILocation(line: 137, column: 12, scope: !558)
!558 = distinct !DILexicalBlock(scope: !549, file: !2, line: 136, column: 5)
!559 = !DILocation(line: 138, column: 13, scope: !558)
!560 = distinct !{!560, !553, !561, !497}
!561 = !DILocation(line: 139, column: 5, scope: !549)
!562 = !DILocation(line: 141, column: 25, scope: !549)
!563 = !DILocation(line: 141, column: 49, scope: !549)
!564 = !DILocation(line: 141, column: 39, scope: !549)
!565 = !DILocation(line: 141, column: 5, scope: !549)
!566 = !DILocation(line: 142, column: 24, scope: !549)
!567 = !DILocation(line: 142, column: 5, scope: !549)
!568 = !DILocation(line: 143, column: 21, scope: !549)
!569 = !DILocation(line: 143, column: 26, scope: !549)
!570 = !DILocation(line: 143, column: 45, scope: !549)
!571 = !DILocation(line: 143, column: 34, scope: !549)
!572 = !DILocation(line: 143, column: 60, scope: !549)
!573 = !DILocation(line: 143, column: 66, scope: !549)
!574 = !DILocation(line: 143, column: 12, scope: !549)
!575 = !DILocation(line: 145, column: 3, scope: !549)
!576 = !DILocation(line: 147, column: 21, scope: !577)
!577 = distinct !DILexicalBlock(scope: !545, file: !2, line: 145, column: 10)
!578 = !DILocation(line: 147, column: 26, scope: !577)
!579 = !DILocation(line: 147, column: 50, scope: !577)
!580 = !{i8 0, i8 2}
!581 = !{}
!582 = !DILocation(line: 147, column: 71, scope: !577)
!583 = !DILocation(line: 148, column: 9, scope: !577)
!584 = !DILocation(line: 147, column: 12, scope: !577)
!585 = !DILocation(line: 152, column: 17, scope: !409)
!586 = !DILocation(line: 152, column: 3, scope: !409)
!587 = !DILocation(line: 153, column: 1, scope: !409)
!588 = !DISubprogram(name: "fprintf", scope: !589, file: !589, line: 350, type: !590, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!589 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!590 = !DISubroutineType(types: !591)
!591 = !{!164, !592, !643, null}
!592 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !595, line: 7, baseType: !596)
!595 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !597, line: 49, size: 1728, elements: !598)
!597 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !614, !616, !617, !618, !621, !623, !625, !626, !629, !631, !634, !637, !638, !639, !640, !641}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !596, file: !597, line: 51, baseType: !164, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !596, file: !597, line: 54, baseType: !412, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !596, file: !597, line: 55, baseType: !412, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !596, file: !597, line: 56, baseType: !412, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !596, file: !597, line: 57, baseType: !412, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !596, file: !597, line: 58, baseType: !412, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !596, file: !597, line: 59, baseType: !412, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !596, file: !597, line: 60, baseType: !412, size: 64, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !596, file: !597, line: 61, baseType: !412, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !596, file: !597, line: 64, baseType: !412, size: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !596, file: !597, line: 65, baseType: !412, size: 64, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !596, file: !597, line: 66, baseType: !412, size: 64, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !596, file: !597, line: 68, baseType: !612, size: 64, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !597, line: 36, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !596, file: !597, line: 70, baseType: !615, size: 64, offset: 832)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !596, file: !597, line: 72, baseType: !164, size: 32, offset: 896)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !596, file: !597, line: 73, baseType: !164, size: 32, offset: 928)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !596, file: !597, line: 74, baseType: !619, size: 64, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !620, line: 152, baseType: !414)
!620 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !596, file: !597, line: 77, baseType: !622, size: 16, offset: 1024)
!622 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !596, file: !597, line: 78, baseType: !624, size: 8, offset: 1040)
!624 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !596, file: !597, line: 79, baseType: !51, size: 8, offset: 1048)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !596, file: !597, line: 81, baseType: !627, size: 64, offset: 1088)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !597, line: 43, baseType: null)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !596, file: !597, line: 89, baseType: !630, size: 64, offset: 1152)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !620, line: 153, baseType: !414)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !596, file: !597, line: 91, baseType: !632, size: 64, offset: 1216)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !597, line: 37, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !596, file: !597, line: 92, baseType: !635, size: 64, offset: 1280)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !597, line: 38, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !596, file: !597, line: 93, baseType: !615, size: 64, offset: 1344)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !596, file: !597, line: 94, baseType: !166, size: 64, offset: 1408)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !596, file: !597, line: 95, baseType: !184, size: 64, offset: 1472)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !596, file: !597, line: 96, baseType: !164, size: 32, offset: 1536)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !596, file: !597, line: 98, baseType: !642, size: 160, offset: 1568)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !157)
!643 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !415)
!644 = !DISubprogram(name: "abort", scope: !645, file: !645, line: 598, type: !646, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!645 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!646 = !DISubroutineType(types: !647)
!647 = !{null}
!648 = !DISubprogram(name: "gt_str_new_cstr", scope: !426, file: !426, line: 32, type: !649, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!649 = !DISubroutineType(types: !650)
!650 = !{!424, !415}
!651 = !DISubprogram(name: "log10", scope: !652, file: !652, line: 107, type: !653, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!652 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "", checksumkind: CSK_MD5, checksum: "8c6e2d0d2bda65bc5ba1ca02b65383b7")
!653 = !DISubroutineType(types: !654)
!654 = !{!165, !165}
!655 = !DISubprogram(name: "gt_str_append_uword", scope: !426, file: !426, line: 61, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !424, !161}
!658 = !DISubprogram(name: "gt_str_append_cstr", scope: !426, file: !426, line: 46, type: !659, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !424, !415}
!661 = !DISubprogram(name: "snprintf", scope: !589, file: !589, line: 378, type: !662, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!662 = !DISubroutineType(types: !663)
!663 = !{!164, !664, !184, !643, null}
!664 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !412)
!665 = !DISubprogram(name: "gt_str_get", scope: !426, file: !426, line: 40, type: !666, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!666 = !DISubroutineType(types: !667)
!667 = !{!412, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!670 = !DISubprogram(name: "gt_str_delete", scope: !426, file: !426, line: 90, type: !671, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !424}
!673 = distinct !DISubprogram(name: "gt_canvas_draw_ruler", scope: !2, file: !2, line: 155, type: !298, scopeLine: 156, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !159, retainedNodes: !674)
!674 = !{!675, !676, !677}
!675 = !DILocalVariable(name: "canvas", arg: 1, scope: !673, file: !2, line: 155, type: !192)
!676 = !DILocalVariable(name: "rng", arg: 2, scope: !673, file: !2, line: 155, type: !205)
!677 = !DILocalVariable(name: "err", arg: 3, scope: !673, file: !2, line: 155, type: !247)
!678 = !DILocation(line: 155, column: 36, scope: !673)
!679 = !DILocation(line: 155, column: 52, scope: !673)
!680 = !DILocation(line: 155, column: 66, scope: !673)
!681 = !DILocation(line: 157, column: 3, scope: !673)
!682 = !DILocation(line: 157, column: 3, scope: !683)
!683 = distinct !DILexicalBlock(scope: !684, file: !2, line: 157, column: 3)
!684 = distinct !DILexicalBlock(scope: !673, file: !2, line: 157, column: 3)
!685 = !DILocation(line: 157, column: 3, scope: !684)
!686 = !DILocation(line: 157, column: 3, scope: !687)
!687 = distinct !DILexicalBlock(scope: !683, file: !2, line: 157, column: 3)
!688 = !DILocation(line: 158, column: 10, scope: !673)
!689 = !DILocation(line: 158, column: 18, scope: !673)
!690 = !{!691, !326, i64 0}
!691 = !{!"GtCanvas", !326, i64 0, !326, i64 8}
!692 = !DILocation(line: 158, column: 27, scope: !673)
!693 = !DILocation(line: 158, column: 43, scope: !673)
!694 = !DILocation(line: 158, column: 56, scope: !673)
!695 = !DILocation(line: 158, column: 3, scope: !673)
