; ModuleID = 'samples/844.bc'
source_filename = "src/match/esa-lcpintervals.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Elcpstate = type { %struct.Lcpinterval, ptr, ptr }
%struct.Lcpinterval = type { i64, i64, i64 }
%struct.Largelcpvalue = type { i64, i64 }
%struct.Sequentialsuffixarrayreader = type { ptr, i64, i64, i64, i64, i64, ptr, ptr, i8, ptr, i32 }
%struct.Suffixarray = type { ptr, %struct.Definedunsignedlong, %struct.Definedunsignedlong, %struct.Defineddouble, %struct.Definedunsignedlong, i32, i8, i64, ptr, ptr, ptr, ptr, i32, ptr, %struct.GtBufferedfile_uint32_t, %struct.GtBufferedfile_GtUword, %struct.GtBufferedfile_GtUchar, %struct.GtBufferedfile_GtUchar, %struct.GtBufferedfile_Largelcpvalue }
%struct.Defineddouble = type { i8, double }
%struct.Definedunsignedlong = type { i8, i64 }
%struct.GtBufferedfile_uint32_t = type { i32, i32, ptr, ptr }
%struct.GtBufferedfile_GtUword = type { i32, i32, ptr, ptr }
%struct.GtBufferedfile_GtUchar = type { i32, i32, ptr, ptr }
%struct.GtBufferedfile_Largelcpvalue = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [29 x i8] c"src/match/esa-lcpintervals.c\00", align 1, !dbg !0
@stderr = external global ptr, align 8

!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 90)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(scope: null, file: !2, line: 294, type: !74, isLocal: true, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 34)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(scope: null, file: !2, line: 294, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 8)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(scope: null, file: !2, line: 294, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 24)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(scope: null, file: !2, line: 294, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 9)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(scope: null, file: !2, line: 300, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !24)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(scope: null, file: !2, line: 306, type: !97, isLocal: true, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 15)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !2, line: 307, type: !97, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !104, line: 54, type: !79, isLocal: true, isDefinition: true)
!104 = !DIFile(filename: "src/match/sarr-def.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "680305296307322e88a803109233df34")
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !104, line: 57, type: !43, isLocal: true, isDefinition: true)
!107 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !108, retainedTypes: !117, globals: !158, splitDebugInlining: false, nameTableKind: None)
!108 = !{!109}
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GtReadmode", file: !110, line: 23, baseType: !111, size: 32, elements: !112)
!110 = !DIFile(filename: "src/core/readmode_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1b062e226e296972a431b9bfcad13aa9")
!111 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!112 = !{!113, !114, !115, !116}
!113 = !DIEnumerator(name: "GT_READMODE_FORWARD", value: 0)
!114 = !DIEnumerator(name: "GT_READMODE_REVERSE", value: 1)
!115 = !DIEnumerator(name: "GT_READMODE_COMPL", value: 2)
!116 = !DIEnumerator(name: "GT_READMODE_REVCOMPL", value: 3)
!117 = !{!118, !119, !123, !126, !137, !150, !152, !132, !111, !156}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dfsstate", file: !121, line: 27, baseType: !122)
!121 = !DIFile(filename: "src/match/esa-dfs.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "5851b1a4629a3d9ba3b6b54f4b70537b")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dfsstate", file: !121, line: 27, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dfsinfo", file: !121, line: 26, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dfsinfo", file: !121, line: 26, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lcpinterval", file: !128, line: 28, baseType: !129)
!128 = !DIFile(filename: "src/match/lcpinterval.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "f84ce0d1ab0e926c629db5b5fc519a43")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 23, size: 192, elements: !130)
!130 = !{!131, !135, !136}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !129, file: !128, line: 25, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !133, line: 83, baseType: !134)
!133 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!134 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !129, file: !128, line: 26, baseType: !132, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !129, file: !128, line: 27, baseType: !132, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elcpstate", file: !2, line: 32, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 27, size: 320, elements: !140)
!140 = !{!141, !142, !149}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "lastcompletenode", scope: !139, file: !2, line: 29, baseType: !127, size: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "processlcpinterval", scope: !139, file: !2, line: 30, baseType: !143, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !118, !147}
!146 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "processinfo", scope: !139, file: !2, line: 31, baseType: !118, size: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUchar", file: !133, line: 102, baseType: !151)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !153, line: 24, baseType: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !155, line: 38, baseType: !151)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !157, line: 70, baseType: !134)
!157 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!158 = !{!0, !7, !12, !17, !21, !26, !31, !36, !41, !44, !49, !54, !59, !62, !67, !72, !77, !82, !87, !92, !95, !100, !102, !105}
!159 = !{i32 7, !"Dwarf Version", i32 5}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{i32 1, !"wchar_size", i32 4}
!162 = !{i32 8, !"PIC Level", i32 2}
!163 = !{i32 7, !"uwtable", i32 2}
!164 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!165 = distinct !DISubprogram(name: "gt_processlcpintervals", scope: !2, file: !2, line: 132, type: !166, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !107, retainedNodes: !343)
!166 = !DISubroutineType(types: !167)
!167 = !{!146, !168, !143, !118, !335, !339}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequentialsuffixarrayreader", file: !170, line: 42, baseType: !171)
!170 = !DIFile(filename: "src/match/esa-seqread.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7d5afd2dc9fb2e0962102c19c42622ee")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequentialsuffixarrayreader", file: !170, line: 27, size: 704, elements: !172)
!172 = !{!173, !323, !324, !325, !326, !327, !328, !329, !332, !333, !334}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "suffixarray", scope: !171, file: !170, line: 29, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "Suffixarray", file: !104, line: 88, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 63, size: 2048, elements: !177)
!177 = !{!178, !183, !191, !192, !199, !200, !202, !203, !204, !208, !211, !220, !221, !222, !227, !294, !304, !313, !314}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "encseq", scope: !176, file: !104, line: 65, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseq", file: !181, line: 48, baseType: !182)
!181 = !DIFile(filename: "src/core/encseq_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "bab4512cadee996edd2995020539d931")
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncseq", file: !181, line: 48, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "numoflargelcpvalues", scope: !176, file: !104, line: 66, baseType: !184, size: 128, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "Definedunsignedlong", file: !185, line: 28, baseType: !186)
!185 = !DIFile(filename: "src/core/defined-types.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e7a1f5519c7b299f300cac0dd118ae65")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 24, size: 128, elements: !187)
!187 = !{!188, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "defined", scope: !186, file: !185, line: 26, baseType: !189, size: 8)
!189 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "valueunsignedlong", scope: !186, file: !185, line: 27, baseType: !132, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "maxbranchdepth", scope: !176, file: !104, line: 67, baseType: !184, size: 128, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "averagelcp", scope: !176, file: !104, line: 68, baseType: !193, size: 128, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "Defineddouble", file: !185, line: 40, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 36, size: 128, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "defined", scope: !194, file: !185, line: 38, baseType: !189, size: 8)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "valuedouble", scope: !194, file: !185, line: 39, baseType: !198, size: 64, offset: 64)
!198 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "longest", scope: !176, file: !104, line: 69, baseType: !184, size: 128, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "readmode", scope: !176, file: !104, line: 70, baseType: !201, size: 32, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtReadmode", file: !110, line: 32, baseType: !109)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mirroredencseq", scope: !176, file: !104, line: 71, baseType: !189, size: 8, offset: 608)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "numberofallsortedsuffixes", scope: !176, file: !104, line: 72, baseType: !132, size: 64, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "suftab", scope: !176, file: !104, line: 74, baseType: !205, size: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESASuffixptr", file: !104, line: 59, baseType: !132)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lcptab", scope: !176, file: !104, line: 75, baseType: !209, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "llvtab", scope: !176, file: !104, line: 76, baseType: !212, size: 64, offset: 832)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "Largelcpvalue", file: !215, line: 30, baseType: !216)
!215 = !DIFile(filename: "src/match/lcpoverflow.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "fbf9328cf0deca32f53d590fbcd3426d")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 26, size: 128, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !216, file: !215, line: 28, baseType: !132, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !216, file: !215, line: 29, baseType: !132, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "bwttab", scope: !176, file: !104, line: 77, baseType: !209, size: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlength", scope: !176, file: !104, line: 78, baseType: !111, size: 32, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bcktab", scope: !176, file: !104, line: 79, baseType: !223, size: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBcktab", file: !225, line: 49, baseType: !226)
!225 = !DIFile(filename: "src/match/bcktab.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1e275b447e1ba6b734897fa227cc90a3")
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtBcktab", file: !225, line: 49, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "suftabstream_uint32_t", scope: !176, file: !104, line: 82, baseType: !228, size: 192, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_uint32_t", file: !104, line: 49, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 49, size: 192, elements: !230)
!230 = !{!231, !232, !233, !237}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !229, file: !104, line: 49, baseType: !111, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !229, file: !104, line: 49, baseType: !111, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !229, file: !104, line: 49, baseType: !234, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !153, line: 26, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !155, line: 42, baseType: !111)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !229, file: !104, line: 49, baseType: !238, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !240, line: 7, baseType: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !242, line: 49, size: 1728, elements: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!243 = !{!244, !245, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !260, !262, !263, !264, !267, !269, !271, !275, !278, !280, !283, !286, !287, !288, !289, !290}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !241, file: !242, line: 51, baseType: !146, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !241, file: !242, line: 54, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !241, file: !242, line: 55, baseType: !246, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !241, file: !242, line: 56, baseType: !246, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !241, file: !242, line: 57, baseType: !246, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !241, file: !242, line: 58, baseType: !246, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !241, file: !242, line: 59, baseType: !246, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !241, file: !242, line: 60, baseType: !246, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !241, file: !242, line: 61, baseType: !246, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !241, file: !242, line: 64, baseType: !246, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !241, file: !242, line: 65, baseType: !246, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !241, file: !242, line: 66, baseType: !246, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !241, file: !242, line: 68, baseType: !258, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !242, line: 36, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !241, file: !242, line: 70, baseType: !261, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !241, file: !242, line: 72, baseType: !146, size: 32, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !241, file: !242, line: 73, baseType: !146, size: 32, offset: 928)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !241, file: !242, line: 74, baseType: !265, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !155, line: 152, baseType: !266)
!266 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !241, file: !242, line: 77, baseType: !268, size: 16, offset: 1024)
!268 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !241, file: !242, line: 78, baseType: !270, size: 8, offset: 1040)
!270 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !241, file: !242, line: 79, baseType: !272, size: 8, offset: 1048)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 1)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !241, file: !242, line: 81, baseType: !276, size: 64, offset: 1088)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !242, line: 43, baseType: null)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !241, file: !242, line: 89, baseType: !279, size: 64, offset: 1152)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !155, line: 153, baseType: !266)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !241, file: !242, line: 91, baseType: !281, size: 64, offset: 1216)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !242, line: 37, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !241, file: !242, line: 92, baseType: !284, size: 64, offset: 1280)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !242, line: 38, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !241, file: !242, line: 93, baseType: !261, size: 64, offset: 1344)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !241, file: !242, line: 94, baseType: !118, size: 64, offset: 1408)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !241, file: !242, line: 95, baseType: !156, size: 64, offset: 1472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !241, file: !242, line: 96, baseType: !146, size: 32, offset: 1536)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !241, file: !242, line: 98, baseType: !291, size: 160, offset: 1568)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 20)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "suftabstream_GtUword", scope: !176, file: !104, line: 84, baseType: !295, size: 192, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_GtUword", file: !296, line: 61, baseType: !297)
!296 = !DIFile(filename: "src/match/declare-readfunc.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "efed3a700136885dfbda6df2e18c991e")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 61, size: 192, elements: !298)
!298 = !{!299, !300, !301, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !297, file: !296, line: 61, baseType: !111, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !297, file: !296, line: 61, baseType: !111, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !297, file: !296, line: 61, baseType: !302, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !297, file: !296, line: 61, baseType: !238, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "bwttabstream", scope: !176, file: !104, line: 85, baseType: !305, size: 192, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_GtUchar", file: !104, line: 53, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 53, size: 192, elements: !307)
!307 = !{!308, !309, !310, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !306, file: !104, line: 53, baseType: !111, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !306, file: !104, line: 53, baseType: !111, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !306, file: !104, line: 53, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !306, file: !104, line: 53, baseType: !238, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "lcptabstream", scope: !176, file: !104, line: 86, baseType: !305, size: 192, offset: 1664)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "llvtabstream", scope: !176, file: !104, line: 87, baseType: !315, size: 192, offset: 1856)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBufferedfile_Largelcpvalue", file: !104, line: 56, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 56, size: 192, elements: !317)
!317 = !{!318, !319, !320, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "nextfree", scope: !316, file: !104, line: 56, baseType: !111, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "nextread", scope: !316, file: !104, line: 56, baseType: !111, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "bufferedfilespace", scope: !316, file: !104, line: 56, baseType: !321, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !316, file: !104, line: 56, baseType: !238, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nonspecials", scope: !171, file: !170, line: 30, baseType: !132, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "numberofsuffixes", scope: !171, file: !170, line: 31, baseType: !132, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "nextsuftabindex", scope: !171, file: !170, line: 32, baseType: !132, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "nextlcptabindex", scope: !171, file: !170, line: 33, baseType: !132, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "largelcpindex", scope: !171, file: !170, line: 34, baseType: !132, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "suftab", scope: !171, file: !170, line: 35, baseType: !205, size: 64, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "encseq", scope: !171, file: !170, line: 36, baseType: !330, size: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "scanfile", scope: !171, file: !170, line: 37, baseType: !189, size: 8, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "extrainfo", scope: !171, file: !170, line: 38, baseType: !118, size: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "readmode", scope: !171, file: !170, line: 39, baseType: !201, size: 32, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtLogger", file: !337, line: 26, baseType: !338)
!337 = !DIFile(filename: "src/core/logger_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "076ebb09feb7de7a97ee09fc11eb7134")
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtLogger", file: !337, line: 26, flags: DIFlagFwdDecl)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !341, line: 44, baseType: !342)
!341 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !341, line: 44, flags: DIFlagFwdDecl)
!343 = !{!344, !345, !346, !347, !348, !349, !350}
!344 = !DILocalVariable(name: "ssar", arg: 1, scope: !165, file: !2, line: 132, type: !168)
!345 = !DILocalVariable(name: "processfunction", arg: 2, scope: !165, file: !2, line: 133, type: !143)
!346 = !DILocalVariable(name: "processinfo", arg: 3, scope: !165, file: !2, line: 134, type: !118)
!347 = !DILocalVariable(name: "logger", arg: 4, scope: !165, file: !2, line: 135, type: !335)
!348 = !DILocalVariable(name: "err", arg: 5, scope: !165, file: !2, line: 136, type: !339)
!349 = !DILocalVariable(name: "state", scope: !165, file: !2, line: 138, type: !137)
!350 = !DILocalVariable(name: "haserr", scope: !165, file: !2, line: 139, type: !189)
!351 = !{!352, !352, i64 0}
!352 = !{!"any pointer", !353, i64 0}
!353 = !{!"omnipotent char", !354, i64 0}
!354 = !{!"Simple C/C++ TBAA"}
!355 = !DILocation(line: 132, column: 57, scope: !165)
!356 = !DILocation(line: 133, column: 34, scope: !165)
!357 = !DILocation(line: 134, column: 34, scope: !165)
!358 = !DILocation(line: 135, column: 38, scope: !165)
!359 = !DILocation(line: 136, column: 37, scope: !165)
!360 = !DILocation(line: 138, column: 3, scope: !165)
!361 = !DILocation(line: 138, column: 14, scope: !165)
!362 = !DILocation(line: 139, column: 3, scope: !165)
!363 = !DILocation(line: 139, column: 8, scope: !165)
!364 = !{!365, !365, i64 0}
!365 = !{!"_Bool", !353, i64 0}
!366 = !DILocation(line: 141, column: 11, scope: !165)
!367 = !DILocation(line: 141, column: 9, scope: !165)
!368 = !DILocation(line: 142, column: 31, scope: !165)
!369 = !DILocation(line: 142, column: 3, scope: !165)
!370 = !DILocation(line: 142, column: 10, scope: !165)
!371 = !DILocation(line: 142, column: 29, scope: !165)
!372 = !{!373, !352, i64 24}
!373 = !{!"", !374, i64 0, !352, i64 24, !352, i64 32}
!374 = !{!"", !375, i64 0, !375, i64 8, !375, i64 16}
!375 = !{!"long", !353, i64 0}
!376 = !DILocation(line: 143, column: 24, scope: !165)
!377 = !DILocation(line: 143, column: 3, scope: !165)
!378 = !DILocation(line: 143, column: 10, scope: !165)
!379 = !DILocation(line: 143, column: 22, scope: !165)
!380 = !{!373, !352, i64 32}
!381 = !DILocation(line: 144, column: 24, scope: !382)
!382 = distinct !DILexicalBlock(scope: !165, file: !2, line: 144, column: 7)
!383 = !DILocation(line: 147, column: 24, scope: !382)
!384 = !DILocation(line: 147, column: 31, scope: !382)
!385 = !DILocation(line: 147, column: 50, scope: !382)
!386 = !DILocation(line: 149, column: 24, scope: !382)
!387 = !DILocation(line: 149, column: 31, scope: !382)
!388 = !DILocation(line: 149, column: 50, scope: !382)
!389 = !DILocation(line: 154, column: 37, scope: !382)
!390 = !DILocation(line: 155, column: 24, scope: !382)
!391 = !DILocation(line: 156, column: 24, scope: !382)
