; ModuleID = 'samples/846.bc'
source_filename = "syst.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_t = type { ptr, i32, i32, i32, i32 }
%struct.perf_event_desc_t = type { %struct.perf_event_attr, [3 x i64], [3 x i64], ptr, i64, ptr, i64, i32, i32, i32, i32, i32, ptr }
%struct.perf_event_attr = type { i32, i32, i64, %union.anon, i64, i64, i64, %union.anon.0, i32, %union.anon.1, %union.anon.2, i64, i64, i32, i32, i64, i32, i16, i16, i32, i32, i64 }
%union.anon = type { i64 }
%union.anon.0 = type { i32 }
%union.anon.1 = type { i64 }
%union.anon.2 = type { i64 }

@options = internal global %struct.options_t zeroinitializer, align 8, !dbg !0
@all_fds = internal global ptr null, align 8, !dbg !314
@num_fds = internal global ptr null, align 8, !dbg !425
@.str = private unnamed_addr constant [21 x i8] c"cannot setup events\0A\00", align 1, !dbg !247
@.str.1 = private unnamed_addr constant [32 x i8] c"cannot attach event to CPU%d %s\00", align 1, !dbg !252
@.str.2 = private unnamed_addr constant [46 x i8] c"<press CTRL-C to quit before %ds time limit>\0A\00", align 1, !dbg !257
@.str.3 = private unnamed_addr constant [39 x i8] c"cannot get number of online processors\00", align 1, !dbg !262
@.str.4 = private unnamed_addr constant [47 x i8] c"cannot allocate memory for internal structures\00", align 1, !dbg !267

!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 168, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 21)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !3, line: 73, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 256, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 32)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 368, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 46)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !3, line: 91, type: !264, isLocal: true, isDefinition: true)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 312, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 39)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(scope: null, file: !3, line: 104, type: !269, isLocal: true, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 376, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 47)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !3, line: 118, type: !274, isLocal: true, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 192, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 24)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !3, line: 126, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 200, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 25)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !3, line: 136, type: !274, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !3, line: 138, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 184, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 23)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !3, line: 149, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 504, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 63)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !3, line: 183, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 80, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 10)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !3, line: 204, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 112, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 14)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !3, line: 211, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 160, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 20)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !3, line: 215, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 272, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 34)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "all_fds", scope: !2, file: !3, line: 46, type: !316, isLocal: true, isDefinition: true)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "perf_event_desc_t", file: !319, line: 46, baseType: !320)
!319 = !DIFile(filename: "./perf_util.h", directory: "/local-ssd/libpfm4-eymjeez6kzzocrqb5p6y26hpb2o7cj4q-build/aidengro/spack-stage-libpfm4-4.13.0-eymjeez6kzzocrqb5p6y26hpb2o7cj4q/spack-src/perf_examples", checksumkind: CSK_MD5, checksum: "58f19a98364ac4cdad39b353d918f35f")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 32, size: 1920, elements: !321)
!321 = !{!322, !408, !412, !413, !414, !415, !416, !419, !420, !421, !422, !423, !424}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !320, file: !319, line: 33, baseType: !323, size: 1024)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perf_event_attr", file: !6, line: 260, size: 1024, elements: !324)
!324 = !{!325, !328, !329, !330, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !380, !381, !386, !391, !392, !393, !394, !398, !399, !400, !404, !405, !406, !407}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !323, file: !6, line: 261, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !237, line: 26, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !239, line: 42, baseType: !7)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !323, file: !6, line: 262, baseType: !326, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !323, file: !6, line: 263, baseType: !236, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, scope: !323, file: !6, line: 265, baseType: !331, size: 64, offset: 128)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !323, file: !6, line: 265, size: 64, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sample_period", scope: !331, file: !6, line: 266, baseType: !236, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sample_freq", scope: !331, file: !6, line: 267, baseType: !236, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sample_type", scope: !323, file: !6, line: 270, baseType: !236, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "read_format", scope: !323, file: !6, line: 271, baseType: !236, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !323, file: !6, line: 273, baseType: !236, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "inherit", scope: !323, file: !6, line: 274, baseType: !236, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pinned", scope: !323, file: !6, line: 275, baseType: !236, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "exclusive", scope: !323, file: !6, line: 276, baseType: !236, size: 1, offset: 323, flags: DIFlagBitField, extraData: i64 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_user", scope: !323, file: !6, line: 277, baseType: !236, size: 1, offset: 324, flags: DIFlagBitField, extraData: i64 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_kernel", scope: !323, file: !6, line: 278, baseType: !236, size: 1, offset: 325, flags: DIFlagBitField, extraData: i64 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_hv", scope: !323, file: !6, line: 279, baseType: !236, size: 1, offset: 326, flags: DIFlagBitField, extraData: i64 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_idle", scope: !323, file: !6, line: 280, baseType: !236, size: 1, offset: 327, flags: DIFlagBitField, extraData: i64 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !323, file: !6, line: 281, baseType: !236, size: 1, offset: 328, flags: DIFlagBitField, extraData: i64 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !323, file: !6, line: 282, baseType: !236, size: 1, offset: 329, flags: DIFlagBitField, extraData: i64 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !323, file: !6, line: 283, baseType: !236, size: 1, offset: 330, flags: DIFlagBitField, extraData: i64 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "inherit_stat", scope: !323, file: !6, line: 284, baseType: !236, size: 1, offset: 331, flags: DIFlagBitField, extraData: i64 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "enable_on_exec", scope: !323, file: !6, line: 285, baseType: !236, size: 1, offset: 332, flags: DIFlagBitField, extraData: i64 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !323, file: !6, line: 286, baseType: !236, size: 1, offset: 333, flags: DIFlagBitField, extraData: i64 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !323, file: !6, line: 287, baseType: !236, size: 1, offset: 334, flags: DIFlagBitField, extraData: i64 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "precise_ip", scope: !323, file: !6, line: 288, baseType: !236, size: 2, offset: 335, flags: DIFlagBitField, extraData: i64 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_data", scope: !323, file: !6, line: 289, baseType: !236, size: 1, offset: 337, flags: DIFlagBitField, extraData: i64 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sample_id_all", scope: !323, file: !6, line: 290, baseType: !236, size: 1, offset: 338, flags: DIFlagBitField, extraData: i64 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_host", scope: !323, file: !6, line: 291, baseType: !236, size: 1, offset: 339, flags: DIFlagBitField, extraData: i64 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_guest", scope: !323, file: !6, line: 292, baseType: !236, size: 1, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_callchain_kernel", scope: !323, file: !6, line: 293, baseType: !236, size: 1, offset: 341, flags: DIFlagBitField, extraData: i64 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_callchain_user", scope: !323, file: !6, line: 294, baseType: !236, size: 1, offset: 342, flags: DIFlagBitField, extraData: i64 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mmap2", scope: !323, file: !6, line: 295, baseType: !236, size: 1, offset: 343, flags: DIFlagBitField, extraData: i64 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "comm_exec", scope: !323, file: !6, line: 296, baseType: !236, size: 1, offset: 344, flags: DIFlagBitField, extraData: i64 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "use_clockid", scope: !323, file: !6, line: 297, baseType: !236, size: 1, offset: 345, flags: DIFlagBitField, extraData: i64 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "context_switch", scope: !323, file: !6, line: 298, baseType: !236, size: 1, offset: 346, flags: DIFlagBitField, extraData: i64 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "write_backward", scope: !323, file: !6, line: 299, baseType: !236, size: 1, offset: 347, flags: DIFlagBitField, extraData: i64 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "namespaces", scope: !323, file: !6, line: 300, baseType: !236, size: 1, offset: 348, flags: DIFlagBitField, extraData: i64 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ksymbol", scope: !323, file: !6, line: 301, baseType: !236, size: 1, offset: 349, flags: DIFlagBitField, extraData: i64 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_event", scope: !323, file: !6, line: 302, baseType: !236, size: 1, offset: 350, flags: DIFlagBitField, extraData: i64 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "aux_output", scope: !323, file: !6, line: 303, baseType: !236, size: 1, offset: 351, flags: DIFlagBitField, extraData: i64 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cgroup", scope: !323, file: !6, line: 304, baseType: !236, size: 1, offset: 352, flags: DIFlagBitField, extraData: i64 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "text_poke", scope: !323, file: !6, line: 305, baseType: !236, size: 1, offset: 353, flags: DIFlagBitField, extraData: i64 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "build_id", scope: !323, file: !6, line: 306, baseType: !236, size: 1, offset: 354, flags: DIFlagBitField, extraData: i64 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "inherit_thread", scope: !323, file: !6, line: 307, baseType: !236, size: 1, offset: 355, flags: DIFlagBitField, extraData: i64 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "remove_on_exec", scope: !323, file: !6, line: 308, baseType: !236, size: 1, offset: 356, flags: DIFlagBitField, extraData: i64 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sigtrap", scope: !323, file: !6, line: 309, baseType: !236, size: 1, offset: 357, flags: DIFlagBitField, extraData: i64 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved_1", scope: !323, file: !6, line: 310, baseType: !236, size: 26, offset: 358, flags: DIFlagBitField, extraData: i64 320)
!375 = !DIDerivedType(tag: DW_TAG_member, scope: !323, file: !6, line: 312, baseType: !376, size: 32, offset: 384)
!376 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !323, file: !6, line: 312, size: 32, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_events", scope: !376, file: !6, line: 313, baseType: !326, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "wakeup_watermark", scope: !376, file: !6, line: 314, baseType: !326, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bp_type", scope: !323, file: !6, line: 317, baseType: !326, size: 32, offset: 416)
!381 = !DIDerivedType(tag: DW_TAG_member, scope: !323, file: !6, line: 318, baseType: !382, size: 64, offset: 448)
!382 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !323, file: !6, line: 318, size: 64, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bp_addr", scope: !382, file: !6, line: 319, baseType: !236, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "config1", scope: !382, file: !6, line: 320, baseType: !236, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, scope: !323, file: !6, line: 322, baseType: !387, size: 64, offset: 512)
!387 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !323, file: !6, line: 322, size: 64, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bp_len", scope: !387, file: !6, line: 323, baseType: !236, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "config2", scope: !387, file: !6, line: 324, baseType: !236, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "branch_sample_type", scope: !323, file: !6, line: 326, baseType: !236, size: 64, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sample_regs_user", scope: !323, file: !6, line: 327, baseType: !236, size: 64, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sample_stack_user", scope: !323, file: !6, line: 328, baseType: !326, size: 32, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !323, file: !6, line: 329, baseType: !395, size: 32, offset: 736)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !396, line: 26, baseType: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !239, line: 41, baseType: !235)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sample_regs_intr", scope: !323, file: !6, line: 330, baseType: !236, size: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "aux_watermark", scope: !323, file: !6, line: 331, baseType: !326, size: 32, offset: 832)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sample_max_stack", scope: !323, file: !6, line: 332, baseType: !401, size: 16, offset: 864)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !237, line: 25, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !239, line: 40, baseType: !403)
!403 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved_2", scope: !323, file: !6, line: 333, baseType: !401, size: 16, offset: 880)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "aux_sample_size", scope: !323, file: !6, line: 334, baseType: !326, size: 32, offset: 896)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved_3", scope: !323, file: !6, line: 335, baseType: !326, size: 32, offset: 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sig_data", scope: !323, file: !6, line: 336, baseType: !236, size: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !320, file: !319, line: 34, baseType: !409, size: 192, offset: 1024)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 192, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 3)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prev_values", scope: !320, file: !319, line: 35, baseType: !409, size: 192, offset: 1216)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !320, file: !319, line: 36, baseType: !243, size: 64, offset: 1408)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !320, file: !319, line: 37, baseType: !236, size: 64, offset: 1472)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !320, file: !319, line: 38, baseType: !245, size: 64, offset: 1536)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pgmsk", scope: !320, file: !319, line: 39, baseType: !417, size: 64, offset: 1600)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !418, line: 70, baseType: !240)
!418 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!419 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !320, file: !319, line: 40, baseType: !235, size: 32, offset: 1664)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !320, file: !319, line: 41, baseType: !235, size: 32, offset: 1696)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "max_fds", scope: !320, file: !319, line: 42, baseType: !235, size: 32, offset: 1728)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !320, file: !319, line: 43, baseType: !235, size: 32, offset: 1760)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !320, file: !319, line: 44, baseType: !235, size: 32, offset: 1792)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fstr", scope: !320, file: !319, line: 45, baseType: !243, size: 64, offset: 1856)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "num_fds", scope: !2, file: !3, line: 47, type: !427, isLocal: true, isDefinition: true)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !319, line: 80, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 496, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 62)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !319, line: 83, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 304, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 38)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !3, line: 173, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 568, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 71)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "options_t", file: !3, line: 43, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 37, size: 192, elements: !445)
!445 = !{!446, !449, !450, !451, !452}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !444, file: !3, line: 38, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !444, file: !3, line: 39, baseType: !235, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !444, file: !3, line: 40, baseType: !235, size: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !444, file: !3, line: 41, baseType: !235, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !444, file: !3, line: 42, baseType: !235, size: 32, offset: 160)
!453 = !{i32 7, !"Dwarf Version", i32 5}
!454 = !{i32 2, !"Debug Info Version", i32 3}
!455 = !{i32 1, !"wchar_size", i32 4}
!456 = !{i32 8, !"PIC Level", i32 2}
!457 = !{i32 7, !"PIE Level", i32 2}
!458 = !{i32 7, !"uwtable", i32 2}
!459 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!460 = distinct !DISubprogram(name: "setup_cpu", scope: !3, file: !3, line: 50, type: !461, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !463)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !235}
!463 = !{!464, !465, !466, !467}
!464 = !DILocalVariable(name: "cpu", arg: 1, scope: !460, file: !3, line: 50, type: !235)
!465 = !DILocalVariable(name: "fds", scope: !460, file: !3, line: 52, type: !317)
!466 = !DILocalVariable(name: "i", scope: !460, file: !3, line: 53, type: !235)
!467 = !DILocalVariable(name: "ret", scope: !460, file: !3, line: 53, type: !235)
!468 = !{!469, !469, i64 0}
!469 = !{!"int", !470, i64 0}
!470 = !{!"omnipotent char", !471, i64 0}
!471 = !{!"Simple C/C++ TBAA"}
!472 = !DILocation(line: 50, column: 15, scope: !460)
!473 = !DILocation(line: 52, column: 2, scope: !460)
!474 = !DILocation(line: 52, column: 21, scope: !460)
!475 = !DILocation(line: 53, column: 2, scope: !460)
!476 = !DILocation(line: 53, column: 6, scope: !460)
!477 = !DILocation(line: 53, column: 9, scope: !460)
!478 = !DILocation(line: 55, column: 39, scope: !460)
!479 = !{!480, !481, i64 0}
!480 = !{!"", !481, i64 0, !469, i64 8, !469, i64 12, !469, i64 16, !469, i64 20}
!481 = !{!"any pointer", !470, i64 0}
!482 = !DILocation(line: 55, column: 48, scope: !460)
!483 = !{!481, !481, i64 0}
!484 = !DILocation(line: 55, column: 56, scope: !460)
!485 = !DILocation(line: 55, column: 63, scope: !460)
!486 = !DILocation(line: 55, column: 71, scope: !460)
!487 = !DILocation(line: 55, column: 8, scope: !460)
!488 = !DILocation(line: 55, column: 6, scope: !460)
!489 = !DILocation(line: 56, column: 6, scope: !490)
!490 = distinct !DILexicalBlock(scope: !460, file: !3, line: 56, column: 6)
!491 = !DILocation(line: 56, column: 10, scope: !490)
!492 = !DILocation(line: 56, column: 14, scope: !490)
!493 = !DILocation(line: 56, column: 22, scope: !490)
!494 = !DILocation(line: 56, column: 6, scope: !460)
!495 = !DILocation(line: 57, column: 3, scope: !490)
!496 = !DILocation(line: 58, column: 8, scope: !460)
!497 = !DILocation(line: 58, column: 16, scope: !460)
!498 = !DILocation(line: 58, column: 6, scope: !460)
!499 = !DILocation(line: 60, column: 2, scope: !460)
!500 = !DILocation(line: 60, column: 9, scope: !460)
!501 = !DILocation(line: 60, column: 12, scope: !460)
!502 = !{!503, !469, i64 212}
!503 = !{!"", !504, i64 0, !470, i64 128, !470, i64 152, !481, i64 176, !505, i64 184, !481, i64 192, !505, i64 200, !469, i64 208, !469, i64 212, !469, i64 216, !469, i64 220, !469, i64 224, !481, i64 232}
!504 = !{!"perf_event_attr", !469, i64 0, !469, i64 4, !505, i64 8, !470, i64 16, !505, i64 24, !505, i64 32, !505, i64 40, !505, i64 40, !505, i64 40, !505, i64 40, !505, i64 40, !505, i64 40, !505, i64 40, !505, i64 40, !505, i64 41, !505, i64 41, !505, i64 41, !505, i64 41, !505, i64 41, !505, i64 41, !505, i64 41, !505, i64 41, !505, i64 42, !505, i64 42, !505, i64 42, !505, i64 42, !505, i64 42, !505, i64 42, !505, i64 42, !505, i64 43, !505, i64 43, !505, i64 43, !505, i64 43, !505, i64 43, !505, i64 43, !505, i64 43, !505, i64 43, !505, i64 44, !505, i64 44, !505, i64 44, !505, i64 44, !505, i64 44, !505, i64 44, !505, i64 44, !470, i64 48, !469, i64 52, !470, i64 56, !470, i64 64, !505, i64 72, !505, i64 80, !469, i64 88, !469, i64 92, !505, i64 96, !469, i64 104, !506, i64 108, !506, i64 110, !469, i64 112, !469, i64 116, !505, i64 120}
!505 = !{!"long", !470, i64 0}
!506 = !{!"short", !470, i64 0}
