; ModuleID = 'samples/867.bc'
source_filename = "src/http/modules/ngx_http_upstream_zone_module.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_http_module_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_command_s = type { %struct.ngx_str_t, i64, ptr, i64, i64, ptr }
%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_conf_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr }
%struct.ngx_http_conf_ctx_t = type { ptr, ptr, ptr }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }
%struct.ngx_http_upstream_srv_conf_s = type { %struct.ngx_http_upstream_peer_t, ptr, ptr, i64, %struct.ngx_str_t, ptr, i64, i16, i64, ptr }
%struct.ngx_http_upstream_peer_t = type { ptr, ptr, ptr }
%struct.ngx_shm_zone_s = type { ptr, %struct.ngx_shm_t, ptr, ptr, ptr, i64 }
%struct.ngx_shm_t = type { ptr, i64, %struct.ngx_str_t, ptr, i64 }
%struct.ngx_http_upstream_main_conf_t = type { %struct.ngx_hash_t, %struct.ngx_array_t }
%struct.ngx_hash_t = type { ptr, i64 }
%struct.ngx_slab_pool_t = type { %struct.ngx_shmtx_sh_t, i64, i64, ptr, ptr, %struct.ngx_slab_page_s, ptr, i64, ptr, ptr, %struct.ngx_shmtx_t, ptr, i8, i8, ptr, ptr }
%struct.ngx_shmtx_sh_t = type { i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/http/modules/ngx_http_upstream_zone_module.c", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "b1dd30cbf6f8aa3c62875e93bf040995")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 41)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "ngx_http_upstream_zone_module_ctx", scope: !9, file: !2, line: 36, type: !752, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !10, globals: !177, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !16, !17, !23, !32, !35, !102}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !12, line: 79, baseType: !13)
!12 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !14, line: 90, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!15 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !19, line: 33, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !21, line: 31, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !25, line: 21, baseType: !26)
!25 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "f0f323751ab5b63196467d991a0424cd")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 17, size: 192, elements: !27)
!27 = !{!28, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !26, file: !25, line: 18, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !26, file: !25, line: 19, baseType: !29, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !26, file: !25, line: 20, baseType: !29, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !19, line: 108, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !21, line: 194, baseType: !34)
!34 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !37, line: 59, baseType: !38)
!37 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6137611cd598fa2ecc498e6967a03177")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 34, size: 1600, elements: !39)
!39 = !{!40, !51, !54, !55, !63, !64, !65, !74, !75, !76, !77, !96, !97, !98, !100, !101}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !38, file: !37, line: 35, baseType: !41, size: 128)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !42, line: 21, baseType: !43)
!42 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "56a332e5761f46e2bb83cbdaf8b18a9f")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 16, size: 128, elements: !44)
!44 = !{!45, !50}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !43, file: !42, line: 17, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !47, line: 56, baseType: !48)
!47 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "5d14beceab1860bcc051d3b7a146b2a2")
!48 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !47, line: 48, baseType: !15)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !43, file: !42, line: 19, baseType: !46, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !38, file: !37, line: 37, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 29, baseType: !15)
!53 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !38, file: !37, line: 38, baseType: !52, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !38, file: !37, line: 40, baseType: !56, size: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !37, line: 16, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !37, line: 18, size: 192, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !58, file: !37, line: 19, baseType: !13, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !37, line: 20, baseType: !56, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !58, file: !37, line: 21, baseType: !13, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !38, file: !37, line: 41, baseType: !56, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !38, file: !37, line: 42, baseType: !57, size: 192, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !38, file: !37, line: 44, baseType: !66, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !37, line: 31, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 25, size: 256, elements: !69)
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !68, file: !37, line: 26, baseType: !11, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !68, file: !37, line: 27, baseType: !11, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !68, file: !37, line: 29, baseType: !11, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !68, file: !37, line: 30, baseType: !11, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !38, file: !37, line: 45, baseType: !11, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !38, file: !37, line: 47, baseType: !17, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !38, file: !37, line: 48, baseType: !17, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !38, file: !37, line: 50, baseType: !78, size: 512, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !42, line: 37, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 24, size: 512, elements: !80)
!80 = !{!81, !83, !84, !85, !95}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !79, file: !42, line: 26, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !79, file: !42, line: 28, baseType: !82, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !79, file: !42, line: 29, baseType: !11, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !79, file: !42, line: 30, baseType: !86, size: 256, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !87, line: 39, baseType: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!88 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !87, line: 35, size: 256, elements: !89)
!89 = !{!90, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !88, file: !87, line: 37, baseType: !91, size: 256)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !88, file: !87, line: 38, baseType: !34, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !79, file: !42, line: 36, baseType: !11, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !38, file: !37, line: 52, baseType: !17, size: 64, offset: 1344)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !38, file: !37, line: 53, baseType: !18, size: 8, offset: 1408)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !38, file: !37, line: 55, baseType: !99, size: 1, offset: 1416, flags: DIFlagBitField, extraData: i64 1416)
!99 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !38, file: !37, line: 57, baseType: !16, size: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !38, file: !37, line: 58, baseType: !16, size: 64, offset: 1536)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_rr_peers_t", file: !105, line: 59, baseType: !106)
!105 = !DIFile(filename: "src/http/ngx_http_upstream_round_robin.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "759ffe5a3eaa7466ee2e57328801103e")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_rr_peers_s", file: !105, line: 61, size: 640, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !124, !125}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !106, file: !105, line: 62, baseType: !11, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !106, file: !105, line: 65, baseType: !35, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rwlock", scope: !106, file: !105, line: 66, baseType: !46, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "zone_next", scope: !106, file: !105, line: 67, baseType: !103, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "total_weight", scope: !106, file: !105, line: 70, baseType: !11, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !106, file: !105, line: 71, baseType: !11, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "single", scope: !106, file: !105, line: 73, baseType: !99, size: 1, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !106, file: !105, line: 74, baseType: !99, size: 1, offset: 385, flags: DIFlagBitField, extraData: i64 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !105, line: 76, baseType: !117, size: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !119, line: 19, baseType: !120)
!119 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2f3ab61eca09df707b083ffd5eafea4f")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 16, size: 128, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !120, file: !119, line: 17, baseType: !52, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !120, file: !119, line: 18, baseType: !17, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !105, line: 78, baseType: !103, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !106, file: !105, line: 80, baseType: !126, size: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_rr_peer_t", file: !105, line: 17, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_rr_peer_s", file: !105, line: 19, size: 1472, elements: !129)
!129 = !{!130, !143, !147, !148, !149, !153, !154, !155, !156, !157, !158, !162, !163, !164, !165, !170, !171, !172, !173, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !128, file: !105, line: 20, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !133, line: 180, size: 128, elements: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!134 = !{!135, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !132, file: !133, line: 182, baseType: !136, size: 16)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !137, line: 28, baseType: !138)
!137 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!138 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !132, file: !133, line: 183, baseType: !140, size: 112, offset: 16)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 14)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !128, file: !105, line: 21, baseType: !144, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !145, line: 274, baseType: !146)
!145 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !21, line: 210, baseType: !99)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !105, line: 22, baseType: !118, size: 128, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !128, file: !105, line: 23, baseType: !118, size: 128, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "current_weight", scope: !128, file: !105, line: 25, baseType: !150, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !12, line: 78, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !145, line: 267, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !21, line: 207, baseType: !34)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "effective_weight", scope: !128, file: !105, line: 26, baseType: !150, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !128, file: !105, line: 27, baseType: !150, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !128, file: !105, line: 29, baseType: !11, size: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "max_conns", scope: !128, file: !105, line: 30, baseType: !11, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !128, file: !105, line: 32, baseType: !11, size: 64, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "accessed", scope: !128, file: !105, line: 33, baseType: !159, size: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !160, line: 10, baseType: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !21, line: 160, baseType: !34)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "checked", scope: !128, file: !105, line: 34, baseType: !159, size: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "max_fails", scope: !128, file: !105, line: 36, baseType: !11, size: 64, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "fail_timeout", scope: !128, file: !105, line: 37, baseType: !159, size: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "slow_start", scope: !128, file: !105, line: 38, baseType: !166, size: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !167, line: 16, baseType: !168)
!167 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !169, line: 16, baseType: !11)
!169 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3e0aca9b19636f12ab4dbc16c3f8a0a1")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !128, file: !105, line: 39, baseType: !166, size: 64, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !128, file: !105, line: 41, baseType: !11, size: 64, offset: 1152)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_session", scope: !128, file: !105, line: 44, baseType: !16, size: 64, offset: 1216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_session_len", scope: !128, file: !105, line: 45, baseType: !174, size: 32, offset: 1280)
!174 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !128, file: !105, line: 49, baseType: !46, size: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !128, file: !105, line: 52, baseType: !126, size: 64, offset: 1408)
!177 = !{!0, !178, !7, !728, !733, !738, !743, !745, !747}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "ngx_http_upstream_zone_module", scope: !9, file: !2, line: 51, type: !180, isLocal: false, isDefinition: true)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !181, line: 15, baseType: !182)
!181 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "20a149d22b95b5c7a0a8830d485b97ae")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !183, line: 222, size: 1600, elements: !184)
!183 = !DIFile(filename: "src/core/ngx_module.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "9061a5345279c977548e41d1c550ac28")
!184 = !{!185, !186, !187, !189, !190, !191, !192, !195, !196, !703, !704, !708, !712, !713, !714, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !182, file: !183, line: 223, baseType: !11, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !182, file: !183, line: 224, baseType: !11, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !183, line: 226, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !182, file: !183, line: 228, baseType: !11, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !182, file: !183, line: 229, baseType: !11, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !182, file: !183, line: 231, baseType: !11, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !182, file: !183, line: 232, baseType: !193, size: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !182, file: !183, line: 234, baseType: !16, size: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !182, file: !183, line: 235, baseType: !197, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !181, line: 22, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !200, line: 77, size: 448, elements: !201)
!200 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "b737d189253ca17c55f83e424debf52b")
!201 = !{!202, !203, !204, !700, !701, !702}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !199, file: !200, line: 78, baseType: !118, size: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !199, file: !200, line: 79, baseType: !11, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !199, file: !200, line: 80, baseType: !205, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!188, !208, !197, !16}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !181, line: 16, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !200, line: 116, size: 768, elements: !211)
!211 = !{!212, !213, !381, !682, !683, !684, !693, !694, !695, !696, !697, !699}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !200, line: 117, baseType: !188, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !210, file: !200, line: 118, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !216, line: 22, baseType: !217)
!216 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 16, size: 320, elements: !218)
!218 = !{!219, !220, !221, !222, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !217, file: !216, line: 17, baseType: !16, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !217, file: !216, line: 18, baseType: !11, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !217, file: !216, line: 19, baseType: !52, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !217, file: !216, line: 20, baseType: !11, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !217, file: !216, line: 21, baseType: !224, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !181, line: 18, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !227, line: 57, size: 640, elements: !228)
!227 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!228 = !{!229, !237, !238, !239, !361, !368, !380}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !226, file: !227, line: 58, baseType: !230, size: 256)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !227, line: 54, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 49, size: 256, elements: !232)
!232 = !{!233, !234, !235, !236}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !231, file: !227, line: 50, baseType: !17, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !231, file: !227, line: 51, baseType: !17, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !227, line: 52, baseType: !224, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !231, file: !227, line: 53, baseType: !11, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !226, file: !227, line: 59, baseType: !52, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !226, file: !227, line: 60, baseType: !224, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !226, file: !227, line: 61, baseType: !240, size: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !181, line: 19, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !243, line: 59, size: 128, elements: !244)
!243 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6333220b53b7706731e71ee9d0416317")
!244 = !{!245, !360}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !242, file: !243, line: 60, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !243, line: 18, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !243, line: 20, size: 640, elements: !249)
!249 = !{!250, !251, !252, !255, !256, !257, !258, !260, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !248, file: !243, line: 21, baseType: !17, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !248, file: !243, line: 22, baseType: !17, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !248, file: !243, line: 23, baseType: !253, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !19, line: 87, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !21, line: 153, baseType: !34)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !248, file: !243, line: 24, baseType: !253, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !248, file: !243, line: 26, baseType: !17, size: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !248, file: !243, line: 27, baseType: !17, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !248, file: !243, line: 28, baseType: !259, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !243, line: 16, baseType: !16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !248, file: !243, line: 29, baseType: !261, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !181, line: 23, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !264, line: 16, size: 1600, elements: !265)
!264 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!265 = !{!266, !269, !270, !308, !309, !310, !345, !346}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !263, file: !264, line: 17, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !268, line: 16, baseType: !174)
!268 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "5c6995d5f659dd97ea6d10eff0ad0f12")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !264, line: 18, baseType: !118, size: 128, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !263, file: !264, line: 19, baseType: !271, size: 1152, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !268, line: 17, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !273, line: 26, size: 1152, elements: !274)
!273 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!274 = !{!275, !277, !279, !281, !283, !285, !287, !288, !289, !291, !293, !295, !302, !303, !304}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !272, file: !273, line: 31, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !21, line: 145, baseType: !15)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !272, file: !273, line: 36, baseType: !278, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !21, line: 148, baseType: !15)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !272, file: !273, line: 44, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !21, line: 151, baseType: !15)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !272, file: !273, line: 45, baseType: !282, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !21, line: 150, baseType: !99)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !272, file: !273, line: 47, baseType: !284, size: 32, offset: 224)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !21, line: 146, baseType: !99)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !272, file: !273, line: 48, baseType: !286, size: 32, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !21, line: 147, baseType: !99)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !272, file: !273, line: 50, baseType: !174, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !272, file: !273, line: 52, baseType: !276, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !272, file: !273, line: 57, baseType: !290, size: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !21, line: 152, baseType: !34)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !272, file: !273, line: 61, baseType: !292, size: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !21, line: 175, baseType: !34)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !272, file: !273, line: 63, baseType: !294, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !21, line: 180, baseType: !34)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !272, file: !273, line: 74, baseType: !296, size: 128, offset: 576)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !297, line: 11, size: 128, elements: !298)
!297 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !296, file: !297, line: 16, baseType: !161, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !296, file: !297, line: 21, baseType: !301, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !21, line: 197, baseType: !34)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !272, file: !273, line: 75, baseType: !296, size: 128, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !272, file: !273, line: 76, baseType: !296, size: 128, offset: 832)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !272, file: !273, line: 89, baseType: !305, size: 192, offset: 960)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 192, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 3)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !263, file: !264, line: 21, baseType: !253, size: 64, offset: 1344)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !263, file: !264, line: 22, baseType: !253, size: 64, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !263, file: !264, line: 24, baseType: !311, size: 64, offset: 1472)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !181, line: 20, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !314, line: 50, size: 640, elements: !315)
!314 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "81257099415bdc5e18cdef9b4461d934")
!315 = !{!316, !317, !329, !330, !331, !336, !337, !342, !343, !344}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !313, file: !314, line: 51, baseType: !11, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !313, file: !314, line: 52, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !181, line: 21, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !200, line: 89, size: 320, elements: !321)
!321 = !{!322, !323, !324, !328}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !320, file: !200, line: 90, baseType: !267, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !320, file: !200, line: 91, baseType: !118, size: 128, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !320, file: !200, line: 93, baseType: !325, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !318, !311}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !320, file: !200, line: 94, baseType: !16, size: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !313, file: !314, line: 54, baseType: !49, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !313, file: !314, line: 56, baseType: !159, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !313, file: !314, line: 58, baseType: !332, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !314, line: 45, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!17, !311, !17, !52}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !313, file: !314, line: 59, baseType: !16, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !313, file: !314, line: 61, baseType: !338, size: 64, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !314, line: 46, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !311, !11, !17, !52}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !313, file: !314, line: 62, baseType: !16, size: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !313, file: !314, line: 70, baseType: !188, size: 64, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !314, line: 72, baseType: !311, size: 64, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !263, file: !264, line: 37, baseType: !99, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !263, file: !264, line: 38, baseType: !99, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !248, file: !243, line: 30, baseType: !246, size: 64, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !248, file: !243, line: 34, baseType: !99, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !248, file: !243, line: 40, baseType: !99, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !248, file: !243, line: 43, baseType: !99, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !248, file: !243, line: 45, baseType: !99, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !248, file: !243, line: 46, baseType: !99, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !248, file: !243, line: 47, baseType: !99, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !248, file: !243, line: 48, baseType: !99, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !248, file: !243, line: 49, baseType: !99, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !248, file: !243, line: 50, baseType: !99, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !248, file: !243, line: 52, baseType: !99, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !248, file: !243, line: 53, baseType: !99, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !248, file: !243, line: 55, baseType: !174, size: 32, offset: 608)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !243, line: 61, baseType: !240, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !226, file: !227, line: 62, baseType: !362, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !227, line: 41, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !227, line: 43, size: 128, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !227, line: 44, baseType: !362, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !364, file: !227, line: 45, baseType: !16, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !226, file: !227, line: 63, baseType: !369, size: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !227, line: 32, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !227, line: 34, size: 192, elements: !372)
!372 = !{!373, !378, !379}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !371, file: !227, line: 35, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !227, line: 30, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !16}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !371, file: !227, line: 36, baseType: !16, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !227, line: 37, baseType: !369, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !226, file: !227, line: 64, baseType: !311, size: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !210, file: !200, line: 120, baseType: !382, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !181, line: 17, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !385, line: 39, size: 5184, elements: !386)
!385 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "44a673836137b8263e2cfd875033292f")
!386 = !{!387, !390, !391, !392, !393, !394, !636, !637, !638, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !384, file: !385, line: 40, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !384, file: !385, line: 41, baseType: !224, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !384, file: !385, line: 43, baseType: !311, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !384, file: !385, line: 44, baseType: !312, size: 640, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !384, file: !385, line: 46, baseType: !11, size: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !384, file: !385, line: 48, baseType: !395, size: 64, offset: 896)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !181, line: 26, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !399, line: 122, size: 1856, elements: !400)
!399 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "212f2f4879dcb10799877db6a93ee4ed")
!400 = !{!401, !402, !456, !457, !460, !466, !468, !473, !478, !539, !540, !541, !542, !543, !544, !545, !546, !562, !609, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !398, file: !399, line: 123, baseType: !16, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !398, file: !399, line: 124, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !181, line: 24, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !406, line: 30, size: 768, elements: !407)
!406 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "37d7d908a1a7ebec5ff5673dd5f89a52")
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !435, !436, !437, !448}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !405, file: !406, line: 31, baseType: !16, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !405, file: !406, line: 33, baseType: !99, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !405, file: !406, line: 35, baseType: !99, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !405, file: !406, line: 38, baseType: !99, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !405, file: !406, line: 44, baseType: !99, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !405, file: !406, line: 46, baseType: !99, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !405, file: !406, line: 49, baseType: !99, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !405, file: !406, line: 51, baseType: !99, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !405, file: !406, line: 54, baseType: !99, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !405, file: !406, line: 56, baseType: !99, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !405, file: !406, line: 57, baseType: !99, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !405, file: !406, line: 59, baseType: !99, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !405, file: !406, line: 60, baseType: !99, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !405, file: !406, line: 62, baseType: !99, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !405, file: !406, line: 64, baseType: !99, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !405, file: !406, line: 67, baseType: !99, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !405, file: !406, line: 69, baseType: !99, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !405, file: !406, line: 71, baseType: !99, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !405, file: !406, line: 74, baseType: !99, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !405, file: !406, line: 75, baseType: !99, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !405, file: !406, line: 77, baseType: !99, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !405, file: !406, line: 101, baseType: !174, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !405, file: !406, line: 103, baseType: !431, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !181, line: 33, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !403}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !405, file: !406, line: 110, baseType: !11, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !405, file: !406, line: 112, baseType: !311, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !405, file: !406, line: 114, baseType: !438, size: 320, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !169, line: 20, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !169, line: 22, size: 320, elements: !440)
!440 = !{!441, !442, !444, !445, !446, !447}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !439, file: !169, line: 23, baseType: !168, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !439, file: !169, line: 24, baseType: !443, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !439, file: !169, line: 25, baseType: !443, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !439, file: !169, line: 26, baseType: !443, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !439, file: !169, line: 27, baseType: !18, size: 8, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !439, file: !169, line: 28, baseType: !18, size: 8, offset: 264)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !405, file: !406, line: 117, baseType: !449, size: 128, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !450, line: 16, baseType: !451)
!450 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !450, line: 18, size: 128, elements: !452)
!452 = !{!453, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !451, file: !450, line: 19, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !451, file: !450, line: 20, baseType: !454, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !398, file: !399, line: 125, baseType: !403, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !398, file: !399, line: 127, baseType: !458, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !459, line: 17, baseType: !174)
!459 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3294ca407f098b2e2906f1b2d90752a2")
!460 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !398, file: !399, line: 129, baseType: !461, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !462, line: 19, baseType: !463)
!462 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!32, !396, !17, !52}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !398, file: !399, line: 130, baseType: !467, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !462, line: 22, baseType: !463)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !398, file: !399, line: 131, baseType: !469, size: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !462, line: 20, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!32, !396, !240, !253}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !398, file: !399, line: 132, baseType: !474, size: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !462, line: 23, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!240, !396, !240, !253}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !398, file: !399, line: 134, baseType: !479, size: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !399, line: 16, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !399, line: 18, size: 2368, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !500, !501, !502, !503, !504, !505, !506, !507, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !481, file: !399, line: 19, baseType: !458, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !481, file: !399, line: 21, baseType: !131, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !481, file: !399, line: 22, baseType: !144, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !481, file: !399, line: 23, baseType: !52, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !481, file: !399, line: 24, baseType: !118, size: 128, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !481, file: !399, line: 26, baseType: !174, size: 32, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !481, file: !399, line: 28, baseType: !174, size: 32, offset: 416)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !481, file: !399, line: 29, baseType: !174, size: 32, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !481, file: !399, line: 30, baseType: !174, size: 32, offset: 480)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !481, file: !399, line: 32, baseType: !174, size: 32, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !481, file: !399, line: 33, baseType: !174, size: 32, offset: 544)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !481, file: !399, line: 34, baseType: !174, size: 32, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !481, file: !399, line: 38, baseType: !496, size: 64, offset: 640)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !181, line: 34, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !396}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !481, file: !399, line: 40, baseType: !16, size: 64, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !481, file: !399, line: 42, baseType: !312, size: 640, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !481, file: !399, line: 43, baseType: !311, size: 64, offset: 1408)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !481, file: !399, line: 45, baseType: !52, size: 64, offset: 1472)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !481, file: !399, line: 47, baseType: !52, size: 64, offset: 1536)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !481, file: !399, line: 49, baseType: !479, size: 64, offset: 1600)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !481, file: !399, line: 50, baseType: !396, size: 64, offset: 1664)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !481, file: !399, line: 52, baseType: !508, size: 192, offset: 1728)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !169, line: 32, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !169, line: 37, size: 192, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !509, file: !169, line: 38, baseType: !443, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !509, file: !169, line: 39, baseType: !443, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !509, file: !169, line: 40, baseType: !514, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !169, line: 34, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !443, !443, !443}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !481, file: !399, line: 53, baseType: !438, size: 320, offset: 1920)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !481, file: !399, line: 55, baseType: !11, size: 64, offset: 2240)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !481, file: !399, line: 57, baseType: !99, size: 1, offset: 2304, flags: DIFlagBitField, extraData: i64 2304)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !481, file: !399, line: 58, baseType: !99, size: 1, offset: 2305, flags: DIFlagBitField, extraData: i64 2304)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !481, file: !399, line: 59, baseType: !99, size: 1, offset: 2306, flags: DIFlagBitField, extraData: i64 2304)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !481, file: !399, line: 61, baseType: !99, size: 1, offset: 2307, flags: DIFlagBitField, extraData: i64 2304)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !481, file: !399, line: 62, baseType: !99, size: 1, offset: 2308, flags: DIFlagBitField, extraData: i64 2304)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !481, file: !399, line: 63, baseType: !99, size: 1, offset: 2309, flags: DIFlagBitField, extraData: i64 2304)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !481, file: !399, line: 64, baseType: !99, size: 1, offset: 2310, flags: DIFlagBitField, extraData: i64 2304)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !481, file: !399, line: 65, baseType: !99, size: 1, offset: 2311, flags: DIFlagBitField, extraData: i64 2304)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !481, file: !399, line: 66, baseType: !99, size: 1, offset: 2312, flags: DIFlagBitField, extraData: i64 2304)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !481, file: !399, line: 67, baseType: !99, size: 1, offset: 2313, flags: DIFlagBitField, extraData: i64 2304)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !481, file: !399, line: 68, baseType: !99, size: 1, offset: 2314, flags: DIFlagBitField, extraData: i64 2304)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !481, file: !399, line: 71, baseType: !99, size: 1, offset: 2315, flags: DIFlagBitField, extraData: i64 2304)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !481, file: !399, line: 73, baseType: !99, size: 1, offset: 2316, flags: DIFlagBitField, extraData: i64 2304)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !481, file: !399, line: 74, baseType: !99, size: 1, offset: 2317, flags: DIFlagBitField, extraData: i64 2304)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !481, file: !399, line: 75, baseType: !99, size: 2, offset: 2318, flags: DIFlagBitField, extraData: i64 2304)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !481, file: !399, line: 77, baseType: !99, size: 1, offset: 2320, flags: DIFlagBitField, extraData: i64 2304)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !481, file: !399, line: 78, baseType: !99, size: 1, offset: 2321, flags: DIFlagBitField, extraData: i64 2304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !481, file: !399, line: 79, baseType: !99, size: 1, offset: 2322, flags: DIFlagBitField, extraData: i64 2304)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !481, file: !399, line: 88, baseType: !174, size: 32, offset: 2336)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !398, file: !399, line: 136, baseType: !253, size: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !398, file: !399, line: 138, baseType: !311, size: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !398, file: !399, line: 140, baseType: !224, size: 64, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !398, file: !399, line: 142, baseType: !174, size: 32, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !398, file: !399, line: 144, baseType: !131, size: 64, offset: 832)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !398, file: !399, line: 145, baseType: !144, size: 32, offset: 896)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !398, file: !399, line: 146, baseType: !118, size: 128, offset: 960)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol", scope: !398, file: !399, line: 148, baseType: !547, size: 64, offset: 1088)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_proxy_protocol_t", file: !181, line: 29, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_proxy_protocol_s", file: !550, line: 20, size: 448, elements: !551)
!550 = !DIFile(filename: "src/core/ngx_proxy_protocol.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2f709b54741e3446706b44243689209d")
!551 = !{!552, !553, !554, !560, !561}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !549, file: !550, line: 21, baseType: !118, size: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr", scope: !549, file: !550, line: 22, baseType: !118, size: 128, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !549, file: !550, line: 23, baseType: !555, size: 16, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !556, line: 123, baseType: !557)
!556 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !558, line: 25, baseType: !559)
!558 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !21, line: 40, baseType: !138)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !549, file: !550, line: 24, baseType: !555, size: 16, offset: 272)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tlvs", scope: !549, file: !550, line: 25, baseType: !118, size: 128, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !398, file: !399, line: 151, baseType: !563, size: 64, offset: 1152)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !181, line: 30, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !566, line: 88, size: 768, elements: !567)
!566 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3af21306d729871437c56397859c5d10")
!567 = !{!568, !573, !577, !578, !579, !580, !581, !586, !587, !588, !589, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !565, file: !566, line: 89, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !571, line: 187, baseType: !572)
!571 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/openssl-3.1.3-t2z4gdp5gh6gi55dbaqbl32ceazzcooa/include/openssl/types.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build", checksumkind: CSK_MD5, checksum: "b6649ae9fb159d98e26ef5156a06b00d")
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !571, line: 187, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !565, file: !566, line: 90, baseType: !574, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !571, line: 188, baseType: !576)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !571, line: 188, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !565, file: !566, line: 92, baseType: !150, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !565, file: !566, line: 93, baseType: !246, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !565, file: !566, line: 94, baseType: !52, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !565, file: !566, line: 96, baseType: !496, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !565, file: !566, line: 98, baseType: !582, size: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !584, line: 234, baseType: !585)
!584 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/openssl-3.1.3-t2z4gdp5gh6gi55dbaqbl32ceazzcooa/include/openssl/ssl.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build", checksumkind: CSK_MD5, checksum: "b3965e72168556c434721fcea95f586f")
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !584, line: 234, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !565, file: !566, line: 99, baseType: !496, size: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !565, file: !566, line: 101, baseType: !431, size: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !565, file: !566, line: 102, baseType: !431, size: 64, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ocsp", scope: !565, file: !566, line: 104, baseType: !590, size: 64, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_ocsp_t", file: !566, line: 78, baseType: !592)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_ocsp_s", file: !566, line: 78, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !565, file: !566, line: 106, baseType: !18, size: 8, offset: 704)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !565, file: !566, line: 108, baseType: !99, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_rejected", scope: !565, file: !566, line: 109, baseType: !99, size: 1, offset: 713, flags: DIFlagBitField, extraData: i64 712)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !565, file: !566, line: 110, baseType: !99, size: 1, offset: 714, flags: DIFlagBitField, extraData: i64 712)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !565, file: !566, line: 111, baseType: !99, size: 1, offset: 715, flags: DIFlagBitField, extraData: i64 712)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !565, file: !566, line: 112, baseType: !99, size: 1, offset: 716, flags: DIFlagBitField, extraData: i64 712)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !565, file: !566, line: 113, baseType: !99, size: 1, offset: 717, flags: DIFlagBitField, extraData: i64 712)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !565, file: !566, line: 114, baseType: !99, size: 1, offset: 718, flags: DIFlagBitField, extraData: i64 712)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_without_free", scope: !565, file: !566, line: 115, baseType: !99, size: 1, offset: 719, flags: DIFlagBitField, extraData: i64 712)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !565, file: !566, line: 116, baseType: !99, size: 1, offset: 720, flags: DIFlagBitField, extraData: i64 712)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "session_timeout_set", scope: !565, file: !566, line: 117, baseType: !99, size: 1, offset: 721, flags: DIFlagBitField, extraData: i64 712)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !565, file: !566, line: 118, baseType: !99, size: 1, offset: 722, flags: DIFlagBitField, extraData: i64 712)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !565, file: !566, line: 119, baseType: !99, size: 1, offset: 723, flags: DIFlagBitField, extraData: i64 712)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "in_ocsp", scope: !565, file: !566, line: 120, baseType: !99, size: 1, offset: 724, flags: DIFlagBitField, extraData: i64 712)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !565, file: !566, line: 121, baseType: !99, size: 1, offset: 725, flags: DIFlagBitField, extraData: i64 712)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !565, file: !566, line: 122, baseType: !99, size: 1, offset: 726, flags: DIFlagBitField, extraData: i64 712)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !398, file: !399, line: 154, baseType: !610, size: 64, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !181, line: 31, baseType: !612)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !181, line: 31, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !398, file: !399, line: 156, baseType: !131, size: 64, offset: 1280)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !398, file: !399, line: 157, baseType: !144, size: 32, offset: 1344)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !398, file: !399, line: 159, baseType: !246, size: 64, offset: 1408)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !398, file: !399, line: 161, baseType: !449, size: 128, offset: 1472)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !398, file: !399, line: 163, baseType: !49, size: 64, offset: 1600)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !398, file: !399, line: 165, baseType: !166, size: 64, offset: 1664)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !398, file: !399, line: 166, baseType: !11, size: 64, offset: 1728)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !398, file: !399, line: 168, baseType: !99, size: 8, offset: 1792, flags: DIFlagBitField, extraData: i64 1792)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !398, file: !399, line: 170, baseType: !99, size: 3, offset: 1800, flags: DIFlagBitField, extraData: i64 1792)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !398, file: !399, line: 172, baseType: !99, size: 1, offset: 1803, flags: DIFlagBitField, extraData: i64 1792)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !398, file: !399, line: 173, baseType: !99, size: 1, offset: 1804, flags: DIFlagBitField, extraData: i64 1792)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !398, file: !399, line: 174, baseType: !99, size: 1, offset: 1805, flags: DIFlagBitField, extraData: i64 1792)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "pipeline", scope: !398, file: !399, line: 175, baseType: !99, size: 1, offset: 1806, flags: DIFlagBitField, extraData: i64 1792)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !398, file: !399, line: 177, baseType: !99, size: 1, offset: 1807, flags: DIFlagBitField, extraData: i64 1792)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !398, file: !399, line: 178, baseType: !99, size: 1, offset: 1808, flags: DIFlagBitField, extraData: i64 1792)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !398, file: !399, line: 179, baseType: !99, size: 1, offset: 1809, flags: DIFlagBitField, extraData: i64 1792)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !398, file: !399, line: 180, baseType: !99, size: 1, offset: 1810, flags: DIFlagBitField, extraData: i64 1792)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !398, file: !399, line: 182, baseType: !99, size: 1, offset: 1811, flags: DIFlagBitField, extraData: i64 1792)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !398, file: !399, line: 183, baseType: !99, size: 1, offset: 1812, flags: DIFlagBitField, extraData: i64 1792)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !398, file: !399, line: 184, baseType: !99, size: 2, offset: 1813, flags: DIFlagBitField, extraData: i64 1792)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !398, file: !399, line: 185, baseType: !99, size: 2, offset: 1815, flags: DIFlagBitField, extraData: i64 1792)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !398, file: !399, line: 187, baseType: !99, size: 1, offset: 1817, flags: DIFlagBitField, extraData: i64 1792)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "need_flush_buf", scope: !398, file: !399, line: 188, baseType: !99, size: 1, offset: 1818, flags: DIFlagBitField, extraData: i64 1792)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !384, file: !385, line: 49, baseType: !396, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !384, file: !385, line: 50, baseType: !11, size: 64, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !384, file: !385, line: 52, baseType: !639, size: 64, offset: 1088)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !384, file: !385, line: 53, baseType: !11, size: 64, offset: 1152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !384, file: !385, line: 54, baseType: !11, size: 64, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !384, file: !385, line: 56, baseType: !449, size: 128, offset: 1280)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !384, file: !385, line: 57, baseType: !11, size: 64, offset: 1408)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "connections_reuse_time", scope: !384, file: !385, line: 58, baseType: !159, size: 64, offset: 1472)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !384, file: !385, line: 60, baseType: !215, size: 320, offset: 1536)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !384, file: !385, line: 61, baseType: !215, size: 320, offset: 1856)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !384, file: !385, line: 63, baseType: !215, size: 320, offset: 2176)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !384, file: !385, line: 64, baseType: !508, size: 192, offset: 2496)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !384, file: !385, line: 65, baseType: !438, size: 320, offset: 2688)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !384, file: !385, line: 67, baseType: !652, size: 448, offset: 3008)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !653, line: 31, baseType: !654)
!653 = !DIFile(filename: "src/core/ngx_list.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "580525d954b127a1c35170a83ca4d8b1")
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !653, line: 25, size: 448, elements: !655)
!655 = !{!656, !664, !665, !666, !667}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !654, file: !653, line: 26, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !653, line: 16, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !653, line: 18, size: 192, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !659, file: !653, line: 19, baseType: !16, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !659, file: !653, line: 20, baseType: !11, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !659, file: !653, line: 21, baseType: !657, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !654, file: !653, line: 27, baseType: !658, size: 192, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !654, file: !653, line: 28, baseType: !52, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !654, file: !653, line: 29, baseType: !11, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !654, file: !653, line: 30, baseType: !224, size: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !384, file: !385, line: 68, baseType: !652, size: 448, offset: 3456)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !384, file: !385, line: 70, baseType: !11, size: 64, offset: 3904)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !384, file: !385, line: 71, baseType: !11, size: 64, offset: 3968)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !384, file: !385, line: 73, baseType: !396, size: 64, offset: 4032)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !384, file: !385, line: 74, baseType: !403, size: 64, offset: 4096)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !384, file: !385, line: 75, baseType: !403, size: 64, offset: 4160)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !384, file: !385, line: 77, baseType: !382, size: 64, offset: 4224)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !384, file: !385, line: 79, baseType: !118, size: 128, offset: 4288)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !384, file: !385, line: 80, baseType: !118, size: 128, offset: 4416)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !384, file: !385, line: 81, baseType: !118, size: 128, offset: 4544)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !384, file: !385, line: 82, baseType: !118, size: 128, offset: 4672)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "error_log", scope: !384, file: !385, line: 83, baseType: !118, size: 128, offset: 4800)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !384, file: !385, line: 84, baseType: !118, size: 128, offset: 4928)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !384, file: !385, line: 85, baseType: !118, size: 128, offset: 5056)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !210, file: !200, line: 121, baseType: !224, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !210, file: !200, line: 122, baseType: !224, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !210, file: !200, line: 123, baseType: !685, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !200, line: 103, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 98, size: 1792, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !687, file: !200, line: 99, baseType: !262, size: 1600)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !687, file: !200, line: 100, baseType: !246, size: 64, offset: 1600)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !687, file: !200, line: 101, baseType: !246, size: 64, offset: 1664)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !687, file: !200, line: 102, baseType: !11, size: 64, offset: 1728)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !210, file: !200, line: 124, baseType: !311, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !210, file: !200, line: 126, baseType: !16, size: 64, offset: 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !210, file: !200, line: 127, baseType: !11, size: 64, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !210, file: !200, line: 128, baseType: !11, size: 64, offset: 576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !210, file: !200, line: 130, baseType: !698, size: 64, offset: 640)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !200, line: 112, baseType: !205)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !210, file: !200, line: 131, baseType: !16, size: 64, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !199, file: !200, line: 81, baseType: !11, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !199, file: !200, line: 82, baseType: !11, size: 64, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !199, file: !200, line: 83, baseType: !16, size: 64, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !183, line: 236, baseType: !11, size: 64, offset: 576)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !182, file: !183, line: 238, baseType: !705, size: 64, offset: 640)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!150, !311}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !182, file: !183, line: 240, baseType: !709, size: 64, offset: 704)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!150, !382}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !182, file: !183, line: 242, baseType: !709, size: 64, offset: 768)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !182, file: !183, line: 243, baseType: !709, size: 64, offset: 832)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !182, file: !183, line: 244, baseType: !715, size: 64, offset: 896)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !382}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !182, file: !183, line: 245, baseType: !715, size: 64, offset: 960)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !182, file: !183, line: 247, baseType: !715, size: 64, offset: 1024)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !182, file: !183, line: 249, baseType: !13, size: 64, offset: 1088)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !182, file: !183, line: 250, baseType: !13, size: 64, offset: 1152)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !182, file: !183, line: 251, baseType: !13, size: 64, offset: 1216)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !182, file: !183, line: 252, baseType: !13, size: 64, offset: 1280)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !182, file: !183, line: 253, baseType: !13, size: 64, offset: 1344)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !182, file: !183, line: 254, baseType: !13, size: 64, offset: 1408)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !182, file: !183, line: 255, baseType: !13, size: 64, offset: 1472)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !182, file: !183, line: 256, baseType: !13, size: 64, offset: 1536)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !2, line: 25, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 5)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "ngx_http_upstream_zone_commands", scope: !9, file: !2, line: 23, type: !735, isLocal: true, isDefinition: true)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 896, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 2)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 23)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 91, type: !740, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !740, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 25)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !25, line: 36, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 24, size: 512, elements: !754)
!754 = !{!755, !759, !760, !764, !768, !769, !773, !774}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !753, file: !25, line: 25, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!150, !208}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !753, file: !25, line: 26, baseType: !756, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !753, file: !25, line: 28, baseType: !761, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!16, !208}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !753, file: !25, line: 29, baseType: !765, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!188, !208, !16}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !753, file: !25, line: 31, baseType: !761, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !753, file: !25, line: 32, baseType: !770, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!188, !208, !16, !16}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !753, file: !25, line: 34, baseType: !761, size: 64, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !753, file: !25, line: 35, baseType: !770, size: 64, offset: 448)
!775 = !{i32 7, !"Dwarf Version", i32 5}
!776 = !{i32 2, !"Debug Info Version", i32 3}
!777 = !{i32 1, !"wchar_size", i32 4}
!778 = !{i32 8, !"PIC Level", i32 2}
!779 = !{i32 7, !"PIE Level", i32 2}
!780 = !{i32 7, !"uwtable", i32 2}
!781 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!782 = distinct !DISubprogram(name: "ngx_http_upstream_zone", scope: !2, file: !2, line: 68, type: !206, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !2062}
!784 = !DILocalVariable(name: "cf", arg: 1, scope: !782, file: !2, line: 68, type: !208)
!785 = !DILocalVariable(name: "cmd", arg: 2, scope: !782, file: !2, line: 68, type: !197)
!786 = !DILocalVariable(name: "conf", arg: 3, scope: !782, file: !2, line: 68, type: !16)
!787 = !DILocalVariable(name: "size", scope: !782, file: !2, line: 70, type: !32)
!788 = !DILocalVariable(name: "value", scope: !782, file: !2, line: 71, type: !117)
!789 = !DILocalVariable(name: "uscf", scope: !782, file: !2, line: 72, type: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_srv_conf_t", file: !792, line: 79, baseType: !793)
!792 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "bad45a65b84155e2cd31779ca946a5e9")
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_srv_conf_s", file: !792, line: 121, size: 832, elements: !794)
!794 = !{!795, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !793, file: !792, line: 122, baseType: !796, size: 192)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_peer_t", file: !792, line: 91, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !792, line: 87, size: 192, elements: !798)
!798 = !{!799, !804, !2052}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !797, file: !792, line: 88, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_pt", file: !792, line: 81, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!150, !208, !790}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !797, file: !792, line: 89, baseType: !805, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_peer_pt", file: !792, line: 83, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!150, !809, !790}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !811, line: 16, baseType: !812)
