; ModuleID = 'samples/874.bc'
source_filename = "mod_session_crypto.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.command_struct = type { ptr, %union.cmd_func, ptr, i32, i32, ptr }
%union.cmd_func = type { ptr }
%struct.module_struct = type { i32, i32, i32, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct.session_crypto_dir_conf = type { ptr, i32, ptr, i32 }
%struct.session_crypto_conf = type { ptr, ptr, i32 }
%struct.cmd_parms_struct = type { ptr, i32, i32, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.server_rec = type { ptr, ptr, ptr, ptr, %struct.ap_logconf, ptr, ptr, ptr, i32, i8, i16, ptr, ptr, ptr, ptr, i64, i64, i32, i32, ptr, ptr, ptr, i32, i32, i32, i32, ptr, i8 }
%struct.ap_logconf = type { ptr, i32 }
%struct.request_rec = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i32, ptr, ptr, i64, ptr, i32, i32, ptr, i64, ptr, ptr, i64, i64, i64, ptr, i64, i32, i32, i32, i32, ptr, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, %struct.apr_uri_t, %struct.apr_finfo_t, ptr, ptr, ptr, ptr, ptr, i32, i64 }
%struct.apr_uri_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i16, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 798, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "mod_session_crypto.c", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/session", checksumkind: CSK_MD5, checksum: "c5a2f9c05699e1667621af8b35f9489c")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 21)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "session_crypto_cmds", scope: !9, file: !2, line: 776, type: !702, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !174, globals: !211, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !28, !86, !110, !119, !127, !139, !144, !149, !161, !169}
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cmd_how", file: !12, line: 49, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "include/http_config.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "478a5811bd142d8034ca8ebc320f852f")
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!15 = !DIEnumerator(name: "RAW_ARGS", value: 0)
!16 = !DIEnumerator(name: "TAKE1", value: 1)
!17 = !DIEnumerator(name: "TAKE2", value: 2)
!18 = !DIEnumerator(name: "ITERATE", value: 3)
!19 = !DIEnumerator(name: "ITERATE2", value: 4)
!20 = !DIEnumerator(name: "FLAG", value: 5)
!21 = !DIEnumerator(name: "NO_ARGS", value: 6)
!22 = !DIEnumerator(name: "TAKE12", value: 7)
!23 = !DIEnumerator(name: "TAKE3", value: 8)
!24 = !DIEnumerator(name: "TAKE23", value: 9)
!25 = !DIEnumerator(name: "TAKE123", value: 10)
!26 = !DIEnumerator(name: "TAKE13", value: 11)
!27 = !DIEnumerator(name: "TAKE_ARGV", value: 12)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !30, file: !29, line: 151, baseType: !13, size: 32, elements: !107)
!29 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_buckets.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "afcd28b2e200d46cb3a438f3ad8fc6de")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_type_t", file: !29, line: 131, size: 448, elements: !31)
!31 = !{!32, !35, !37, !38, !43, !90, !98, !102}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !29, line: 135, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "num_func", scope: !30, file: !29, line: 140, baseType: !36, size: 32, offset: 64)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "is_metadata", scope: !30, file: !29, line: 156, baseType: !28, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !30, file: !29, line: 164, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !30, file: !29, line: 176, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !49, !83, !84, !85}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !48, line: 44, baseType: !36)
!48 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_errno.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "571a7b9d4a9f11f6d27db63c8ba4bc85")
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket", file: !29, line: 121, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket", file: !29, line: 224, size: 512, elements: !52)
!52 = !{!53, !60, !64, !70, !77, !78, !79}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !51, file: !29, line: 226, baseType: !54, size: 128)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !29, line: 226, size: 128, elements: !55)
!55 = !{!56, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !29, line: 226, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !54, file: !29, line: 226, baseType: !57, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !29, line: 228, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_type_t", file: !29, line: 126, baseType: !30)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !51, file: !29, line: 234, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !66, line: 379, baseType: !67)
!66 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "73077acfd8398d55139f48047843856b")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 70, baseType: !69)
!68 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!69 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !51, file: !29, line: 242, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !66, line: 381, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !73, line: 85, baseType: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 152, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!76 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !51, file: !29, line: 244, baseType: !42, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !51, file: !29, line: 252, baseType: !39, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !51, file: !29, line: 254, baseType: !80, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_alloc_t", file: !29, line: 123, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_alloc_t", file: !29, line: 123, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_read_type_e", file: !29, line: 60, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 57, baseType: !13, size: 32, elements: !87)
!87 = !{!88, !89}
!88 = !DIEnumerator(name: "APR_BLOCK_READ", value: 0)
!89 = !DIEnumerator(name: "APR_NONBLOCK_READ", value: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "setaside", scope: !30, file: !29, line: 192, baseType: !91, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!47, !49, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !96, line: 60, baseType: !97)
!96 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_pools.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "ca846d53df1698194c1a577ccf147813")
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !96, line: 60, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !30, file: !29, line: 203, baseType: !99, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!47, !49, !65}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !30, file: !29, line: 211, baseType: !103, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!47, !49, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!107 = !{!108, !109}
!108 = !DIEnumerator(name: "APR_BUCKET_DATA", value: 0)
!109 = !DIEnumerator(name: "APR_BUCKET_METADATA", value: 1)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 41, baseType: !13, size: 32, elements: !112)
!111 = !DIFile(filename: "include/util_filter.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "894e51124b630754ca6243e0c50426ad")
!112 = !{!113, !114, !115, !116, !117, !118}
!113 = !DIEnumerator(name: "AP_MODE_READBYTES", value: 0)
!114 = !DIEnumerator(name: "AP_MODE_GETLINE", value: 1)
!115 = !DIEnumerator(name: "AP_MODE_EATCRLF", value: 2)
!116 = !DIEnumerator(name: "AP_MODE_SPECULATIVE", value: 3)
!117 = !DIEnumerator(name: "AP_MODE_EXHAUSTIVE", value: 4)
!118 = !DIEnumerator(name: "AP_MODE_INIT", value: 5)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 158, baseType: !13, size: 32, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126}
!121 = !DIEnumerator(name: "AP_FTYPE_RESOURCE", value: 10)
!122 = !DIEnumerator(name: "AP_FTYPE_CONTENT_SET", value: 20)
!123 = !DIEnumerator(name: "AP_FTYPE_PROTOCOL", value: 30)
!124 = !DIEnumerator(name: "AP_FTYPE_TRANSCODE", value: 40)
!125 = !DIEnumerator(name: "AP_FTYPE_CONNECTION", value: 50)
!126 = !DIEnumerator(name: "AP_FTYPE_NETWORK", value: 60)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 1251, baseType: !13, size: 32, elements: !129)
!128 = !DIFile(filename: "include/httpd.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "13796706810e88ffd526cf3216ebbaab")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138}
!130 = !DIEnumerator(name: "CONN_STATE_CHECK_REQUEST_LINE_READABLE", value: 0)
!131 = !DIEnumerator(name: "CONN_STATE_READ_REQUEST_LINE", value: 1)
!132 = !DIEnumerator(name: "CONN_STATE_HANDLER", value: 2)
!133 = !DIEnumerator(name: "CONN_STATE_WRITE_COMPLETION", value: 3)
!134 = !DIEnumerator(name: "CONN_STATE_SUSPENDED", value: 4)
!135 = !DIEnumerator(name: "CONN_STATE_LINGER", value: 5)
!136 = !DIEnumerator(name: "CONN_STATE_LINGER_NORMAL", value: 6)
!137 = !DIEnumerator(name: "CONN_STATE_LINGER_SHORT", value: 7)
!138 = !DIEnumerator(name: "CONN_STATE_NUM", value: 8)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 1264, baseType: !13, size: 32, elements: !140)
!140 = !{!141, !142, !143}
!141 = !DIEnumerator(name: "CONN_SENSE_DEFAULT", value: 0)
!142 = !DIEnumerator(name: "CONN_SENSE_WANT_READ", value: 1)
!143 = !DIEnumerator(name: "CONN_SENSE_WANT_WRITE", value: 2)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 1136, baseType: !13, size: 32, elements: !145)
!145 = !{!146, !147, !148}
!146 = !DIEnumerator(name: "AP_CONN_UNKNOWN", value: 0)
!147 = !DIEnumerator(name: "AP_CONN_CLOSE", value: 1)
!148 = !DIEnumerator(name: "AP_CONN_KEEPALIVE", value: 2)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !150, line: 62, baseType: !13, size: 32, elements: !151)
!150 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_info.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "58895203e42ced4eaee1557b60315f00")
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160}
!152 = !DIEnumerator(name: "APR_NOFILE", value: 0)
!153 = !DIEnumerator(name: "APR_REG", value: 1)
!154 = !DIEnumerator(name: "APR_DIR", value: 2)
!155 = !DIEnumerator(name: "APR_CHR", value: 3)
!156 = !DIEnumerator(name: "APR_BLK", value: 4)
!157 = !DIEnumerator(name: "APR_PIPE", value: 5)
!158 = !DIEnumerator(name: "APR_LNK", value: 6)
!159 = !DIEnumerator(name: "APR_SOCK", value: 7)
!160 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !162, line: 106, baseType: !13, size: 32, elements: !163)
!162 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_crypto.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "fac5587a1af4c5cc3b7c66ec4731fda6")
!163 = !{!164, !165, !166, !167, !168}
!164 = !DIEnumerator(name: "APR_KEY_NONE", value: 0)
!165 = !DIEnumerator(name: "APR_KEY_3DES_192", value: 1)
!166 = !DIEnumerator(name: "APR_KEY_AES_128", value: 2)
!167 = !DIEnumerator(name: "APR_KEY_AES_192", value: 3)
!168 = !DIEnumerator(name: "APR_KEY_AES_256", value: 4)
!169 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !162, line: 115, baseType: !13, size: 32, elements: !170)
!170 = !{!171, !172, !173}
!171 = !DIEnumerator(name: "APR_MODE_NONE", value: 0)
!172 = !DIEnumerator(name: "APR_MODE_ECB", value: 1)
!173 = !DIEnumerator(name: "APR_MODE_CBC", value: 2)
!174 = !{!42, !175, !194, !33, !201, !203, !83, !204, !206, !208, !190, !209}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "session_crypto_dir_conf", file: !2, line: 50, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 45, size: 256, elements: !178)
!178 = !{!179, !191, !192, !193}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "passphrases", scope: !177, file: !2, line: 46, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_array_header_t", file: !182, line: 59, baseType: !183)
!182 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_tables.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "82dd315cfdbab9381cd05a1d2abe34a2")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_array_header_t", file: !182, line: 62, size: 256, elements: !184)
!184 = !{!185, !186, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !183, file: !182, line: 64, baseType: !94, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !183, file: !182, line: 66, baseType: !36, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !183, file: !182, line: 68, baseType: !36, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !183, file: !182, line: 70, baseType: !36, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !183, file: !182, line: 72, baseType: !190, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "passphrases_set", scope: !177, file: !2, line: 47, baseType: !36, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !177, file: !2, line: 48, baseType: !33, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_set", scope: !177, file: !2, line: 49, baseType: !36, size: 32, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "session_crypto_conf", file: !2, line: 59, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 55, size: 192, elements: !197)
!197 = !{!198, !199, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !196, file: !2, line: 56, baseType: !33, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !196, file: !2, line: 57, baseType: !33, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "library_set", scope: !196, file: !2, line: 58, baseType: !36, size: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!211 = !{!0, !212, !513, !518, !521, !526, !531, !536, !541, !546, !551, !553, !7, !558, !563, !568, !573, !578, !583, !588, !593, !595, !600, !605, !610, !612, !617, !622, !624, !629, !634, !639, !644, !649, !651, !653, !655, !657, !659, !661, !663, !665, !670, !672, !677, !682, !687, !692, !697}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "session_crypto_module", scope: !9, file: !2, line: 796, type: !214, isLocal: false, isDefinition: true)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "module", file: !12, line: 344, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_struct", file: !12, line: 345, size: 896, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !224, !225, !238, !242, !246, !400, !401, !508, !512}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !215, file: !12, line: 349, baseType: !36, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "minor_version", scope: !215, file: !12, line: 352, baseType: !36, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "module_index", scope: !215, file: !12, line: 354, baseType: !36, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !12, line: 357, baseType: !33, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_load_handle", scope: !215, file: !12, line: 359, baseType: !42, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !12, line: 364, baseType: !223, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !215, file: !12, line: 368, baseType: !69, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "rewrite_args", scope: !215, file: !12, line: 374, baseType: !226, size: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "process_rec", file: !128, line: 805, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "process_rec", file: !128, line: 822, size: 320, elements: !232)
!232 = !{!233, !234, !235, !236, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !231, file: !128, line: 824, baseType: !94, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pconf", scope: !231, file: !128, line: 826, baseType: !94, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !231, file: !128, line: 828, baseType: !33, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !231, file: !128, line: 830, baseType: !201, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !231, file: !128, line: 832, baseType: !36, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "create_dir_config", scope: !215, file: !12, line: 381, baseType: !239, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!42, !94, !190}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "merge_dir_config", scope: !215, file: !12, line: 389, baseType: !243, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!42, !94, !42, !42}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_config", scope: !215, file: !12, line: 396, baseType: !247, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!42, !94, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_rec", file: !128, line: 807, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_rec", file: !128, line: 1315, size: 1536, elements: !253)
!253 = !{!254, !255, !256, !257, !262, !269, !272, !273, !274, !275, !276, !281, !282, !283, !284, !381, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !252, file: !128, line: 1317, baseType: !229, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !128, line: 1319, baseType: !250, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "error_fname", scope: !252, file: !128, line: 1324, baseType: !190, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "error_log", scope: !252, file: !128, line: 1326, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !260, line: 188, baseType: !261)
!260 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9f1a845f7255d07e28e3a10d24320b5d")
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !150, line: 212, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !252, file: !128, line: 1328, baseType: !263, size: 128, offset: 256)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_logconf", file: !128, line: 1305, size: 128, elements: !264)
!264 = !{!265, !268}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "module_levels", scope: !263, file: !128, line: 1307, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !263, file: !128, line: 1310, baseType: !36, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "module_config", scope: !252, file: !128, line: 1334, baseType: !270, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_conf_vector_t", file: !128, line: 791, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_defaults", scope: !252, file: !128, line: 1336, baseType: !270, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "defn_name", scope: !252, file: !128, line: 1339, baseType: !33, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "defn_line_number", scope: !252, file: !128, line: 1341, baseType: !13, size: 32, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "is_virtual", scope: !252, file: !128, line: 1343, baseType: !4, size: 8, offset: 608)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !252, file: !128, line: 1349, baseType: !277, size: 16, offset: 624)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_port_t", file: !278, line: 230, baseType: !279)
!278 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_network_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "d28b53dbcb33f6acce926c2efb3f7365")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint16_t", file: !66, line: 331, baseType: !280)
!280 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "server_scheme", scope: !252, file: !128, line: 1351, baseType: !33, size: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "server_admin", scope: !252, file: !128, line: 1356, baseType: !190, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "server_hostname", scope: !252, file: !128, line: 1358, baseType: !190, size: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !252, file: !128, line: 1363, baseType: !285, size: 64, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_addr_rec", file: !128, line: 1293, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_addr_rec", file: !128, line: 1294, size: 256, elements: !288)
!288 = !{!289, !290, !291, !380}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !128, line: 1296, baseType: !285, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "virthost", scope: !287, file: !128, line: 1298, baseType: !190, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !287, file: !128, line: 1300, baseType: !292, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_sockaddr_t", file: !278, line: 235, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_sockaddr_t", file: !278, line: 239, size: 1536, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !302, !307, !308, !309, !310, !311}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !294, file: !278, line: 241, baseType: !94, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !294, file: !278, line: 243, baseType: !190, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "servname", scope: !294, file: !278, line: 245, baseType: !190, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !294, file: !278, line: 247, baseType: !277, size: 16, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !294, file: !278, line: 249, baseType: !301, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !66, line: 333, baseType: !36)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !294, file: !278, line: 251, baseType: !303, size: 32, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_socklen_t", file: !66, line: 382, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !305, line: 33, baseType: !306)
!305 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !75, line: 210, baseType: !13)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_len", scope: !294, file: !278, line: 253, baseType: !36, size: 32, offset: 288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "addr_str_len", scope: !294, file: !278, line: 256, baseType: !36, size: 32, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_ptr", scope: !294, file: !278, line: 259, baseType: !42, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !278, line: 262, baseType: !292, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !294, file: !278, line: 280, baseType: !312, size: 1024, offset: 512)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !294, file: !278, line: 264, size: 1024, elements: !313)
!313 = !{!314, !337, !362, !371}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !312, file: !278, line: 266, baseType: !315, size: 128)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !316, line: 245, size: 128, elements: !317)
!316 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!317 = !{!318, !321, !326, !333}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !315, file: !316, line: 247, baseType: !319, size: 16)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !320, line: 28, baseType: !280)
!320 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !315, file: !316, line: 248, baseType: !322, size: 16, offset: 16)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !316, line: 123, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !324, line: 25, baseType: !325)
!324 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !75, line: 40, baseType: !280)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !315, file: !316, line: 249, baseType: !327, size: 32, offset: 32)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !316, line: 31, size: 32, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !327, file: !316, line: 33, baseType: !330, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !316, line: 30, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !324, line: 26, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !75, line: 42, baseType: !13)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !315, file: !316, line: 252, baseType: !334, size: 64, offset: 64)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 8)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !312, file: !278, line: 269, baseType: !338, size: 224)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !316, line: 260, size: 224, elements: !339)
!339 = !{!340, !341, !342, !343, !361}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !338, file: !316, line: 262, baseType: !319, size: 16)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !338, file: !316, line: 263, baseType: !322, size: 16, offset: 16)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !338, file: !316, line: 264, baseType: !331, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !338, file: !316, line: 265, baseType: !344, size: 128, offset: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !316, line: 219, size: 128, elements: !345)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !344, file: !316, line: 226, baseType: !347, size: 128)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !344, file: !316, line: 221, size: 128, elements: !348)
!348 = !{!349, !355, !357}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !347, file: !316, line: 223, baseType: !350, size: 128)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 128, elements: !353)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !324, line: 24, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !75, line: 38, baseType: !205)
!353 = !{!354}
!354 = !DISubrange(count: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !347, file: !316, line: 224, baseType: !356, size: 128)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 128, elements: !335)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !347, file: !316, line: 225, baseType: !358, size: 128)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 128, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 4)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !338, file: !316, line: 266, baseType: !331, size: 32, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sas", scope: !312, file: !278, line: 274, baseType: !363, size: 1024)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !305, line: 193, size: 1024, elements: !364)
!364 = !{!365, !366, !370}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !363, file: !305, line: 195, baseType: !319, size: 16)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !363, file: !305, line: 196, baseType: !367, size: 944, offset: 16)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 944, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 118)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !363, file: !305, line: 197, baseType: !69, size: 64, offset: 960)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "unx", scope: !312, file: !278, line: 278, baseType: !372, size: 880)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !373, line: 29, size: 880, elements: !374)
!373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !372, file: !373, line: 31, baseType: !319, size: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !372, file: !373, line: 32, baseType: !377, size: 864, offset: 16)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 864, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 108)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "host_port", scope: !287, file: !128, line: 1302, baseType: !277, size: 16, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !252, file: !128, line: 1365, baseType: !382, size: 64, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !383, line: 55, baseType: !384)
!383 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_time.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "1a8b9732d4ee010f71e3eb03e6e3a16e")
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !66, line: 371, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !386, line: 27, baseType: !387)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !75, line: 44, baseType: !76)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !252, file: !128, line: 1367, baseType: !382, size: 64, offset: 960)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !252, file: !128, line: 1369, baseType: !36, size: 32, offset: 1024)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !252, file: !128, line: 1371, baseType: !36, size: 32, offset: 1056)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !252, file: !128, line: 1374, baseType: !180, size: 64, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wild_names", scope: !252, file: !128, line: 1376, baseType: !180, size: 64, offset: 1152)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !252, file: !128, line: 1379, baseType: !33, size: 64, offset: 1216)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pathlen", scope: !252, file: !128, line: 1381, baseType: !36, size: 32, offset: 1280)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_line", scope: !252, file: !128, line: 1384, baseType: !36, size: 32, offset: 1312)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fieldsize", scope: !252, file: !128, line: 1386, baseType: !36, size: 32, offset: 1344)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fields", scope: !252, file: !128, line: 1388, baseType: !36, size: 32, offset: 1376)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !252, file: !128, line: 1391, baseType: !42, size: 64, offset: 1408)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout_set", scope: !252, file: !128, line: 1396, baseType: !13, size: 1, offset: 1472, flags: DIFlagBitField, extraData: i64 1472)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "merge_server_config", scope: !215, file: !12, line: 404, baseType: !243, size: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cmds", scope: !215, file: !12, line: 409, baseType: !402, size: 64, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "command_rec", file: !12, line: 203, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "command_struct", file: !12, line: 204, size: 320, elements: !406)
!406 = !{!407, !408, !504, !505, !506, !507}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !12, line: 206, baseType: !33, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !405, file: !12, line: 208, baseType: !409, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmd_func", file: !12, line: 101, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 82, size: 64, elements: !411)
!411 = !{!412, !481, !485, !491, !492, !496, !500}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "no_args", scope: !410, file: !12, line: 84, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!33, !416, !42}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmd_parms", file: !12, line: 74, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmd_parms_struct", file: !12, line: 288, size: 960, elements: !419)
!419 = !{!420, !421, !422, !423, !427, !428, !429, !436, !456, !472, !473, !474, !475, !476, !477, !478}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !418, file: !12, line: 290, baseType: !42, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !418, file: !12, line: 292, baseType: !36, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "override_opts", scope: !418, file: !12, line: 294, baseType: !36, size: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "override_list", scope: !418, file: !12, line: 296, baseType: !424, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_table_t", file: !182, line: 56, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_table_t", file: !182, line: 56, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "limited", scope: !418, file: !12, line: 298, baseType: !384, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "limited_xmethods", scope: !418, file: !12, line: 300, baseType: !180, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "xlimited", scope: !418, file: !12, line: 302, baseType: !430, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_method_list_t", file: !128, line: 634, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_method_list_t", file: !128, line: 643, size: 128, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "method_mask", scope: !432, file: !128, line: 645, baseType: !384, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "method_list", scope: !432, file: !128, line: 647, baseType: !180, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "config_file", scope: !418, file: !12, line: 305, baseType: !437, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_configfile_t", file: !12, line: 267, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_configfile_t", file: !12, line: 268, size: 384, elements: !440)
!440 = !{!441, !445, !449, !453, !454, !455}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "getch", scope: !439, file: !12, line: 270, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!47, !190, !42}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "getstr", scope: !439, file: !12, line: 272, baseType: !446, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!47, !42, !65, !42}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !439, file: !12, line: 274, baseType: !450, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!47, !42}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !439, file: !12, line: 276, baseType: !42, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !439, file: !12, line: 278, baseType: !33, size: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !439, file: !12, line: 280, baseType: !13, size: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !418, file: !12, line: 307, baseType: !457, size: 64, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_directive_t", file: !459, line: 35, baseType: !460)
!459 = !DIFile(filename: "include/util_cfgtree.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "c91452b9a51fb2ed560e306e1998c613")
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_directive_t", file: !459, line: 46, size: 576, elements: !461)
!461 = !{!462, !463, !464, !466, !467, !468, !469, !470, !471}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !460, file: !459, line: 48, baseType: !33, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !460, file: !459, line: 51, baseType: !33, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !459, line: 53, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "first_child", scope: !460, file: !459, line: 55, baseType: !465, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !460, file: !459, line: 57, baseType: !465, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !460, file: !459, line: 60, baseType: !42, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !460, file: !459, line: 64, baseType: !33, size: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "line_num", scope: !460, file: !459, line: 66, baseType: !36, size: 32, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !460, file: !459, line: 73, baseType: !465, size: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !418, file: !12, line: 310, baseType: !94, size: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !418, file: !12, line: 313, baseType: !94, size: 64, offset: 576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !418, file: !12, line: 315, baseType: !250, size: 64, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !418, file: !12, line: 322, baseType: !190, size: 64, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !418, file: !12, line: 324, baseType: !402, size: 64, offset: 768)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !418, file: !12, line: 327, baseType: !270, size: 64, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "err_directive", scope: !418, file: !12, line: 329, baseType: !479, size: 64, offset: 896)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "raw_args", scope: !410, file: !12, line: 86, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!33, !416, !42, !33}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "take_argv", scope: !410, file: !12, line: 89, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!33, !416, !42, !36, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "take1", scope: !410, file: !12, line: 92, baseType: !482, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "take2", scope: !410, file: !12, line: 94, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!33, !416, !42, !33, !33}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "take3", scope: !410, file: !12, line: 97, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!33, !416, !42, !33, !33, !33}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !410, file: !12, line: 100, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!33, !416, !42, !36}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_data", scope: !405, file: !12, line: 210, baseType: !42, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "req_override", scope: !405, file: !12, line: 212, baseType: !36, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "args_how", scope: !405, file: !12, line: 214, baseType: !11, size: 32, offset: 224)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "errmsg", scope: !405, file: !12, line: 217, baseType: !33, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "register_hooks", scope: !215, file: !12, line: 417, baseType: !509, size: 64, offset: 768)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !94}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !215, file: !12, line: 420, baseType: !36, size: 32, offset: 832)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 7)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !2, line: 641, type: !520, isLocal: true, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !335)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 778, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 24)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !2, line: 778, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1008, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 126)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !2, line: 780, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 28)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 780, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1216, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 152)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 782, type: !543, isLocal: true, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 20)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 782, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 36)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 784, type: !543, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 784, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 44)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !2, line: 703, type: !560, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 6)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !2, line: 706, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 37)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 713, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 47)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !2, line: 721, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 42)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !2, line: 747, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 32)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 510, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 23)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "aplog_module_index", scope: !9, file: !590, line: 148, type: !591, isLocal: true, isDefinition: true)
!590 = !DIFile(filename: "include/http_log.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "ce7bde9ead508f1c34c81b1931b44b16")
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !580, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !2, line: 295, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 48)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !2, line: 299, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 45)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !2, line: 303, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 35)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !2, line: 307, type: !602, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !2, line: 314, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 46)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 324, type: !619, isLocal: true, isDefinition: true)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 41)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 330, type: !597, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 69)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 248, type: !631, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 792, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 99)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !2, line: 545, type: !636, isLocal: true, isDefinition: true)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 51)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !2, line: 384, type: !641, isLocal: true, isDefinition: true)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 40)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !2, line: 408, type: !646, isLocal: true, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 39)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !597, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !2, line: 424, type: !602, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !2, line: 429, type: !607, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !2, line: 434, type: !602, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !2, line: 441, type: !641, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !2, line: 454, type: !614, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !2, line: 467, type: !619, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !2, line: 475, type: !597, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !2, line: 486, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 27)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !2, line: 582, type: !602, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 704, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 88)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !2, line: 595, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 528, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 66)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !2, line: 600, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 52)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !2, line: 606, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 53)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !2, line: 614, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 58)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !2, line: 620, type: !699, isLocal: true, isDefinition: true)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 57)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 1600, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 5)
!705 = !{i32 7, !"Dwarf Version", i32 5}
!706 = !{i32 2, !"Debug Info Version", i32 3}
!707 = !{i32 1, !"wchar_size", i32 4}
!708 = !{i32 8, !"PIC Level", i32 2}
!709 = !{i32 7, !"uwtable", i32 2}
!710 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!711 = distinct !DISubprogram(name: "create_session_crypto_dir_config", scope: !2, file: !2, line: 647, type: !240, scopeLine: 648, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !712)
!712 = !{!713, !714, !715}
!713 = !DILocalVariable(name: "p", arg: 1, scope: !711, file: !2, line: 647, type: !94)
!714 = !DILocalVariable(name: "dummy", arg: 2, scope: !711, file: !2, line: 647, type: !190)
!715 = !DILocalVariable(name: "new", scope: !711, file: !2, line: 649, type: !175)
!716 = !{!717, !717, i64 0}
!717 = !{!"any pointer", !718, i64 0}
!718 = !{!"omnipotent char", !719, i64 0}
!719 = !{!"Simple C/C++ TBAA"}
!720 = !DILocation(line: 647, column: 60, scope: !711)
!721 = !DILocation(line: 647, column: 69, scope: !711)
!722 = !DILocation(line: 649, column: 5, scope: !711)
!723 = !DILocation(line: 649, column: 30, scope: !711)
!724 = !DILocation(line: 650, column: 33, scope: !711)
!725 = !DILocation(line: 652, column: 39, scope: !711)
!726 = !DILocation(line: 652, column: 24, scope: !711)
!727 = !DILocation(line: 652, column: 5, scope: !711)
!728 = !DILocation(line: 652, column: 10, scope: !711)
!729 = !DILocation(line: 652, column: 22, scope: !711)
!730 = !{!731, !717, i64 0}
!731 = !{!"", !717, i64 0, !732, i64 8, !717, i64 16, !732, i64 24}
!732 = !{!"int", !718, i64 0}
!733 = !DILocation(line: 655, column: 5, scope: !711)
!734 = !DILocation(line: 655, column: 10, scope: !711)
!735 = !DILocation(line: 655, column: 17, scope: !711)
!736 = !{!731, !717, i64 16}
!737 = !DILocation(line: 657, column: 21, scope: !711)
!738 = !DILocation(line: 658, column: 1, scope: !711)
!739 = !DILocation(line: 657, column: 5, scope: !711)
!740 = distinct !DISubprogram(name: "merge_session_crypto_dir_config", scope: !2, file: !2, line: 660, type: !244, scopeLine: 661, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !741)
!741 = !{!742, !743, !744, !745, !746, !747}
!742 = !DILocalVariable(name: "p", arg: 1, scope: !740, file: !2, line: 660, type: !94)
!743 = !DILocalVariable(name: "basev", arg: 2, scope: !740, file: !2, line: 660, type: !42)
!744 = !DILocalVariable(name: "addv", arg: 3, scope: !740, file: !2, line: 660, type: !42)
!745 = !DILocalVariable(name: "new", scope: !740, file: !2, line: 662, type: !175)
!746 = !DILocalVariable(name: "add", scope: !740, file: !2, line: 663, type: !175)
!747 = !DILocalVariable(name: "base", scope: !740, file: !2, line: 664, type: !175)
!748 = !DILocation(line: 660, column: 59, scope: !740)
!749 = !DILocation(line: 660, column: 68, scope: !740)
!750 = !DILocation(line: 660, column: 81, scope: !740)
!751 = !DILocation(line: 662, column: 5, scope: !740)
!752 = !DILocation(line: 662, column: 30, scope: !740)
!753 = !DILocation(line: 662, column: 64, scope: !740)
!754 = !DILocation(line: 663, column: 5, scope: !740)
!755 = !DILocation(line: 663, column: 30, scope: !740)
!756 = !DILocation(line: 663, column: 64, scope: !740)
!757 = !DILocation(line: 664, column: 5, scope: !740)
!758 = !DILocation(line: 664, column: 30, scope: !740)
!759 = !DILocation(line: 664, column: 65, scope: !740)
!760 = !DILocation(line: 666, column: 25, scope: !740)
!761 = !DILocation(line: 666, column: 30, scope: !740)
!762 = !{!731, !732, i64 8}
!763 = !DILocation(line: 666, column: 46, scope: !740)
!764 = !DILocation(line: 666, column: 24, scope: !740)
!765 = !DILocation(line: 666, column: 54, scope: !740)
!766 = !DILocation(line: 666, column: 60, scope: !740)
!767 = !DILocation(line: 666, column: 74, scope: !740)
!768 = !DILocation(line: 666, column: 79, scope: !740)
!769 = !DILocation(line: 666, column: 5, scope: !740)
!770 = !DILocation(line: 666, column: 10, scope: !740)
!771 = !DILocation(line: 666, column: 22, scope: !740)
!772 = !DILocation(line: 667, column: 28, scope: !740)
!773 = !DILocation(line: 667, column: 33, scope: !740)
!774 = !DILocation(line: 667, column: 49, scope: !740)
!775 = !DILocation(line: 667, column: 52, scope: !740)
!776 = !DILocation(line: 667, column: 58, scope: !740)
!777 = !DILocation(line: 667, column: 5, scope: !740)
!778 = !DILocation(line: 667, column: 10, scope: !740)
!779 = !DILocation(line: 667, column: 26, scope: !740)
!780 = !DILocation(line: 668, column: 20, scope: !740)
!781 = !DILocation(line: 668, column: 25, scope: !740)
!782 = !{!731, !732, i64 24}
!783 = !DILocation(line: 668, column: 36, scope: !740)
!784 = !DILocation(line: 668, column: 19, scope: !740)
!785 = !DILocation(line: 668, column: 44, scope: !740)
!786 = !DILocation(line: 668, column: 50, scope: !740)
!787 = !DILocation(line: 668, column: 59, scope: !740)
!788 = !DILocation(line: 668, column: 64, scope: !740)
!789 = !DILocation(line: 668, column: 5, scope: !740)
!790 = !DILocation(line: 668, column: 10, scope: !740)
!791 = !DILocation(line: 668, column: 17, scope: !740)
!792 = !DILocation(line: 669, column: 23, scope: !740)
!793 = !DILocation(line: 669, column: 28, scope: !740)
!794 = !DILocation(line: 669, column: 39, scope: !740)
!795 = !DILocation(line: 669, column: 42, scope: !740)
!796 = !DILocation(line: 669, column: 48, scope: !740)
!797 = !DILocation(line: 669, column: 5, scope: !740)
!798 = !DILocation(line: 669, column: 10, scope: !740)
!799 = !DILocation(line: 669, column: 21, scope: !740)
!800 = !DILocation(line: 671, column: 12, scope: !740)
!801 = !DILocation(line: 672, column: 1, scope: !740)
!802 = !DILocation(line: 671, column: 5, scope: !740)
!803 = distinct !DISubprogram(name: "create_session_crypto_config", scope: !2, file: !2, line: 632, type: !248, scopeLine: 633, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !804)
!804 = !{!805, !806, !807}
!805 = !DILocalVariable(name: "p", arg: 1, scope: !803, file: !2, line: 632, type: !94)
!806 = !DILocalVariable(name: "s", arg: 2, scope: !803, file: !2, line: 632, type: !250)
!807 = !DILocalVariable(name: "new", scope: !803, file: !2, line: 634, type: !194)
!808 = !DILocation(line: 632, column: 56, scope: !803)
!809 = !DILocation(line: 632, column: 71, scope: !803)
!810 = !DILocation(line: 634, column: 5, scope: !803)
!811 = !DILocation(line: 634, column: 26, scope: !803)
!812 = !DILocation(line: 635, column: 29, scope: !803)
!813 = !DILocation(line: 641, column: 5, scope: !803)
!814 = !DILocation(line: 641, column: 10, scope: !803)
!815 = !DILocation(line: 641, column: 18, scope: !803)
!816 = !{!817, !717, i64 0}
!817 = !{!"", !717, i64 0, !717, i64 8, !732, i64 16}
!818 = !DILocation(line: 644, column: 21, scope: !803)
!819 = !DILocation(line: 645, column: 1, scope: !803)
!820 = !DILocation(line: 644, column: 5, scope: !803)
!821 = distinct !DISubprogram(name: "register_hooks", scope: !2, file: !2, line: 789, type: !510, scopeLine: 790, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !822)
!822 = !{!823}
!823 = !DILocalVariable(name: "p", arg: 1, scope: !821, file: !2, line: 789, type: !94)
!824 = !DILocation(line: 789, column: 41, scope: !821)
!825 = !DILocation(line: 791, column: 5, scope: !821)
!826 = !DILocation(line: 792, column: 5, scope: !821)
!827 = !DILocation(line: 793, column: 5, scope: !821)
!828 = !DILocation(line: 794, column: 1, scope: !821)
!829 = !DISubprogram(name: "apr_palloc", scope: !96, file: !96, line: 430, type: !830, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!830 = !DISubroutineType(types: !831)
!831 = !{!42, !94, !65}
!832 = !DISubprogram(name: "apr_array_make", scope: !182, file: !182, line: 121, type: !833, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DISubroutineType(types: !834)
!834 = !{!180, !94, !36, !36}
!835 = distinct !DISubprogram(name: "set_crypto_passphrase", scope: !2, file: !2, line: 693, type: !483, scopeLine: 694, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !836)
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844}
!837 = !DILocalVariable(name: "cmd", arg: 1, scope: !835, file: !2, line: 693, type: !416)
!838 = !DILocalVariable(name: "config", arg: 2, scope: !835, file: !2, line: 693, type: !42)
!839 = !DILocalVariable(name: "arg", arg: 3, scope: !835, file: !2, line: 693, type: !33)
!840 = !DILocalVariable(name: "arglen", scope: !835, file: !2, line: 695, type: !36)
!841 = !DILocalVariable(name: "argv", scope: !835, file: !2, line: 696, type: !208)
!842 = !DILocalVariable(name: "result", scope: !835, file: !2, line: 697, type: !190)
!843 = !DILocalVariable(name: "passphrase", scope: !835, file: !2, line: 698, type: !83)
!844 = !DILocalVariable(name: "dconf", scope: !835, file: !2, line: 699, type: !175)
!845 = !DILocation(line: 693, column: 54, scope: !835)
!846 = !DILocation(line: 693, column: 65, scope: !835)
!847 = !DILocation(line: 693, column: 85, scope: !835)
!848 = !DILocation(line: 695, column: 5, scope: !835)
!849 = !DILocation(line: 695, column: 9, scope: !835)
!850 = !DILocation(line: 695, column: 25, scope: !835)
!851 = !DILocation(line: 695, column: 18, scope: !835)
!852 = !{!732, !732, i64 0}
!853 = !DILocation(line: 696, column: 5, scope: !835)
!854 = !DILocation(line: 696, column: 12, scope: !835)
!855 = !DILocation(line: 697, column: 5, scope: !835)
!856 = !DILocation(line: 697, column: 11, scope: !835)
!857 = !DILocation(line: 698, column: 5, scope: !835)
!858 = !DILocation(line: 698, column: 18, scope: !835)
!859 = !DILocation(line: 699, column: 5, scope: !835)
!860 = !DILocation(line: 699, column: 30, scope: !835)
!861 = !DILocation(line: 699, column: 66, scope: !835)
!862 = !DILocation(line: 701, column: 33, scope: !835)
!863 = !DILocation(line: 701, column: 40, scope: !835)
!864 = !DILocation(line: 701, column: 18, scope: !835)
!865 = !DILocation(line: 701, column: 16, scope: !835)
!866 = !DILocation(line: 703, column: 10, scope: !867)
!867 = distinct !DILexicalBlock(scope: !835, file: !2, line: 703, column: 9)
!868 = !DILocation(line: 703, column: 17, scope: !867)
!869 = !DILocation(line: 703, column: 22, scope: !867)
!870 = !DILocation(line: 703, column: 33, scope: !867)
!871 = !DILocation(line: 703, column: 25, scope: !867)
!872 = !DILocation(line: 703, column: 50, scope: !867)
!873 = !DILocation(line: 703, column: 9, scope: !835)
!874 = !DILocation(line: 704, column: 34, scope: !875)
!875 = distinct !DILexicalBlock(scope: !876, file: !2, line: 704, column: 13)
!876 = distinct !DILexicalBlock(scope: !867, file: !2, line: 703, column: 56)
!877 = !DILocation(line: 704, column: 37, scope: !875)
!878 = !DILocation(line: 704, column: 48, scope: !875)
!879 = !DILocation(line: 704, column: 53, scope: !875)
!880 = !{!881, !717, i64 72}
!881 = !{!"cmd_parms_struct", !717, i64 0, !732, i64 8, !732, i64 12, !717, i64 16, !882, i64 24, !717, i64 32, !717, i64 40, !717, i64 48, !717, i64 56, !717, i64 64, !717, i64 72, !717, i64 80, !717, i64 88, !717, i64 96, !717, i64 104, !717, i64 112}
!882 = !{!"long", !718, i64 0}
!883 = !DILocation(line: 704, column: 13, scope: !875)
!884 = !DILocation(line: 704, column: 64, scope: !875)
!885 = !DILocation(line: 704, column: 13, scope: !876)
!886 = !DILocation(line: 705, column: 32, scope: !887)
!887 = distinct !DILexicalBlock(scope: !875, file: !2, line: 704, column: 80)
!888 = !DILocation(line: 705, column: 37, scope: !887)
!889 = !{!881, !717, i64 64}
!890 = !DILocation(line: 707, column: 32, scope: !887)
!891 = !DILocation(line: 707, column: 35, scope: !887)
!892 = !DILocation(line: 705, column: 20, scope: !887)
!893 = !DILocation(line: 705, column: 13, scope: !887)
!894 = !DILocation(line: 709, column: 43, scope: !876)
!895 = !DILocation(line: 709, column: 48, scope: !876)
!896 = !DILocation(line: 709, column: 59, scope: !876)
!897 = !DILocation(line: 709, column: 19, scope: !876)
!898 = !DILocation(line: 709, column: 9, scope: !876)
!899 = !DILocation(line: 709, column: 17, scope: !876)
!900 = !DILocation(line: 711, column: 14, scope: !901)
!901 = distinct !DILexicalBlock(scope: !876, file: !2, line: 711, column: 13)
!902 = !DILocation(line: 711, column: 13, scope: !876)
!903 = !DILocation(line: 712, column: 32, scope: !904)
!904 = distinct !DILexicalBlock(scope: !901, file: !2, line: 711, column: 23)
!905 = !DILocation(line: 712, column: 37, scope: !904)
!906 = !DILocation(line: 714, column: 32, scope: !904)
!907 = !DILocation(line: 714, column: 35, scope: !904)
!908 = !DILocation(line: 712, column: 20, scope: !904)
!909 = !DILocation(line: 712, column: 13, scope: !904)
!910 = !DILocation(line: 716, column: 35, scope: !876)
!911 = !DILocation(line: 716, column: 40, scope: !876)
!912 = !DILocation(line: 717, column: 48, scope: !876)
!913 = !DILocation(line: 717, column: 79, scope: !876)
!914 = !DILocation(line: 716, column: 18, scope: !876)
!915 = !DILocation(line: 716, column: 16, scope: !876)
!916 = !DILocation(line: 719, column: 13, scope: !917)
!917 = distinct !DILexicalBlock(scope: !876, file: !2, line: 719, column: 12)
!918 = !DILocation(line: 719, column: 12, scope: !876)
!919 = !DILocation(line: 720, column: 32, scope: !920)
!920 = distinct !DILexicalBlock(scope: !917, file: !2, line: 719, column: 21)
!921 = !DILocation(line: 720, column: 37, scope: !920)
!922 = !DILocation(line: 722, column: 32, scope: !920)
!923 = !DILocation(line: 722, column: 35, scope: !920)
!924 = !DILocation(line: 720, column: 20, scope: !920)
!925 = !DILocation(line: 720, column: 13, scope: !920)
!926 = !DILocation(line: 724, column: 23, scope: !876)
!927 = !DILocation(line: 724, column: 10, scope: !876)
!928 = !DILocation(line: 724, column: 21, scope: !876)
!929 = !DILocation(line: 725, column: 5, scope: !876)
!930 = !DILocation(line: 727, column: 23, scope: !931)
!931 = distinct !DILexicalBlock(scope: !867, file: !2, line: 726, column: 10)
!932 = !DILocation(line: 727, column: 10, scope: !931)
!933 = !DILocation(line: 727, column: 21, scope: !931)
!934 = !DILocation(line: 730, column: 5, scope: !835)
!935 = !DILocation(line: 730, column: 12, scope: !835)
!936 = !DILocation(line: 730, column: 28, scope: !835)
!937 = !DILocation(line: 732, column: 5, scope: !835)
!938 = !DILocation(line: 733, column: 1, scope: !835)
!939 = distinct !DISubprogram(name: "set_crypto_passphrase_file", scope: !2, file: !2, line: 735, type: !483, scopeLine: 737, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !940)
!940 = !{!941, !942, !943, !944, !948, !949, !950, !951}
!941 = !DILocalVariable(name: "cmd", arg: 1, scope: !939, file: !2, line: 735, type: !416)
!942 = !DILocalVariable(name: "config", arg: 2, scope: !939, file: !2, line: 735, type: !42)
!943 = !DILocalVariable(name: "filename", arg: 3, scope: !939, file: !2, line: 736, type: !33)
!944 = !DILocalVariable(name: "buffer", scope: !939, file: !2, line: 738, type: !945)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !946)
!946 = !{!947}
!947 = !DISubrange(count: 8192)
!948 = !DILocalVariable(name: "arg", scope: !939, file: !2, line: 739, type: !190)
!949 = !DILocalVariable(name: "args", scope: !939, file: !2, line: 740, type: !33)
!950 = !DILocalVariable(name: "file", scope: !939, file: !2, line: 741, type: !437)
!951 = !DILocalVariable(name: "rv", scope: !939, file: !2, line: 742, type: !47)
!952 = !DILocation(line: 735, column: 58, scope: !939)
!953 = !DILocation(line: 735, column: 69, scope: !939)
!954 = !DILocation(line: 736, column: 47, scope: !939)
!955 = !DILocation(line: 738, column: 5, scope: !939)
!956 = !DILocation(line: 738, column: 10, scope: !939)
!957 = !DILocation(line: 739, column: 5, scope: !939)
!958 = !DILocation(line: 739, column: 11, scope: !939)
!959 = !DILocation(line: 740, column: 5, scope: !939)
!960 = !DILocation(line: 740, column: 17, scope: !939)
!961 = !DILocation(line: 741, column: 5, scope: !939)
!962 = !DILocation(line: 741, column: 22, scope: !939)
!963 = !DILocation(line: 742, column: 5, scope: !939)
!964 = !DILocation(line: 742, column: 18, scope: !939)
!965 = !DILocation(line: 744, column: 40, scope: !939)
!966 = !DILocation(line: 744, column: 45, scope: !939)
!967 = !DILocation(line: 744, column: 56, scope: !939)
!968 = !DILocation(line: 744, column: 16, scope: !939)
!969 = !DILocation(line: 744, column: 14, scope: !939)
!970 = !DILocation(line: 745, column: 34, scope: !939)
!971 = !DILocation(line: 745, column: 39, scope: !939)
!972 = !DILocation(line: 745, column: 50, scope: !939)
!973 = !DILocation(line: 745, column: 10, scope: !939)
!974 = !DILocation(line: 745, column: 8, scope: !939)
!975 = !DILocation(line: 746, column: 9, scope: !976)
!976 = distinct !DILexicalBlock(scope: !939, file: !2, line: 746, column: 9)
!977 = !DILocation(line: 746, column: 12, scope: !976)
!978 = !DILocation(line: 746, column: 9, scope: !939)
!979 = !DILocation(line: 747, column: 29, scope: !980)
!980 = distinct !DILexicalBlock(scope: !976, file: !2, line: 746, column: 28)
!981 = !DILocation(line: 747, column: 34, scope: !980)
!982 = !DILocation(line: 748, column: 29, scope: !980)
!983 = !DILocation(line: 748, column: 34, scope: !980)
!984 = !{!881, !717, i64 96}
!985 = !DILocation(line: 748, column: 39, scope: !980)
!986 = !{!987, !717, i64 0}
!987 = !{!"command_struct", !717, i64 0, !718, i64 8, !717, i64 16, !732, i64 24, !718, i64 28, !717, i64 32}
!988 = !DILocation(line: 748, column: 45, scope: !980)
!989 = !DILocation(line: 747, column: 16, scope: !980)
!990 = !DILocation(line: 747, column: 9, scope: !980)
!991 = !DILocation(line: 751, column: 5, scope: !939)
!992 = !DILocation(line: 751, column: 29, scope: !939)
!993 = !DILocation(line: 751, column: 53, scope: !939)
!994 = !DILocation(line: 751, column: 14, scope: !939)
!995 = !DILocation(line: 751, column: 12, scope: !939)
!996 = !DILocation(line: 752, column: 16, scope: !997)
!997 = distinct !DILexicalBlock(scope: !939, file: !2, line: 751, column: 61)
!998 = !DILocation(line: 752, column: 14, scope: !997)
!999 = !DILocation(line: 753, column: 9, scope: !997)
!1000 = !DILocation(line: 753, column: 40, scope: !997)
!1001 = !DILocation(line: 753, column: 45, scope: !997)
!1002 = !DILocation(line: 753, column: 24, scope: !997)
!1003 = !DILocation(line: 753, column: 22, scope: !997)
!1004 = !DILocation(line: 753, column: 16, scope: !997)
!1005 = !{!718, !718, i64 0}
!1006 = !DILocation(line: 753, column: 59, scope: !997)
!1007 = !DILocation(line: 754, column: 18, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 754, column: 17)
!1009 = distinct !DILexicalBlock(scope: !997, file: !2, line: 753, column: 68)
!1010 = !DILocation(line: 754, column: 17, scope: !1008)
!1011 = !DILocation(line: 754, column: 22, scope: !1008)
!1012 = !DILocation(line: 754, column: 17, scope: !1009)
!1013 = !DILocation(line: 755, column: 17, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 754, column: 30)
!1015 = !DILocation(line: 757, column: 35, scope: !1009)
!1016 = !DILocation(line: 757, column: 40, scope: !1009)
!1017 = !DILocation(line: 757, column: 48, scope: !1009)
!1018 = !DILocation(line: 757, column: 13, scope: !1009)
!1019 = distinct !{!1019, !999, !1020, !1021}
!1020 = !DILocation(line: 758, column: 9, scope: !997)
!1021 = !{!"llvm.loop.mustprogress"}
!1022 = distinct !{!1022, !991, !1023, !1021}
!1023 = !DILocation(line: 759, column: 5, scope: !939)
!1024 = !DILocation(line: 761, column: 22, scope: !939)
!1025 = !DILocation(line: 761, column: 5, scope: !939)
!1026 = !DILocation(line: 763, column: 5, scope: !939)
!1027 = !DILocation(line: 764, column: 1, scope: !939)
!1028 = distinct !DISubprogram(name: "set_crypto_cipher", scope: !2, file: !2, line: 766, type: !483, scopeLine: 767, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !1029)
!1029 = !{!1030, !1031, !1032, !1033}
!1030 = !DILocalVariable(name: "cmd", arg: 1, scope: !1028, file: !2, line: 766, type: !416)
!1031 = !DILocalVariable(name: "config", arg: 2, scope: !1028, file: !2, line: 766, type: !42)
!1032 = !DILocalVariable(name: "cipher", arg: 3, scope: !1028, file: !2, line: 766, type: !33)
!1033 = !DILocalVariable(name: "dconf", scope: !1028, file: !2, line: 768, type: !175)
!1034 = !DILocation(line: 766, column: 50, scope: !1028)
!1035 = !DILocation(line: 766, column: 61, scope: !1028)
!1036 = !DILocation(line: 766, column: 81, scope: !1028)
!1037 = !DILocation(line: 768, column: 5, scope: !1028)
!1038 = !DILocation(line: 768, column: 30, scope: !1028)
!1039 = !DILocation(line: 768, column: 66, scope: !1028)
!1040 = !DILocation(line: 770, column: 21, scope: !1028)
!1041 = !DILocation(line: 770, column: 5, scope: !1028)
!1042 = !DILocation(line: 770, column: 12, scope: !1028)
!1043 = !DILocation(line: 770, column: 19, scope: !1028)
!1044 = !DILocation(line: 771, column: 5, scope: !1028)
!1045 = !DILocation(line: 771, column: 12, scope: !1028)
!1046 = !DILocation(line: 771, column: 23, scope: !1028)
!1047 = !DILocation(line: 774, column: 1, scope: !1028)
!1048 = !DILocation(line: 773, column: 5, scope: !1028)
!1049 = distinct !DISubprogram(name: "set_crypto_driver", scope: !2, file: !2, line: 674, type: !483, scopeLine: 675, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055}
!1051 = !DILocalVariable(name: "cmd", arg: 1, scope: !1049, file: !2, line: 674, type: !416)
!1052 = !DILocalVariable(name: "config", arg: 2, scope: !1049, file: !2, line: 674, type: !42)
!1053 = !DILocalVariable(name: "arg", arg: 3, scope: !1049, file: !2, line: 674, type: !33)
!1054 = !DILocalVariable(name: "conf", scope: !1049, file: !2, line: 676, type: !194)
!1055 = !DILocalVariable(name: "err", scope: !1049, file: !2, line: 680, type: !33)
!1056 = !DILocation(line: 674, column: 50, scope: !1049)
!1057 = !DILocation(line: 674, column: 61, scope: !1049)
!1058 = !DILocation(line: 674, column: 81, scope: !1049)
!1059 = !DILocation(line: 676, column: 5, scope: !1049)
!1060 = !DILocation(line: 676, column: 26, scope: !1049)
!1061 = !DILocation(line: 677, column: 28, scope: !1049)
!1062 = !{!881, !717, i64 80}
!1063 = !{!1064, !717, i64 48}
!1064 = !{!"server_rec", !717, i64 0, !717, i64 8, !717, i64 16, !717, i64 24, !1065, i64 32, !717, i64 48, !717, i64 56, !717, i64 64, !732, i64 72, !718, i64 76, !1066, i64 78, !717, i64 80, !717, i64 88, !717, i64 96, !717, i64 104, !882, i64 112, !882, i64 120, !732, i64 128, !732, i64 132, !717, i64 136, !717, i64 144, !717, i64 152, !732, i64 160, !732, i64 164, !732, i64 168, !732, i64 172, !717, i64 176, !732, i64 184}
!1065 = !{!"ap_logconf", !717, i64 0, !732, i64 8}
!1066 = !{!"short", !718, i64 0}
!1067 = !{!1068, !732, i64 8}
!1068 = !{!"module_struct", !732, i64 0, !732, i64 4, !732, i64 8, !717, i64 16, !717, i64 24, !717, i64 32, !882, i64 40, !717, i64 48, !717, i64 56, !717, i64 64, !717, i64 72, !717, i64 80, !717, i64 88, !717, i64 96, !732, i64 104}
!1069 = !DILocation(line: 680, column: 5, scope: !1049)
!1070 = !DILocation(line: 680, column: 17, scope: !1049)
!1071 = !DILocation(line: 680, column: 44, scope: !1049)
!1072 = !DILocation(line: 680, column: 23, scope: !1049)
!1073 = !DILocation(line: 682, column: 9, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1049, file: !2, line: 682, column: 9)
!1075 = !DILocation(line: 682, column: 13, scope: !1074)
!1076 = !DILocation(line: 682, column: 9, scope: !1049)
!1077 = !DILocation(line: 683, column: 16, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1074, file: !2, line: 682, column: 22)
!1079 = !DILocation(line: 683, column: 9, scope: !1078)
!1080 = !DILocation(line: 686, column: 37, scope: !1049)
!1081 = !DILocation(line: 686, column: 42, scope: !1049)
!1082 = !DILocation(line: 686, column: 21, scope: !1049)
!1083 = !DILocation(line: 686, column: 5, scope: !1049)
!1084 = !DILocation(line: 686, column: 11, scope: !1049)
!1085 = !DILocation(line: 686, column: 19, scope: !1049)
!1086 = !DILocation(line: 687, column: 20, scope: !1049)
!1087 = !DILocation(line: 687, column: 5, scope: !1049)
!1088 = !DILocation(line: 687, column: 11, scope: !1049)
!1089 = !DILocation(line: 687, column: 18, scope: !1049)
!1090 = !{!817, !717, i64 8}
!1091 = !DILocation(line: 688, column: 5, scope: !1049)
!1092 = !DILocation(line: 688, column: 11, scope: !1049)
!1093 = !DILocation(line: 688, column: 23, scope: !1049)
!1094 = !{!817, !732, i64 16}
!1095 = !DILocation(line: 690, column: 5, scope: !1049)
!1096 = !DILocation(line: 691, column: 1, scope: !1049)
!1097 = !DISubprogram(name: "strlen", scope: !1098, file: !1098, line: 407, type: !1099, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1098 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!69, !33}
!1101 = !DISubprogram(name: "apr_array_push", scope: !182, file: !182, line: 131, type: !1102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!42, !180}
!1104 = !DISubprogram(name: "strncmp", scope: !1098, file: !1098, line: 159, type: !1105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!36, !33, !33, !67}
!1107 = !DISubprogram(name: "apr_tokenize_to_argv", scope: !1108, file: !1108, line: 226, type: !1109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1108 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_strings.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "f876519c65276b07631e818685d4ffb3")
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!47, !33, !1111, !94}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!1112 = !DISubprogram(name: "apr_pstrcat", scope: !1108, file: !1108, line: 147, type: !1113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!190, !94, null}
!1115 = !DISubprogram(name: "ap_server_root_relative", scope: !12, file: !12, line: 750, type: !1116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!190, !94, !33}
!1118 = !DISubprogram(name: "ap_get_exec_line", scope: !128, file: !128, line: 2508, type: !1119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!190, !94, !33, !201}
!1121 = !DISubprogram(name: "ap_pcfg_openfile", scope: !12, file: !12, line: 818, type: !1122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!47, !1124, !94, !33}
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!1125 = !DISubprogram(name: "apr_psprintf", scope: !1108, file: !1108, line: 182, type: !1126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!190, !94, !33, null}
!1128 = !DISubprogram(name: "ap_cfg_getline", scope: !12, file: !12, line: 845, type: !1129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!47, !190, !65, !437}
!1131 = !DISubprogram(name: "ap_getword_conf", scope: !128, file: !128, line: 1554, type: !1132, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!190, !94, !83}
!1134 = !DISubprogram(name: "ap_cfg_closefile", scope: !12, file: !12, line: 860, type: !1135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!36, !437}
!1137 = !DISubprogram(name: "ap_check_cmd_context", scope: !12, file: !12, line: 955, type: !1138, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!33, !416, !13}
!1140 = !DISubprogram(name: "ap_hook_session_encode", scope: !1141, file: !1141, line: 156, type: !1142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1141 = !DIFile(filename: "./mod_session.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/session", checksumkind: CSK_MD5, checksum: "2f96d0badaf5cfa127e9fd7fcb409f35")
!1142 = !DISubroutineType(types: !1143)
!1143 = !{null, !1144, !201, !201, !36}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_HOOK_session_encode_t", file: !1141, line: 156, baseType: !1146)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!47, !1148, !1408}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_rec", file: !128, line: 811, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request_rec", file: !128, line: 838, size: 5888, elements: !1151)
