; ModuleID = 'samples/876.bc'
source_filename = "src/extended/csa_splice_form.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtCSASpliceForm = type { ptr, ptr, ptr }
%struct.GtRange = type { i64, i64 }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [32 x i8] c"spliced_alignment && get_strand\00", align 1, !dbg !7
@__func__.gt_csa_splice_form_new = private unnamed_addr constant [23 x i8] c"gt_csa_splice_form_new\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [31 x i8] c"src/extended/csa_splice_form.c\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [12 x i8] c"splice_form\00", align 1, !dbg !23
@__func__.gt_csa_splice_form_add_sa = private unnamed_addr constant [26 x i8] c"gt_csa_splice_form_add_sa\00", align 1, !dbg !28
@.str.4 = private unnamed_addr constant [94 x i8] c"csa_splice_form_start(splice_form) <= splice_form->get_genomic_range(spliced_alignment).start\00", align 1, !dbg !33

!19 = distinct !DIGlobalVariable(scope: null, file: !2, line: 33, type: !20, isLocal: true, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 31)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 12)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 208, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 26)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 752, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 94)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 680, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 85)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !30, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 30)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 264, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 33)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !30, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !59, isLocal: true, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 304, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 38)
!62 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !63, retainedTypes: !73, globals: !76, splitDebugInlining: false, nameTableKind: None)
!63 = !{!64}
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GtStrand", file: !65, line: 21, baseType: !66, size: 32, elements: !67)
!65 = !DIFile(filename: "src/core/strand_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "5c7a103ad5a6a6a01ca9604fb681ddb9")
!66 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!67 = !{!68, !69, !70, !71, !72}
!68 = !DIEnumerator(name: "GT_STRAND_FORWARD", value: 0)
!69 = !DIEnumerator(name: "GT_STRAND_REVERSE", value: 1)
!70 = !DIEnumerator(name: "GT_STRAND_BOTH", value: 2)
!71 = !DIEnumerator(name: "GT_STRAND_UNKNOWN", value: 3)
!72 = !DIEnumerator(name: "GT_NUM_OF_STRAND_TYPES", value: 4)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !{!0, !7, !12, !18, !23, !28, !33, !38, !43, !45, !50, !55, !57}
!77 = !{i32 7, !"Dwarf Version", i32 5}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 1, !"wchar_size", i32 4}
!80 = !{i32 8, !"PIC Level", i32 2}
!81 = !{i32 7, !"uwtable", i32 2}
!82 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!83 = distinct !DISubprogram(name: "gt_csa_splice_form_new", scope: !2, file: !2, line: 28, type: !84, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !62, retainedNodes: !119)
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !75, !97, !114}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtCSASpliceForm", file: !88, line: 24, baseType: !89)
!88 = !DIFile(filename: "src/extended/csa_splice_form.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "40ad5dfb352135d9fc9de90cd27f099a")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtCSASpliceForm", file: !2, line: 22, size: 192, elements: !90)
!90 = !{!91, !96, !113}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "spliced_alignments", scope: !89, file: !2, line: 23, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtArray", file: !94, line: 27, baseType: !95)
!94 = !DIFile(filename: "src/core/array_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "4614c0e64ebb94278b4837ce435832ba")
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtArray", file: !94, line: 27, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "get_genomic_range", scope: !89, file: !2, line: 24, baseType: !97, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtGetGenomicRangeFunc", file: !98, line: 27, baseType: !99)
!98 = !DIFile(filename: "src/extended/consensus_sa_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "b2ea6e37724c3890159ea19a41c0abb3")
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtRange", file: !103, line: 29, baseType: !104)
!103 = !DIFile(filename: "src/core/range_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "05971597f0a8f239b91be35d4168fb4b")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtRange", file: !103, line: 31, size: 128, elements: !105)
!105 = !{!106, !110}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !104, file: !103, line: 32, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !108, line: 83, baseType: !109)
!108 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!109 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !104, file: !103, line: 33, baseType: !107, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "get_strand", scope: !89, file: !2, line: 25, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtGetStrandFunc", file: !98, line: 29, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !111}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStrand", file: !65, line: 32, baseType: !64)
!119 = !{!120, !121, !122, !123}
!120 = !DILocalVariable(name: "spliced_alignment", arg: 1, scope: !83, file: !2, line: 28, type: !75)
!121 = !DILocalVariable(name: "get_genomic_range", arg: 2, scope: !83, file: !2, line: 29, type: !97)
!122 = !DILocalVariable(name: "get_strand", arg: 3, scope: !83, file: !2, line: 30, type: !114)
!123 = !DILocalVariable(name: "splice_form", scope: !83, file: !2, line: 32, type: !86)
!124 = !{!125, !125, i64 0}
!125 = !{!"any pointer", !126, i64 0}
!126 = !{!"omnipotent char", !127, i64 0}
!127 = !{!"Simple C/C++ TBAA"}
!128 = !DILocation(line: 28, column: 47, scope: !83)
!129 = !DILocation(line: 29, column: 58, scope: !83)
!130 = !DILocation(line: 30, column: 52, scope: !83)
!131 = !DILocation(line: 32, column: 3, scope: !83)
!132 = !DILocation(line: 32, column: 20, scope: !83)
!133 = !DILocation(line: 33, column: 3, scope: !83)
!134 = !DILocation(line: 33, column: 3, scope: !135)
!135 = distinct !DILexicalBlock(scope: !136, file: !2, line: 33, column: 3)
!136 = distinct !DILexicalBlock(scope: !83, file: !2, line: 33, column: 3)
!137 = !DILocation(line: 33, column: 3, scope: !136)
!138 = !DILocation(line: 33, column: 3, scope: !139)
!139 = distinct !DILexicalBlock(scope: !135, file: !2, line: 33, column: 3)
!140 = !DILocation(line: 34, column: 17, scope: !83)
!141 = !DILocation(line: 34, column: 15, scope: !83)
!142 = !DILocation(line: 35, column: 37, scope: !83)
!143 = !DILocation(line: 35, column: 3, scope: !83)
!144 = !DILocation(line: 35, column: 16, scope: !83)
!145 = !DILocation(line: 35, column: 35, scope: !83)
!146 = !{!147, !125, i64 0}
!147 = !{!"GtCSASpliceForm", !125, i64 0, !125, i64 8, !125, i64 16}
!148 = !DILocation(line: 36, column: 3, scope: !83)
!149 = !DILocation(line: 37, column: 36, scope: !83)
!150 = !DILocation(line: 37, column: 3, scope: !83)
!151 = !DILocation(line: 37, column: 16, scope: !83)
!152 = !DILocation(line: 37, column: 34, scope: !83)
!153 = !{!147, !125, i64 8}
!154 = !DILocation(line: 38, column: 29, scope: !83)
!155 = !DILocation(line: 38, column: 3, scope: !83)
!156 = !DILocation(line: 38, column: 16, scope: !83)
!157 = !DILocation(line: 38, column: 27, scope: !83)
!158 = !{!147, !125, i64 16}
!159 = !DILocation(line: 39, column: 10, scope: !83)
!160 = !DILocation(line: 40, column: 1, scope: !83)
!161 = !DILocation(line: 39, column: 3, scope: !83)
!162 = !DISubprogram(name: "fprintf", scope: !163, file: !163, line: 350, type: !164, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!163 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !167, !227, null}
!166 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !170, line: 7, baseType: !171)
!170 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !172, line: 49, size: 1728, elements: !173)
!172 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!173 = !{!174, !175, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !190, !192, !193, !194, !198, !200, !202, !206, !209, !211, !214, !217, !218, !219, !222, !223}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !171, file: !172, line: 51, baseType: !166, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !171, file: !172, line: 54, baseType: !176, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !171, file: !172, line: 55, baseType: !176, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !171, file: !172, line: 56, baseType: !176, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !171, file: !172, line: 57, baseType: !176, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !171, file: !172, line: 58, baseType: !176, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !171, file: !172, line: 59, baseType: !176, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !171, file: !172, line: 60, baseType: !176, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !171, file: !172, line: 61, baseType: !176, size: 64, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !171, file: !172, line: 64, baseType: !176, size: 64, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !171, file: !172, line: 65, baseType: !176, size: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !171, file: !172, line: 66, baseType: !176, size: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !171, file: !172, line: 68, baseType: !188, size: 64, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !172, line: 36, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !171, file: !172, line: 70, baseType: !191, size: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !171, file: !172, line: 72, baseType: !166, size: 32, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !171, file: !172, line: 73, baseType: !166, size: 32, offset: 928)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !171, file: !172, line: 74, baseType: !195, size: 64, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !196, line: 152, baseType: !197)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!197 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !171, file: !172, line: 77, baseType: !199, size: 16, offset: 1024)
!199 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !171, file: !172, line: 78, baseType: !201, size: 8, offset: 1040)
!201 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !171, file: !172, line: 79, baseType: !203, size: 8, offset: 1048)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 1)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !171, file: !172, line: 81, baseType: !207, size: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !172, line: 43, baseType: null)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !171, file: !172, line: 89, baseType: !210, size: 64, offset: 1152)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !196, line: 153, baseType: !197)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !171, file: !172, line: 91, baseType: !212, size: 64, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !172, line: 37, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !171, file: !172, line: 92, baseType: !215, size: 64, offset: 1280)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !172, line: 38, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !171, file: !172, line: 93, baseType: !191, size: 64, offset: 1344)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !171, file: !172, line: 94, baseType: !75, size: 64, offset: 1408)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !171, file: !172, line: 95, baseType: !220, size: 64, offset: 1472)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !221, line: 70, baseType: !109)
!221 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !171, file: !172, line: 96, baseType: !166, size: 32, offset: 1536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !171, file: !172, line: 98, baseType: !224, size: 160, offset: 1568)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 20)
!227 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!229 = !DISubprogram(name: "abort", scope: !230, file: !230, line: 598, type: !231, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!230 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!231 = !DISubroutineType(types: !232)
!232 = !{null}
!233 = !DISubprogram(name: "gt_malloc_mem", scope: !234, file: !234, line: 56, type: !235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!235 = !DISubroutineType(types: !236)
!236 = !{!75, !220, !228, !166}
!237 = !DISubprogram(name: "gt_array_new", scope: !94, file: !94, line: 30, type: !238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!238 = !DISubroutineType(types: !239)
!239 = !{!92, !220}
!240 = !DISubprogram(name: "gt_array_add_elem", scope: !94, file: !94, line: 57, type: !241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !92, !75, !220}
!243 = distinct !DISubprogram(name: "gt_csa_splice_form_delete", scope: !2, file: !2, line: 42, type: !244, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !62, retainedNodes: !246)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !86}
!246 = !{!247}
!247 = !DILocalVariable(name: "splice_form", arg: 1, scope: !243, file: !2, line: 42, type: !86)
!248 = !DILocation(line: 42, column: 49, scope: !243)
!249 = !DILocation(line: 44, column: 8, scope: !250)
!250 = distinct !DILexicalBlock(scope: !243, file: !2, line: 44, column: 7)
!251 = !DILocation(line: 44, column: 7, scope: !243)
!252 = !DILocation(line: 44, column: 21, scope: !250)
!253 = !DILocation(line: 45, column: 19, scope: !243)
!254 = !DILocation(line: 45, column: 32, scope: !243)
!255 = !DILocation(line: 45, column: 3, scope: !243)
!256 = !DILocation(line: 46, column: 3, scope: !243)
!257 = !DILocation(line: 47, column: 1, scope: !243)
!258 = !DISubprogram(name: "gt_array_delete", scope: !94, file: !94, line: 102, type: !259, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !92}
!261 = !DISubprogram(name: "gt_free_mem", scope: !234, file: !234, line: 75, type: !262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !75, !228, !166}
!264 = distinct !DISubprogram(name: "gt_csa_splice_form_add_sa", scope: !2, file: !2, line: 59, type: !265, scopeLine: 61, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !62, retainedNodes: !267)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !86, !75}
!267 = !{!268, !269}
!268 = !DILocalVariable(name: "splice_form", arg: 1, scope: !264, file: !2, line: 59, type: !86)
!269 = !DILocalVariable(name: "spliced_alignment", arg: 2, scope: !264, file: !2, line: 60, type: !75)
!270 = !DILocation(line: 59, column: 49, scope: !264)
!271 = !DILocation(line: 60, column: 38, scope: !264)
!272 = !DILocation(line: 62, column: 3, scope: !264)
!273 = !DILocation(line: 62, column: 3, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !2, line: 62, column: 3)
!275 = distinct !DILexicalBlock(scope: !264, file: !2, line: 62, column: 3)
!276 = !DILocation(line: 62, column: 3, scope: !275)
