; ModuleID = 'samples/878.bc'
source_filename = "src/extended/maxcoordvalue.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtMaxcoordvalue = type { i64, %struct.GtUwordPair, %struct.GtUwordPair }
%struct.GtUwordPair = type { i64, i64 }

@.str = private unnamed_addr constant [29 x i8] c"src/extended/maxcoordvalue.c\00", align 1, !dbg !0
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [12 x i8] c"max != NULL\00", align 1, !dbg !12
@__func__.gt_maxcoordvalue_get_value = private unnamed_addr constant [27 x i8] c"gt_maxcoordvalue_get_value\00", align 1, !dbg !17
@__func__.gt_maxcoordvalue_set_start = private unnamed_addr constant [27 x i8] c"gt_maxcoordvalue_set_start\00", align 1, !dbg !23
@__func__.gt_maxcoordvalue_get_start = private unnamed_addr constant [27 x i8] c"gt_maxcoordvalue_get_start\00", align 1, !dbg !25
@__func__.gt_maxcoordvalue_set_end_with_pair = private unnamed_addr constant [35 x i8] c"gt_maxcoordvalue_set_end_with_pair\00", align 1, !dbg !27

!22 = !DISubrange(count: 27)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !19, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !19, isLocal: true, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 280, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 35)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 99, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 200, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 25)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 240, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 30)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 352, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 44)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 130, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 32)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !2, line: 135, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 13)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(scope: null, file: !2, line: 141, type: !49, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 184, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 23)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !19, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(scope: null, file: !2, line: 72, type: !68, isLocal: true, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 296, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 37)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(scope: null, file: !2, line: 92, type: !34, isLocal: true, isDefinition: true)
!73 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !74, globals: !79, splitDebugInlining: false, nameTableKind: None)
!74 = !{!75, !78}
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 70, baseType: !77)
!76 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!77 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !{!0, !7, !12, !17, !23, !25, !27, !32, !37, !42, !47, !52, !57, !59, !64, !66, !71}
!80 = !{i32 7, !"Dwarf Version", i32 5}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = !{i32 1, !"wchar_size", i32 4}
!83 = !{i32 8, !"PIC Level", i32 2}
!84 = !{i32 7, !"uwtable", i32 2}
!85 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!86 = distinct !DISubprogram(name: "gt_maxcoordvalue_new", scope: !2, file: !2, line: 29, type: !87, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !73, retainedNodes: !106)
!87 = !DISubroutineType(types: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtMaxcoordvalue", file: !91, line: 25, baseType: !92)
!91 = !DIFile(filename: "src/extended/maxcoordvalue.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "b2368baf0f08c20235cb2bb50641b29c")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtMaxcoordvalue", file: !2, line: 23, size: 320, elements: !93)
!93 = !{!94, !98, !105}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !92, file: !2, line: 24, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtWord", file: !96, line: 94, baseType: !97)
!96 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!97 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !92, file: !2, line: 25, baseType: !99, size: 128, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUwordPair", file: !96, line: 118, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 115, size: 128, elements: !101)
!101 = !{!102, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !100, file: !96, line: 117, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !96, line: 83, baseType: !77)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !100, file: !96, line: 117, baseType: !103, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !92, file: !2, line: 26, baseType: !99, size: 128, offset: 192)
!106 = !{!107}
!107 = !DILocalVariable(name: "max", scope: !86, file: !2, line: 31, type: !89)
!108 = !DILocation(line: 31, column: 3, scope: !86)
!109 = !DILocation(line: 31, column: 20, scope: !86)
!110 = !DILocation(line: 32, column: 9, scope: !86)
!111 = !DILocation(line: 32, column: 7, scope: !86)
!112 = !{!113, !113, i64 0}
!113 = !{!"any pointer", !114, i64 0}
!114 = !{!"omnipotent char", !115, i64 0}
!115 = !{!"Simple C/C++ TBAA"}
!116 = !DILocation(line: 33, column: 3, scope: !86)
!117 = !DILocation(line: 33, column: 8, scope: !86)
!118 = !DILocation(line: 33, column: 14, scope: !86)
!119 = !{!120, !121, i64 0}
!120 = !{!"GtMaxcoordvalue", !121, i64 0, !122, i64 8, !122, i64 24}
!121 = !{!"long", !114, i64 0}
!122 = !{!"", !121, i64 0, !121, i64 8}
!123 = !DILocation(line: 35, column: 3, scope: !86)
!124 = !DILocation(line: 35, column: 8, scope: !86)
!125 = !DILocation(line: 35, column: 14, scope: !86)
!126 = !DILocation(line: 35, column: 15, scope: !86)
!127 = !{!120, !121, i64 8}
!128 = !DILocation(line: 36, column: 3, scope: !86)
!129 = !DILocation(line: 36, column: 8, scope: !86)
!130 = !DILocation(line: 36, column: 14, scope: !86)
!131 = !DILocation(line: 36, column: 15, scope: !86)
!132 = !{!120, !121, i64 16}
!133 = !DILocation(line: 38, column: 3, scope: !86)
!134 = !DILocation(line: 38, column: 8, scope: !86)
!135 = !DILocation(line: 38, column: 12, scope: !86)
!136 = !DILocation(line: 38, column: 13, scope: !86)
!137 = !{!120, !121, i64 24}
!138 = !DILocation(line: 39, column: 3, scope: !86)
!139 = !DILocation(line: 39, column: 8, scope: !86)
!140 = !DILocation(line: 39, column: 12, scope: !86)
!141 = !DILocation(line: 39, column: 13, scope: !86)
!142 = !{!120, !121, i64 32}
!143 = !DILocation(line: 40, column: 10, scope: !86)
!144 = !DILocation(line: 41, column: 1, scope: !86)
!145 = !DILocation(line: 40, column: 3, scope: !86)
!146 = !DISubprogram(name: "gt_calloc_mem", scope: !147, file: !147, line: 62, type: !148, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!147 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!148 = !DISubroutineType(types: !149)
!149 = !{!78, !75, !75, !150, !151}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!151 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!152 = distinct !DISubprogram(name: "gt_maxcoordvalue_delete", scope: !2, file: !2, line: 43, type: !153, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !73, retainedNodes: !155)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !89}
!155 = !{!156}
!156 = !DILocalVariable(name: "max", arg: 1, scope: !152, file: !2, line: 43, type: !89)
!157 = !DILocation(line: 43, column: 47, scope: !152)
!158 = !DILocation(line: 45, column: 7, scope: !159)
!159 = distinct !DILexicalBlock(scope: !152, file: !2, line: 45, column: 7)
!160 = !DILocation(line: 45, column: 11, scope: !159)
!161 = !DILocation(line: 45, column: 7, scope: !152)
!162 = !DILocation(line: 46, column: 5, scope: !159)
!163 = !DILocation(line: 47, column: 1, scope: !152)
!164 = !DISubprogram(name: "gt_free_mem", scope: !147, file: !147, line: 75, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !78, !150, !151}
!167 = distinct !DISubprogram(name: "gt_maxcoordvalue_get_value", scope: !2, file: !2, line: 55, type: !168, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !73, retainedNodes: !172)
!168 = !DISubroutineType(types: !169)
!169 = !{!95, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!172 = !{!173}
!173 = !DILocalVariable(name: "max", arg: 1, scope: !167, file: !2, line: 55, type: !170)
!174 = !DILocation(line: 55, column: 58, scope: !167)
!175 = !DILocation(line: 57, column: 3, scope: !167)
!176 = !DILocation(line: 57, column: 3, scope: !177)
!177 = distinct !DILexicalBlock(scope: !178, file: !2, line: 57, column: 3)
!178 = distinct !DILexicalBlock(scope: !167, file: !2, line: 57, column: 3)
!179 = !DILocation(line: 57, column: 3, scope: !178)
!180 = !DILocation(line: 57, column: 3, scope: !181)
!181 = distinct !DILexicalBlock(scope: !177, file: !2, line: 57, column: 3)
!182 = !DILocation(line: 58, column: 10, scope: !167)
!183 = !DILocation(line: 58, column: 15, scope: !167)
!184 = !DILocation(line: 58, column: 3, scope: !167)
!185 = !DISubprogram(name: "fprintf", scope: !186, file: !186, line: 350, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!187 = !DISubroutineType(types: !188)
!188 = !{!151, !189, !246, null}
!189 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !192, line: 7, baseType: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !194, line: 49, size: 1728, elements: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!195 = !{!196, !197, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !212, !214, !215, !216, !219, !221, !223, !227, !230, !232, !235, !238, !239, !240, !241, !242}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !193, file: !194, line: 51, baseType: !151, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !193, file: !194, line: 54, baseType: !198, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !193, file: !194, line: 55, baseType: !198, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !193, file: !194, line: 56, baseType: !198, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !193, file: !194, line: 57, baseType: !198, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !193, file: !194, line: 58, baseType: !198, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !193, file: !194, line: 59, baseType: !198, size: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !193, file: !194, line: 60, baseType: !198, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !193, file: !194, line: 61, baseType: !198, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !193, file: !194, line: 64, baseType: !198, size: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !193, file: !194, line: 65, baseType: !198, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !193, file: !194, line: 66, baseType: !198, size: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !193, file: !194, line: 68, baseType: !210, size: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !194, line: 36, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !193, file: !194, line: 70, baseType: !213, size: 64, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !193, file: !194, line: 72, baseType: !151, size: 32, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !193, file: !194, line: 73, baseType: !151, size: 32, offset: 928)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !193, file: !194, line: 74, baseType: !217, size: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !218, line: 152, baseType: !97)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !193, file: !194, line: 77, baseType: !220, size: 16, offset: 1024)
!220 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !193, file: !194, line: 78, baseType: !222, size: 8, offset: 1040)
!222 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !193, file: !194, line: 79, baseType: !224, size: 8, offset: 1048)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 1)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !193, file: !194, line: 81, baseType: !228, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !194, line: 43, baseType: null)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !193, file: !194, line: 89, baseType: !231, size: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !218, line: 153, baseType: !97)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !193, file: !194, line: 91, baseType: !233, size: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !194, line: 37, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !193, file: !194, line: 92, baseType: !236, size: 64, offset: 1280)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !194, line: 38, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !193, file: !194, line: 93, baseType: !213, size: 64, offset: 1344)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !193, file: !194, line: 94, baseType: !78, size: 64, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !193, file: !194, line: 95, baseType: !75, size: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !193, file: !194, line: 96, baseType: !151, size: 32, offset: 1536)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !193, file: !194, line: 98, baseType: !243, size: 160, offset: 1568)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 20)
!246 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !150)
!247 = !DISubprogram(name: "abort", scope: !248, file: !248, line: 598, type: !249, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!248 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!249 = !DISubroutineType(types: !250)
!250 = !{null}
!251 = distinct !DISubprogram(name: "gt_maxcoordvalue_set_start", scope: !2, file: !2, line: 61, type: !252, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !73, retainedNodes: !254)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !89, !103, !103}
!254 = !{!255, !256, !257}
!255 = !DILocalVariable(name: "max", arg: 1, scope: !251, file: !2, line: 61, type: !89)
!256 = !DILocalVariable(name: "a", arg: 2, scope: !251, file: !2, line: 62, type: !103)
!257 = !DILocalVariable(name: "b", arg: 3, scope: !251, file: !2, line: 62, type: !103)
!258 = !DILocation(line: 61, column: 50, scope: !251)
!259 = !{!121, !121, i64 0}
!260 = !DILocation(line: 62, column: 41, scope: !251)
!261 = !DILocation(line: 62, column: 52, scope: !251)
!262 = !DILocation(line: 64, column: 3, scope: !251)
!263 = !DILocation(line: 64, column: 3, scope: !264)
!264 = distinct !DILexicalBlock(scope: !265, file: !2, line: 64, column: 3)
!265 = distinct !DILexicalBlock(scope: !251, file: !2, line: 64, column: 3)
!266 = !DILocation(line: 64, column: 3, scope: !265)
!267 = !DILocation(line: 64, column: 3, scope: !268)
!268 = distinct !DILexicalBlock(scope: !264, file: !2, line: 64, column: 3)
!269 = !DILocation(line: 65, column: 18, scope: !251)
!270 = !DILocation(line: 65, column: 3, scope: !251)
!271 = !DILocation(line: 65, column: 8, scope: !251)
!272 = !DILocation(line: 65, column: 14, scope: !251)
!273 = !DILocation(line: 65, column: 16, scope: !251)
!274 = !DILocation(line: 66, column: 18, scope: !251)
!275 = !DILocation(line: 66, column: 3, scope: !251)
!276 = !DILocation(line: 66, column: 8, scope: !251)
!277 = !DILocation(line: 66, column: 14, scope: !251)
!278 = !DILocation(line: 66, column: 16, scope: !251)
!279 = !DILocation(line: 67, column: 1, scope: !251)
!280 = distinct !DISubprogram(name: "gt_maxcoordvalue_get_start", scope: !2, file: !2, line: 76, type: !281, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !73, retainedNodes: !283)
!281 = !DISubroutineType(types: !282)
!282 = !{!99, !170}
!283 = !{!284}
!284 = !DILocalVariable(name: "max", arg: 1, scope: !280, file: !2, line: 76, type: !170)
!285 = !DILocation(line: 76, column: 63, scope: !280)
!286 = !DILocation(line: 78, column: 3, scope: !280)
!287 = !DILocation(line: 78, column: 3, scope: !288)
!288 = distinct !DILexicalBlock(scope: !289, file: !2, line: 78, column: 3)
!289 = distinct !DILexicalBlock(scope: !280, file: !2, line: 78, column: 3)
!290 = !DILocation(line: 78, column: 3, scope: !289)
!291 = !DILocation(line: 78, column: 3, scope: !292)
!292 = distinct !DILexicalBlock(scope: !288, file: !2, line: 78, column: 3)
!293 = !DILocation(line: 79, column: 10, scope: !280)
!294 = !DILocation(line: 79, column: 15, scope: !280)
!295 = !{i64 0, i64 8, !259, i64 8, i64 8, !259}
!296 = !DILocation(line: 79, column: 3, scope: !280)
!297 = distinct !DISubprogram(name: "gt_maxcoordvalue_set_end_with_pair", scope: !2, file: !2, line: 82, type: !298, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !73, retainedNodes: !301)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !89, !300}
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
