; ModuleID = 'samples/882.bc'
source_filename = "src/core/ext/upb-generated/xds/type/v3/cel.upb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.upb_MiniTable_Sub = type { ptr }
%struct.upb_MiniTable_Field = type { i32, i16, i16, i16, i8, i8 }
%struct.upb_MiniTable = type { ptr, ptr, i16, i16, i8, i8, i8, i8, [0 x %struct._upb_FastTable_Entry] }
%struct._upb_FastTable_Entry = type { i64, ptr }
%struct.upb_MiniTable_File = type { ptr, ptr, ptr, i32, i32, i32 }

@xds_type_v3_CelExpression_submsgs = internal constant [2 x %union.upb_MiniTable_Sub] [%union.upb_MiniTable_Sub { ptr @google_api_expr_v1alpha1_ParsedExpr_msginit }, %union.upb_MiniTable_Sub { ptr @google_api_expr_v1alpha1_CheckedExpr_msginit }], align 16, !dbg !0
@xds_type_v3_CelExpression__fields = internal constant [2 x %struct.upb_MiniTable_Field] [%struct.upb_MiniTable_Field { i32 1, i16 8, i16 -1, i16 0, i8 11, i8 98 }, %struct.upb_MiniTable_Field { i32 2, i16 8, i16 -1, i16 1, i8 11, i8 98 }], align 16, !dbg !123
@xds_type_v3_CelExpression_msginit = hidden constant %struct.upb_MiniTable { ptr @xds_type_v3_CelExpression_submsgs, ptr @xds_type_v3_CelExpression__fields, i16 16, i16 2, i8 0, i8 2, i8 -1, i8 0, [0 x %struct._upb_FastTable_Entry] zeroinitializer }, align 8, !dbg !7
@xds_type_v3_CelExtractString_submsgs = internal constant [2 x %union.upb_MiniTable_Sub] [%union.upb_MiniTable_Sub { ptr @xds_type_v3_CelExpression_msginit }, %union.upb_MiniTable_Sub { ptr @google_protobuf_StringValue_msginit }], align 16, !dbg !128
@xds_type_v3_CelExtractString__fields = internal constant [2 x %struct.upb_MiniTable_Field] [%struct.upb_MiniTable_Field { i32 1, i16 8, i16 1, i16 0, i8 11, i8 98 }, %struct.upb_MiniTable_Field { i32 2, i16 16, i16 2, i16 1, i8 11, i8 98 }], align 16, !dbg !131
@xds_type_v3_CelExtractString_msginit = hidden constant %struct.upb_MiniTable { ptr @xds_type_v3_CelExtractString_submsgs, ptr @xds_type_v3_CelExtractString__fields, i16 24, i16 2, i8 0, i8 2, i8 -1, i8 0, [0 x %struct._upb_FastTable_Entry] zeroinitializer }, align 8, !dbg !97
@messages_layout = internal global [2 x ptr] [ptr @xds_type_v3_CelExpression_msginit, ptr @xds_type_v3_CelExtractString_msginit], align 16, !dbg !133
@xds_type_v3_cel_proto_upb_file_layout = hidden constant %struct.upb_MiniTable_File { ptr @messages_layout, ptr null, ptr null, i32 2, i32 0, i32 0 }, align 8, !dbg !99
@google_api_expr_v1alpha1_ParsedExpr_msginit = external constant %struct.upb_MiniTable, align 8
@google_api_expr_v1alpha1_CheckedExpr_msginit = external constant %struct.upb_MiniTable, align 8
@google_protobuf_StringValue_msginit = external constant %struct.upb_MiniTable, align 8

!llvm.dbg.cu = !{!2}
!llvm.module.flags = !{!136, !137, !138, !139, !140}
!llvm.ident = !{!141}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xds_type_v3_CelExpression_submsgs", scope: !2, file: !3, line: 20, type: !130, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !6, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/core/ext/upb-generated/xds/type/v3/cel.upb.c", directory: "/local-ssd/py-grpcio-ona3o4hxrwcumc5bj36xxurhwz2hlb4f-build/aidengro/spack-stage-py-grpcio-1.52.0-ona3o4hxrwcumc5bj36xxurhwz2hlb4f/spack-src", checksumkind: CSK_MD5, checksum: "9d17ca8676f04e5978233e8feaa38d02")
!4 = !{!5}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !{!7, !97, !99, !0, !123, !128, !131, !133}
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "xds_type_v3_CelExpression_msginit", scope: !2, file: !3, line: 30, type: !9, isLocal: false, isDefinition: true)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable", file: !11, line: 54, baseType: !12)
!11 = !DIFile(filename: "third_party/upb/upb/msg.h", directory: "/local-ssd/py-grpcio-ona3o4hxrwcumc5bj36xxurhwz2hlb4f-build/aidengro/spack-stage-py-grpcio-1.52.0-ona3o4hxrwcumc5bj36xxurhwz2hlb4f/spack-src", checksumkind: CSK_MD5, checksum: "bd85072d28b38de71402a2fc88a45678")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upb_MiniTable", file: !13, line: 174, size: 192, elements: !14)
!13 = !DIFile(filename: "third_party/upb/upb/msg_internal.h", directory: "/local-ssd/py-grpcio-ona3o4hxrwcumc5bj36xxurhwz2hlb4f-build/aidengro/spack-stage-py-grpcio-1.52.0-ona3o4hxrwcumc5bj36xxurhwz2hlb4f/spack-src", checksumkind: CSK_MD5, checksum: "230d56cd9ef81e26bc203e59aa64fab1")
!14 = !{!15, !44, !68, !69, !70, !71, !72, !73, !74}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !12, file: !13, line: 175, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable_Sub", file: !13, line: 146, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !13, line: 143, size: 64, elements: !20)
!20 = !{!21, !24}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "submsg", scope: !19, file: !13, line: 144, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "subenum", scope: !19, file: !13, line: 145, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable_Enum", file: !13, line: 141, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 137, size: 192, elements: !29)
!29 = !{!30, !38, !43}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !28, file: !13, line: 138, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !34, line: 26, baseType: !35)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !36, line: 41, baseType: !37)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !28, file: !13, line: 139, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !40, line: 27, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !36, line: 45, baseType: !42)
!42 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "value_count", scope: !28, file: !13, line: 140, baseType: !37, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !12, file: !13, line: 176, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable_Field", file: !13, line: 80, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 72, size: 96, elements: !49)
!49 = !{!50, !54, !58, !62, !63, !67}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !48, file: !13, line: 73, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !40, line: 26, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !36, line: 42, baseType: !53)
!53 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !48, file: !13, line: 74, baseType: !55, size: 16, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !40, line: 25, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !36, line: 40, baseType: !57)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "presence", scope: !48, file: !13, line: 75, baseType: !59, size: 16, offset: 48)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !34, line: 25, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !36, line: 39, baseType: !61)
!61 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "submsg_index", scope: !48, file: !13, line: 76, baseType: !55, size: 16, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "descriptortype", scope: !48, file: !13, line: 77, baseType: !64, size: 8, offset: 80)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !40, line: 24, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !36, line: 38, baseType: !66)
!66 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !48, file: !13, line: 78, baseType: !64, size: 8, offset: 88)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !12, file: !13, line: 179, baseType: !55, size: 16, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "field_count", scope: !12, file: !13, line: 180, baseType: !55, size: 16, offset: 144)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !12, file: !13, line: 181, baseType: !64, size: 8, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dense_below", scope: !12, file: !13, line: 182, baseType: !64, size: 8, offset: 168)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "table_mask", scope: !12, file: !13, line: 183, baseType: !64, size: 8, offset: 176)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "required_count", scope: !12, file: !13, line: 184, baseType: !64, size: 8, offset: 184)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "fasttable", scope: !12, file: !13, line: 188, baseType: !75, offset: 192)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, elements: !95)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "_upb_FastTable_Entry", file: !13, line: 135, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 132, size: 128, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "field_data", scope: !77, file: !13, line: 133, baseType: !39, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "field_parser", scope: !77, file: !13, line: 134, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_upb_FieldParser", file: !13, line: 128, baseType: !83)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !88, !85, !90, !92, !39, !39}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "upb_Decoder", file: !13, line: 125, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_Message", file: !11, line: 49, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !93, line: 87, baseType: !94)
!93 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!94 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!95 = !{!96}
!96 = !DISubrange(count: -1)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "xds_type_v3_CelExtractString_msginit", scope: !2, file: !3, line: 46, type: !9, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "xds_type_v3_cel_proto_upb_file_layout", scope: !2, file: !3, line: 57, type: !101, isLocal: false, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable_File", file: !13, line: 204, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 197, size: 320, elements: !104)
!104 = !{!105, !108, !110, !120, !121, !122}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "msgs", scope: !103, file: !13, line: 198, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "enums", scope: !103, file: !13, line: 199, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "exts", scope: !103, file: !13, line: 200, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "upb_MiniTable_Extension", file: !13, line: 195, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 191, size: 256, elements: !116)
!116 = !{!117, !118, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !115, file: !13, line: 192, baseType: !47, size: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "extendee", scope: !115, file: !13, line: 193, baseType: !107, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !115, file: !13, line: 194, baseType: !18, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "msg_count", scope: !103, file: !13, line: 201, baseType: !37, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "enum_count", scope: !103, file: !13, line: 202, baseType: !37, size: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ext_count", scope: !103, file: !13, line: 203, baseType: !37, size: 32, offset: 256)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "xds_type_v3_CelExpression__fields", scope: !2, file: !3, line: 25, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 192, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 2)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "xds_type_v3_CelExtractString_submsgs", scope: !2, file: !3, line: 36, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, elements: !126)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "xds_type_v3_CelExtractString__fields", scope: !2, file: !3, line: 41, type: !125, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "messages_layout", scope: !2, file: !3, line: 52, type: !135, isLocal: true, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, elements: !126)
!136 = !{i32 7, !"Dwarf Version", i32 5}
!137 = !{i32 2, !"Debug Info Version", i32 3}
!138 = !{i32 1, !"wchar_size", i32 4}
!139 = !{i32 8, !"PIC Level", i32 2}
!140 = !{i32 7, !"uwtable", i32 2}
!141 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
