; ModuleID = 'samples/884.bc'
source_filename = "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src/src/libmongoc/examples/example-manage-collection-indexes.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._bson_error_t = type { i32, i32, [504 x i8] }

@.str = private unnamed_addr constant [52 x i8] c"mongodb://127.0.0.1/?appname=create-indexes-example\00", align 1, !dbg !0
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [18 x i8] c"Failure at %s:%d\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [210 x i8] c"/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src/src/libmongoc/examples/example-manage-collection-indexes.c\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [61 x i8] c"Unexpected arguments. Expected usage: %s [CONNECTION_STRING]\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [24 x i8] c"Failed to parse URI: %s\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [28 x i8] c"Failed to create client: %s\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [5 x i8] c"test\00", align 1, !dbg !37

!99 = !DIEnumerator(name: "BCON_TYPE_DOC_END", value: 25)
!100 = !DIEnumerator(name: "BCON_TYPE_END", value: 26)
!101 = !DIEnumerator(name: "BCON_TYPE_RAW", value: 27)
!102 = !DIEnumerator(name: "BCON_TYPE_SKIP", value: 28)
!103 = !DIEnumerator(name: "BCON_TYPE_ITER", value: 29)
!104 = !DIEnumerator(name: "BCON_TYPE_ERROR", value: 30)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !44, !46, !51, !53, !58, !60, !62}
!108 = !{i32 7, !"Dwarf Version", i32 5}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"wchar_size", i32 4}
!111 = !{i32 8, !"PIC Level", i32 2}
!112 = !{i32 7, !"PIE Level", i32 2}
!113 = !{i32 7, !"uwtable", i32 2}
!114 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!115 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 17, type: !116, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !67, retainedNodes: !121)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !118, !119}
!118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!121 = !{!122, !123, !124, !130, !133, !138, !143, !158, !160, !175, !179, !185, !188, !190, !192, !193}
!122 = !DILocalVariable(name: "argc", arg: 1, scope: !115, file: !2, line: 17, type: !118)
!123 = !DILocalVariable(name: "argv", arg: 2, scope: !115, file: !2, line: 17, type: !119)
!124 = !DILocalVariable(name: "client", scope: !115, file: !2, line: 19, type: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "mongoc_client_t", file: !127, line: 75, baseType: !128)
!127 = !DIFile(filename: "src/libmongoc/src/mongoc/mongoc-client.h", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src", checksumkind: CSK_MD5, checksum: "3ff398fceb492cf43ecf501aafb6c1ac")
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mongoc_client_t", file: !129, line: 25, flags: DIFlagFwdDecl)
!129 = !DIFile(filename: "src/libmongoc/src/mongoc/mongoc-client-side-encryption.h", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src", checksumkind: CSK_MD5, checksum: "57f4e41e176701c3fb870b1cdcd60748")
!130 = !DILocalVariable(name: "uri_string", scope: !115, file: !2, line: 20, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!133 = !DILocalVariable(name: "uri", scope: !115, file: !2, line: 22, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "mongoc_uri_t", file: !136, line: 95, baseType: !137)
!136 = !DIFile(filename: "src/libmongoc/src/mongoc/mongoc-uri.h", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src", checksumkind: CSK_MD5, checksum: "ec8a82d2d8c002b1517fee400464e7cc")
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mongoc_uri_t", file: !136, line: 95, flags: DIFlagFwdDecl)
!138 = !DILocalVariable(name: "coll", scope: !115, file: !2, line: 23, type: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "mongoc_collection_t", file: !141, line: 38, baseType: !142)
!141 = !DIFile(filename: "src/libmongoc/src/mongoc/mongoc-collection.h", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src", checksumkind: CSK_MD5, checksum: "f6ec830f12a9639826f517033b9687d1")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mongoc_collection_t", file: !129, line: 29, flags: DIFlagFwdDecl)
!143 = !DILocalVariable(name: "error", scope: !115, file: !2, line: 24, type: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "bson_error_t", file: !145, line: 521, baseType: !146, align: 64)
!145 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/linux-ubuntu22.04-zen2/clang-18.0.0/libbson-1.24.4-3emagvezomjldhykavhwzeddzez6p3tl/include/libbson-1.0/bson/bson-types.h", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build", checksumkind: CSK_MD5, checksum: "fd1703a8823d69f0452e79051a925038")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_bson_error_t", file: !145, line: 517, size: 4096, elements: !147)
!147 = !{!148, !153, !154}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !146, file: !145, line: 518, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !150, line: 26, baseType: !151)
!150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !152, line: 42, baseType: !72)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!153 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !146, file: !145, line: 519, baseType: !149, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !146, file: !145, line: 520, baseType: !155, size: 4032, offset: 64)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4032, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 504)
!158 = !DILocalVariable(name: "ok", scope: !115, file: !2, line: 25, type: !159)
!159 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!160 = !DILocalVariable(name: "keys", scope: !161, file: !2, line: 53, type: !162)
!161 = distinct !DILexicalBlock(scope: !115, file: !2, line: 50, column: 4)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "bson_t", file: !145, line: 138, baseType: !164, align: 1024)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_bson_t", file: !145, line: 134, size: 1024, elements: !165)
!165 = !{!166, !167, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !164, file: !145, line: 135, baseType: !149, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !164, file: !145, line: 136, baseType: !149, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !164, file: !145, line: 137, baseType: !169, size: 960, offset: 64)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 960, elements: !173)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !150, line: 24, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !152, line: 38, baseType: !172)
!172 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !{!174}
!174 = !DISubrange(count: 120)
!175 = !DILocalVariable(name: "im", scope: !161, file: !2, line: 54, type: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "mongoc_index_model_t", file: !141, line: 160, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mongoc_index_model_t", file: !141, line: 160, flags: DIFlagFwdDecl)
!179 = !DILocalVariable(name: "cursor", scope: !180, file: !2, line: 68, type: !181)
!180 = distinct !DILexicalBlock(scope: !115, file: !2, line: 66, column: 4)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "mongoc_cursor_t", file: !183, line: 30, baseType: !184)
!183 = !DIFile(filename: "src/libmongoc/src/mongoc/mongoc-cursor.h", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src", checksumkind: CSK_MD5, checksum: "ab02e4cb247e4dedbf49e30b4b02e193")
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mongoc_cursor_t", file: !129, line: 27, flags: DIFlagFwdDecl)
!185 = !DILocalVariable(name: "got", scope: !180, file: !2, line: 71, type: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!188 = !DILocalVariable(name: "got_str", scope: !189, file: !2, line: 73, type: !120)
!189 = distinct !DILexicalBlock(scope: !180, file: !2, line: 72, column: 49)
!190 = !DILocalVariable(name: "keys", scope: !191, file: !2, line: 87, type: !162)
!191 = distinct !DILexicalBlock(scope: !115, file: !2, line: 85, column: 4)
!192 = !DILocalVariable(name: "index_name", scope: !191, file: !2, line: 88, type: !120)
!193 = !DILabel(scope: !115, name: "fail", file: !2, line: 103)
!194 = !{!195, !195, i64 0}
!195 = !{!"int", !196, i64 0}
!196 = !{!"omnipotent char", !197, i64 0}
!197 = !{!"Simple C/C++ TBAA"}
!198 = !DILocation(line: 17, column: 11, scope: !115)
!199 = !{!200, !200, i64 0}
!200 = !{!"any pointer", !196, i64 0}
!201 = !DILocation(line: 17, column: 23, scope: !115)
!202 = !DILocation(line: 19, column: 4, scope: !115)
!203 = !DILocation(line: 19, column: 21, scope: !115)
!204 = !DILocation(line: 20, column: 4, scope: !115)
!205 = !DILocation(line: 20, column: 16, scope: !115)
!206 = !DILocation(line: 22, column: 4, scope: !115)
!207 = !DILocation(line: 22, column: 18, scope: !115)
!208 = !DILocation(line: 23, column: 4, scope: !115)
!209 = !DILocation(line: 23, column: 25, scope: !115)
!210 = !DILocation(line: 24, column: 4, scope: !115)
!211 = !DILocation(line: 24, column: 17, scope: !115)
!212 = !DILocation(line: 25, column: 4, scope: !115)
!213 = !DILocation(line: 25, column: 9, scope: !115)
!214 = !{!215, !215, i64 0}
!215 = !{!"_Bool", !196, i64 0}
!216 = !DILocation(line: 27, column: 4, scope: !115)
!217 = !DILocation(line: 29, column: 8, scope: !218)
!218 = distinct !DILexicalBlock(scope: !115, file: !2, line: 29, column: 8)
!219 = !DILocation(line: 29, column: 13, scope: !218)
!220 = !DILocation(line: 29, column: 8, scope: !115)
!221 = !DILocation(line: 30, column: 7, scope: !222)
!222 = distinct !DILexicalBlock(scope: !223, file: !2, line: 30, column: 7)
!223 = distinct !DILexicalBlock(scope: !224, file: !2, line: 30, column: 7)
!224 = distinct !DILexicalBlock(scope: !218, file: !2, line: 29, column: 18)
!225 = !DILocation(line: 35, column: 8, scope: !226)
!226 = distinct !DILexicalBlock(scope: !115, file: !2, line: 35, column: 8)
!227 = !DILocation(line: 35, column: 13, scope: !226)
!228 = !DILocation(line: 35, column: 8, scope: !115)
!229 = !DILocation(line: 36, column: 20, scope: !230)
!230 = distinct !DILexicalBlock(scope: !226, file: !2, line: 35, column: 18)
!231 = !DILocation(line: 36, column: 18, scope: !230)
!232 = !DILocation(line: 37, column: 4, scope: !230)
!233 = !DILocation(line: 39, column: 37, scope: !115)
!234 = !DILocation(line: 39, column: 10, scope: !115)
!235 = !DILocation(line: 39, column: 8, scope: !115)
!236 = !DILocation(line: 40, column: 9, scope: !237)
!237 = distinct !DILexicalBlock(scope: !115, file: !2, line: 40, column: 8)
!238 = !DILocation(line: 40, column: 8, scope: !115)
!239 = !DILocation(line: 41, column: 7, scope: !240)
!240 = distinct !DILexicalBlock(scope: !241, file: !2, line: 41, column: 7)
!241 = distinct !DILexicalBlock(scope: !242, file: !2, line: 41, column: 7)
!242 = distinct !DILexicalBlock(scope: !237, file: !2, line: 40, column: 14)
!243 = !DILocation(line: 43, column: 52, scope: !115)
!244 = !DILocation(line: 43, column: 13, scope: !115)
!245 = !DILocation(line: 43, column: 11, scope: !115)
!246 = !DILocation(line: 44, column: 9, scope: !247)
!247 = distinct !DILexicalBlock(scope: !115, file: !2, line: 44, column: 8)
!248 = !DILocation(line: 44, column: 8, scope: !115)
!249 = !DILocation(line: 45, column: 7, scope: !250)
!250 = distinct !DILexicalBlock(scope: !251, file: !2, line: 45, column: 7)
!251 = distinct !DILexicalBlock(scope: !252, file: !2, line: 45, column: 7)
!252 = distinct !DILexicalBlock(scope: !247, file: !2, line: 44, column: 17)
!253 = !DILocation(line: 48, column: 41, scope: !115)
!254 = !DILocation(line: 48, column: 11, scope: !115)
!255 = !DILocation(line: 48, column: 9, scope: !115)
!256 = !DILocation(line: 53, column: 7, scope: !161)
!257 = !DILocation(line: 53, column: 15, scope: !161)
!258 = !DILocation(line: 53, column: 22, scope: !161)
!259 = !DILocation(line: 54, column: 7, scope: !161)
!260 = !DILocation(line: 54, column: 29, scope: !161)
!261 = !DILocation(line: 54, column: 58, scope: !161)
!262 = !DILocation(line: 54, column: 34, scope: !161)
!263 = !DILocation(line: 56, column: 14, scope: !264)
!264 = distinct !DILexicalBlock(scope: !161, file: !2, line: 55, column: 11)
!265 = !DILocation(line: 55, column: 11, scope: !264)
!266 = !DILocation(line: 55, column: 11, scope: !161)
!267 = !DILocation(line: 57, column: 10, scope: !268)
!268 = distinct !DILexicalBlock(scope: !264, file: !2, line: 56, column: 72)
!269 = !DILocation(line: 58, column: 7, scope: !268)
!270 = !DILocation(line: 59, column: 24, scope: !271)
!271 = distinct !DILexicalBlock(scope: !264, file: !2, line: 58, column: 14)
!272 = !DILocation(line: 59, column: 10, scope: !271)
!273 = !DILocation(line: 60, column: 10, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !2, line: 60, column: 10)
!275 = distinct !DILexicalBlock(scope: !271, file: !2, line: 60, column: 10)
!276 = !DILocation(line: 62, column: 21, scope: !161)
!277 = !DILocation(line: 62, column: 7, scope: !161)
!278 = !DILocation(line: 64, column: 4, scope: !115)
!279 = !DILocation(line: 68, column: 7, scope: !180)
!280 = !DILocation(line: 68, column: 24, scope: !180)
!281 = !DILocation(line: 69, column: 52, scope: !180)
!282 = !DILocation(line: 69, column: 10, scope: !180)
!283 = !DILocation(line: 70, column: 7, scope: !180)
!284 = !DILocation(line: 71, column: 7, scope: !180)
!285 = !DILocation(line: 71, column: 21, scope: !180)
!286 = !DILocation(line: 72, column: 7, scope: !180)
!287 = !DILocation(line: 72, column: 34, scope: !180)
!288 = !DILocation(line: 72, column: 14, scope: !180)
!289 = !DILocation(line: 73, column: 10, scope: !189)
!290 = !DILocation(line: 73, column: 16, scope: !189)
!291 = !DILocation(line: 73, column: 59, scope: !189)
!292 = !DILocation(line: 73, column: 26, scope: !189)
!293 = !DILocation(line: 74, column: 28, scope: !189)
!294 = !DILocation(line: 74, column: 10, scope: !189)
!295 = !DILocation(line: 75, column: 21, scope: !189)
!296 = !DILocation(line: 75, column: 10, scope: !189)
!297 = !DILocation(line: 76, column: 7, scope: !180)
!298 = distinct !{!298, !286, !297}
!299 = !DILocation(line: 77, column: 32, scope: !300)
!300 = distinct !DILexicalBlock(scope: !180, file: !2, line: 77, column: 11)
!301 = !DILocation(line: 77, column: 11, scope: !300)
!302 = !DILocation(line: 77, column: 11, scope: !180)
!303 = !DILocation(line: 78, column: 33, scope: !304)
!304 = distinct !DILexicalBlock(scope: !300, file: !2, line: 77, column: 49)
!305 = !DILocation(line: 78, column: 10, scope: !304)
!306 = !DILocation(line: 79, column: 10, scope: !307)
!307 = distinct !DILexicalBlock(scope: !308, file: !2, line: 79, column: 10)
!308 = distinct !DILexicalBlock(scope: !304, file: !2, line: 79, column: 10)
!309 = !DILocation(line: 81, column: 30, scope: !180)
!310 = !DILocation(line: 81, column: 7, scope: !180)
!311 = !DILocation(line: 83, column: 4, scope: !115)
!312 = !DILocation(line: 87, column: 7, scope: !191)
!313 = !DILocation(line: 87, column: 15, scope: !191)
!314 = !DILocation(line: 87, column: 22, scope: !191)
!315 = !DILocation(line: 88, column: 7, scope: !191)
!316 = !DILocation(line: 88, column: 13, scope: !191)
!317 = !DILocation(line: 88, column: 66, scope: !191)
!318 = !DILocation(line: 88, column: 26, scope: !191)
!319 = !DILocation(line: 90, column: 14, scope: !320)
!320 = distinct !DILexicalBlock(scope: !191, file: !2, line: 89, column: 11)
!321 = !DILocation(line: 90, column: 20, scope: !320)
!322 = !DILocation(line: 89, column: 11, scope: !320)
!323 = !DILocation(line: 89, column: 11, scope: !191)
!324 = !DILocation(line: 91, column: 10, scope: !325)
!325 = distinct !DILexicalBlock(scope: !320, file: !2, line: 90, column: 58)
!326 = !DILocation(line: 92, column: 7, scope: !325)
!327 = !DILocation(line: 93, column: 21, scope: !328)
!328 = distinct !DILexicalBlock(scope: !320, file: !2, line: 92, column: 14)
!329 = !DILocation(line: 93, column: 10, scope: !328)
!330 = !DILocation(line: 94, column: 24, scope: !328)
!331 = !DILocation(line: 94, column: 10, scope: !328)
!332 = !DILocation(line: 95, column: 10, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !2, line: 95, column: 10)
!334 = distinct !DILexicalBlock(scope: !328, file: !2, line: 95, column: 10)
!335 = !DILocation(line: 97, column: 18, scope: !191)
!336 = !DILocation(line: 97, column: 7, scope: !191)
!337 = !DILocation(line: 98, column: 21, scope: !191)
!338 = !DILocation(line: 98, column: 7, scope: !191)
!339 = !DILocation(line: 100, column: 4, scope: !115)
!340 = !DILocation(line: 102, column: 7, scope: !115)
!341 = !DILocation(line: 102, column: 4, scope: !115)
!342 = !DILocation(line: 103, column: 1, scope: !115)
!343 = !DILocation(line: 104, column: 31, scope: !115)
!344 = !DILocation(line: 104, column: 4, scope: !115)
!345 = !DILocation(line: 105, column: 27, scope: !115)
!346 = !DILocation(line: 105, column: 4, scope: !115)
!347 = !DILocation(line: 106, column: 24, scope: !115)
!348 = !DILocation(line: 106, column: 4, scope: !115)
!349 = !DILocation(line: 107, column: 4, scope: !115)
!350 = !DILocation(line: 108, column: 11, scope: !115)
!351 = !{i8 0, i8 2}
!352 = !{}
!353 = !DILocation(line: 108, column: 4, scope: !115)
!354 = !DILocation(line: 109, column: 1, scope: !115)
!355 = !DISubprogram(name: "mongoc_init", scope: !356, file: !356, line: 30, type: !357, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!356 = !DIFile(filename: "src/libmongoc/src/mongoc/mongoc-init.h", directory: "/local-ssd/mongo-c-driver-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm-build/aidengro/spack-stage-mongo-c-driver-1.24.4-tfdtld7x3mjiju5wjzhoudyw5ewfb7hm/spack-src", checksumkind: CSK_MD5, checksum: "747ea7ab1744daf2a7e42508780575b1")
!357 = !DISubroutineType(types: !358)
!358 = !{null}
!359 = !DISubprogram(name: "fprintf", scope: !360, file: !360, line: 350, type: !361, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!360 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!361 = !DISubroutineType(types: !362)
!362 = !{!118, !363, !422, null}
!363 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !366, line: 7, baseType: !367)
!366 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !368, line: 49, size: 1728, elements: !369)
!368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !385, !387, !388, !389, !392, !394, !396, !400, !403, !405, !408, !411, !412, !413, !417, !418}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !367, file: !368, line: 51, baseType: !118, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !367, file: !368, line: 54, baseType: !120, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !367, file: !368, line: 55, baseType: !120, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !367, file: !368, line: 56, baseType: !120, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !367, file: !368, line: 57, baseType: !120, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !367, file: !368, line: 58, baseType: !120, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !367, file: !368, line: 59, baseType: !120, size: 64, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !367, file: !368, line: 60, baseType: !120, size: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !367, file: !368, line: 61, baseType: !120, size: 64, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !367, file: !368, line: 64, baseType: !120, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !367, file: !368, line: 65, baseType: !120, size: 64, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !367, file: !368, line: 66, baseType: !120, size: 64, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !367, file: !368, line: 68, baseType: !383, size: 64, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !368, line: 36, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !367, file: !368, line: 70, baseType: !386, size: 64, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !367, file: !368, line: 72, baseType: !118, size: 32, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !367, file: !368, line: 73, baseType: !118, size: 32, offset: 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !367, file: !368, line: 74, baseType: !390, size: 64, offset: 960)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !152, line: 152, baseType: !391)
!391 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !367, file: !368, line: 77, baseType: !393, size: 16, offset: 1024)
!393 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !367, file: !368, line: 78, baseType: !395, size: 8, offset: 1040)
!395 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !367, file: !368, line: 79, baseType: !397, size: 8, offset: 1048)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 1)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !367, file: !368, line: 81, baseType: !401, size: 64, offset: 1088)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !368, line: 43, baseType: null)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !367, file: !368, line: 89, baseType: !404, size: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !152, line: 153, baseType: !391)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !367, file: !368, line: 91, baseType: !406, size: 64, offset: 1216)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !368, line: 37, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !367, file: !368, line: 92, baseType: !409, size: 64, offset: 1280)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !368, line: 38, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !367, file: !368, line: 93, baseType: !386, size: 64, offset: 1344)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !367, file: !368, line: 94, baseType: !106, size: 64, offset: 1408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !367, file: !368, line: 95, baseType: !414, size: 64, offset: 1472)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !415, line: 70, baseType: !416)
!415 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!416 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !367, file: !368, line: 96, baseType: !118, size: 32, offset: 1536)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !367, file: !368, line: 98, baseType: !419, size: 160, offset: 1568)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 20)
!422 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !131)
!423 = !DISubprogram(name: "mongoc_uri_new_with_error", scope: !136, file: !136, line: 105, type: !424, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!424 = !DISubroutineType(types: !425)
!425 = !{!134, !131, !426}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!427 = !DISubprogram(name: "mongoc_client_new_from_uri_with_error", scope: !127, file: !127, line: 111, type: !428, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!428 = !DISubroutineType(types: !429)
!429 = !{!125, !430, !426}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!432 = !DISubprogram(name: "mongoc_client_get_collection", scope: !127, file: !127, line: 199, type: !433, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!433 = !DISubroutineType(types: !434)
!434 = !{!139, !125, !131, !131}
!435 = !DISubprogram(name: "bcon_new", scope: !71, file: !71, line: 263, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!436 = !DISubroutineType(types: !437)
!437 = !{!162, !106, null}
!438 = !DISubprogram(name: "bson_bcon_magic", scope: !71, file: !71, line: 287, type: !439, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!439 = !DISubroutineType(types: !440)
!440 = !{!131}
!441 = distinct !DISubprogram(name: "bcon_ensure_int32", scope: !71, file: !71, line: 58, type: !442, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !67, retainedNodes: !447)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !444}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !445, line: 26, baseType: !446)
!445 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !152, line: 41, baseType: !118)
!447 = !{!448}
!448 = !DILocalVariable(name: "_t", arg: 1, scope: !441, file: !71, line: 58, type: !444)
!449 = !DILocation(line: 58, column: 1, scope: !441)
!450 = !DISubprogram(name: "mongoc_index_model_new", scope: !141, file: !141, line: 163, type: !451, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!451 = !DISubroutineType(types: !452)
!452 = !{!176, !186, !186}
!453 = !DISubprogram(name: "mongoc_collection_create_indexes_with_opts", scope: !141, file: !141, line: 168, type: !454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!454 = !DISubroutineType(types: !455)
!455 = !{!159, !139, !456, !414, !186, !162, !426}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!458 = !DISubprogram(name: "printf", scope: !360, file: !360, line: 356, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!459 = !DISubroutineType(types: !460)
!460 = !{!118, !422, null}
!461 = !DISubprogram(name: "bson_destroy", scope: !462, file: !462, line: 371, type: !463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
