; ModuleID = 'samples/893.bc'
source_filename = "dnssec-cds.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.dns_rdataset = type { i32, ptr, %struct.anon, i16, i16, i32, i32, i16, i16, i32, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr }
%struct.anon = type { ptr, ptr }
%struct.dns_rdata_rrsig = type { %struct.dns_rdatacommon, ptr, i16, i8, i8, i32, i32, i32, i16, %struct.dns_name, i16, ptr }
%struct.dns_rdatacommon = type { i16, i16, %struct.anon.5 }
%struct.anon.5 = type { ptr, ptr }
%struct.dns_name = type { i32, ptr, i32, i32, i32, ptr, ptr, %struct.anon.6, %struct.anon.7 }
%struct.anon.6 = type { ptr, ptr }
%struct.anon.7 = type { ptr, ptr }
%struct.dns_fixedname = type { %struct.dns_name, [128 x i8], %struct.isc_buffer, [255 x i8] }
%struct.isc_buffer = type { i32, ptr, i32, i32, i32, i32, %struct.anon.8, ptr, i8 }
%struct.anon.8 = type { ptr, ptr }
%struct.isc_time = type { i32, i32 }
%struct.dns_rdata_key = type { %struct.dns_rdatacommon, ptr, i16, i8, i8, i16, ptr }
%struct.isc_region = type { ptr, i32 }
%struct.keyinfo = type { %struct.dns_rdata, ptr, i8, i16 }
%struct.dns_rdata = type { ptr, i32, i16, i16, i32, %struct.anon.9 }
%struct.anon.9 = type { ptr, ptr }
%struct.dns_rdatalist = type { i16, i16, i16, i32, %struct.anon.10, %struct.anon.11, [32 x i8] }
%struct.anon.10 = type { ptr, ptr }
%struct.anon.11 = type { ptr, ptr }

!72 = !DIEnumerator(name: "dns_rdatatype_apl", value: 42)
!73 = !DIEnumerator(name: "dns_rdatatype_ds", value: 43)
!74 = !DIEnumerator(name: "dns_rdatatype_sshfp", value: 44)
!75 = !DIEnumerator(name: "dns_rdatatype_ipseckey", value: 45)
!76 = !DIEnumerator(name: "dns_rdatatype_rrsig", value: 46)
!77 = !DIEnumerator(name: "dns_rdatatype_nsec", value: 47)
!78 = !DIEnumerator(name: "dns_rdatatype_dnskey", value: 48)
!79 = !DIEnumerator(name: "dns_rdatatype_dhcid", value: 49)
!80 = !DIEnumerator(name: "dns_rdatatype_nsec3", value: 50)
!81 = !DIEnumerator(name: "dns_rdatatype_nsec3param", value: 51)
!82 = !DIEnumerator(name: "dns_rdatatype_tlsa", value: 52)
!83 = !DIEnumerator(name: "dns_rdatatype_smimea", value: 53)
!84 = !DIEnumerator(name: "dns_rdatatype_hip", value: 55)
!85 = !DIEnumerator(name: "dns_rdatatype_ninfo", value: 56)
!86 = !DIEnumerator(name: "dns_rdatatype_rkey", value: 57)
!87 = !DIEnumerator(name: "dns_rdatatype_talink", value: 58)
!88 = !DIEnumerator(name: "dns_rdatatype_cds", value: 59)
!89 = !DIEnumerator(name: "dns_rdatatype_cdnskey", value: 60)
!90 = !DIEnumerator(name: "dns_rdatatype_openpgpkey", value: 61)
!91 = !DIEnumerator(name: "dns_rdatatype_csync", value: 62)
!92 = !DIEnumerator(name: "dns_rdatatype_zonemd", value: 63)
!93 = !DIEnumerator(name: "dns_rdatatype_spf", value: 99)
!94 = !DIEnumerator(name: "dns_rdatatype_nid", value: 104)
!95 = !DIEnumerator(name: "dns_rdatatype_l32", value: 105)
!96 = !DIEnumerator(name: "dns_rdatatype_l64", value: 106)
!97 = !DIEnumerator(name: "dns_rdatatype_lp", value: 107)
!98 = !DIEnumerator(name: "dns_rdatatype_eui48", value: 108)
!99 = !DIEnumerator(name: "dns_rdatatype_eui64", value: 109)
!100 = !DIEnumerator(name: "dns_rdatatype_tkey", value: 249)
!101 = !DIEnumerator(name: "dns_rdatatype_tsig", value: 250)
!102 = !DIEnumerator(name: "dns_rdatatype_uri", value: 256)
!103 = !DIEnumerator(name: "dns_rdatatype_caa", value: 257)
!104 = !DIEnumerator(name: "dns_rdatatype_avc", value: 258)
!105 = !DIEnumerator(name: "dns_rdatatype_doa", value: 259)
!106 = !DIEnumerator(name: "dns_rdatatype_amtrelay", value: 260)
!107 = !DIEnumerator(name: "dns_rdatatype_ta", value: 32768)
!108 = !DIEnumerator(name: "dns_rdatatype_dlv", value: 32769)
!109 = !DIEnumerator(name: "dns_rdatatype_keydata", value: 65533)
!110 = !DIEnumerator(name: "dns_rdatatype_ixfr", value: 251)
!111 = !DIEnumerator(name: "dns_rdatatype_axfr", value: 252)
!112 = !DIEnumerator(name: "dns_rdatatype_mailb", value: 253)
!113 = !DIEnumerator(name: "dns_rdatatype_maila", value: 254)
!114 = !DIEnumerator(name: "dns_rdatatype_any", value: 255)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 25, baseType: !13, size: 32, elements: !117)
!116 = !DIFile(filename: "lib/isc/include/isc/assertions.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "d437064b1a440cf5712e89d244b6208d")
!117 = !{!118, !119, !120, !121}
!118 = !DIEnumerator(name: "isc_assertiontype_require", value: 0)
!119 = !DIEnumerator(name: "isc_assertiontype_ensure", value: 1)
!120 = !DIEnumerator(name: "isc_assertiontype_insist", value: 2)
!121 = !DIEnumerator(name: "isc_assertiontype_invariant", value: 3)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 186, baseType: !13, size: 32, elements: !123)
!123 = !{!124, !125, !126}
!124 = !DIEnumerator(name: "dns_dbtype_zone", value: 0)
!125 = !DIEnumerator(name: "dns_dbtype_cache", value: 1)
!126 = !DIEnumerator(name: "dns_dbtype_stub", value: 3)
!127 = !{!128, !129, !137, !141, !13, !142, !143, !144, !161}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dsdigest_t", file: !18, line: 78, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !133, line: 24, baseType: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !135, line: 38, baseType: !136)
!135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!136 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataclass_t", file: !18, line: 121, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !133, line: 25, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !135, line: 40, baseType: !140)
!140 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatatype_t", file: !18, line: 126, baseType: !138)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdata_t", file: !18, line: 119, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdata", file: !148, line: 112, size: 320, elements: !149)
!148 = !DIFile(filename: "lib/dns/include/dns/rdata.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "e790fb4f336bc4fdcd566550403b32a6")
!149 = !{!150, !151, !152, !153, !154, !155}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !148, line: 113, baseType: !142, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !147, file: !148, line: 114, baseType: !13, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !147, file: !148, line: 115, baseType: !137, size: 16, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !148, line: 116, baseType: !141, size: 16, offset: 112)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !148, line: 117, baseType: !13, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !147, file: !148, line: 118, baseType: !156, size: 128, offset: 192)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !147, file: !148, line: 118, size: 128, elements: !157)
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !148, line: 118, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !148, line: 118, baseType: !159, size: 64, offset: 64)
!161 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!162 = !{!0, !8, !163, !227, !232, !237, !242, !247, !252, !257, !262, !267, !272, !277, !279, !284, !289, !291, !296, !301, !303, !308, !310, !315, !320, !325, !330, !332, !337, !679, !681, !683, !685, !687, !689, !691, !693, !695, !706, !708, !710, !715, !717, !719, !722, !727, !732, !737, !742, !744, !761, !763, !768, !770, !772, !777, !782, !784, !789, !794, !796, !801, !806, !808, !810, !812, !815, !818, !823, !825, !827, !829, !834, !839, !844, !846, !848, !853, !855, !857, !862, !867, !869, !871, !873, !875, !877, !879, !884, !889, !891, !893, !898, !903, !905, !910, !912, !914, !916, !918, !923, !928, !930, !932, !934, !936, !938, !940, !942, !944, !946, !948, !950, !952, !954, !956, !958, !963, !965, !967, !972, !974, !976, !978, !983, !988, !990, !992, !994, !996, !1001}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "new_ds_buf", scope: !10, file: !2, line: 147, type: !165, isLocal: false, isDefinition: true)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_buffer_t", file: !167, line: 35, baseType: !168)
!167 = !DIFile(filename: "lib/isc/include/isc/types.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "6a355582c4f962c465b18bab43b68c96")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_buffer", file: !169, line: 173, size: 512, elements: !170)
!169 = !DIFile(filename: "lib/isc/include/isc/buffer.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "feec9784066f3891a27281dd5bdccd55")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !182, !225}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !168, file: !169, line: 174, baseType: !13, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !168, file: !169, line: 175, baseType: !128, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !168, file: !169, line: 178, baseType: !13, size: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !168, file: !169, line: 179, baseType: !13, size: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !168, file: !169, line: 180, baseType: !13, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !168, file: !169, line: 181, baseType: !13, size: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !168, file: !169, line: 184, baseType: !178, size: 128, offset: 256)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !168, file: !169, line: 184, size: 128, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !178, file: !169, line: 184, baseType: !165, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !169, line: 184, baseType: !165, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !168, file: !169, line: 186, baseType: !183, size: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mem_t", file: !167, line: 59, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mem", file: !186, line: 191, size: 128, elements: !187)
!186 = !DIFile(filename: "lib/isc/include/isc/mem.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "587a841195795b087519b89f298822b2")
!187 = !{!188, !189, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !185, file: !186, line: 192, baseType: !13, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !185, file: !186, line: 193, baseType: !13, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !185, file: !186, line: 194, baseType: !191, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_memmethods_t", file: !186, line: 180, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_memmethods", file: !186, line: 170, size: 448, elements: !194)
!194 = !{!195, !203, !207, !212, !213, !217, !221}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "memget", scope: !193, file: !186, line: 171, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!128, !183, !199, !202, !13}
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !200, line: 70, baseType: !201)
!200 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!201 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "memput", scope: !193, file: !186, line: 172, baseType: !204, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !183, !128, !199, !202, !13}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "memputanddetach", scope: !193, file: !186, line: 173, baseType: !208, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !211, !128, !199, !202, !13}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "memallocate", scope: !193, file: !186, line: 175, baseType: !196, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "memreallocate", scope: !193, file: !186, line: 176, baseType: !214, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!128, !183, !128, !199, !202, !13}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "memstrdup", scope: !193, file: !186, line: 178, baseType: !218, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!143, !183, !202, !202, !13}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "memfree", scope: !193, file: !186, line: 179, baseType: !222, size: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !183, !128, !202, !13}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "autore", scope: !168, file: !169, line: 188, baseType: !226, size: 8, offset: 448)
!226 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1143, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 14)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1154, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 21)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1180, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 1)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1205, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 32)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1232, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 29)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1237, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 23)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1249, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 53)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1261, type: !264, isLocal: true, isDefinition: true)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 42)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1267, type: !269, isLocal: true, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 37)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1272, type: !274, isLocal: true, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 33)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1275, type: !259, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1284, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 28)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1287, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 45)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1291, type: !249, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1295, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 46)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1300, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 25)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1304, type: !264, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1318, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 31)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1320, type: !298, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1331, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 40)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1353, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 50)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1357, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 592, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 74)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1366, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 65)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "verbose", scope: !10, file: !2, line: 69, type: !161, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "dtype", scope: !10, file: !2, line: 89, type: !334, isLocal: true, isDefinition: true)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 64, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 8)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "oldestsig", scope: !10, file: !2, line: 93, type: !339, isLocal: true, isDefinition: true)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdata_rrsig_t", file: !340, line: 1388, baseType: !341)
!340 = !DIFile(filename: "lib/dns/include/dns/rdatastruct.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "2fa7912eeb1b296a4fc4f0b7f3b904fc")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdata_rrsig", file: !340, line: 1375, size: 1216, elements: !342)
!342 = !{!343, !355, !356, !357, !359, !360, !363, !364, !365, !366, !677, !678}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !341, file: !340, line: 1376, baseType: !344, size: 192)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatacommon_t", file: !340, line: 45, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatacommon", file: !340, line: 41, size: 192, elements: !346)
!346 = !{!347, !348, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !345, file: !340, line: 42, baseType: !137, size: 16)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rdtype", scope: !345, file: !340, line: 43, baseType: !141, size: 16, offset: 16)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !345, file: !340, line: 44, baseType: !350, size: 128, offset: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !345, file: !340, line: 44, size: 128, elements: !351)
!351 = !{!352, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !350, file: !340, line: 44, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !340, line: 44, baseType: !353, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !341, file: !340, line: 1377, baseType: !183, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "covered", scope: !341, file: !340, line: 1378, baseType: !141, size: 16, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !341, file: !340, line: 1379, baseType: !358, size: 8, offset: 272)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_secalg_t", file: !18, line: 131, baseType: !132)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !341, file: !340, line: 1380, baseType: !132, size: 8, offset: 280)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "originalttl", scope: !341, file: !340, line: 1381, baseType: !361, size: 32, offset: 288)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !133, line: 26, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !135, line: 42, baseType: !13)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "timeexpire", scope: !341, file: !340, line: 1382, baseType: !361, size: 32, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "timesigned", scope: !341, file: !340, line: 1383, baseType: !361, size: 32, offset: 352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "keyid", scope: !341, file: !340, line: 1384, baseType: !138, size: 16, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "signer", scope: !341, file: !340, line: 1385, baseType: !367, size: 640, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_name_t", file: !18, line: 107, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_name", file: !369, line: 104, size: 640, elements: !370)
!369 = !DIFile(filename: "lib/dns/include/dns/name.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "ec64c9a43875cd86cb4b0e37c1191a89")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !384}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !368, file: !369, line: 105, baseType: !13, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ndata", scope: !368, file: !369, line: 106, baseType: !142, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !368, file: !369, line: 107, baseType: !13, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !368, file: !369, line: 108, baseType: !13, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !368, file: !369, line: 109, baseType: !13, size: 32, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !368, file: !369, line: 110, baseType: !142, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !368, file: !369, line: 111, baseType: !165, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !368, file: !369, line: 112, baseType: !379, size: 128, offset: 384)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !369, line: 112, size: 128, elements: !380)
!380 = !{!381, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !379, file: !369, line: 112, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !369, line: 112, baseType: !382, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !368, file: !369, line: 113, baseType: !385, size: 128, offset: 512)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !369, line: 113, size: 128, elements: !386)
!386 = !{!387, !676}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !385, file: !369, line: 113, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdataset_t", file: !18, line: 123, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdataset", file: !391, line: 107, size: 960, elements: !392)
!391 = !DIFile(filename: "lib/dns/include/dns/rdataset.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "a2414fd23f718a363582354673aed6a8")
!392 = !{!393, !394, !653, !658, !659, !660, !661, !662, !663, !664, !665, !666, !669, !670, !671, !672, !673, !674, !675}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !390, file: !391, line: 108, baseType: !13, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !390, file: !391, line: 109, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetmethods_t", file: !391, line: 96, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatasetmethods", file: !391, line: 64, size: 1024, elements: !398)
!398 = !{!399, !403, !408, !409, !413, !417, !421, !427, !431, !432, !433, !438, !439, !440, !444, !450}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "disassociate", scope: !397, file: !391, line: 65, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !388}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !397, file: !391, line: 66, baseType: !404, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!407, !388}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_result_t", file: !167, line: 67, baseType: !13)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !391, line: 67, baseType: !404, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !397, file: !391, line: 68, baseType: !410, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !388, !159}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !397, file: !391, line: 70, baseType: !414, size: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !388, !388}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !397, file: !391, line: 72, baseType: !418, size: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!13, !388}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "addnoqname", scope: !397, file: !391, line: 73, baseType: !422, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!407, !388, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "getnoqname", scope: !397, file: !391, line: 75, baseType: !428, size: 64, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!407, !388, !382, !388, !388}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "addclosest", scope: !397, file: !391, line: 79, baseType: !422, size: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "getclosest", scope: !397, file: !391, line: 81, baseType: !428, size: 64, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "settrust", scope: !397, file: !391, line: 85, baseType: !434, size: 64, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !388, !437}
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_trust_t", file: !18, line: 140, baseType: !138)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !397, file: !391, line: 87, baseType: !400, size: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "clearprefetch", scope: !397, file: !391, line: 88, baseType: !400, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "setownercase", scope: !397, file: !391, line: 89, baseType: !441, size: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !388, !425}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "getownercase", scope: !397, file: !391, line: 91, baseType: !445, size: 64, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !448, !382}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "addglue", scope: !397, file: !391, line: 93, baseType: !451, size: 64, offset: 960)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!407, !388, !454, !456}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_dbversion_t", file: !18, line: 61, baseType: null)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_message_t", file: !18, line: 103, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_message", file: !459, line: 197, size: 3840, elements: !460)
!459 = !DIFile(filename: "lib/dns/include/dns/message.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "6416f0e57c4314c86bb1ccbb29bdbc0d")
!460 = !{!461, !462, !464, !465, !467, !469, !470, !474, !481, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !539, !540, !547, !548, !554, !555, !563, !568, !573, !578, !605, !606, !607, !608, !609, !613, !618, !619, !620, !621, !625, !626, !627, !628, !635}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !458, file: !459, line: 199, baseType: !13, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !458, file: !459, line: 201, baseType: !463, size: 16, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_messageid_t", file: !18, line: 104, baseType: !138)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !458, file: !459, line: 202, baseType: !13, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !458, file: !459, line: 203, baseType: !466, size: 16, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rcode_t", file: !18, line: 118, baseType: !138)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !458, file: !459, line: 204, baseType: !468, size: 16, offset: 112)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_opcode_t", file: !18, line: 111, baseType: !138)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !458, file: !459, line: 205, baseType: !137, size: 16, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !458, file: !459, line: 208, baseType: !471, size: 128, offset: 160)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 4)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sections", scope: !458, file: !459, line: 211, baseType: !475, size: 512, offset: 320)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 512, elements: !472)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_namelist_t", file: !18, line: 108, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 108, size: 128, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !477, file: !18, line: 108, baseType: !382, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !477, file: !18, line: 108, baseType: !382, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "cursors", scope: !458, file: !459, line: 212, baseType: !482, size: 256, offset: 832)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 256, elements: !472)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !458, file: !459, line: 213, baseType: !388, size: 64, offset: 1088)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sig0", scope: !458, file: !459, line: 214, baseType: !388, size: 64, offset: 1152)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tsig", scope: !458, file: !459, line: 215, baseType: !388, size: 64, offset: 1216)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !458, file: !459, line: 217, baseType: !161, size: 32, offset: 1280)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "from_to_wire", scope: !458, file: !459, line: 218, baseType: !13, size: 2, offset: 1312, flags: DIFlagBitField, extraData: i64 1312)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "header_ok", scope: !458, file: !459, line: 219, baseType: !13, size: 1, offset: 1314, flags: DIFlagBitField, extraData: i64 1312)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "question_ok", scope: !458, file: !459, line: 220, baseType: !13, size: 1, offset: 1315, flags: DIFlagBitField, extraData: i64 1312)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_continuation", scope: !458, file: !459, line: 221, baseType: !13, size: 1, offset: 1316, flags: DIFlagBitField, extraData: i64 1312)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "verified_sig", scope: !458, file: !459, line: 222, baseType: !13, size: 1, offset: 1317, flags: DIFlagBitField, extraData: i64 1312)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "verify_attempted", scope: !458, file: !459, line: 223, baseType: !13, size: 1, offset: 1318, flags: DIFlagBitField, extraData: i64 1312)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "free_query", scope: !458, file: !459, line: 224, baseType: !13, size: 1, offset: 1319, flags: DIFlagBitField, extraData: i64 1312)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "free_saved", scope: !458, file: !459, line: 225, baseType: !13, size: 1, offset: 1320, flags: DIFlagBitField, extraData: i64 1312)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cc_ok", scope: !458, file: !459, line: 226, baseType: !13, size: 1, offset: 1321, flags: DIFlagBitField, extraData: i64 1312)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "cc_bad", scope: !458, file: !459, line: 227, baseType: !13, size: 1, offset: 1322, flags: DIFlagBitField, extraData: i64 1312)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tkey", scope: !458, file: !459, line: 228, baseType: !13, size: 1, offset: 1323, flags: DIFlagBitField, extraData: i64 1312)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass_set", scope: !458, file: !459, line: 229, baseType: !13, size: 1, offset: 1324, flags: DIFlagBitField, extraData: i64 1312)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "opt_reserved", scope: !458, file: !459, line: 231, baseType: !13, size: 32, offset: 1344)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sig_reserved", scope: !458, file: !459, line: 232, baseType: !13, size: 32, offset: 1376)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !458, file: !459, line: 233, baseType: !13, size: 32, offset: 1408)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !458, file: !459, line: 235, baseType: !138, size: 16, offset: 1440)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "padding_off", scope: !458, file: !459, line: 236, baseType: !13, size: 32, offset: 1472)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !458, file: !459, line: 238, baseType: !165, size: 64, offset: 1536)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cctx", scope: !458, file: !459, line: 239, baseType: !506, size: 64, offset: 1600)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compress_t", file: !18, line: 53, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compress", file: !509, line: 66, size: 18688, elements: !510)
!509 = !DIFile(filename: "lib/dns/include/dns/compress.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "ae360072e6dd15c4fe76c4efa2dcea4c")
!510 = !{!511, !512, !513, !514, !533, !537, !538}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !508, file: !509, line: 67, baseType: !13, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !508, file: !509, line: 68, baseType: !13, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "edns", scope: !508, file: !509, line: 69, baseType: !161, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !508, file: !509, line: 71, baseType: !515, size: 4096, offset: 128)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 4096, elements: !531)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_compressnode_t", file: !509, line: 56, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_compressnode", file: !509, line: 58, size: 896, elements: !519)
!519 = !{!520, !521, !522, !523, !530}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !518, file: !509, line: 59, baseType: !516, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !518, file: !509, line: 60, baseType: !138, size: 16, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !518, file: !509, line: 61, baseType: !138, size: 16, offset: 80)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !518, file: !509, line: 62, baseType: !524, size: 128, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_region_t", file: !167, line: 65, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_region", file: !526, line: 21, size: 128, elements: !527)
!526 = !DIFile(filename: "lib/isc/include/isc/region.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "2ed4a07dc05ddbd48f51e2dc9be9f317")
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !525, file: !526, line: 22, baseType: !142, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !525, file: !526, line: 23, baseType: !13, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !518, file: !509, line: 63, baseType: !367, size: 640, offset: 256)
!531 = !{!532}
!532 = !DISubrange(count: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "initialnodes", scope: !508, file: !509, line: 73, baseType: !534, size: 14336, offset: 4224)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 14336, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 16)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !508, file: !509, line: 74, baseType: !138, size: 16, offset: 18560)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !508, file: !509, line: 75, baseType: !183, size: 64, offset: 18624)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !458, file: !459, line: 241, baseType: !183, size: 64, offset: 1664)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "namepool", scope: !458, file: !459, line: 242, baseType: !541, size: 64, offset: 1728)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_mempool_t", file: !167, line: 60, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isc_mempool", file: !186, line: 205, size: 64, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "impmagic", scope: !543, file: !186, line: 206, baseType: !13, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !543, file: !186, line: 207, baseType: !13, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rdspool", scope: !458, file: !459, line: 243, baseType: !541, size: 64, offset: 1792)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "scratchpad", scope: !458, file: !459, line: 245, baseType: !549, size: 128, offset: 1856)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_bufferlist_t", file: !167, line: 36, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 36, size: 128, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !550, file: !167, line: 36, baseType: !165, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !550, file: !167, line: 36, baseType: !165, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !458, file: !459, line: 246, baseType: !549, size: 128, offset: 1984)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rdatas", scope: !458, file: !459, line: 248, baseType: !556, size: 128, offset: 2112)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !459, line: 248, size: 128, elements: !557)
!557 = !{!558, !562}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !556, file: !459, line: 248, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_msgblock_t", file: !459, line: 189, baseType: !561)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_msgblock", file: !459, line: 189, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !556, file: !459, line: 248, baseType: !559, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rdatalists", scope: !458, file: !459, line: 249, baseType: !564, size: 128, offset: 2240)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !459, line: 249, size: 128, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !564, file: !459, line: 249, baseType: !559, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !564, file: !459, line: 249, baseType: !559, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !458, file: !459, line: 250, baseType: !569, size: 128, offset: 2368)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !459, line: 250, size: 128, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !569, file: !459, line: 250, baseType: !559, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !569, file: !459, line: 250, baseType: !559, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "freerdata", scope: !458, file: !459, line: 252, baseType: !574, size: 128, offset: 2496)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !459, line: 252, size: 128, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !574, file: !459, line: 252, baseType: !159, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !574, file: !459, line: 252, baseType: !159, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "freerdatalist", scope: !458, file: !459, line: 253, baseType: !579, size: 128, offset: 2624)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !459, line: 253, size: 128, elements: !580)
!580 = !{!581, !604}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !579, file: !459, line: 253, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatalist_t", file: !18, line: 122, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_rdatalist", file: !585, line: 47, size: 640, elements: !586)
!585 = !DIFile(filename: "lib/dns/include/dns/rdatalist.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "83ad1004003459f099937cac6d2eb8e0")
!586 = !{!587, !588, !589, !590, !592, !597, !602}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !584, file: !585, line: 48, baseType: !137, size: 16)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !584, file: !585, line: 49, baseType: !141, size: 16, offset: 16)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "covers", scope: !584, file: !585, line: 50, baseType: !141, size: 16, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !584, file: !585, line: 51, baseType: !591, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_ttl_t", file: !18, line: 144, baseType: !361)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rdata", scope: !584, file: !585, line: 52, baseType: !593, size: 128, offset: 128)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !584, file: !585, line: 52, size: 128, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !593, file: !585, line: 52, baseType: !159, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !593, file: !585, line: 52, baseType: !159, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !584, file: !585, line: 53, baseType: !598, size: 128, offset: 256)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !584, file: !585, line: 53, size: 128, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !598, file: !585, line: 53, baseType: !582, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !598, file: !585, line: 53, baseType: !582, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !584, file: !585, line: 59, baseType: !603, size: 256, offset: 384)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 256, elements: !245)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !579, file: !459, line: 253, baseType: !582, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tsigstatus", scope: !458, file: !459, line: 255, baseType: !466, size: 16, offset: 2752)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "querytsigstatus", scope: !458, file: !459, line: 256, baseType: !466, size: 16, offset: 2768)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tsigname", scope: !458, file: !459, line: 257, baseType: !382, size: 64, offset: 2816)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "querytsig", scope: !458, file: !459, line: 258, baseType: !388, size: 64, offset: 2880)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tsigkey", scope: !458, file: !459, line: 259, baseType: !610, size: 64, offset: 2944)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_tsigkey_t", file: !18, line: 143, baseType: !612)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_tsigkey", file: !18, line: 143, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "tsigctx", scope: !458, file: !459, line: 260, baseType: !614, size: 64, offset: 3008)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_context_t", file: !616, line: 45, baseType: !617)
!616 = !DIFile(filename: "lib/dns/include/dst/dst.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "10e76bcacbe005e6cc7dee2ac6ffac9a")
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_context", file: !616, line: 45, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sigstart", scope: !458, file: !459, line: 261, baseType: !161, size: 32, offset: 3072)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "timeadjust", scope: !458, file: !459, line: 262, baseType: !161, size: 32, offset: 3104)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sig0name", scope: !458, file: !459, line: 264, baseType: !382, size: 64, offset: 3136)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sig0key", scope: !458, file: !459, line: 265, baseType: !622, size: 64, offset: 3200)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "dst_key_t", file: !616, line: 44, baseType: !624)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "dst_key", file: !616, line: 44, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sig0status", scope: !458, file: !459, line: 266, baseType: !466, size: 16, offset: 3264)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !458, file: !459, line: 267, baseType: !524, size: 128, offset: 3328)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !458, file: !459, line: 268, baseType: !524, size: 128, offset: 3456)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !458, file: !459, line: 270, baseType: !629, size: 64, offset: 3584)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_rdatasetorderfunc_t", file: !18, line: 415, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!161, !144, !633}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "order_arg", scope: !458, file: !459, line: 271, baseType: !636, size: 192, offset: 3648)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_sortlist_arg_t", file: !18, line: 134, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_sortlist_arg", file: !459, line: 191, size: 192, elements: !638)
!638 = !{!639, !643, !648}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !637, file: !459, line: 192, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclenv_t", file: !18, line: 32, baseType: !642)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclenv", file: !18, line: 32, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !637, file: !459, line: 193, baseType: !644, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_acl_t", file: !18, line: 30, baseType: !647)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_acl", file: !18, line: 30, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !637, file: !459, line: 194, baseType: !649, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_aclelement_t", file: !18, line: 31, baseType: !652)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "dns_aclelement", file: !18, line: 31, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !390, file: !391, line: 110, baseType: !654, size: 128, offset: 128)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !391, line: 110, size: 128, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !654, file: !391, line: 110, baseType: !388, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !391, line: 110, baseType: !388, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rdclass", scope: !390, file: !391, line: 117, baseType: !137, size: 16, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !391, line: 118, baseType: !141, size: 16, offset: 272)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !390, file: !391, line: 119, baseType: !591, size: 32, offset: 288)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "stale_ttl", scope: !390, file: !391, line: 124, baseType: !591, size: 32, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !390, file: !391, line: 125, baseType: !437, size: 16, offset: 352)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "covers", scope: !390, file: !391, line: 126, baseType: !141, size: 16, offset: 368)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !390, file: !391, line: 131, baseType: !13, size: 32, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !390, file: !391, line: 139, baseType: !361, size: 32, offset: 416)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "resign", scope: !390, file: !391, line: 145, baseType: !667, size: 32, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_stdtime_t", file: !668, line: 26, baseType: !361)
!668 = !DIFile(filename: "../../lib/isc/unix/include/isc/stdtime.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src/bin/dnssec", checksumkind: CSK_MD5, checksum: "b8868fded6c0eb282ad50986c628a693")
!669 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !390, file: !391, line: 152, baseType: !128, size: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !390, file: !391, line: 153, baseType: !128, size: 64, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !390, file: !391, line: 154, baseType: !128, size: 64, offset: 640)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "privateuint4", scope: !390, file: !391, line: 155, baseType: !13, size: 32, offset: 704)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !390, file: !391, line: 156, baseType: !128, size: 64, offset: 768)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !390, file: !391, line: 157, baseType: !633, size: 64, offset: 832)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "private7", scope: !390, file: !391, line: 158, baseType: !633, size: 64, offset: 896)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !385, file: !369, line: 113, baseType: !388, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "siglen", scope: !341, file: !340, line: 1386, baseType: !138, size: 16, offset: 1088)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !341, file: !340, line: 1387, baseType: !142, size: 64, offset: 1152)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "cdnskey_set", scope: !10, file: !2, line: 140, type: !389, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "cdnskey_sig", scope: !10, file: !2, line: 140, type: !389, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "cds_set", scope: !10, file: !2, line: 141, type: !389, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "cds_sig", scope: !10, file: !2, line: 141, type: !389, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "dnskey_set", scope: !10, file: !2, line: 142, type: !389, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "dnskey_sig", scope: !10, file: !2, line: 142, type: !389, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "old_ds_set", scope: !10, file: !2, line: 143, type: !389, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "new_ds_set", scope: !10, file: !2, line: 143, type: !389, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "old_key_tbl", scope: !10, file: !2, line: 145, type: !697, isLocal: true, isDefinition: true)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "keyinfo_t", file: !2, line: 134, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyinfo", file: !2, line: 129, size: 448, elements: !700)
!700 = !{!701, !702, !703, !704}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rdata", scope: !699, file: !2, line: 130, baseType: !146, size: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !699, file: !2, line: 131, baseType: !622, size: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "algo", scope: !699, file: !2, line: 132, baseType: !358, size: 8, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !699, file: !2, line: 133, baseType: !705, size: 16, offset: 400)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_keytag_t", file: !18, line: 98, baseType: !138)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "new_key_tbl", scope: !10, file: !2, line: 145, type: !697, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "mctx", scope: !10, file: !2, line: 75, type: !183, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !2, line: 866, type: !712, isLocal: true, isDefinition: true)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 34)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "rdclass", scope: !10, file: !2, line: 83, type: !137, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "startstr", scope: !10, file: !2, line: 91, type: !202, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1108, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !335)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1110, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 55)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !729, isLocal: true, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 13)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 7)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1113, type: !739, isLocal: true, isDefinition: true)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4416, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 552)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !249, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "fixed", scope: !10, file: !2, line: 81, type: !746, isLocal: true, isDefinition: true)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_fixedname_t", file: !18, line: 87, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_fixedname", file: !748, line: 61, size: 4224, elements: !749)
!748 = !DIFile(filename: "lib/dns/include/dns/fixedname.h", directory: "/local-ssd/bind9-bfe527roow53kyl4mztedmcoca3rfykn-build/aidengro/spack-stage-bind9-9_14_6-bfe527roow53kyl4mztedmcoca3rfykn/spack-src", checksumkind: CSK_MD5, checksum: "0de03067a9d468538b5b154e7da6cb18")
!749 = !{!750, !751, !756, !757}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !747, file: !748, line: 62, baseType: !367, size: 640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !747, file: !748, line: 63, baseType: !752, size: 1024, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_offsets_t", file: !18, line: 112, baseType: !753)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1024, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !747, file: !748, line: 64, baseType: !166, size: 512, offset: 1664)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !747, file: !748, line: 65, baseType: !758, size: 2040, offset: 2176)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 2040, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 255)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "name", scope: !10, file: !2, line: 82, type: !382, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "lctx", scope: !10, file: !2, line: 74, type: !765, isLocal: true, isDefinition: true)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "isc_log_t", file: !167, line: 55, baseType: !767)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "isc_log", file: !167, line: 55, flags: DIFlagFwdDecl)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !2, line: 343, type: !264, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !312, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !2, line: 358, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 39)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !2, line: 301, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 22)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !2, line: 303, type: !729, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !2, line: 303, type: !786, isLocal: true, isDefinition: true)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 52)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !2, line: 303, type: !791, isLocal: true, isDefinition: true)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 44)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !2, line: 306, type: !734, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(scope: null, file: !2, line: 309, type: !798, isLocal: true, isDefinition: true)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 2)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !2, line: 318, type: !803, isLocal: true, isDefinition: true)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 26)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !2, line: 328, type: !293, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !2, line: 328, type: !774, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "notbefore", scope: !10, file: !2, line: 92, type: !667, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !2, line: 252, type: !814, isLocal: true, isDefinition: true)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !472)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !2, line: 254, type: !817, isLocal: true, isDefinition: true)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !535)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !2, line: 259, type: !820, isLocal: true, isDefinition: true)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 18)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !298, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !779, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "namestr", scope: !10, file: !2, line: 80, type: !202, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !2, line: 559, type: !831, isLocal: true, isDefinition: true)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 9)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !2, line: 567, type: !836, isLocal: true, isDefinition: true)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 27)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !2, line: 581, type: !841, isLocal: true, isDefinition: true)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 49)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "nkey", scope: !10, file: !2, line: 95, type: !161, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !2, line: 489, type: !254, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !2, line: 498, type: !850, isLocal: true, isDefinition: true)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 54)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !2, line: 508, type: !281, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !2, line: 509, type: !814, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !2, line: 509, type: !859, isLocal: true, isDefinition: true)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 3)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !864, isLocal: true, isDefinition: true)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 61)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !2, line: 521, type: !249, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !2, line: 525, type: !721, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !2, line: 525, type: !734, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !774, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(scope: null, file: !2, line: 641, type: !803, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !2, line: 647, type: !305, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !2, line: 661, type: !881, isLocal: true, isDefinition: true)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: 41)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !2, line: 673, type: !886, isLocal: true, isDefinition: true)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 47)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !2, line: 679, type: !254, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !2, line: 690, type: !803, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !2, line: 161, type: !895, isLocal: true, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 20)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !2, line: 162, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 43)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !734, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 12)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !2, line: 427, type: !859, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !2, line: 430, type: !281, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !2, line: 439, type: !907, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !2, line: 443, type: !907, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !2, line: 450, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 24)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !2, line: 457, type: !925, isLocal: true, isDefinition: true)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 38)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !2, line: 384, type: !305, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !2, line: 387, type: !895, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !779, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !2, line: 396, type: !925, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !2, line: 880, type: !836, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !2, line: 891, type: !274, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !2, line: 894, type: !920, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !2, line: 907, type: !920, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !2, line: 914, type: !817, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !244, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !244, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !244, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !244, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !2, line: 764, type: !920, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !2, line: 797, type: !920, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !2, line: 952, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 30)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !2, line: 971, type: !274, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !2, line: 748, type: !286, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1089, type: !969, isLocal: true, isDefinition: true)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 36)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1091, type: !814, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1092, type: !814, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1094, type: !820, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1096, type: !980, isLocal: true, isDefinition: true)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 6)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1099, type: !985, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 17)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1055, type: !895, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1059, type: !820, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1065, type: !234, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1075, type: !803, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1030, type: !998, isLocal: true, isDefinition: true)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 15)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1031, type: !985, isLocal: true, isDefinition: true)
!1003 = !{i32 7, !"Dwarf Version", i32 5}
!1004 = !{i32 2, !"Debug Info Version", i32 3}
!1005 = !{i32 1, !"wchar_size", i32 4}
!1006 = !{i32 8, !"PIC Level", i32 2}
!1007 = !{i32 7, !"uwtable", i32 2}
!1008 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!1009 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 1130, type: !1010, scopeLine: 1130, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1013)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!161, !161, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1014 = !DILocalVariable(name: "argc", arg: 1, scope: !1009, file: !2, line: 1130, type: !161)
!1015 = !DILocalVariable(name: "argv", arg: 2, scope: !1009, file: !2, line: 1130, type: !1012)
!1016 = !DILocalVariable(name: "child_path", scope: !1009, file: !2, line: 1131, type: !202)
!1017 = !DILocalVariable(name: "ds_path", scope: !1009, file: !2, line: 1132, type: !202)
!1018 = !DILocalVariable(name: "inplace", scope: !1009, file: !2, line: 1133, type: !202)
!1019 = !DILocalVariable(name: "result", scope: !1009, file: !2, line: 1134, type: !407)
!1020 = !DILocalVariable(name: "prefer_cdnskey", scope: !1009, file: !2, line: 1135, type: !226)
!1021 = !DILocalVariable(name: "nsupdate", scope: !1009, file: !2, line: 1136, type: !226)
!1022 = !DILocalVariable(name: "ttl", scope: !1009, file: !2, line: 1137, type: !361)
!1023 = !DILocalVariable(name: "ch", scope: !1009, file: !2, line: 1138, type: !161)
!1024 = !DILocalVariable(name: "endp", scope: !1009, file: !2, line: 1139, type: !143)
!1025 = !DILocalVariable(name: "type", scope: !1026, file: !2, line: 1316, type: !1028)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 1315, column: 48)
!1027 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1315, column: 6)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 256, elements: !245)
!1029 = !DILocation(line: 1130, column: 10, scope: !1009)
!1030 = !DILocation(line: 1130, column: 22, scope: !1009)
!1031 = !DILocation(line: 1131, column: 2, scope: !1009)
!1032 = !DILocation(line: 1131, column: 14, scope: !1009)
!1033 = !DILocation(line: 1132, column: 2, scope: !1009)
!1034 = !DILocation(line: 1132, column: 14, scope: !1009)
!1035 = !DILocation(line: 1133, column: 2, scope: !1009)
!1036 = !DILocation(line: 1133, column: 14, scope: !1009)
!1037 = !DILocation(line: 1134, column: 2, scope: !1009)
!1038 = !DILocation(line: 1134, column: 15, scope: !1009)
!1039 = !DILocation(line: 1135, column: 2, scope: !1009)
!1040 = !DILocation(line: 1135, column: 7, scope: !1009)
!1041 = !DILocation(line: 1136, column: 2, scope: !1009)
!1042 = !DILocation(line: 1136, column: 7, scope: !1009)
!1043 = !DILocation(line: 1137, column: 2, scope: !1009)
!1044 = !DILocation(line: 1137, column: 11, scope: !1009)
!1045 = !DILocation(line: 1138, column: 2, scope: !1009)
!1046 = !DILocation(line: 1138, column: 6, scope: !1009)
!1047 = !DILocation(line: 1139, column: 2, scope: !1009)
!1048 = !DILocation(line: 1139, column: 8, scope: !1009)
!1049 = !DILocation(line: 1141, column: 11, scope: !1009)
!1050 = !DILocation(line: 1141, column: 9, scope: !1009)
!1051 = !DILocation(line: 1142, column: 6, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1142, column: 6)
!1053 = !DILocation(line: 1142, column: 13, scope: !1052)
!1054 = !DILocation(line: 1142, column: 6, scope: !1009)
!1055 = !DILocation(line: 1143, column: 3, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 1142, column: 31)
!1057 = !DILocation(line: 1149, column: 2, scope: !1009)
!1058 = !DILocation(line: 1151, column: 27, scope: !1009)
!1059 = !DILocation(line: 1154, column: 2, scope: !1009)
!1060 = !DILocation(line: 1154, column: 37, scope: !1009)
!1061 = !DILocation(line: 1154, column: 43, scope: !1009)
!1062 = !DILocation(line: 1154, column: 15, scope: !1009)
!1063 = !DILocation(line: 1154, column: 13, scope: !1009)
!1064 = !DILocation(line: 1154, column: 59, scope: !1009)
!1065 = !DILocation(line: 1155, column: 11, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1154, column: 66)
!1067 = !DILocation(line: 1155, column: 3, scope: !1066)
!1068 = !DILocation(line: 1157, column: 14, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1066, file: !2, line: 1155, column: 15)
!1070 = !DILocation(line: 1157, column: 4, scope: !1069)
!1071 = !DILocation(line: 1158, column: 4, scope: !1069)
!1072 = !DILocation(line: 1160, column: 25, scope: !1069)
!1073 = !DILocation(line: 1160, column: 14, scope: !1069)
!1074 = !DILocation(line: 1160, column: 12, scope: !1069)
!1075 = !DILocation(line: 1161, column: 4, scope: !1069)
!1076 = !DILocation(line: 1163, column: 19, scope: !1069)
!1077 = !DILocation(line: 1164, column: 4, scope: !1069)
!1078 = !DILocation(line: 1166, column: 14, scope: !1069)
!1079 = !DILocation(line: 1166, column: 12, scope: !1069)
!1080 = !DILocation(line: 1167, column: 4, scope: !1069)
!1081 = !DILocation(line: 1169, column: 17, scope: !1069)
!1082 = !DILocation(line: 1169, column: 15, scope: !1069)
!1083 = !DILocation(line: 1170, column: 4, scope: !1069)
!1084 = !DILocation(line: 1176, column: 8, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1069, file: !2, line: 1176, column: 8)
!1086 = !DILocation(line: 1177, column: 8, scope: !1085)
!1087 = !DILocation(line: 1177, column: 13, scope: !1085)
!1088 = !DILocation(line: 1177, column: 35, scope: !1085)
!1089 = !DILocation(line: 1176, column: 33, scope: !1085)
!1090 = !DILocation(line: 1176, column: 8, scope: !1069)
!1091 = !DILocation(line: 1179, column: 26, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1085, file: !2, line: 1178, column: 4)
!1093 = !DILocation(line: 1180, column: 13, scope: !1092)
!1094 = !DILocation(line: 1181, column: 4, scope: !1092)
!1095 = !DILocation(line: 1182, column: 15, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1085, file: !2, line: 1181, column: 11)
!1097 = !DILocation(line: 1182, column: 13, scope: !1096)
!1098 = !DILocation(line: 1184, column: 4, scope: !1069)
!1099 = !DILocation(line: 1186, column: 22, scope: !1069)
!1100 = !DILocation(line: 1188, column: 4, scope: !1069)
!1101 = !DILocation(line: 1190, column: 15, scope: !1069)
!1102 = !DILocation(line: 1190, column: 13, scope: !1069)
!1103 = !DILocation(line: 1191, column: 4, scope: !1069)
!1104 = !DILocation(line: 1193, column: 19, scope: !1069)
!1105 = !DILocation(line: 1193, column: 10, scope: !1069)
!1106 = !DILocation(line: 1193, column: 8, scope: !1069)
!1107 = !DILocation(line: 1194, column: 4, scope: !1069)
!1108 = !DILocation(line: 1196, column: 13, scope: !1069)
!1109 = !DILocation(line: 1197, column: 4, scope: !1069)
!1110 = !DILocation(line: 1200, column: 12, scope: !1069)
!1111 = !DILocation(line: 1200, column: 4, scope: !1069)
!1112 = !DILocation(line: 1203, column: 22, scope: !1069)
!1113 = !DILocation(line: 1203, column: 14, scope: !1069)
!1114 = !DILocation(line: 1203, column: 12, scope: !1069)
!1115 = !DILocation(line: 1204, column: 9, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1069, file: !2, line: 1204, column: 8)
!1117 = !DILocation(line: 1204, column: 8, scope: !1116)
!1118 = !DILocation(line: 1204, column: 14, scope: !1116)
!1119 = !DILocation(line: 1204, column: 8, scope: !1069)
!1120 = !DILocation(line: 1205, column: 5, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1116, file: !2, line: 1204, column: 23)
!1122 = !DILocation(line: 1207, column: 4, scope: !1069)
!1123 = !DILocation(line: 1209, column: 4, scope: !1069)
!1124 = distinct !{!1124, !1059, !1125, !1126}
!1125 = !DILocation(line: 1212, column: 2, scope: !1009)
!1126 = !{!"llvm.loop.mustprogress"}
!1127 = !DILocation(line: 1213, column: 10, scope: !1009)
!1128 = !DILocation(line: 1213, column: 7, scope: !1009)
!1129 = !DILocation(line: 1214, column: 10, scope: !1009)
!1130 = !DILocation(line: 1214, column: 7, scope: !1009)
!1131 = !DILocation(line: 1216, column: 6, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1216, column: 6)
!1133 = !DILocation(line: 1216, column: 11, scope: !1132)
!1134 = !DILocation(line: 1216, column: 6, scope: !1009)
!1135 = !DILocation(line: 1217, column: 3, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !2, line: 1216, column: 17)
!1137 = !DILocation(line: 1219, column: 11, scope: !1009)
!1138 = !DILocation(line: 1219, column: 2, scope: !1009)
!1139 = !DILocation(line: 1224, column: 6, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1224, column: 6)
!1141 = !DILocation(line: 1224, column: 15, scope: !1140)
!1142 = !DILocation(line: 1224, column: 6, scope: !1009)
!1143 = !DILocation(line: 1225, column: 12, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1140, file: !2, line: 1224, column: 21)
!1145 = !DILocation(line: 1226, column: 2, scope: !1144)
!1146 = !DILocation(line: 1228, column: 16, scope: !1009)
!1147 = !DILocation(line: 1228, column: 2, scope: !1009)
!1148 = !DILocation(line: 1230, column: 24, scope: !1009)
!1149 = !DILocation(line: 1230, column: 11, scope: !1009)
!1150 = !DILocation(line: 1230, column: 9, scope: !1009)
!1151 = !DILocation(line: 1231, column: 6, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1231, column: 6)
!1153 = !DILocation(line: 1231, column: 13, scope: !1152)
!1154 = !DILocation(line: 1231, column: 6, scope: !1009)
!1155 = !DILocation(line: 1233, column: 27, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1152, file: !2, line: 1231, column: 31)
!1157 = !DILocation(line: 1233, column: 9, scope: !1156)
!1158 = !DILocation(line: 1232, column: 3, scope: !1156)
!1159 = !DILocation(line: 1236, column: 6, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1236, column: 6)
!1161 = !DILocation(line: 1236, column: 14, scope: !1160)
!1162 = !DILocation(line: 1236, column: 6, scope: !1009)
!1163 = !DILocation(line: 1237, column: 3, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1160, file: !2, line: 1236, column: 23)
!1165 = !DILocation(line: 1239, column: 18, scope: !1009)
!1166 = !DILocation(line: 1239, column: 2, scope: !1009)
!1167 = !DILocation(line: 1244, column: 6, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1244, column: 6)
!1169 = !DILocation(line: 1244, column: 10, scope: !1168)
!1170 = !DILocation(line: 1244, column: 6, scope: !1009)
!1171 = !DILocation(line: 1245, column: 20, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !2, line: 1244, column: 16)
!1173 = !DILocation(line: 1245, column: 7, scope: !1172)
!1174 = !DILocation(line: 1246, column: 2, scope: !1172)
!1175 = !DILocation(line: 1248, column: 6, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1248, column: 6)
!1177 = !DILocation(line: 1248, column: 17, scope: !1176)
!1178 = !DILocation(line: 1248, column: 6, scope: !1009)
!1179 = !DILocation(line: 1249, column: 3, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1176, file: !2, line: 1248, column: 26)
!1181 = !DILocation(line: 1252, column: 18, scope: !1009)
!1182 = !DILocation(line: 1252, column: 2, scope: !1009)
!1183 = !DILocation(line: 1258, column: 7, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1258, column: 6)
!1185 = !DILocation(line: 1258, column: 46, scope: !1184)
!1186 = !DILocation(line: 1259, column: 7, scope: !1184)
!1187 = !DILocation(line: 1258, column: 6, scope: !1009)
!1188 = !DILocation(line: 1261, column: 54, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1184, file: !2, line: 1260, column: 2)
!1190 = !DILocation(line: 1261, column: 3, scope: !1189)
!1191 = !DILocation(line: 1264, column: 6, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 1264, column: 6)
!1193 = !DILocation(line: 1264, column: 46, scope: !1192)
!1194 = !DILocation(line: 1265, column: 7, scope: !1192)
!1195 = !DILocation(line: 1264, column: 6, scope: !1009)
!1196 = !DILocation(line: 1267, column: 49, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 1266, column: 2)
!1198 = !DILocation(line: 1267, column: 3, scope: !1197)
!1199 = !DILocation(line: 1269, column: 6, scope: !1200)
