; ModuleID = 'samples/894.bc'
source_filename = "src/FreeType/ftenc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._FontEnc = type { ptr, ptr, i32, i32, ptr, ptr, i32, i32 }
%struct._FontMap = type { i32, i32, i32, ptr, ptr, ptr, ptr, ptr }
%struct._FTMapping = type { i32, ptr, i32, ptr }
%struct.TT_OS2_ = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, [10 x i8], i64, i64, i64, i64, [4 x i8], i16, i16, i16, i16, i16, i16, i16, i16, i64, i64, i16, i16, i16, i16, i16, i16, i16 }
%struct.FT_FaceRec_ = type { i64, i64, i64, i64, i64, ptr, ptr, i32, ptr, i32, ptr, %struct.FT_Generic_, %struct.FT_BBox_, i16, i16, i16, i16, i16, i16, i16, i16, ptr, ptr, ptr, ptr, ptr, ptr, %struct.FT_ListRec_, %struct.FT_Generic_, ptr, ptr }
%struct.FT_BBox_ = type { i64, i64, i64, i64 }
%struct.FT_ListRec_ = type { ptr, ptr }
%struct.FT_Generic_ = type { ptr, ptr }
%struct.FT_CharMapRec_ = type { ptr, i32, i16, i16 }

@.str = private unnamed_addr constant [10 x i8] c"iso8859-1\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [6 x i8] c"%s-%s\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [7 x i8] c"%s %s\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [11 x i8] c"iso10646-1\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [17 x i8] c"microsoft-symbol\00", align 1, !dbg !22

!49 = !DIEnumerator(name: "FT_ENCODING_WANSUNG", value: 2002873971)
!50 = !DIEnumerator(name: "FT_ENCODING_JOHAB", value: 1785686113)
!51 = !DIEnumerator(name: "FT_ENCODING_GB2312", value: 1734484000)
!52 = !DIEnumerator(name: "FT_ENCODING_MS_SJIS", value: 1936353651)
!53 = !DIEnumerator(name: "FT_ENCODING_MS_GB2312", value: 1734484000)
!54 = !DIEnumerator(name: "FT_ENCODING_MS_BIG5", value: 1651074869)
!55 = !DIEnumerator(name: "FT_ENCODING_MS_WANSUNG", value: 2002873971)
!56 = !DIEnumerator(name: "FT_ENCODING_MS_JOHAB", value: 1785686113)
!57 = !DIEnumerator(name: "FT_ENCODING_ADOBE_STANDARD", value: 1094995778)
!58 = !DIEnumerator(name: "FT_ENCODING_ADOBE_EXPERT", value: 1094992453)
!59 = !DIEnumerator(name: "FT_ENCODING_ADOBE_CUSTOM", value: 1094992451)
!60 = !DIEnumerator(name: "FT_ENCODING_ADOBE_LATIN_1", value: 1818326065)
!61 = !DIEnumerator(name: "FT_ENCODING_OLD_LATIN_2", value: 1818326066)
!62 = !DIEnumerator(name: "FT_ENCODING_APPLE_ROMAN", value: 1634889070)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Glyph_Format_", file: !64, line: 745, baseType: !41, size: 32, elements: !65)
!64 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/freetype-2.11.1-xvbwukrut2ugtlgn3w5o4kj7nubpabwg/include/freetype2/freetype/ftimage.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "cab593a63b806d3836ad07da681d8347")
!65 = !{!66, !67, !68, !69, !70}
!66 = !DIEnumerator(name: "FT_GLYPH_FORMAT_NONE", value: 0)
!67 = !DIEnumerator(name: "FT_GLYPH_FORMAT_COMPOSITE", value: 1668246896)
!68 = !DIEnumerator(name: "FT_GLYPH_FORMAT_BITMAP", value: 1651078259)
!69 = !DIEnumerator(name: "FT_GLYPH_FORMAT_OUTLINE", value: 1869968492)
!70 = !DIEnumerator(name: "FT_GLYPH_FORMAT_PLOTTER", value: 1886154612)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Sfnt_Tag_", file: !72, line: 620, baseType: !41, size: 32, elements: !73)
!72 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/freetype-2.11.1-xvbwukrut2ugtlgn3w5o4kj7nubpabwg/include/freetype2/freetype/tttables.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "a4c1ffb337087b2a0a273a41fad02e37")
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81}
!74 = !DIEnumerator(name: "FT_SFNT_HEAD", value: 0)
!75 = !DIEnumerator(name: "FT_SFNT_MAXP", value: 1)
!76 = !DIEnumerator(name: "FT_SFNT_OS2", value: 2)
!77 = !DIEnumerator(name: "FT_SFNT_HHEA", value: 3)
!78 = !DIEnumerator(name: "FT_SFNT_VHEA", value: 4)
!79 = !DIEnumerator(name: "FT_SFNT_POST", value: 5)
!80 = !DIEnumerator(name: "FT_SFNT_PCLT", value: 6)
!81 = !DIEnumerator(name: "FT_SFNT_MAX", value: 7)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !{!0, !7, !12, !17, !22, !27, !32}
!85 = !{i32 7, !"Dwarf Version", i32 5}
!86 = !{i32 2, !"Debug Info Version", i32 3}
!87 = !{i32 1, !"wchar_size", i32 4}
!88 = !{i32 8, !"PIC Level", i32 2}
!89 = !{i32 7, !"uwtable", i32 2}
!90 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!91 = distinct !DISubprogram(name: "FTPickMapping", scope: !2, file: !2, line: 64, type: !92, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !37, retainedNodes: !384)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !95, !94, !95, !96, !344}
!94 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Face", file: !40, line: 512, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_FaceRec_", file: !40, line: 1063, size: 1984, elements: !99)
!99 = !{!100, !104, !105, !106, !107, !108, !111, !112, !114, !127, !128, !141, !151, !159, !160, !161, !162, !163, !164, !165, !166, !167, !246, !269, !270, !274, !296, !325, !338, !339, !340}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "num_faces", scope: !98, file: !40, line: 1065, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Long", file: !102, line: 242, baseType: !103)
!102 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/freetype-2.11.1-xvbwukrut2ugtlgn3w5o4kj7nubpabwg/include/freetype2/freetype/fttypes.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "42a7b2840fe5cdec3124d3bf9a9cd98d")
!103 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "face_index", scope: !98, file: !40, line: 1066, baseType: !101, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "face_flags", scope: !98, file: !40, line: 1068, baseType: !101, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "style_flags", scope: !98, file: !40, line: 1069, baseType: !101, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "num_glyphs", scope: !98, file: !40, line: 1071, baseType: !101, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "family_name", scope: !98, file: !40, line: 1073, baseType: !109, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_String", file: !102, line: 187, baseType: !4)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "style_name", scope: !98, file: !40, line: 1074, baseType: !109, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "num_fixed_sizes", scope: !98, file: !40, line: 1076, baseType: !113, size: 32, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Int", file: !102, line: 220, baseType: !94)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "available_sizes", scope: !98, file: !40, line: 1077, baseType: !115, size: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Bitmap_Size", file: !40, line: 394, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Bitmap_Size_", file: !40, line: 384, size: 256, elements: !118)
!118 = !{!119, !122, !123, !125, !126}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !117, file: !40, line: 386, baseType: !120, size: 16)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Short", file: !102, line: 198, baseType: !121)
!121 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !117, file: !40, line: 387, baseType: !120, size: 16, offset: 16)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !117, file: !40, line: 389, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Pos", file: !64, line: 52, baseType: !103)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "x_ppem", scope: !117, file: !40, line: 391, baseType: !124, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "y_ppem", scope: !117, file: !40, line: 392, baseType: !124, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "num_charmaps", scope: !98, file: !40, line: 1079, baseType: !113, size: 32, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "charmaps", scope: !98, file: !40, line: 1080, baseType: !129, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_CharMap", file: !40, line: 595, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_CharMapRec_", file: !40, line: 852, size: 128, elements: !133)
!133 = !{!134, !135, !137, !140}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !132, file: !40, line: 854, baseType: !96, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !132, file: !40, line: 855, baseType: !136, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Encoding", file: !40, line: 805, baseType: !39)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "platform_id", scope: !132, file: !40, line: 856, baseType: !138, size: 16, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_UShort", file: !102, line: 209, baseType: !139)
!139 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_id", scope: !132, file: !40, line: 857, baseType: !138, size: 16, offset: 112)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !98, file: !40, line: 1082, baseType: !142, size: 128, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Generic", file: !102, line: 472, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Generic_", file: !102, line: 467, size: 128, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !143, file: !102, line: 469, baseType: !83, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "finalizer", scope: !143, file: !102, line: 470, baseType: !147, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Generic_Finalizer", file: !102, line: 435, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !83}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !98, file: !40, line: 1087, baseType: !152, size: 256, offset: 832)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_BBox", file: !64, line: 118, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_BBox_", file: !64, line: 113, size: 256, elements: !154)
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "xMin", scope: !153, file: !64, line: 115, baseType: !124, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "yMin", scope: !153, file: !64, line: 115, baseType: !124, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "xMax", scope: !153, file: !64, line: 116, baseType: !124, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "yMax", scope: !153, file: !64, line: 116, baseType: !124, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "units_per_EM", scope: !98, file: !40, line: 1089, baseType: !138, size: 16, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !98, file: !40, line: 1090, baseType: !120, size: 16, offset: 1104)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !98, file: !40, line: 1091, baseType: !120, size: 16, offset: 1120)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !98, file: !40, line: 1092, baseType: !120, size: 16, offset: 1136)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance_width", scope: !98, file: !40, line: 1094, baseType: !120, size: 16, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance_height", scope: !98, file: !40, line: 1095, baseType: !120, size: 16, offset: 1168)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "underline_position", scope: !98, file: !40, line: 1097, baseType: !120, size: 16, offset: 1184)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "underline_thickness", scope: !98, file: !40, line: 1098, baseType: !120, size: 16, offset: 1200)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "glyph", scope: !98, file: !40, line: 1100, baseType: !168, size: 64, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_GlyphSlot", file: !40, line: 561, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_GlyphSlotRec_", file: !40, line: 1906, size: 2432, elements: !171)
!171 = !{!172, !176, !177, !178, !180, !181, !193, !195, !196, !202, !204, !218, !219, !220, !232, !233, !237, !238, !239, !240, !241, !242}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !170, file: !40, line: 1908, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Library", file: !40, line: 428, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_LibraryRec_", file: !40, line: 428, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !170, file: !40, line: 1909, baseType: !96, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !40, line: 1910, baseType: !168, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "glyph_index", scope: !170, file: !40, line: 1911, baseType: !179, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_UInt", file: !102, line: 231, baseType: !41)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !170, file: !40, line: 1912, baseType: !142, size: 128, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !170, file: !40, line: 1914, baseType: !182, size: 512, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Glyph_Metrics", file: !40, line: 342, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Glyph_Metrics_", file: !40, line: 329, size: 512, elements: !184)
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !183, file: !40, line: 331, baseType: !124, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !183, file: !40, line: 332, baseType: !124, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "horiBearingX", scope: !183, file: !40, line: 334, baseType: !124, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "horiBearingY", scope: !183, file: !40, line: 335, baseType: !124, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "horiAdvance", scope: !183, file: !40, line: 336, baseType: !124, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "vertBearingX", scope: !183, file: !40, line: 338, baseType: !124, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vertBearingY", scope: !183, file: !40, line: 339, baseType: !124, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "vertAdvance", scope: !183, file: !40, line: 340, baseType: !124, size: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "linearHoriAdvance", scope: !170, file: !40, line: 1915, baseType: !194, size: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Fixed", file: !102, line: 287, baseType: !103)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "linearVertAdvance", scope: !170, file: !40, line: 1916, baseType: !194, size: 64, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "advance", scope: !170, file: !40, line: 1917, baseType: !197, size: 128, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Vector", file: !64, line: 75, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Vector_", file: !64, line: 70, size: 128, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !198, file: !64, line: 72, baseType: !124, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !198, file: !64, line: 73, baseType: !124, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !40, line: 1919, baseType: !203, size: 32, offset: 1152)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Glyph_Format", file: !64, line: 754, baseType: !63)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !170, file: !40, line: 1921, baseType: !205, size: 320, offset: 1216)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Bitmap", file: !64, line: 271, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Bitmap_", file: !64, line: 260, size: 320, elements: !207)
!207 = !{!208, !209, !210, !211, !214, !215, !216, !217}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !206, file: !64, line: 262, baseType: !41, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !206, file: !64, line: 263, baseType: !41, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !206, file: !64, line: 264, baseType: !94, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !206, file: !64, line: 265, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "num_grays", scope: !206, file: !64, line: 266, baseType: !139, size: 16, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_mode", scope: !206, file: !64, line: 267, baseType: !213, size: 8, offset: 208)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "palette_mode", scope: !206, file: !64, line: 268, baseType: !213, size: 8, offset: 216)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !206, file: !64, line: 269, baseType: !83, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_left", scope: !170, file: !40, line: 1922, baseType: !113, size: 32, offset: 1536)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_top", scope: !170, file: !40, line: 1923, baseType: !113, size: 32, offset: 1568)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "outline", scope: !170, file: !40, line: 1925, baseType: !221, size: 320, offset: 1600)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Outline", file: !64, line: 347, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Outline_", file: !64, line: 336, size: 320, elements: !223)
!223 = !{!224, !225, !226, !228, !229, !231}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "n_contours", scope: !222, file: !64, line: 338, baseType: !121, size: 16)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "n_points", scope: !222, file: !64, line: 339, baseType: !121, size: 16, offset: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !222, file: !64, line: 341, baseType: !227, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tags", scope: !222, file: !64, line: 342, baseType: !95, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "contours", scope: !222, file: !64, line: 343, baseType: !230, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !222, file: !64, line: 345, baseType: !94, size: 32, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "num_subglyphs", scope: !170, file: !40, line: 1927, baseType: !179, size: 32, offset: 1920)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "subglyphs", scope: !170, file: !40, line: 1928, baseType: !234, size: 64, offset: 1984)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_SubGlyph", file: !40, line: 1693, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_SubGlyphRec_", file: !40, line: 1693, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "control_data", scope: !170, file: !40, line: 1930, baseType: !83, size: 64, offset: 2048)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "control_len", scope: !170, file: !40, line: 1931, baseType: !103, size: 64, offset: 2112)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "lsb_delta", scope: !170, file: !40, line: 1933, baseType: !124, size: 64, offset: 2176)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "rsb_delta", scope: !170, file: !40, line: 1934, baseType: !124, size: 64, offset: 2240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !170, file: !40, line: 1936, baseType: !83, size: 64, offset: 2304)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !170, file: !40, line: 1938, baseType: !243, size: 64, offset: 2368)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Slot_Internal", file: !40, line: 1705, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Slot_InternalRec_", file: !40, line: 1705, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !98, file: !40, line: 1101, baseType: !247, size: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size", file: !40, line: 542, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_SizeRec_", file: !40, line: 1667, size: 704, elements: !250)
!250 = !{!251, !252, !253, !265}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !249, file: !40, line: 1669, baseType: !96, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !249, file: !40, line: 1670, baseType: !142, size: 128, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !249, file: !40, line: 1671, baseType: !254, size: 448, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size_Metrics", file: !40, line: 1643, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Size_Metrics_", file: !40, line: 1630, size: 448, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "x_ppem", scope: !255, file: !40, line: 1632, baseType: !138, size: 16)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "y_ppem", scope: !255, file: !40, line: 1633, baseType: !138, size: 16, offset: 16)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "x_scale", scope: !255, file: !40, line: 1635, baseType: !194, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "y_scale", scope: !255, file: !40, line: 1636, baseType: !194, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !255, file: !40, line: 1638, baseType: !124, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !255, file: !40, line: 1639, baseType: !124, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !255, file: !40, line: 1640, baseType: !124, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance", scope: !255, file: !40, line: 1641, baseType: !124, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !249, file: !40, line: 1672, baseType: !266, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size_Internal", file: !40, line: 1523, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Size_InternalRec_", file: !40, line: 1523, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "charmap", scope: !98, file: !40, line: 1102, baseType: !130, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !98, file: !40, line: 1106, baseType: !271, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Driver", file: !40, line: 460, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_DriverRec_", file: !40, line: 460, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !98, file: !40, line: 1107, baseType: !275, size: 64, offset: 1472)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Memory", file: !276, line: 64, baseType: !277)
!276 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/freetype-2.11.1-xvbwukrut2ugtlgn3w5o4kj7nubpabwg/include/freetype2/freetype/ftsystem.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "a38cdab0dfaf29637f5eb31802b29298")
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_MemoryRec_", file: !276, line: 169, size: 256, elements: !279)
!279 = !{!280, !281, !286, !291}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !278, file: !276, line: 171, baseType: !83, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !278, file: !276, line: 172, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Alloc_Func", file: !276, line: 87, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!83, !275, !103}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !278, file: !276, line: 173, baseType: !287, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Free_Func", file: !276, line: 108, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !275, !83}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !278, file: !276, line: 174, baseType: !292, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Realloc_Func", file: !276, line: 141, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!83, !275, !103, !103, !83}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !98, file: !40, line: 1108, baseType: !297, size: 64, offset: 1536)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream", file: !276, line: 198, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_StreamRec_", file: !276, line: 327, size: 640, elements: !300)
!300 = !{!301, !302, !304, !305, !311, !312, !317, !322, !323, !324}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !299, file: !276, line: 329, baseType: !212, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !276, line: 330, baseType: !303, size: 64, offset: 64)
!303 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !299, file: !276, line: 331, baseType: !303, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !299, file: !276, line: 333, baseType: !306, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_StreamDesc", file: !276, line: 216, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "FT_StreamDesc_", file: !276, line: 211, size: 64, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !307, file: !276, line: 213, baseType: !103, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !307, file: !276, line: 214, baseType: !83, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !299, file: !276, line: 334, baseType: !306, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !299, file: !276, line: 335, baseType: !313, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream_IoFunc", file: !276, line: 249, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!303, !297, !303, !212, !303}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !299, file: !276, line: 336, baseType: !318, size: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream_CloseFunc", file: !276, line: 269, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !297}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !299, file: !276, line: 338, baseType: !275, size: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !299, file: !276, line: 339, baseType: !212, size: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !299, file: !276, line: 340, baseType: !212, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sizes_list", scope: !98, file: !40, line: 1110, baseType: !326, size: 128, offset: 1600)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ListRec", file: !102, line: 584, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ListRec_", file: !102, line: 579, size: 128, elements: !328)
!328 = !{!329, !337}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !327, file: !102, line: 581, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ListNode", file: !102, line: 522, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ListNodeRec_", file: !102, line: 554, size: 192, elements: !333)
!333 = !{!334, !335, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !332, file: !102, line: 556, baseType: !330, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !102, line: 557, baseType: !330, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !332, file: !102, line: 558, baseType: !83, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !327, file: !102, line: 582, baseType: !330, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "autohint", scope: !98, file: !40, line: 1112, baseType: !142, size: 128, offset: 1728)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !98, file: !40, line: 1113, baseType: !83, size: 64, offset: 1856)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !98, file: !40, line: 1115, baseType: !341, size: 64, offset: 1920)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Face_Internal", file: !40, line: 883, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Face_InternalRec_", file: !40, line: 883, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTMappingPtr", file: !345, line: 69, baseType: !346)
!345 = !DIFile(filename: "src/FreeType/ft.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build/aidengro/spack-stage-libxfont2-2.0.6-hvuqeosdye26hqi7nikcloa25oti4t3f/spack-src", checksumkind: CSK_MD5, checksum: "87ea5d07799bc4e1f86f196da8a8da24")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FTMapping", file: !345, line: 63, size: 256, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !347, file: !345, line: 65, baseType: !94, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !347, file: !345, line: 66, baseType: !130, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !347, file: !345, line: 67, baseType: !94, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !347, file: !345, line: 68, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FontMap", file: !355, line: 49, size: 448, elements: !356)
!355 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/libfontenc-1.1.7-duv2prnznvlcph6i77gcmwftruwmtha6/include/X11/fonts/fontenc.h", directory: "/local-ssd/libxfont2-hvuqeosdye26hqi7nikcloa25oti4t3f-build", checksumkind: CSK_MD5, checksum: "7ca3884dc79402e972917e6d23340e85")
!356 = !{!357, !358, !359, !360, !364, !368, !369, !370}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !355, line: 50, baseType: !94, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !354, file: !355, line: 51, baseType: !94, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "eid", scope: !354, file: !355, line: 51, baseType: !94, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "recode", scope: !354, file: !355, line: 52, baseType: !361, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!41, !41, !83}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !354, file: !355, line: 53, baseType: !365, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!95, !41, !83}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !354, file: !355, line: 54, baseType: !83, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !355, line: 55, baseType: !353, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !354, file: !355, line: 58, baseType: !371, size: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FontEnc", file: !355, line: 65, size: 384, elements: !373)
!373 = !{!374, !375, !377, !378, !379, !381, !382, !383}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !355, line: 66, baseType: !95, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !372, file: !355, line: 67, baseType: !376, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !372, file: !355, line: 68, baseType: !94, size: 32, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "row_size", scope: !372, file: !355, line: 69, baseType: !94, size: 32, offset: 160)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !372, file: !355, line: 70, baseType: !380, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontMapPtr", file: !355, line: 59, baseType: !353)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !355, line: 71, baseType: !371, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !372, file: !355, line: 74, baseType: !94, size: 32, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "first_col", scope: !372, file: !355, line: 75, baseType: !94, size: 32, offset: 352)
!384 = !{!385, !386, !387, !388, !389, !390, !392, !393, !394, !395, !396, !399, !400, !401, !405, !464}
!385 = !DILocalVariable(name: "xlfd", arg: 1, scope: !91, file: !2, line: 64, type: !95)
!386 = !DILocalVariable(name: "length", arg: 2, scope: !91, file: !2, line: 64, type: !94)
!387 = !DILocalVariable(name: "filename", arg: 3, scope: !91, file: !2, line: 64, type: !95)
!388 = !DILocalVariable(name: "face", arg: 4, scope: !91, file: !2, line: 64, type: !96)
!389 = !DILocalVariable(name: "tm", arg: 5, scope: !91, file: !2, line: 65, type: !344)
!390 = !DILocalVariable(name: "encoding", scope: !91, file: !2, line: 67, type: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontEncPtr", file: !355, line: 76, baseType: !371)
!392 = !DILocalVariable(name: "mapping", scope: !91, file: !2, line: 68, type: !380)
!393 = !DILocalVariable(name: "cmap", scope: !91, file: !2, line: 69, type: !130)
!394 = !DILocalVariable(name: "ftrc", scope: !91, file: !2, line: 70, type: !94)
!395 = !DILocalVariable(name: "symbol", scope: !91, file: !2, line: 71, type: !94)
!396 = !DILocalVariable(name: "enc", scope: !91, file: !2, line: 72, type: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!399 = !DILocalVariable(name: "reg", scope: !91, file: !2, line: 72, type: !397)
!400 = !DILocalVariable(name: "encoding_name", scope: !91, file: !2, line: 73, type: !397)
!401 = !DILocalVariable(name: "buf", scope: !91, file: !2, line: 74, type: !402)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 20)
!405 = !DILocalVariable(name: "os2", scope: !406, file: !2, line: 134, type: !413)
!406 = distinct !DILexicalBlock(scope: !407, file: !2, line: 131, column: 24)
!407 = distinct !DILexicalBlock(scope: !408, file: !2, line: 131, column: 16)
!408 = distinct !DILexicalBlock(scope: !409, file: !2, line: 128, column: 30)
!409 = distinct !DILexicalBlock(scope: !410, file: !2, line: 127, column: 12)
!410 = distinct !DILexicalBlock(scope: !411, file: !2, line: 126, column: 73)
!411 = distinct !DILexicalBlock(scope: !412, file: !2, line: 126, column: 5)
!412 = distinct !DILexicalBlock(scope: !91, file: !2, line: 126, column: 5)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "TT_OS2", file: !72, line: 430, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TT_OS2_", file: !72, line: 375, size: 1088, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !436, !438, !439, !440, !441, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !415, file: !72, line: 377, baseType: !138, size: 16)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "xAvgCharWidth", scope: !415, file: !72, line: 378, baseType: !120, size: 16, offset: 16)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "usWeightClass", scope: !415, file: !72, line: 379, baseType: !138, size: 16, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "usWidthClass", scope: !415, file: !72, line: 380, baseType: !138, size: 16, offset: 48)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fsType", scope: !415, file: !72, line: 381, baseType: !138, size: 16, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ySubscriptXSize", scope: !415, file: !72, line: 382, baseType: !120, size: 16, offset: 80)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ySubscriptYSize", scope: !415, file: !72, line: 383, baseType: !120, size: 16, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ySubscriptXOffset", scope: !415, file: !72, line: 384, baseType: !120, size: 16, offset: 112)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ySubscriptYOffset", scope: !415, file: !72, line: 385, baseType: !120, size: 16, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ySuperscriptXSize", scope: !415, file: !72, line: 386, baseType: !120, size: 16, offset: 144)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ySuperscriptYSize", scope: !415, file: !72, line: 387, baseType: !120, size: 16, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ySuperscriptXOffset", scope: !415, file: !72, line: 388, baseType: !120, size: 16, offset: 176)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ySuperscriptYOffset", scope: !415, file: !72, line: 389, baseType: !120, size: 16, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "yStrikeoutSize", scope: !415, file: !72, line: 390, baseType: !120, size: 16, offset: 208)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "yStrikeoutPosition", scope: !415, file: !72, line: 391, baseType: !120, size: 16, offset: 224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sFamilyClass", scope: !415, file: !72, line: 392, baseType: !120, size: 16, offset: 240)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "panose", scope: !415, file: !72, line: 394, baseType: !434, size: 80, offset: 256)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 80, elements: !5)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Byte", file: !102, line: 154, baseType: !213)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ulUnicodeRange1", scope: !415, file: !72, line: 396, baseType: !437, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ULong", file: !102, line: 253, baseType: !303)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ulUnicodeRange2", scope: !415, file: !72, line: 397, baseType: !437, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ulUnicodeRange3", scope: !415, file: !72, line: 398, baseType: !437, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ulUnicodeRange4", scope: !415, file: !72, line: 399, baseType: !437, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "achVendID", scope: !415, file: !72, line: 401, baseType: !442, size: 32, offset: 640)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 32, elements: !445)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Char", file: !102, line: 143, baseType: !444)
!444 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!445 = !{!446}
!446 = !DISubrange(count: 4)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fsSelection", scope: !415, file: !72, line: 403, baseType: !138, size: 16, offset: 672)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "usFirstCharIndex", scope: !415, file: !72, line: 404, baseType: !138, size: 16, offset: 688)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "usLastCharIndex", scope: !415, file: !72, line: 405, baseType: !138, size: 16, offset: 704)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sTypoAscender", scope: !415, file: !72, line: 406, baseType: !120, size: 16, offset: 720)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sTypoDescender", scope: !415, file: !72, line: 407, baseType: !120, size: 16, offset: 736)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sTypoLineGap", scope: !415, file: !72, line: 408, baseType: !120, size: 16, offset: 752)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "usWinAscent", scope: !415, file: !72, line: 409, baseType: !138, size: 16, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "usWinDescent", scope: !415, file: !72, line: 410, baseType: !138, size: 16, offset: 784)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ulCodePageRange1", scope: !415, file: !72, line: 414, baseType: !437, size: 64, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ulCodePageRange2", scope: !415, file: !72, line: 415, baseType: !437, size: 64, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sxHeight", scope: !415, file: !72, line: 419, baseType: !120, size: 16, offset: 960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sCapHeight", scope: !415, file: !72, line: 420, baseType: !120, size: 16, offset: 976)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "usDefaultChar", scope: !415, file: !72, line: 421, baseType: !138, size: 16, offset: 992)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "usBreakChar", scope: !415, file: !72, line: 422, baseType: !138, size: 16, offset: 1008)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "usMaxContext", scope: !415, file: !72, line: 423, baseType: !138, size: 16, offset: 1024)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "usLowerOpticalPointSize", scope: !415, file: !72, line: 427, baseType: !138, size: 16, offset: 1040)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "usUpperOpticalPointSize", scope: !415, file: !72, line: 428, baseType: !138, size: 16, offset: 1056)
!464 = !DILabel(scope: !91, name: "native", file: !2, line: 149)
!465 = !DILocation(line: 64, column: 21, scope: !91)
!466 = !DILocation(line: 64, column: 31, scope: !91)
!467 = !DILocation(line: 64, column: 45, scope: !91)
!468 = !DILocation(line: 64, column: 63, scope: !91)
!469 = !DILocation(line: 65, column: 28, scope: !91)
!470 = !DILocation(line: 67, column: 5, scope: !91)
!471 = !DILocation(line: 67, column: 16, scope: !91)
!472 = !DILocation(line: 68, column: 5, scope: !91)
!473 = !DILocation(line: 68, column: 16, scope: !91)
!474 = !DILocation(line: 69, column: 5, scope: !91)
!475 = !DILocation(line: 69, column: 16, scope: !91)
!476 = !DILocation(line: 70, column: 5, scope: !91)
!477 = !DILocation(line: 70, column: 9, scope: !91)
!478 = !DILocation(line: 71, column: 5, scope: !91)
!479 = !DILocation(line: 71, column: 9, scope: !91)
!480 = !DILocation(line: 72, column: 5, scope: !91)
!481 = !DILocation(line: 72, column: 17, scope: !91)
!482 = !DILocation(line: 72, column: 23, scope: !91)
!483 = !DILocation(line: 73, column: 5, scope: !91)
!484 = !DILocation(line: 73, column: 17, scope: !91)
!485 = !DILocation(line: 74, column: 5, scope: !91)
!486 = !DILocation(line: 74, column: 10, scope: !91)
!487 = !DILocation(line: 76, column: 8, scope: !488)
!488 = distinct !DILexicalBlock(scope: !91, file: !2, line: 76, column: 8)
!489 = !DILocation(line: 76, column: 8, scope: !91)
!490 = !DILocation(line: 77, column: 39, scope: !488)
!491 = !DILocation(line: 77, column: 45, scope: !488)
!492 = !DILocation(line: 77, column: 23, scope: !488)
!493 = !DILocation(line: 77, column: 21, scope: !488)
!494 = !DILocation(line: 77, column: 7, scope: !488)
!495 = !DILocation(line: 78, column: 9, scope: !496)
!496 = distinct !DILexicalBlock(scope: !91, file: !2, line: 78, column: 8)
!497 = !DILocation(line: 78, column: 8, scope: !91)
!498 = !DILocation(line: 79, column: 23, scope: !496)
!499 = !DILocation(line: 79, column: 9, scope: !496)
!500 = !DILocation(line: 81, column: 32, scope: !91)
!501 = !DILocation(line: 81, column: 14, scope: !91)
!502 = !DILocation(line: 81, column: 12, scope: !91)
!503 = !DILocation(line: 84, column: 34, scope: !91)
!504 = !DILocation(line: 84, column: 12, scope: !91)
!505 = !DILocation(line: 84, column: 10, scope: !91)
!506 = !DILocation(line: 88, column: 8, scope: !507)
!507 = distinct !DILexicalBlock(scope: !91, file: !2, line: 88, column: 8)
!508 = !DILocation(line: 88, column: 13, scope: !507)
!509 = !DILocation(line: 88, column: 8, scope: !91)
!510 = !DILocation(line: 91, column: 19, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !2, line: 91, column: 12)
!512 = distinct !DILexicalBlock(scope: !507, file: !2, line: 88, column: 19)
!513 = !DILocation(line: 91, column: 12, scope: !511)
!514 = !DILocation(line: 91, column: 33, scope: !511)
!515 = !DILocation(line: 91, column: 26, scope: !511)
!516 = !DILocation(line: 91, column: 24, scope: !511)
!517 = !DILocation(line: 91, column: 38, scope: !511)
!518 = !DILocation(line: 91, column: 12, scope: !512)
!519 = !DILocation(line: 92, column: 13, scope: !511)
!520 = !DILocation(line: 93, column: 18, scope: !512)
!521 = !DILocation(line: 93, column: 45, scope: !512)
!522 = !DILocation(line: 93, column: 50, scope: !512)
!523 = !DILocation(line: 93, column: 9, scope: !512)
!524 = !DILocation(line: 94, column: 27, scope: !512)
!525 = !DILocation(line: 94, column: 32, scope: !512)
!526 = !DILocation(line: 94, column: 9, scope: !512)
!527 = !DILocation(line: 95, column: 23, scope: !528)
!528 = distinct !DILexicalBlock(scope: !512, file: !2, line: 95, column: 12)
!529 = !DILocation(line: 95, column: 12, scope: !528)
!530 = !DILocation(line: 95, column: 42, scope: !528)
!531 = !DILocation(line: 95, column: 12, scope: !512)
!532 = !DILocation(line: 96, column: 27, scope: !533)
