; ModuleID = 'samples/900.bc'
source_filename = "../ngx_stream_lua-0.0.7/src/ngx_stream_lua_directive.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_stream_lua_main_conf_s = type { ptr, ptr, %struct.ngx_str_t, %struct.ngx_str_t, ptr, ptr, i64, i64, i64, i64, i64, ptr, ptr, ptr, ptr, i64, ptr, %struct.ngx_str_t, ptr, %struct.ngx_str_t, ptr, i64, ptr, i64, i64, i64, i8 }
%struct.ngx_conf_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }
%struct.ngx_stream_lua_shdict_ctx_t = type { ptr, ptr, %struct.ngx_str_t, ptr, ptr }
%struct.ngx_cycle_s = type { ptr, ptr, ptr, %struct.ngx_log_s, i64, ptr, ptr, i64, ptr, i64, i64, %struct.ngx_queue_s, i64, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i64, i64, ptr, ptr, ptr, ptr, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, ptr, ptr, i32 }
%struct.ngx_log_s = type { i64, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_queue_s = type { ptr, ptr }

!45 = !DISubrange(count: 46)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !31, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(scope: null, file: !2, line: 524, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 11)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(scope: null, file: !2, line: 818, type: !11, isLocal: true, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(scope: null, file: !2, line: 834, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 47)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(scope: null, file: !2, line: 903, type: !62, isLocal: true, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 40)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1200, type: !67, isLocal: true, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 36)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1209, type: !72, isLocal: true, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 56)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1216, type: !77, isLocal: true, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 42)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1298, type: !82, isLocal: true, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 27)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(scope: null, file: !2, line: 751, type: !31, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(scope: null, file: !2, line: 966, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 76)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(scope: null, file: !2, line: 979, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 65)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1004, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 45)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1128, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 54)
!107 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !108, retainedTypes: !738, globals: !1179, splitDebugInlining: false, nameTableKind: None)
!108 = !{!109, !726}
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !110, file: !2, line: 775, baseType: !213, size: 32, elements: !723)
!110 = distinct !DISubprogram(name: "ngx_stream_lua_conf_lua_block_parse", scope: !2, file: !2, line: 763, type: !111, scopeLine: 764, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !107, retainedNodes: !700)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !114, !598}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !116, line: 16, baseType: !117)
!116 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1c4d8383f329aa1de050d17038ecb169")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !118, line: 116, size: 768, elements: !119)
!118 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6ae6b72e2fd6bbb6ecc9de2e6386072c")
!119 = !{!120, !121, !317, !682, !683, !684, !693, !694, !695, !696, !697, !699}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 117, baseType: !113, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !117, file: !118, line: 118, baseType: !122, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !124, line: 22, baseType: !125)
!124 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 16, size: 320, elements: !126)
!126 = !{!127, !129, !135, !138, !139}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !125, file: !124, line: 17, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !125, file: !124, line: 18, baseType: !130, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !131, line: 79, baseType: !132)
!131 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !133, line: 90, baseType: !134)
!133 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!134 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !125, file: !124, line: 19, baseType: !136, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !137, line: 29, baseType: !134)
!137 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !125, file: !124, line: 20, baseType: !130, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !125, file: !124, line: 21, baseType: !140, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !116, line: 18, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !143, line: 57, size: 640, elements: !144)
!143 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!144 = !{!145, !159, !160, !161, !297, !304, !316}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !142, file: !143, line: 58, baseType: !146, size: 256)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !143, line: 54, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 49, size: 256, elements: !148)
!148 = !{!149, !156, !157, !158}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !147, file: !143, line: 50, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !152, line: 33, baseType: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !154, line: 31, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !147, file: !143, line: 51, baseType: !150, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !143, line: 52, baseType: !140, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !147, file: !143, line: 53, baseType: !130, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !142, file: !143, line: 59, baseType: !136, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !142, file: !143, line: 60, baseType: !140, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !142, file: !143, line: 61, baseType: !162, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !116, line: 19, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !165, line: 59, size: 128, elements: !166)
!165 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6fc45f3cccbbf41b239dcfa9e2c5b7b1")
!166 = !{!167, !296}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !164, file: !165, line: 60, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !165, line: 18, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !165, line: 20, size: 640, elements: !171)
!171 = !{!172, !173, !174, !178, !179, !180, !181, !183, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !170, file: !165, line: 21, baseType: !150, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !170, file: !165, line: 22, baseType: !150, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !170, file: !165, line: 23, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !152, line: 87, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !154, line: 153, baseType: !177)
!177 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !170, file: !165, line: 24, baseType: !175, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !170, file: !165, line: 26, baseType: !150, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !170, file: !165, line: 27, baseType: !150, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !170, file: !165, line: 28, baseType: !182, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !165, line: 16, baseType: !128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !170, file: !165, line: 29, baseType: !184, size: 64, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !116, line: 23, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !187, line: 16, size: 1600, elements: !188)
!187 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!188 = !{!189, !193, !200, !240, !241, !242, !281, !282}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !186, file: !187, line: 17, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !191, line: 16, baseType: !192)
!191 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "7b9a751e8c1ad1afef5467d60ed94e69")
!192 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !187, line: 18, baseType: !194, size: 128, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !195, line: 19, baseType: !196)
!195 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "aecf67ab89c624000ba2e2684dbcfdc8")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 16, size: 128, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !196, file: !195, line: 17, baseType: !136, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !195, line: 18, baseType: !150, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !186, file: !187, line: 19, baseType: !201, size: 1152, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !191, line: 17, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !203, line: 26, size: 1152, elements: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!204 = !{!205, !207, !209, !211, !214, !216, !218, !219, !220, !222, !224, !226, !234, !235, !236}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !202, file: !203, line: 31, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !154, line: 145, baseType: !134)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !202, file: !203, line: 36, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !154, line: 148, baseType: !134)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !202, file: !203, line: 44, baseType: !210, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !154, line: 151, baseType: !134)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !202, file: !203, line: 45, baseType: !212, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !154, line: 150, baseType: !213)
!213 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !202, file: !203, line: 47, baseType: !215, size: 32, offset: 224)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !154, line: 146, baseType: !213)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !202, file: !203, line: 48, baseType: !217, size: 32, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !154, line: 147, baseType: !213)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !202, file: !203, line: 50, baseType: !192, size: 32, offset: 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !202, file: !203, line: 52, baseType: !206, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !202, file: !203, line: 57, baseType: !221, size: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !154, line: 152, baseType: !177)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !202, file: !203, line: 61, baseType: !223, size: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !154, line: 175, baseType: !177)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !202, file: !203, line: 63, baseType: !225, size: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !154, line: 180, baseType: !177)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !202, file: !203, line: 74, baseType: !227, size: 128, offset: 576)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !228, line: 11, size: 128, elements: !229)
!228 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!229 = !{!230, !232}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !227, file: !228, line: 16, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !154, line: 160, baseType: !177)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !227, file: !228, line: 21, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !154, line: 197, baseType: !177)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !202, file: !203, line: 75, baseType: !227, size: 128, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !202, file: !203, line: 76, baseType: !227, size: 128, offset: 832)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !202, file: !203, line: 89, baseType: !237, size: 192, offset: 960)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 192, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 3)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !186, file: !187, line: 21, baseType: !175, size: 64, offset: 1344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !186, file: !187, line: 22, baseType: !175, size: 64, offset: 1408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !186, file: !187, line: 24, baseType: !243, size: 64, offset: 1472)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !116, line: 20, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !246, line: 50, size: 640, elements: !247)
!246 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f35895306f847777914ce99ffeccfabd")
!247 = !{!248, !249, !261, !264, !267, !272, !273, !278, !279, !280}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !245, file: !246, line: 51, baseType: !130, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !245, file: !246, line: 52, baseType: !250, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !116, line: 21, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !118, line: 89, size: 320, elements: !253)
!253 = !{!254, !255, !256, !260}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !252, file: !118, line: 90, baseType: !190, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !118, line: 91, baseType: !194, size: 128, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !252, file: !118, line: 93, baseType: !257, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !250, !243}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !252, file: !118, line: 94, baseType: !128, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !245, file: !246, line: 54, baseType: !262, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !263, line: 98, baseType: !134)
!263 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "eac8f0294f941da9268c3a72c9fca0e1")
!264 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !245, file: !246, line: 56, baseType: !265, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !266, line: 10, baseType: !231)
!266 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!267 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !245, file: !246, line: 58, baseType: !268, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !246, line: 45, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!150, !243, !150, !136}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !245, file: !246, line: 59, baseType: !128, size: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !245, file: !246, line: 61, baseType: !274, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !246, line: 46, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !243, !130, !150, !136}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !245, file: !246, line: 62, baseType: !128, size: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !245, file: !246, line: 70, baseType: !113, size: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !246, line: 72, baseType: !243, size: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !186, file: !187, line: 37, baseType: !213, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !186, file: !187, line: 38, baseType: !213, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !170, file: !165, line: 30, baseType: !168, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !170, file: !165, line: 34, baseType: !213, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !170, file: !165, line: 40, baseType: !213, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !170, file: !165, line: 43, baseType: !213, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !170, file: !165, line: 45, baseType: !213, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !170, file: !165, line: 46, baseType: !213, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !170, file: !165, line: 47, baseType: !213, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !170, file: !165, line: 48, baseType: !213, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !170, file: !165, line: 49, baseType: !213, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !170, file: !165, line: 50, baseType: !213, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !170, file: !165, line: 52, baseType: !213, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !170, file: !165, line: 53, baseType: !213, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !170, file: !165, line: 55, baseType: !192, size: 32, offset: 608)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !165, line: 61, baseType: !162, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !142, file: !143, line: 62, baseType: !298, size: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !143, line: 41, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !143, line: 43, size: 128, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !143, line: 44, baseType: !298, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !300, file: !143, line: 45, baseType: !128, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !142, file: !143, line: 63, baseType: !305, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !143, line: 32, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !143, line: 34, size: 192, elements: !308)
!308 = !{!309, !314, !315}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !307, file: !143, line: 35, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !143, line: 30, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !128}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !143, line: 36, baseType: !128, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !143, line: 37, baseType: !305, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !142, file: !143, line: 64, baseType: !243, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !117, file: !118, line: 120, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !116, line: 17, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !321, line: 47, size: 5184, elements: !322)
!321 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "084646d0d3ecf791b89c14281fd46376")
!322 = !{!323, !327, !328, !329, !330, !331, !578, !579, !580, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !680, !681}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !320, file: !321, line: 48, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !320, file: !321, line: 49, baseType: !140, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !320, file: !321, line: 51, baseType: !243, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !320, file: !321, line: 52, baseType: !244, size: 640, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !320, file: !321, line: 54, baseType: !130, size: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !320, file: !321, line: 56, baseType: !332, size: 64, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !116, line: 26, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !336, line: 124, size: 1920, elements: !337)
!336 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf513a87e959064e14502903e9282b0e")
!337 = !{!338, !339, !396, !397, !400, !408, !410, !415, !420, !499, !500, !501, !502, !503, !504, !505, !506, !507, !513, !554, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !335, file: !336, line: 125, baseType: !128, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !335, file: !336, line: 126, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !116, line: 24, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !343, line: 30, size: 768, elements: !344)
!343 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "c79f651cc4aca504d9d912404beb8bf3")
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !373, !374, !375, !388}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !343, line: 31, baseType: !128, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !342, file: !343, line: 33, baseType: !213, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !342, file: !343, line: 35, baseType: !213, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !342, file: !343, line: 38, baseType: !213, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !342, file: !343, line: 44, baseType: !213, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !342, file: !343, line: 46, baseType: !213, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !342, file: !343, line: 49, baseType: !213, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !342, file: !343, line: 51, baseType: !213, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !342, file: !343, line: 54, baseType: !213, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !342, file: !343, line: 56, baseType: !213, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !342, file: !343, line: 57, baseType: !213, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !342, file: !343, line: 59, baseType: !213, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !342, file: !343, line: 60, baseType: !213, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !342, file: !343, line: 62, baseType: !213, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !342, file: !343, line: 64, baseType: !213, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !342, file: !343, line: 67, baseType: !213, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !342, file: !343, line: 69, baseType: !213, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !342, file: !343, line: 71, baseType: !213, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !342, file: !343, line: 74, baseType: !213, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !342, file: !343, line: 75, baseType: !213, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "skip_socket_leak_check", scope: !342, file: !343, line: 77, baseType: !213, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !342, file: !343, line: 80, baseType: !213, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !342, file: !343, line: 110, baseType: !213, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !342, file: !343, line: 113, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !116, line: 32, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !340}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !342, file: !343, line: 120, baseType: !130, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !342, file: !343, line: 122, baseType: !243, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !342, file: !343, line: 124, baseType: !376, size: 320, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !377, line: 20, baseType: !378)
!377 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ee5b3151c1c48b156833d321f8e1946a")
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !377, line: 22, size: 320, elements: !379)
!379 = !{!380, !382, !384, !385, !386, !387}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !378, file: !377, line: 23, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !377, line: 16, baseType: !130)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !378, file: !377, line: 24, baseType: !383, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !378, file: !377, line: 25, baseType: !383, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !378, file: !377, line: 26, baseType: !383, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !378, file: !377, line: 27, baseType: !151, size: 8, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !378, file: !377, line: 28, baseType: !151, size: 8, offset: 264)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !342, file: !343, line: 127, baseType: !389, size: 128, offset: 640)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !390, line: 16, baseType: !391)
!390 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !390, line: 18, size: 128, elements: !392)
!392 = !{!393, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !391, file: !390, line: 19, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !390, line: 20, baseType: !394, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !335, file: !336, line: 127, baseType: !340, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !335, file: !336, line: 129, baseType: !398, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !399, line: 17, baseType: !192)
!399 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ad64fd7b9f2b4876e8c9dcdeeb2305ce")
!400 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !335, file: !336, line: 131, baseType: !401, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !402, line: 19, baseType: !403)
!402 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !333, !150, !136}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !152, line: 108, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !154, line: 194, baseType: !177)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !335, file: !336, line: 132, baseType: !409, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !402, line: 22, baseType: !403)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !335, file: !336, line: 133, baseType: !411, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !402, line: 20, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!406, !333, !162, !175}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !335, file: !336, line: 134, baseType: !416, size: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !402, line: 23, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!162, !333, !162, !175}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !335, file: !336, line: 136, baseType: !421, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !336, line: 16, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !336, line: 18, size: 2432, elements: !424)
!424 = !{!425, !426, !439, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !457, !458, !459, !460, !461, !462, !465, !466, !467, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !423, file: !336, line: 19, baseType: !398, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !423, file: !336, line: 21, baseType: !427, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !429, line: 180, size: 128, elements: !430)
!429 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!430 = !{!431, !435}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !428, file: !429, line: 182, baseType: !432, size: 16)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !433, line: 28, baseType: !434)
!433 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!434 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !428, file: !429, line: 183, baseType: !436, size: 112, offset: 16)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 14)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !423, file: !336, line: 22, baseType: !440, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !441, line: 274, baseType: !442)
!441 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !154, line: 210, baseType: !213)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !423, file: !336, line: 23, baseType: !136, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !423, file: !336, line: 24, baseType: !194, size: 128, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !423, file: !336, line: 26, baseType: !192, size: 32, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !423, file: !336, line: 28, baseType: !192, size: 32, offset: 416)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !423, file: !336, line: 29, baseType: !192, size: 32, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !423, file: !336, line: 30, baseType: !192, size: 32, offset: 480)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !423, file: !336, line: 32, baseType: !192, size: 32, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !423, file: !336, line: 33, baseType: !192, size: 32, offset: 544)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !423, file: !336, line: 34, baseType: !192, size: 32, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !423, file: !336, line: 38, baseType: !453, size: 64, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !116, line: 33, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !333}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !423, file: !336, line: 40, baseType: !128, size: 64, offset: 704)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !423, file: !336, line: 42, baseType: !244, size: 640, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !423, file: !336, line: 43, baseType: !243, size: 64, offset: 1408)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !423, file: !336, line: 45, baseType: !136, size: 64, offset: 1472)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !423, file: !336, line: 47, baseType: !136, size: 64, offset: 1536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !423, file: !336, line: 49, baseType: !463, size: 64, offset: 1600)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !464, line: 16, baseType: !381)
!464 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!465 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !423, file: !336, line: 51, baseType: !421, size: 64, offset: 1664)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !423, file: !336, line: 52, baseType: !333, size: 64, offset: 1728)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !423, file: !336, line: 54, baseType: !468, size: 192, offset: 1792)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !377, line: 32, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !377, line: 37, size: 192, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !469, file: !377, line: 38, baseType: !383, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !469, file: !377, line: 39, baseType: !383, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !469, file: !377, line: 40, baseType: !474, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !377, line: 34, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !383, !383, !383}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !423, file: !336, line: 55, baseType: !376, size: 320, offset: 1984)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !423, file: !336, line: 57, baseType: !130, size: 64, offset: 2304)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !423, file: !336, line: 59, baseType: !213, size: 1, offset: 2368, flags: DIFlagBitField, extraData: i64 2368)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !423, file: !336, line: 60, baseType: !213, size: 1, offset: 2369, flags: DIFlagBitField, extraData: i64 2368)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !423, file: !336, line: 61, baseType: !213, size: 1, offset: 2370, flags: DIFlagBitField, extraData: i64 2368)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !423, file: !336, line: 63, baseType: !213, size: 1, offset: 2371, flags: DIFlagBitField, extraData: i64 2368)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !423, file: !336, line: 64, baseType: !213, size: 1, offset: 2372, flags: DIFlagBitField, extraData: i64 2368)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !423, file: !336, line: 65, baseType: !213, size: 1, offset: 2373, flags: DIFlagBitField, extraData: i64 2368)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !423, file: !336, line: 66, baseType: !213, size: 1, offset: 2374, flags: DIFlagBitField, extraData: i64 2368)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !423, file: !336, line: 67, baseType: !213, size: 1, offset: 2375, flags: DIFlagBitField, extraData: i64 2368)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !423, file: !336, line: 68, baseType: !213, size: 1, offset: 2376, flags: DIFlagBitField, extraData: i64 2368)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !423, file: !336, line: 69, baseType: !213, size: 1, offset: 2377, flags: DIFlagBitField, extraData: i64 2368)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !423, file: !336, line: 70, baseType: !213, size: 1, offset: 2378, flags: DIFlagBitField, extraData: i64 2368)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !423, file: !336, line: 73, baseType: !213, size: 1, offset: 2379, flags: DIFlagBitField, extraData: i64 2368)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !423, file: !336, line: 75, baseType: !213, size: 1, offset: 2380, flags: DIFlagBitField, extraData: i64 2368)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !423, file: !336, line: 76, baseType: !213, size: 1, offset: 2381, flags: DIFlagBitField, extraData: i64 2368)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !423, file: !336, line: 77, baseType: !213, size: 2, offset: 2382, flags: DIFlagBitField, extraData: i64 2368)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !423, file: !336, line: 79, baseType: !213, size: 1, offset: 2384, flags: DIFlagBitField, extraData: i64 2368)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !423, file: !336, line: 80, baseType: !213, size: 1, offset: 2385, flags: DIFlagBitField, extraData: i64 2368)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !423, file: !336, line: 81, baseType: !213, size: 1, offset: 2386, flags: DIFlagBitField, extraData: i64 2368)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !423, file: !336, line: 90, baseType: !192, size: 32, offset: 2400)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !335, file: !336, line: 138, baseType: !175, size: 64, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !335, file: !336, line: 140, baseType: !243, size: 64, offset: 640)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !335, file: !336, line: 142, baseType: !140, size: 64, offset: 704)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !335, file: !336, line: 144, baseType: !192, size: 32, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !335, file: !336, line: 146, baseType: !427, size: 64, offset: 832)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !335, file: !336, line: 147, baseType: !440, size: 32, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !335, file: !336, line: 148, baseType: !194, size: 128, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !335, file: !336, line: 150, baseType: !194, size: 128, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !335, file: !336, line: 151, baseType: !508, size: 16, offset: 1216)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !509, line: 123, baseType: !510)
!509 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !511, line: 25, baseType: !512)
!511 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !154, line: 40, baseType: !434)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !335, file: !336, line: 154, baseType: !514, size: 64, offset: 1280)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !116, line: 29, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !517, line: 74, size: 704, elements: !518)
!517 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "51639b814b1b55c5b35047c033281672")
!518 = !{!519, !524, !528, !532, !533, !534, !535, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !516, file: !517, line: 75, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !522, line: 184, baseType: !523)
!522 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !522, line: 184, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !516, file: !517, line: 76, baseType: !525, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !522, line: 185, baseType: !527)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !522, line: 185, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !516, file: !517, line: 78, baseType: !529, size: 64, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !131, line: 78, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !441, line: 267, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !154, line: 207, baseType: !177)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !516, file: !517, line: 79, baseType: !168, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !516, file: !517, line: 80, baseType: !136, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !516, file: !517, line: 82, baseType: !453, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !516, file: !517, line: 84, baseType: !536, size: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !538, line: 231, baseType: !539)
!538 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "848d42aedd0da44ffda19088217823c7")
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !538, line: 231, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !516, file: !517, line: 85, baseType: !453, size: 64, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !516, file: !517, line: 87, baseType: !369, size: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !516, file: !517, line: 88, baseType: !369, size: 64, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !516, file: !517, line: 90, baseType: !151, size: 8, offset: 640)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !516, file: !517, line: 92, baseType: !213, size: 1, offset: 648, flags: DIFlagBitField, extraData: i64 648)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !516, file: !517, line: 93, baseType: !213, size: 1, offset: 649, flags: DIFlagBitField, extraData: i64 648)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !516, file: !517, line: 94, baseType: !213, size: 1, offset: 650, flags: DIFlagBitField, extraData: i64 648)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !516, file: !517, line: 95, baseType: !213, size: 1, offset: 651, flags: DIFlagBitField, extraData: i64 648)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !516, file: !517, line: 96, baseType: !213, size: 1, offset: 652, flags: DIFlagBitField, extraData: i64 648)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !516, file: !517, line: 97, baseType: !213, size: 1, offset: 653, flags: DIFlagBitField, extraData: i64 648)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !516, file: !517, line: 98, baseType: !213, size: 1, offset: 654, flags: DIFlagBitField, extraData: i64 648)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !516, file: !517, line: 99, baseType: !213, size: 1, offset: 655, flags: DIFlagBitField, extraData: i64 648)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !516, file: !517, line: 100, baseType: !213, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 648)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !516, file: !517, line: 101, baseType: !213, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 648)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !335, file: !336, line: 157, baseType: !555, size: 64, offset: 1344)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !116, line: 30, baseType: !557)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !116, line: 30, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !335, file: !336, line: 159, baseType: !427, size: 64, offset: 1408)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !335, file: !336, line: 160, baseType: !440, size: 32, offset: 1472)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !335, file: !336, line: 162, baseType: !168, size: 64, offset: 1536)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !335, file: !336, line: 164, baseType: !389, size: 128, offset: 1600)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !335, file: !336, line: 166, baseType: !262, size: 64, offset: 1728)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !335, file: !336, line: 168, baseType: !130, size: 64, offset: 1792)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !335, file: !336, line: 170, baseType: !213, size: 8, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !335, file: !336, line: 172, baseType: !213, size: 3, offset: 1864, flags: DIFlagBitField, extraData: i64 1856)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !335, file: !336, line: 174, baseType: !213, size: 1, offset: 1867, flags: DIFlagBitField, extraData: i64 1856)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !335, file: !336, line: 175, baseType: !213, size: 1, offset: 1868, flags: DIFlagBitField, extraData: i64 1856)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !335, file: !336, line: 176, baseType: !213, size: 1, offset: 1869, flags: DIFlagBitField, extraData: i64 1856)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !335, file: !336, line: 178, baseType: !213, size: 1, offset: 1870, flags: DIFlagBitField, extraData: i64 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !335, file: !336, line: 179, baseType: !213, size: 1, offset: 1871, flags: DIFlagBitField, extraData: i64 1856)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !335, file: !336, line: 180, baseType: !213, size: 1, offset: 1872, flags: DIFlagBitField, extraData: i64 1856)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !335, file: !336, line: 181, baseType: !213, size: 1, offset: 1873, flags: DIFlagBitField, extraData: i64 1856)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !335, file: !336, line: 183, baseType: !213, size: 1, offset: 1874, flags: DIFlagBitField, extraData: i64 1856)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !335, file: !336, line: 184, baseType: !213, size: 1, offset: 1875, flags: DIFlagBitField, extraData: i64 1856)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !335, file: !336, line: 185, baseType: !213, size: 2, offset: 1876, flags: DIFlagBitField, extraData: i64 1856)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !335, file: !336, line: 186, baseType: !213, size: 2, offset: 1878, flags: DIFlagBitField, extraData: i64 1856)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !335, file: !336, line: 188, baseType: !213, size: 1, offset: 1880, flags: DIFlagBitField, extraData: i64 1856)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !320, file: !321, line: 57, baseType: !333, size: 64, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !320, file: !321, line: 58, baseType: !130, size: 64, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !320, file: !321, line: 60, baseType: !581, size: 64, offset: 1088)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !116, line: 15, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !585, line: 222, size: 1600, elements: !586)
!585 = !DIFile(filename: "src/core/ngx_module.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "1b2032f87974a892f93f4098e8fc0619")
!586 = !{!587, !588, !589, !590, !591, !592, !593, !596, !597, !611, !612, !616, !620, !621, !622, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !584, file: !585, line: 223, baseType: !130, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !584, file: !585, line: 224, baseType: !130, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !584, file: !585, line: 226, baseType: !113, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !584, file: !585, line: 228, baseType: !130, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !584, file: !585, line: 229, baseType: !130, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !584, file: !585, line: 231, baseType: !130, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !584, file: !585, line: 232, baseType: !594, size: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !584, file: !585, line: 234, baseType: !128, size: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !584, file: !585, line: 235, baseType: !598, size: 64, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !116, line: 22, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !118, line: 77, size: 448, elements: !601)
!601 = !{!602, !603, !604, !608, !609, !610}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !600, file: !118, line: 78, baseType: !194, size: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !600, file: !118, line: 79, baseType: !130, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !600, file: !118, line: 80, baseType: !605, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!113, !114, !598, !128}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !600, file: !118, line: 81, baseType: !130, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !600, file: !118, line: 82, baseType: !130, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !600, file: !118, line: 83, baseType: !128, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !584, file: !585, line: 236, baseType: !130, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !584, file: !585, line: 238, baseType: !613, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!529, !243}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !584, file: !585, line: 240, baseType: !617, size: 64, offset: 704)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!529, !318}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !584, file: !585, line: 242, baseType: !617, size: 64, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !584, file: !585, line: 243, baseType: !617, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !584, file: !585, line: 244, baseType: !623, size: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !318}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !584, file: !585, line: 245, baseType: !623, size: 64, offset: 960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !584, file: !585, line: 247, baseType: !623, size: 64, offset: 1024)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !584, file: !585, line: 249, baseType: !132, size: 64, offset: 1088)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !584, file: !585, line: 250, baseType: !132, size: 64, offset: 1152)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !584, file: !585, line: 251, baseType: !132, size: 64, offset: 1216)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !584, file: !585, line: 252, baseType: !132, size: 64, offset: 1280)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !584, file: !585, line: 253, baseType: !132, size: 64, offset: 1344)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !584, file: !585, line: 254, baseType: !132, size: 64, offset: 1408)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !584, file: !585, line: 255, baseType: !132, size: 64, offset: 1472)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !584, file: !585, line: 256, baseType: !132, size: 64, offset: 1536)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !320, file: !321, line: 61, baseType: !130, size: 64, offset: 1152)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !320, file: !321, line: 62, baseType: !130, size: 64, offset: 1216)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !320, file: !321, line: 64, baseType: !389, size: 128, offset: 1280)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !320, file: !321, line: 65, baseType: !130, size: 64, offset: 1408)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !320, file: !321, line: 67, baseType: !123, size: 320, offset: 1472)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !320, file: !321, line: 68, baseType: !123, size: 320, offset: 1792)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !320, file: !321, line: 70, baseType: !123, size: 320, offset: 2112)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !320, file: !321, line: 71, baseType: !468, size: 192, offset: 2432)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !320, file: !321, line: 72, baseType: !376, size: 320, offset: 2624)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !320, file: !321, line: 74, baseType: !646, size: 448, offset: 2944)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !647, line: 31, baseType: !648)
!647 = !DIFile(filename: "src/core/ngx_list.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "580525d954b127a1c35170a83ca4d8b1")
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !647, line: 25, size: 448, elements: !649)
!649 = !{!650, !658, !659, !660, !661}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !648, file: !647, line: 26, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !647, line: 16, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !647, line: 18, size: 192, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !653, file: !647, line: 19, baseType: !128, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !653, file: !647, line: 20, baseType: !130, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !653, file: !647, line: 21, baseType: !651, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !648, file: !647, line: 27, baseType: !652, size: 192, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !648, file: !647, line: 28, baseType: !136, size: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !648, file: !647, line: 29, baseType: !130, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !648, file: !647, line: 30, baseType: !140, size: 64, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !320, file: !321, line: 75, baseType: !646, size: 448, offset: 3392)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !320, file: !321, line: 77, baseType: !130, size: 64, offset: 3840)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !320, file: !321, line: 78, baseType: !130, size: 64, offset: 3904)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !320, file: !321, line: 80, baseType: !333, size: 64, offset: 3968)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !320, file: !321, line: 81, baseType: !340, size: 64, offset: 4032)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !320, file: !321, line: 82, baseType: !340, size: 64, offset: 4096)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !320, file: !321, line: 84, baseType: !318, size: 64, offset: 4160)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !320, file: !321, line: 86, baseType: !194, size: 128, offset: 4224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !320, file: !321, line: 87, baseType: !194, size: 128, offset: 4352)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !320, file: !321, line: 88, baseType: !194, size: 128, offset: 4480)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !320, file: !321, line: 89, baseType: !194, size: 128, offset: 4608)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !320, file: !321, line: 90, baseType: !194, size: 128, offset: 4736)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !320, file: !321, line: 91, baseType: !194, size: 128, offset: 4864)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_handler", scope: !320, file: !321, line: 93, baseType: !676, size: 64, offset: 4992)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_intercept_pt", file: !321, line: 34, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!529, !243, !130, !150, !136}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "intercept_error_log_data", scope: !320, file: !321, line: 94, baseType: !128, size: 64, offset: 5056)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "entered_logger", scope: !320, file: !321, line: 95, baseType: !213, size: 32, offset: 5120)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !117, file: !118, line: 121, baseType: !140, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !117, file: !118, line: 122, baseType: !140, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !117, file: !118, line: 123, baseType: !685, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !118, line: 103, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 98, size: 1792, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !687, file: !118, line: 99, baseType: !185, size: 1600)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !687, file: !118, line: 100, baseType: !168, size: 64, offset: 1600)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !687, file: !118, line: 101, baseType: !168, size: 64, offset: 1664)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !687, file: !118, line: 102, baseType: !130, size: 64, offset: 1728)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !117, file: !118, line: 124, baseType: !243, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !117, file: !118, line: 126, baseType: !128, size: 64, offset: 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !117, file: !118, line: 127, baseType: !130, size: 64, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !117, file: !118, line: 128, baseType: !130, size: 64, offset: 576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !117, file: !118, line: 130, baseType: !698, size: 64, offset: 640)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !118, line: 112, baseType: !605)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !117, file: !118, line: 131, baseType: !128, size: 64, offset: 704)
!700 = !{!701, !702, !703, !709, !710, !711, !712, !713, !715, !716, !717, !718, !719, !720, !721, !722}
!701 = !DILocalVariable(name: "cf", arg: 1, scope: !110, file: !2, line: 763, type: !114)
!702 = !DILocalVariable(name: "cmd", arg: 2, scope: !110, file: !2, line: 763, type: !598)
!703 = !DILocalVariable(name: "ctx", scope: !110, file: !2, line: 765, type: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_lua_block_parser_ctx_t", file: !2, line: 40, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_stream_lua_block_parser_ctx_s", file: !2, line: 52, size: 128, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "start_line", scope: !705, file: !2, line: 53, baseType: !130, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "token_len", scope: !705, file: !2, line: 54, baseType: !192, size: 32, offset: 64)
!709 = !DILocalVariable(name: "level", scope: !110, file: !2, line: 767, type: !192)
!710 = !DILocalVariable(name: "rv", scope: !110, file: !2, line: 768, type: !113)
!711 = !DILocalVariable(name: "p", scope: !110, file: !2, line: 769, type: !150)
!712 = !DILocalVariable(name: "len", scope: !110, file: !2, line: 770, type: !136)
!713 = !DILocalVariable(name: "src", scope: !110, file: !2, line: 771, type: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!715 = !DILocalVariable(name: "dst", scope: !110, file: !2, line: 771, type: !714)
!716 = !DILocalVariable(name: "rc", scope: !110, file: !2, line: 772, type: !529)
!717 = !DILocalVariable(name: "i", scope: !110, file: !2, line: 773, type: !130)
!718 = !DILocalVariable(name: "start_line", scope: !110, file: !2, line: 773, type: !130)
!719 = !DILocalVariable(name: "saved", scope: !110, file: !2, line: 774, type: !122)
!720 = !DILocalVariable(name: "type", scope: !110, file: !2, line: 778, type: !109)
!721 = !DILabel(scope: !110, name: "failed", file: !2, line: 908)
!722 = !DILabel(scope: !110, name: "done", file: !2, line: 912)
!723 = !{!724, !725}
!724 = !DIEnumerator(name: "parse_block", value: 0)
!725 = !DIEnumerator(name: "parse_param", value: 1)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 58, baseType: !213, size: 32, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!728 = !DIEnumerator(name: "FOUND_LEFT_CURLY", value: 0)
!729 = !DIEnumerator(name: "FOUND_RIGHT_CURLY", value: 1)
!730 = !DIEnumerator(name: "FOUND_LEFT_LBRACKET_STR", value: 2)
!731 = !DIEnumerator(name: "FOUND_LBRACKET_STR", value: 2)
!732 = !DIEnumerator(name: "FOUND_LEFT_LBRACKET_CMT", value: 3)
!733 = !DIEnumerator(name: "FOUND_LBRACKET_CMT", value: 3)
!734 = !DIEnumerator(name: "FOUND_RIGHT_LBRACKET", value: 4)
!735 = !DIEnumerator(name: "FOUND_COMMENT_LINE", value: 5)
!736 = !DIEnumerator(name: "FOUND_DOUBLE_QUOTED", value: 6)
!737 = !DIEnumerator(name: "FOUND_SINGLE_QUOTED", value: 7)
!738 = !{!128, !136, !739, !150, !741, !1112, !1118, !594, !1167, !676, !406, !151, !130}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !131, line: 80, baseType: !530)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_lua_handler_pt", file: !742, line: 52, baseType: !743)
!742 = !DIFile(filename: "../ngx_stream_lua-0.0.7/src/ngx_stream_lua_request.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ccaa5a9459f8752c4a35875ca3232d17")
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!529, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_lua_request_t", file: !742, line: 22, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_stream_lua_request_s", file: !742, line: 27, size: 384, elements: !749)
!749 = !{!750, !751, !1096, !1097, !1106, !1111}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !748, file: !742, line: 28, baseType: !333, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !748, file: !742, line: 29, baseType: !752, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_session_t", file: !754, line: 20, baseType: !755)
!754 = !DIFile(filename: "src/stream/ngx_stream.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "5b43959b152802dd9a372cd63f29aa49")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_stream_session_s", file: !754, line: 195, size: 960, elements: !756)
!756 = !{!757, !760, !761, !762, !763, !764, !765, !766, !767, !768, !1077, !1078, !1091, !1092, !1093, !1094, !1095}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !755, file: !754, line: 196, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !511, line: 26, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !154, line: 42, baseType: !213)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !755, file: !754, line: 198, baseType: !333, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "received", scope: !755, file: !754, line: 200, baseType: !175, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !755, file: !754, line: 201, baseType: !265, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "start_msec", scope: !755, file: !754, line: 202, baseType: !463, size: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "log_handler", scope: !755, file: !754, line: 204, baseType: !268, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !755, file: !754, line: 206, baseType: !326, size: 64, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !755, file: !754, line: 207, baseType: !326, size: 64, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !755, file: !754, line: 208, baseType: !326, size: 64, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !755, file: !754, line: 210, baseType: !769, size: 64, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_t", file: !771, line: 142, baseType: !772)
!771 = !DIFile(filename: "src/stream/ngx_stream_upstream.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "3f8e5475e314f6b689847c899b77180e")
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !771, line: 117, size: 3328, elements: !773)
!773 = !{!774, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !887, !1064, !1075, !1076}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !772, file: !771, line: 118, baseType: !775, size: 1024)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !776, line: 22, baseType: !777)
!776 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "ac5aedde14d2cb26bc31b0019c79e36b")
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !776, line: 36, size: 1024, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !791, !796, !798, !799, !801, !806, !815, !816, !817, !818, !819, !820, !821}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !777, file: !776, line: 37, baseType: !333, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !777, file: !776, line: 39, baseType: !427, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !777, file: !776, line: 40, baseType: !440, size: 32, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !777, file: !776, line: 41, baseType: !714, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !777, file: !776, line: 43, baseType: !130, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !777, file: !776, line: 44, baseType: !463, size: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !777, file: !776, line: 46, baseType: !786, size: 64, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !776, line: 24, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!529, !790, !128}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !777, file: !776, line: 47, baseType: !792, size: 64, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !776, line: 26, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !790, !128, !130}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !777, file: !776, line: 48, baseType: !797, size: 64, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !776, line: 28, baseType: !793)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !777, file: !776, line: 49, baseType: !128, size: 64, offset: 576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "set_session", scope: !777, file: !776, line: 52, baseType: !800, size: 64, offset: 640)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_set_peer_session_pt", file: !776, line: 30, baseType: !787)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !777, file: !776, line: 53, baseType: !802, size: 64, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_save_peer_session_pt", file: !776, line: 32, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !790, !128}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !777, file: !776, line: 56, baseType: !807, size: 64, offset: 768)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !809, line: 78, baseType: !810)
!809 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "6d8b5de9d803e9eabdd54c00fd750bd0")
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !809, line: 74, size: 256, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !810, file: !809, line: 75, baseType: !427, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !810, file: !809, line: 76, baseType: !440, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !810, file: !809, line: 77, baseType: !194, size: 128, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !777, file: !776, line: 58, baseType: !192, size: 32, offset: 832)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !777, file: !776, line: 59, baseType: !192, size: 32, offset: 864)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !777, file: !776, line: 61, baseType: !243, size: 64, offset: 896)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !777, file: !776, line: 63, baseType: !213, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !777, file: !776, line: 64, baseType: !213, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "so_keepalive", scope: !777, file: !776, line: 65, baseType: !213, size: 1, offset: 962, flags: DIFlagBitField, extraData: i64 960)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !777, file: !776, line: 68, baseType: !213, size: 2, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_buf", scope: !772, file: !771, line: 120, baseType: !169, size: 640, offset: 1024)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_buf", scope: !772, file: !771, line: 121, baseType: !169, size: 640, offset: 1664)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !772, file: !771, line: 123, baseType: !162, size: 64, offset: 2304)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_out", scope: !772, file: !771, line: 124, baseType: !162, size: 64, offset: 2368)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_busy", scope: !772, file: !771, line: 125, baseType: !162, size: 64, offset: 2432)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_out", scope: !772, file: !771, line: 126, baseType: !162, size: 64, offset: 2496)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_busy", scope: !772, file: !771, line: 127, baseType: !162, size: 64, offset: 2560)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "received", scope: !772, file: !771, line: 129, baseType: !175, size: 64, offset: 2624)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !772, file: !771, line: 130, baseType: !265, size: 64, offset: 2688)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !772, file: !771, line: 131, baseType: !130, size: 64, offset: 2752)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "responses", scope: !772, file: !771, line: 132, baseType: !130, size: 64, offset: 2816)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !772, file: !771, line: 133, baseType: !463, size: 64, offset: 2880)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_name", scope: !772, file: !771, line: 135, baseType: !194, size: 128, offset: 2944)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !772, file: !771, line: 137, baseType: !836, size: 64, offset: 3072)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_srv_conf_t", file: !771, line: 36, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_stream_upstream_srv_conf_s", file: !771, line: 70, size: 832, elements: !839)
!839 = !{!840, !855, !856, !857, !858, !859, !860, !861, !862, !863}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !838, file: !771, line: 71, baseType: !841, size: 192)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_peer_t", file: !771, line: 49, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !771, line: 45, size: 192, elements: !843)
!843 = !{!844, !849, !854}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !842, file: !771, line: 46, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_init_pt", file: !771, line: 39, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!529, !114, !836}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !842, file: !771, line: 47, baseType: !850, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_stream_upstream_init_peer_pt", file: !771, line: 41, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!529, !752, !836}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !842, file: !771, line: 48, baseType: !128, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !838, file: !771, line: 72, baseType: !326, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !838, file: !771, line: 74, baseType: !122, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !838, file: !771, line: 77, baseType: !130, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !838, file: !771, line: 78, baseType: !194, size: 128, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "file_name", scope: !838, file: !771, line: 79, baseType: !150, size: 64, offset: 512)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !838, file: !771, line: 80, baseType: !130, size: 64, offset: 576)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !838, file: !771, line: 81, baseType: !508, size: 16, offset: 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "no_port", scope: !838, file: !771, line: 82, baseType: !130, size: 64, offset: 704)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !838, file: !771, line: 85, baseType: !864, size: 64, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !321, line: 31, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !321, line: 37, size: 704, elements: !867)
!867 = !{!868, !869, !879, !884, !885, !886}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !866, file: !321, line: 38, baseType: !128, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !866, file: !321, line: 39, baseType: !870, size: 384, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !871, line: 22, baseType: !872)
!871 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/nginx-1.15.8", checksumkind: CSK_MD5, checksum: "bf27d4781f3b25ce5eb9a764f55ea2d4")
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !871, line: 16, size: 384, elements: !873)
!873 = !{!874, !875, !876, !877, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !872, file: !871, line: 17, baseType: !150, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !872, file: !871, line: 18, baseType: !136, size: 64, offset: 64)
