; ModuleID = 'samples/917.bc'
source_filename = "mod_dav.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.module_struct = type { i32, i32, i32, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct.command_struct = type { ptr, %union.cmd_func, ptr, i32, i32, ptr }
%union.cmd_func = type { ptr }
%struct.anon.0 = type { ptr, ptr, ptr, ptr, ptr, ptr }
%struct.apr_bucket_type_t = type { ptr, i32, i32, ptr, ptr, ptr, ptr, ptr }
%struct.request_rec = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i32, ptr, ptr, i64, ptr, i32, i32, ptr, i64, ptr, ptr, i64, i64, i64, ptr, i64, i32, i32, i32, i32, ptr, ptr, i64, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, %struct.apr_uri_t, %struct.apr_finfo_t, ptr, ptr, ptr, ptr, ptr, i32, i64 }
%struct.apr_uri_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i16, i8 }
%struct.apr_finfo_t = type { ptr, i32, i32, i32, i32, i32, i64, i64, i32, i64, i64, i64, i64, i64, ptr, ptr, ptr }
%struct.dav_dir_conf = type { ptr, ptr, ptr, i32, i32, i32 }
%struct.dav_provider = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.dav_response = type { ptr, ptr, %struct.dav_get_props_result, i32, ptr }
%struct.dav_get_props_result = type { ptr, ptr }
%struct.apr_text = type { ptr, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dav_module", scope: !2, file: !3, line: 5185, type: !2370, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !212, globals: !1341, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "mod_dav.c", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/dav/main", checksumkind: CSK_MD5, checksum: "17772cc25d536d1c149e2b4494cd72fc")
!4 = !{!5, !64, !89, !98, !106, !118, !123, !128, !140, !151, !155, !160, !165, !169, !174, !190, !197, !202, !207}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !7, file: !6, line: 151, baseType: !65, size: 32, elements: !86)
!6 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_buckets.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "afcd28b2e200d46cb3a438f3ad8fc6de")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_type_t", file: !6, line: 131, size: 448, elements: !8)
!8 = !{!9, !13, !15, !16, !21, !69, !77, !81}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !7, file: !6, line: 135, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "num_func", scope: !7, file: !6, line: 140, baseType: !14, size: 32, offset: 64)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "is_metadata", scope: !7, file: !6, line: 156, baseType: !5, size: 32, offset: 96)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !7, file: !6, line: 164, baseType: !17, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !7, file: !6, line: 176, baseType: !22, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !27, !61, !62, !63}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !26, line: 44, baseType: !14)
!26 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_errno.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "571a7b9d4a9f11f6d27db63c8ba4bc85")
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket", file: !6, line: 121, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket", file: !6, line: 224, size: 512, elements: !30)
!30 = !{!31, !38, !42, !48, !55, !56, !57}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !29, file: !6, line: 226, baseType: !32, size: 128)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !29, file: !6, line: 226, size: 128, elements: !33)
!33 = !{!34, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !32, file: !6, line: 226, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !32, file: !6, line: 226, baseType: !35, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !29, file: !6, line: 228, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_type_t", file: !6, line: 126, baseType: !7)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !29, file: !6, line: 234, baseType: !43, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !44, line: 379, baseType: !45)
!44 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "73077acfd8398d55139f48047843856b")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 70, baseType: !47)
!46 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!47 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !29, file: !6, line: 242, baseType: !49, size: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !44, line: 381, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !51, line: 85, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !53, line: 152, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!54 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !29, file: !6, line: 244, baseType: !20, size: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !29, file: !6, line: 252, baseType: !17, size: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !29, file: !6, line: 254, baseType: !58, size: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_alloc_t", file: !6, line: 123, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_alloc_t", file: !6, line: 123, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_read_type_e", file: !6, line: 60, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 57, baseType: !65, size: 32, elements: !66)
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !{!67, !68}
!67 = !DIEnumerator(name: "APR_BLOCK_READ", value: 0)
!68 = !DIEnumerator(name: "APR_NONBLOCK_READ", value: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "setaside", scope: !7, file: !6, line: 192, baseType: !70, size: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!25, !27, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !75, line: 60, baseType: !76)
!75 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_pools.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "ca846d53df1698194c1a577ccf147813")
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !75, line: 60, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !7, file: !6, line: 203, baseType: !78, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!25, !27, !43}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !7, file: !6, line: 211, baseType: !82, size: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!25, !27, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!86 = !{!87, !88}
!87 = !DIEnumerator(name: "APR_BUCKET_DATA", value: 0)
!88 = !DIEnumerator(name: "APR_BUCKET_METADATA", value: 1)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 41, baseType: !65, size: 32, elements: !91)
!90 = !DIFile(filename: "include/util_filter.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "894e51124b630754ca6243e0c50426ad")
!91 = !{!92, !93, !94, !95, !96, !97}
!92 = !DIEnumerator(name: "AP_MODE_READBYTES", value: 0)
!93 = !DIEnumerator(name: "AP_MODE_GETLINE", value: 1)
!94 = !DIEnumerator(name: "AP_MODE_EATCRLF", value: 2)
!95 = !DIEnumerator(name: "AP_MODE_SPECULATIVE", value: 3)
!96 = !DIEnumerator(name: "AP_MODE_EXHAUSTIVE", value: 4)
!97 = !DIEnumerator(name: "AP_MODE_INIT", value: 5)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 158, baseType: !65, size: 32, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105}
!100 = !DIEnumerator(name: "AP_FTYPE_RESOURCE", value: 10)
!101 = !DIEnumerator(name: "AP_FTYPE_CONTENT_SET", value: 20)
!102 = !DIEnumerator(name: "AP_FTYPE_PROTOCOL", value: 30)
!103 = !DIEnumerator(name: "AP_FTYPE_TRANSCODE", value: 40)
!104 = !DIEnumerator(name: "AP_FTYPE_CONNECTION", value: 50)
!105 = !DIEnumerator(name: "AP_FTYPE_NETWORK", value: 60)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !107, line: 1251, baseType: !65, size: 32, elements: !108)
!107 = !DIFile(filename: "include/httpd.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "13796706810e88ffd526cf3216ebbaab")
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117}
!109 = !DIEnumerator(name: "CONN_STATE_CHECK_REQUEST_LINE_READABLE", value: 0)
!110 = !DIEnumerator(name: "CONN_STATE_READ_REQUEST_LINE", value: 1)
!111 = !DIEnumerator(name: "CONN_STATE_HANDLER", value: 2)
!112 = !DIEnumerator(name: "CONN_STATE_WRITE_COMPLETION", value: 3)
!113 = !DIEnumerator(name: "CONN_STATE_SUSPENDED", value: 4)
!114 = !DIEnumerator(name: "CONN_STATE_LINGER", value: 5)
!115 = !DIEnumerator(name: "CONN_STATE_LINGER_NORMAL", value: 6)
!116 = !DIEnumerator(name: "CONN_STATE_LINGER_SHORT", value: 7)
!117 = !DIEnumerator(name: "CONN_STATE_NUM", value: 8)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !107, line: 1264, baseType: !65, size: 32, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIEnumerator(name: "CONN_SENSE_DEFAULT", value: 0)
!121 = !DIEnumerator(name: "CONN_SENSE_WANT_READ", value: 1)
!122 = !DIEnumerator(name: "CONN_SENSE_WANT_WRITE", value: 2)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !107, line: 1136, baseType: !65, size: 32, elements: !124)
!124 = !{!125, !126, !127}
!125 = !DIEnumerator(name: "AP_CONN_UNKNOWN", value: 0)
!126 = !DIEnumerator(name: "AP_CONN_CLOSE", value: 1)
!127 = !DIEnumerator(name: "AP_CONN_KEEPALIVE", value: 2)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !129, line: 62, baseType: !65, size: 32, elements: !130)
!129 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_info.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "58895203e42ced4eaee1557b60315f00")
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139}
!131 = !DIEnumerator(name: "APR_NOFILE", value: 0)
!132 = !DIEnumerator(name: "APR_REG", value: 1)
!133 = !DIEnumerator(name: "APR_DIR", value: 2)
!134 = !DIEnumerator(name: "APR_CHR", value: 3)
!135 = !DIEnumerator(name: "APR_BLK", value: 4)
!136 = !DIEnumerator(name: "APR_PIPE", value: 5)
!137 = !DIEnumerator(name: "APR_LNK", value: 6)
!138 = !DIEnumerator(name: "APR_SOCK", value: 7)
!139 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 296, baseType: !65, size: 32, elements: !142)
!141 = !DIFile(filename: "./mod_dav.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src/modules/dav/main", checksumkind: CSK_MD5, checksum: "b6a8eab5551a9362e9e8d2c4945ac944")
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150}
!143 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_UNKNOWN", value: 0)
!144 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_REGULAR", value: 1)
!145 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_VERSION", value: 2)
!146 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_HISTORY", value: 3)
!147 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_WORKING", value: 4)
!148 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_WORKSPACE", value: 5)
!149 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_ACTIVITY", value: 6)
!150 = !DIEnumerator(name: "DAV_RESOURCE_TYPE_PRIVATE", value: 7)
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 1902, baseType: !65, size: 32, elements: !152)
!152 = !{!153, !154}
!153 = !DIEnumerator(name: "DAV_MODE_WRITE_TRUNC", value: 0)
!154 = !DIEnumerator(name: "DAV_MODE_WRITE_SEEKABLE", value: 1)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 1353, baseType: !65, size: 32, elements: !156)
!156 = !{!157, !158, !159}
!157 = !DIEnumerator(name: "DAV_LOCKREC_DIRECT", value: 0)
!158 = !DIEnumerator(name: "DAV_LOCKREC_INDIRECT", value: 1)
!159 = !DIEnumerator(name: "DAV_LOCKREC_INDIRECT_PARTIAL", value: 2)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 1342, baseType: !65, size: 32, elements: !161)
!161 = !{!162, !163, !164}
!162 = !DIEnumerator(name: "DAV_LOCKSCOPE_UNKNOWN", value: 0)
!163 = !DIEnumerator(name: "DAV_LOCKSCOPE_EXCLUSIVE", value: 1)
!164 = !DIEnumerator(name: "DAV_LOCKSCOPE_SHARED", value: 2)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 1348, baseType: !65, size: 32, elements: !166)
!166 = !{!167, !168}
!167 = !DIEnumerator(name: "DAV_LOCKTYPE_UNKNOWN", value: 0)
!168 = !DIEnumerator(name: "DAV_LOCKTYPE_WRITE", value: 1)
!169 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 2182, baseType: !65, size: 32, elements: !170)
!170 = !{!171, !172, !173}
!171 = !DIEnumerator(name: "DAV_AUTO_VERSION_NEVER", value: 0)
!172 = !DIEnumerator(name: "DAV_AUTO_VERSION_ALWAYS", value: 1)
!173 = !DIEnumerator(name: "DAV_AUTO_VERSION_LOCKED", value: 2)
!174 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cmd_how", file: !175, line: 49, baseType: !65, size: 32, elements: !176)
!175 = !DIFile(filename: "include/http_config.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build/aidengro/spack-stage-httpd-2.4.55-bro7h6vxm4umjopi7zqm3u26chbfh465/spack-src", checksumkind: CSK_MD5, checksum: "478a5811bd142d8034ca8ebc320f852f")
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!177 = !DIEnumerator(name: "RAW_ARGS", value: 0)
!178 = !DIEnumerator(name: "TAKE1", value: 1)
!179 = !DIEnumerator(name: "TAKE2", value: 2)
!180 = !DIEnumerator(name: "ITERATE", value: 3)
!181 = !DIEnumerator(name: "ITERATE2", value: 4)
!182 = !DIEnumerator(name: "FLAG", value: 5)
!183 = !DIEnumerator(name: "NO_ARGS", value: 6)
!184 = !DIEnumerator(name: "TAKE12", value: 7)
!185 = !DIEnumerator(name: "TAKE3", value: 8)
!186 = !DIEnumerator(name: "TAKE23", value: 9)
!187 = !DIEnumerator(name: "TAKE123", value: 10)
!188 = !DIEnumerator(name: "TAKE13", value: 11)
!189 = !DIEnumerator(name: "TAKE_ARGV", value: 12)
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 516, baseType: !65, size: 32, elements: !191)
!191 = !{!192, !193, !194, !195, !196}
!192 = !DIEnumerator(name: "DAV_PROP_INSERT_NOTDEF", value: 0)
!193 = !DIEnumerator(name: "DAV_PROP_INSERT_NOTSUPP", value: 1)
!194 = !DIEnumerator(name: "DAV_PROP_INSERT_NAME", value: 2)
!195 = !DIEnumerator(name: "DAV_PROP_INSERT_VALUE", value: 3)
!196 = !DIEnumerator(name: "DAV_PROP_INSERT_SUPPORTED", value: 4)
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 73, baseType: !65, size: 32, elements: !198)
!198 = !{!199, !200, !201}
!199 = !DIEnumerator(name: "DAV_ENABLED_UNSET", value: 0)
!200 = !DIEnumerator(name: "DAV_ENABLED_OFF", value: 1)
!201 = !DIEnumerator(name: "DAV_ENABLED_ON", value: 2)
!202 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 104, baseType: !65, size: 32, elements: !203)
!203 = !{!204, !205, !206}
!204 = !DIEnumerator(name: "DAV_M_BIND", value: 0)
!205 = !DIEnumerator(name: "DAV_M_SEARCH", value: 1)
!206 = !DIEnumerator(name: "DAV_M_LAST", value: 2)
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 840, baseType: !65, size: 32, elements: !208)
!208 = !{!209, !210, !211}
!209 = !DIEnumerator(name: "dav_if_etag", value: 0)
!210 = !DIEnumerator(name: "dav_if_opaquelock", value: 1)
!211 = !DIEnumerator(name: "dav_if_unknown", value: 2)
!212 = !{!213, !20, !214, !36, !216, !54, !217, !725, !738, !1048, !1061, !1082, !1095, !14, !1108, !1320, !1325, !442, !1326, !1332, !1248, !61}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_prop_ctx", file: !141, line: 1783, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_prop_ctx", file: !141, line: 1762, size: 448, elements: !220)
!220 = !{!221, !225, !265, !266, !267, !268, !271, !285}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "propdb", scope: !219, file: !141, line: 1764, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_propdb", file: !141, line: 1686, baseType: !224)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "dav_propdb", file: !141, line: 1686, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !219, file: !141, line: 1766, baseType: !226, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_xml_elem", file: !228, line: 143, baseType: !229)
!228 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_xml.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "478ff65569ad8360e0ab2190ba58f12e")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_xml_elem", file: !228, line: 162, size: 896, elements: !230)
!230 = !{!231, !232, !233, !234, !247, !248, !250, !251, !252, !260, !261, !264}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !228, line: 164, baseType: !10, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !229, file: !228, line: 166, baseType: !14, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !229, file: !228, line: 168, baseType: !10, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "first_cdata", scope: !229, file: !228, line: 171, baseType: !235, size: 128, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_text_header", file: !228, line: 61, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_text_header", file: !228, line: 64, size: 128, elements: !237)
!237 = !{!238, !246}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !236, file: !228, line: 66, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_text", file: !228, line: 50, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_text", file: !228, line: 53, size: 128, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !241, file: !228, line: 55, baseType: !10, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !228, line: 57, baseType: !245, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !236, file: !228, line: 68, baseType: !239, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "following_cdata", scope: !229, file: !228, line: 173, baseType: !235, size: 128, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !229, file: !228, line: 176, baseType: !249, size: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !228, line: 178, baseType: !249, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "first_child", scope: !229, file: !228, line: 180, baseType: !249, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !229, file: !228, line: 182, baseType: !253, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_xml_attr", file: !228, line: 148, size: 256, elements: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !254, file: !228, line: 150, baseType: !10, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !254, file: !228, line: 152, baseType: !14, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !254, file: !228, line: 155, baseType: !10, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !228, line: 158, baseType: !253, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "last_child", scope: !229, file: !228, line: 186, baseType: !249, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ns_scope", scope: !229, file: !228, line: 188, baseType: !262, size: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_xml_ns_scope", file: !228, line: 188, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !229, file: !228, line: 192, baseType: !20, size: 64, offset: 832)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "operation", scope: !219, file: !141, line: 1768, baseType: !14, size: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "is_liveprop", scope: !219, file: !141, line: 1774, baseType: !14, size: 32, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "liveprop_ctx", scope: !219, file: !141, line: 1775, baseType: !20, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !219, file: !141, line: 1776, baseType: !269, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "dav_rollback_item", file: !141, line: 1776, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !219, file: !141, line: 1778, baseType: !272, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_error", file: !141, line: 135, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_error", file: !141, line: 121, size: 448, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !282, !284}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !274, file: !141, line: 122, baseType: !14, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "error_id", scope: !274, file: !141, line: 123, baseType: !14, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !274, file: !141, line: 124, baseType: !10, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "aprerr", scope: !274, file: !141, line: 126, baseType: !25, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !274, file: !141, line: 128, baseType: !10, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tagname", scope: !274, file: !141, line: 129, baseType: !10, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !274, file: !141, line: 131, baseType: !283, size: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "childtags", scope: !274, file: !141, line: 133, baseType: !10, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !219, file: !141, line: 1781, baseType: !286, size: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_rec", file: !107, line: 811, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request_rec", file: !107, line: 838, size: 5888, elements: !289)
!289 = !{!290, !291, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !584, !585, !586, !587, !588, !589, !590, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !645, !646, !647, !648, !649, !650, !651, !656, !677, !714, !715, !716, !717, !718, !719, !720}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !288, file: !107, line: 840, baseType: !73, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !288, file: !107, line: 842, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_rec", file: !107, line: 809, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_rec", file: !107, line: 1145, size: 1664, elements: !295)
!295 = !{!296, !297, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !482, !539, !540, !541, !543, !552, !553, !554, !555, !556, !557, !559, !560, !563, !564, !569, !570}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !294, file: !107, line: 1147, baseType: !73, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "base_server", scope: !294, file: !107, line: 1149, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_rec", file: !107, line: 807, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_rec", file: !107, line: 1315, size: 1536, elements: !301)
!301 = !{!302, !312, !313, !314, !319, !326, !329, !330, !331, !332, !333, !338, !339, !340, !341, !439, !446, !447, !448, !449, !460, !461, !462, !463, !464, !465, !466, !467}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !300, file: !107, line: 1317, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "process_rec", file: !107, line: 805, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "process_rec", file: !107, line: 822, size: 320, elements: !306)
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !305, file: !107, line: 824, baseType: !73, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pconf", scope: !305, file: !107, line: 826, baseType: !73, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !305, file: !107, line: 828, baseType: !10, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !305, file: !107, line: 830, baseType: !214, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !305, file: !107, line: 832, baseType: !14, size: 32, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !107, line: 1319, baseType: !298, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "error_fname", scope: !300, file: !107, line: 1324, baseType: !216, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error_log", scope: !300, file: !107, line: 1326, baseType: !315, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !317, line: 188, baseType: !318)
!317 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_file_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9f1a845f7255d07e28e3a10d24320b5d")
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !129, line: 212, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !300, file: !107, line: 1328, baseType: !320, size: 128, offset: 256)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_logconf", file: !107, line: 1305, size: 128, elements: !321)
!321 = !{!322, !325}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "module_levels", scope: !320, file: !107, line: 1307, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !320, file: !107, line: 1310, baseType: !14, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "module_config", scope: !300, file: !107, line: 1334, baseType: !327, size: 64, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_conf_vector_t", file: !107, line: 791, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_defaults", scope: !300, file: !107, line: 1336, baseType: !327, size: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "defn_name", scope: !300, file: !107, line: 1339, baseType: !10, size: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "defn_line_number", scope: !300, file: !107, line: 1341, baseType: !65, size: 32, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "is_virtual", scope: !300, file: !107, line: 1343, baseType: !12, size: 8, offset: 608)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !300, file: !107, line: 1349, baseType: !334, size: 16, offset: 624)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_port_t", file: !335, line: 230, baseType: !336)
!335 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_network_io.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "d28b53dbcb33f6acce926c2efb3f7365")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint16_t", file: !44, line: 331, baseType: !337)
!337 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "server_scheme", scope: !300, file: !107, line: 1351, baseType: !10, size: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "server_admin", scope: !300, file: !107, line: 1356, baseType: !216, size: 64, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "server_hostname", scope: !300, file: !107, line: 1358, baseType: !216, size: 64, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !300, file: !107, line: 1363, baseType: !342, size: 64, offset: 832)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "server_addr_rec", file: !107, line: 1293, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "server_addr_rec", file: !107, line: 1294, size: 256, elements: !345)
!345 = !{!346, !347, !348, !438}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !107, line: 1296, baseType: !342, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "virthost", scope: !344, file: !107, line: 1298, baseType: !216, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !344, file: !107, line: 1300, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_sockaddr_t", file: !335, line: 235, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_sockaddr_t", file: !335, line: 239, size: 1536, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !359, !364, !365, !366, !367, !368}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !351, file: !335, line: 241, baseType: !73, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !351, file: !335, line: 243, baseType: !216, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "servname", scope: !351, file: !335, line: 245, baseType: !216, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !351, file: !335, line: 247, baseType: !334, size: 16, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !351, file: !335, line: 249, baseType: !358, size: 32, offset: 224)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !44, line: 333, baseType: !14)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !351, file: !335, line: 251, baseType: !360, size: 32, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_socklen_t", file: !44, line: 382, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !362, line: 33, baseType: !363)
!362 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !53, line: 210, baseType: !65)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_len", scope: !351, file: !335, line: 253, baseType: !14, size: 32, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "addr_str_len", scope: !351, file: !335, line: 256, baseType: !14, size: 32, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ipaddr_ptr", scope: !351, file: !335, line: 259, baseType: !20, size: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !351, file: !335, line: 262, baseType: !349, size: 64, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !351, file: !335, line: 280, baseType: !369, size: 1024, offset: 512)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !351, file: !335, line: 264, size: 1024, elements: !370)
!370 = !{!371, !395, !420, !429}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !369, file: !335, line: 266, baseType: !372, size: 128)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !373, line: 245, size: 128, elements: !374)
!373 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!374 = !{!375, !378, !383, !390}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !372, file: !373, line: 247, baseType: !376, size: 16)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !377, line: 28, baseType: !337)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !372, file: !373, line: 248, baseType: !379, size: 16, offset: 16)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !373, line: 123, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !381, line: 25, baseType: !382)
!381 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !53, line: 40, baseType: !337)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !372, file: !373, line: 249, baseType: !384, size: 32, offset: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !373, line: 31, size: 32, elements: !385)
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !384, file: !373, line: 33, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !373, line: 30, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !381, line: 26, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !53, line: 42, baseType: !65)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !372, file: !373, line: 252, baseType: !391, size: 64, offset: 64)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 64, elements: !393)
!392 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!393 = !{!394}
!394 = !DISubrange(count: 8)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !369, file: !335, line: 269, baseType: !396, size: 224)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !373, line: 260, size: 224, elements: !397)
!397 = !{!398, !399, !400, !401, !419}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !396, file: !373, line: 262, baseType: !376, size: 16)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !396, file: !373, line: 263, baseType: !379, size: 16, offset: 16)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !396, file: !373, line: 264, baseType: !388, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !396, file: !373, line: 265, baseType: !402, size: 128, offset: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !373, line: 219, size: 128, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !402, file: !373, line: 226, baseType: !405, size: 128)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !402, file: !373, line: 221, size: 128, elements: !406)
!406 = !{!407, !413, !415}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !405, file: !373, line: 223, baseType: !408, size: 128)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 128, elements: !411)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !381, line: 24, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !53, line: 38, baseType: !392)
!411 = !{!412}
!412 = !DISubrange(count: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !405, file: !373, line: 224, baseType: !414, size: 128)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 128, elements: !393)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !405, file: !373, line: 225, baseType: !416, size: 128)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 128, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 4)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !396, file: !373, line: 266, baseType: !388, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sas", scope: !369, file: !335, line: 274, baseType: !421, size: 1024)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !362, line: 193, size: 1024, elements: !422)
!422 = !{!423, !424, !428}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !421, file: !362, line: 195, baseType: !376, size: 16)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !421, file: !362, line: 196, baseType: !425, size: 944, offset: 16)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 944, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 118)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !421, file: !362, line: 197, baseType: !47, size: 64, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "unx", scope: !369, file: !335, line: 278, baseType: !430, size: 880)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !431, line: 29, size: 880, elements: !432)
!431 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !430, file: !431, line: 31, baseType: !376, size: 16)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !430, file: !431, line: 32, baseType: !435, size: 864, offset: 16)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 864, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 108)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "host_port", scope: !344, file: !107, line: 1302, baseType: !334, size: 16, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !300, file: !107, line: 1365, baseType: !440, size: 64, offset: 896)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !441, line: 55, baseType: !442)
!441 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_time.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "1a8b9732d4ee010f71e3eb03e6e3a16e")
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !44, line: 371, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !444, line: 27, baseType: !445)
!444 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 44, baseType: !54)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !300, file: !107, line: 1367, baseType: !440, size: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !300, file: !107, line: 1369, baseType: !14, size: 32, offset: 1024)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !300, file: !107, line: 1371, baseType: !14, size: 32, offset: 1056)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !300, file: !107, line: 1374, baseType: !450, size: 64, offset: 1088)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_array_header_t", file: !452, line: 59, baseType: !453)
!452 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_tables.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "82dd315cfdbab9381cd05a1d2abe34a2")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_array_header_t", file: !452, line: 62, size: 256, elements: !454)
!454 = !{!455, !456, !457, !458, !459}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !453, file: !452, line: 64, baseType: !73, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !453, file: !452, line: 66, baseType: !14, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !453, file: !452, line: 68, baseType: !14, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !453, file: !452, line: 70, baseType: !14, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !453, file: !452, line: 72, baseType: !216, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "wild_names", scope: !300, file: !107, line: 1376, baseType: !450, size: 64, offset: 1152)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !300, file: !107, line: 1379, baseType: !10, size: 64, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pathlen", scope: !300, file: !107, line: 1381, baseType: !14, size: 32, offset: 1280)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_line", scope: !300, file: !107, line: 1384, baseType: !14, size: 32, offset: 1312)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fieldsize", scope: !300, file: !107, line: 1386, baseType: !14, size: 32, offset: 1344)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "limit_req_fields", scope: !300, file: !107, line: 1388, baseType: !14, size: 32, offset: 1376)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !300, file: !107, line: 1391, baseType: !20, size: 64, offset: 1408)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout_set", scope: !300, file: !107, line: 1396, baseType: !65, size: 1, offset: 1472, flags: DIFlagBitField, extraData: i64 1472)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vhost_lookup_data", scope: !294, file: !107, line: 1151, baseType: !20, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !294, file: !107, line: 1155, baseType: !349, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "client_addr", scope: !294, file: !107, line: 1159, baseType: !349, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "client_ip", scope: !294, file: !107, line: 1164, baseType: !216, size: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "remote_host", scope: !294, file: !107, line: 1168, baseType: !216, size: 64, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "remote_logname", scope: !294, file: !107, line: 1171, baseType: !216, size: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip", scope: !294, file: !107, line: 1174, baseType: !216, size: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "local_host", scope: !294, file: !107, line: 1177, baseType: !216, size: 64, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !294, file: !107, line: 1180, baseType: !54, size: 64, offset: 640)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "conn_config", scope: !294, file: !107, line: 1183, baseType: !327, size: 64, offset: 704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !294, file: !107, line: 1186, baseType: !479, size: 64, offset: 768)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_table_t", file: !452, line: 56, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_table_t", file: !452, line: 56, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "input_filters", scope: !294, file: !107, line: 1188, baseType: !483, size: 64, offset: 832)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_t", file: !90, line: 259, size: 320, elements: !485)
!485 = !{!486, !535, !536, !537, !538}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "frec", scope: !484, file: !90, line: 263, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_rec_t", file: !90, line: 199, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_rec_t", file: !90, line: 215, size: 448, elements: !490)
!490 = !{!491, !492, !520, !525, !527, !531, !533, !534}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !489, file: !90, line: 217, baseType: !10, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "filter_func", scope: !489, file: !90, line: 220, baseType: !493, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_func", file: !90, line: 146, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ap_filter_func", file: !90, line: 143, size: 64, elements: !495)
!495 = !{!496, !514}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "out_func", scope: !494, file: !90, line: 144, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_out_filter_func", file: !90, line: 134, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!25, !501, !503}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_t", file: !90, line: 94, baseType: !484)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_bucket_brigade", file: !6, line: 119, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_brigade", file: !6, line: 258, size: 256, elements: !506)
!506 = !{!507, !508, !513}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !505, file: !6, line: 264, baseType: !73, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !505, file: !6, line: 273, baseType: !509, size: 128, offset: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_bucket_list", file: !6, line: 273, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !6, line: 273, baseType: !35, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !509, file: !6, line: 273, baseType: !35, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_alloc", scope: !505, file: !6, line: 275, baseType: !58, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "in_func", scope: !494, file: !90, line: 145, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_in_filter_func", file: !90, line: 136, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!25, !501, !503, !519, !63, !49}
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_input_mode_t", file: !90, line: 63, baseType: !89)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "filter_init_func", scope: !489, file: !90, line: 230, baseType: !521, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_init_filter_func", file: !90, line: 141, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!14, !501}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !90, line: 233, baseType: !526, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "providers", scope: !489, file: !90, line: 236, baseType: !528, size: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_provider_t", file: !90, line: 200, baseType: !530)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "ap_filter_provider_t", file: !90, line: 200, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !489, file: !90, line: 243, baseType: !532, size: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_filter_type", file: !90, line: 184, baseType: !98)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !489, file: !90, line: 246, baseType: !14, size: 32, offset: 352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "proto_flags", scope: !489, file: !90, line: 249, baseType: !65, size: 32, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !484, file: !90, line: 266, baseType: !20, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !90, line: 269, baseType: !501, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !484, file: !90, line: 275, baseType: !286, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !484, file: !90, line: 280, baseType: !292, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "output_filters", scope: !294, file: !107, line: 1190, baseType: !483, size: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sbh", scope: !294, file: !107, line: 1192, baseType: !20, size: 64, offset: 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_alloc", scope: !294, file: !107, line: 1194, baseType: !542, size: 64, offset: 1024)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !294, file: !107, line: 1196, baseType: !544, size: 64, offset: 1088)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_state_t", file: !107, line: 813, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_state_t", file: !107, line: 1273, size: 64, elements: !547)
!547 = !{!548, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !546, file: !107, line: 1275, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_state_e", file: !107, line: 1262, baseType: !106)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "sense", scope: !546, file: !107, line: 1277, baseType: !551, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_sense_e", file: !107, line: 1268, baseType: !118)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "data_in_input_filters", scope: !294, file: !107, line: 1198, baseType: !14, size: 32, offset: 1152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "data_in_output_filters", scope: !294, file: !107, line: 1200, baseType: !14, size: 32, offset: 1184)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "clogging_input_filters", scope: !294, file: !107, line: 1205, baseType: !65, size: 1, offset: 1216, flags: DIFlagBitField, extraData: i64 1216)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "double_reverse", scope: !294, file: !107, line: 1209, baseType: !14, size: 2, offset: 1217, flags: DIFlagBitField, extraData: i64 1216)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", scope: !294, file: !107, line: 1212, baseType: !65, size: 32, offset: 1248)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !294, file: !107, line: 1216, baseType: !558, size: 32, offset: 1280)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_conn_keepalive_e", file: !107, line: 1140, baseType: !123)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "keepalives", scope: !294, file: !107, line: 1219, baseType: !14, size: 32, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !294, file: !107, line: 1223, baseType: !561, size: 64, offset: 1344)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !294, file: !107, line: 1228, baseType: !10, size: 64, offset: 1408)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "current_thread", scope: !294, file: !107, line: 1237, baseType: !565, size: 64, offset: 1472)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_thread_t", file: !567, line: 178, baseType: !568)
!567 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_thread_proc.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "86521d0dbb7f1fbad577c4bb2abede6c")
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_t", file: !567, line: 178, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !294, file: !107, line: 1241, baseType: !292, size: 64, offset: 1536)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "outgoing", scope: !294, file: !107, line: 1243, baseType: !14, size: 32, offset: 1600)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !288, file: !107, line: 844, baseType: !298, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !107, line: 847, baseType: !286, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !288, file: !107, line: 849, baseType: !286, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !288, file: !107, line: 853, baseType: !286, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "the_request", scope: !288, file: !107, line: 859, baseType: !216, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "assbackwards", scope: !288, file: !107, line: 861, baseType: !14, size: 32, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "proxyreq", scope: !288, file: !107, line: 866, baseType: !14, size: 32, offset: 480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "header_only", scope: !288, file: !107, line: 868, baseType: !14, size: 32, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "proto_num", scope: !288, file: !107, line: 870, baseType: !14, size: 32, offset: 544)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !288, file: !107, line: 872, baseType: !216, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !288, file: !107, line: 876, baseType: !10, size: 64, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "request_time", scope: !288, file: !107, line: 879, baseType: !583, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !441, line: 45, baseType: !442)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "status_line", scope: !288, file: !107, line: 882, baseType: !10, size: 64, offset: 768)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !288, file: !107, line: 884, baseType: !14, size: 32, offset: 832)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "method_number", scope: !288, file: !107, line: 891, baseType: !14, size: 32, offset: 864)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !288, file: !107, line: 893, baseType: !10, size: 64, offset: 896)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !288, file: !107, line: 915, baseType: !442, size: 64, offset: 960)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_xmethods", scope: !288, file: !107, line: 917, baseType: !450, size: 64, offset: 1024)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_methods", scope: !288, file: !107, line: 919, baseType: !591, size: 64, offset: 1088)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_method_list_t", file: !107, line: 634, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ap_method_list_t", file: !107, line: 643, size: 128, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "method_mask", scope: !593, file: !107, line: 645, baseType: !442, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "method_list", scope: !593, file: !107, line: 647, baseType: !450, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bodyct", scope: !288, file: !107, line: 922, baseType: !49, size: 64, offset: 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_sent", scope: !288, file: !107, line: 924, baseType: !49, size: 64, offset: 1216)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !288, file: !107, line: 926, baseType: !583, size: 64, offset: 1280)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !288, file: !107, line: 931, baseType: !10, size: 64, offset: 1344)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "clength", scope: !288, file: !107, line: 933, baseType: !49, size: 64, offset: 1408)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "chunked", scope: !288, file: !107, line: 935, baseType: !14, size: 32, offset: 1472)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "read_body", scope: !288, file: !107, line: 940, baseType: !14, size: 32, offset: 1504)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "read_chunked", scope: !288, file: !107, line: 942, baseType: !14, size: 32, offset: 1536)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "expecting_100", scope: !288, file: !107, line: 944, baseType: !65, size: 32, offset: 1568)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "kept_body", scope: !288, file: !107, line: 946, baseType: !503, size: 64, offset: 1600)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "body_table", scope: !288, file: !107, line: 950, baseType: !479, size: 64, offset: 1664)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !288, file: !107, line: 952, baseType: !49, size: 64, offset: 1728)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !288, file: !107, line: 954, baseType: !49, size: 64, offset: 1792)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "headers_in", scope: !288, file: !107, line: 969, baseType: !479, size: 64, offset: 1856)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "headers_out", scope: !288, file: !107, line: 971, baseType: !479, size: 64, offset: 1920)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "err_headers_out", scope: !288, file: !107, line: 974, baseType: !479, size: 64, offset: 1984)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "subprocess_env", scope: !288, file: !107, line: 976, baseType: !479, size: 64, offset: 2048)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !288, file: !107, line: 978, baseType: !479, size: 64, offset: 2112)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !288, file: !107, line: 985, baseType: !10, size: 64, offset: 2176)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !288, file: !107, line: 987, baseType: !10, size: 64, offset: 2240)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "content_encoding", scope: !288, file: !107, line: 990, baseType: !10, size: 64, offset: 2304)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "content_languages", scope: !288, file: !107, line: 992, baseType: !450, size: 64, offset: 2368)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vlist_validator", scope: !288, file: !107, line: 995, baseType: !216, size: 64, offset: 2432)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !288, file: !107, line: 998, baseType: !216, size: 64, offset: 2496)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ap_auth_type", scope: !288, file: !107, line: 1000, baseType: !216, size: 64, offset: 2560)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "unparsed_uri", scope: !288, file: !107, line: 1007, baseType: !216, size: 64, offset: 2624)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !288, file: !107, line: 1009, baseType: !216, size: 64, offset: 2688)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !288, file: !107, line: 1011, baseType: !216, size: 64, offset: 2752)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_filename", scope: !288, file: !107, line: 1015, baseType: !216, size: 64, offset: 2816)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "path_info", scope: !288, file: !107, line: 1017, baseType: !216, size: 64, offset: 2880)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !288, file: !107, line: 1019, baseType: !216, size: 64, offset: 2944)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "used_path_info", scope: !288, file: !107, line: 1029, baseType: !14, size: 32, offset: 3008)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "eos_sent", scope: !288, file: !107, line: 1032, baseType: !14, size: 32, offset: 3040)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "per_dir_config", scope: !288, file: !107, line: 1040, baseType: !327, size: 64, offset: 3072)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "request_config", scope: !288, file: !107, line: 1042, baseType: !327, size: 64, offset: 3136)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !288, file: !107, line: 1047, baseType: !561, size: 64, offset: 3200)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "log_id", scope: !288, file: !107, line: 1052, baseType: !10, size: 64, offset: 3264)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "htaccess", scope: !288, file: !107, line: 1060, baseType: !635, size: 64, offset: 3328)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htaccess_result", file: !107, line: 781, size: 320, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !637, file: !107, line: 783, baseType: !10, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !637, file: !107, line: 785, baseType: !14, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "override_opts", scope: !637, file: !107, line: 787, baseType: !14, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "override_list", scope: !637, file: !107, line: 789, baseType: !479, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "htaccess", scope: !637, file: !107, line: 791, baseType: !327, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !107, line: 793, baseType: !635, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "output_filters", scope: !288, file: !107, line: 1063, baseType: !483, size: 64, offset: 3392)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "input_filters", scope: !288, file: !107, line: 1065, baseType: !483, size: 64, offset: 3456)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "proto_output_filters", scope: !288, file: !107, line: 1069, baseType: !483, size: 64, offset: 3520)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "proto_input_filters", scope: !288, file: !107, line: 1072, baseType: !483, size: 64, offset: 3584)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "no_cache", scope: !288, file: !107, line: 1075, baseType: !14, size: 32, offset: 3648)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "no_local_copy", scope: !288, file: !107, line: 1077, baseType: !14, size: 32, offset: 3680)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "invoke_mtx", scope: !288, file: !107, line: 1082, baseType: !652, size: 64, offset: 3712)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_thread_mutex_t", file: !654, line: 41, baseType: !655)
!654 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_thread_mutex.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "333d6b386ebd5ebf2a57c53b3ab4b684")
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !654, line: 41, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "parsed_uri", scope: !288, file: !107, line: 1085, baseType: !657, size: 704, offset: 3776)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uri_t", file: !658, line: 80, baseType: !659)
!658 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-util-1.6.3-l37sacsnb2zk76xejbzfvftzd4gcjj3o/include/apr-1/apr_uri.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "9269047179f727bd075392a12871b578")
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_uri_t", file: !658, line: 85, size: 704, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !673, !674, !675, !676}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !659, file: !658, line: 87, baseType: !216, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "hostinfo", scope: !659, file: !658, line: 89, baseType: !216, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !659, file: !658, line: 91, baseType: !216, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !659, file: !658, line: 93, baseType: !216, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !659, file: !658, line: 95, baseType: !216, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "port_str", scope: !659, file: !658, line: 97, baseType: !216, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !659, file: !658, line: 99, baseType: !216, size: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !659, file: !658, line: 101, baseType: !216, size: 64, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !659, file: !658, line: 103, baseType: !216, size: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "hostent", scope: !659, file: !658, line: 106, baseType: !671, size: 64, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", file: !658, line: 106, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !659, file: !658, line: 109, baseType: !334, size: 16, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !659, file: !658, line: 112, baseType: !65, size: 1, offset: 656, flags: DIFlagBitField, extraData: i64 656)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dns_looked_up", scope: !659, file: !658, line: 115, baseType: !65, size: 1, offset: 657, flags: DIFlagBitField, extraData: i64 656)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dns_resolved", scope: !659, file: !658, line: 117, baseType: !65, size: 1, offset: 658, flags: DIFlagBitField, extraData: i64 656)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "finfo", scope: !288, file: !107, line: 1087, baseType: !678, size: 960, offset: 4480)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_finfo_t", file: !129, line: 143, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !129, line: 174, size: 960, elements: !680)
!680 = !{!681, !682, !683, !685, !687, !692, !696, !700, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !679, file: !129, line: 176, baseType: !73, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !679, file: !129, line: 179, baseType: !358, size: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !679, file: !129, line: 181, baseType: !684, size: 32, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !129, line: 125, baseType: !358)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !679, file: !129, line: 186, baseType: !686, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !129, line: 72, baseType: !128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !679, file: !129, line: 188, baseType: !688, size: 32, offset: 160)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !689, line: 45, baseType: !690)
!689 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/apr-1.7.4-xap43yqog3cx4varfxeol7h4nsfslylk/include/apr-1/apr_user.h", directory: "/local-ssd/httpd-bro7h6vxm4umjopi7zqm3u26chbfh465-build", checksumkind: CSK_MD5, checksum: "724f26fd838740b0ca4b55f59030741b")
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !51, line: 79, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !53, line: 146, baseType: !65)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !679, file: !129, line: 190, baseType: !693, size: 32, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !689, line: 54, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !51, line: 64, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !53, line: 147, baseType: !65)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !679, file: !129, line: 192, baseType: !697, size: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !44, line: 383, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !51, line: 47, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !53, line: 148, baseType: !47)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !679, file: !129, line: 194, baseType: !701, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !129, line: 135, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !51, line: 59, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !53, line: 145, baseType: !47)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !679, file: !129, line: 196, baseType: !358, size: 32, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !679, file: !129, line: 198, baseType: !49, size: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !679, file: !129, line: 200, baseType: !49, size: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !679, file: !129, line: 202, baseType: !583, size: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !679, file: !129, line: 204, baseType: !583, size: 64, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !679, file: !129, line: 206, baseType: !583, size: 64, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !679, file: !129, line: 208, baseType: !10, size: 64, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !679, file: !129, line: 210, baseType: !10, size: 64, offset: 832)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !679, file: !129, line: 212, baseType: !713, size: 64, offset: 896)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_addr", scope: !288, file: !107, line: 1093, baseType: !349, size: 64, offset: 5440)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_ip", scope: !288, file: !107, line: 1094, baseType: !216, size: 64, offset: 5504)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "trailers_in", scope: !288, file: !107, line: 1097, baseType: !479, size: 64, offset: 5568)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "trailers_out", scope: !288, file: !107, line: 1099, baseType: !479, size: 64, offset: 5632)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "useragent_host", scope: !288, file: !107, line: 1104, baseType: !216, size: 64, offset: 5696)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "double_reverse", scope: !288, file: !107, line: 1108, baseType: !14, size: 32, offset: 5760)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bnotes", scope: !288, file: !107, line: 1113, baseType: !721, size: 64, offset: 5824)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ap_request_bnotes_t", file: !107, line: 662, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uint64_t", file: !44, line: 372, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !381, line: 27, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !53, line: 45, baseType: !47)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_LINK_gather_propsets_t", file: !141, line: 697, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_LINK_gather_propsets_t", file: !141, line: 697, size: 320, elements: !728)
!728 = !{!729, !734, !735, !736, !737}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pFunc", scope: !727, file: !141, line: 697, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_HOOK_gather_propsets_t", file: !141, line: 697, baseType: !732)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !450}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "szName", scope: !727, file: !141, line: 697, baseType: !10, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "aszPredecessors", scope: !727, file: !141, line: 697, baseType: !214, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "aszSuccessors", scope: !727, file: !141, line: 697, baseType: !214, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "nOrder", scope: !727, file: !141, line: 697, baseType: !14, size: 32, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_LINK_find_liveprop_t", file: !141, line: 711, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_LINK_find_liveprop_t", file: !141, line: 711, size: 320, elements: !741)
!741 = !{!742, !1044, !1045, !1046, !1047}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pFunc", scope: !740, file: !141, line: 711, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_HOOK_find_liveprop_t", file: !141, line: 711, baseType: !745)
!745 = !DISubroutineType(types: !746)
!746 = !{!14, !747, !10, !10, !1004}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_resource", file: !141, line: 421, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_resource", file: !141, line: 387, size: 448, elements: !751)
!751 = !{!752, !754, !755, !756, !757, !758, !759, !760, !764, !1003}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !750, file: !141, line: 388, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_resource_type", file: !141, line: 315, baseType: !140)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !750, file: !141, line: 390, baseType: !14, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "collection", scope: !750, file: !141, line: 392, baseType: !14, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "versioned", scope: !750, file: !141, line: 396, baseType: !14, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "baselined", scope: !750, file: !141, line: 400, baseType: !14, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "working", scope: !750, file: !141, line: 404, baseType: !14, size: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !750, file: !141, line: 408, baseType: !10, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !750, file: !141, line: 412, baseType: !761, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_resource_private", file: !141, line: 320, baseType: !763)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "dav_resource_private", file: !141, line: 320, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !750, file: !141, line: 414, baseType: !765, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_hooks_repository", file: !141, line: 270, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_hooks_repository", file: !141, line: 1914, size: 1280, elements: !769)
!769 = !{!770, !771, !777, !781, !785, !786, !795, !799, !805, !809, !813, !817, !821, !841, !845, !849, !996, !997, !998, !1002}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "handle_get", scope: !768, file: !141, line: 1922, baseType: !14, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "get_resource", scope: !768, file: !141, line: 1947, baseType: !772, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!272, !286, !10, !10, !14, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent_resource", scope: !768, file: !141, line: 1962, baseType: !778, size: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!272, !747, !775}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "is_same_resource", scope: !768, file: !141, line: 1971, baseType: !782, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!14, !747, !747}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "is_parent_resource", scope: !768, file: !141, line: 1981, baseType: !782, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "open_stream", scope: !768, file: !141, line: 1990, baseType: !787, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!272, !747, !790, !791}
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_stream_mode", file: !141, line: 1905, baseType: !151)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_stream", file: !141, line: 1900, baseType: !794)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "dav_stream", file: !141, line: 1900, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "close_stream", scope: !768, file: !141, line: 2010, baseType: !796, size: 64, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!272, !792, !14}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "write_stream", scope: !768, file: !141, line: 2017, baseType: !800, size: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!272, !792, !803, !43}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "seek_stream", scope: !768, file: !141, line: 2027, baseType: !806, size: 64, offset: 512)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!272, !792, !49}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "set_headers", scope: !768, file: !141, line: 2040, baseType: !810, size: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!272, !286, !747}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "deliver", scope: !768, file: !141, line: 2056, baseType: !814, size: 64, offset: 640)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!272, !747, !501}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "create_collection", scope: !768, file: !141, line: 2065, baseType: !818, size: 64, offset: 704)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!272, !776}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "copy_resource", scope: !768, file: !141, line: 2082, baseType: !822, size: 64, offset: 768)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!272, !747, !776, !14, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_response", file: !141, line: 188, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dav_response", file: !141, line: 492, size: 384, elements: !829)
!829 = !{!830, !831, !832, !838, !839}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "href", scope: !828, file: !141, line: 494, baseType: !10, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !828, file: !141, line: 495, baseType: !10, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "propresult", scope: !828, file: !141, line: 498, baseType: !833, size: 128, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_get_props_result", file: !141, line: 489, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 485, size: 128, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "propstats", scope: !834, file: !141, line: 487, baseType: !239, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "xmlns", scope: !834, file: !141, line: 488, baseType: !239, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !828, file: !141, line: 500, baseType: !14, size: 32, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !828, file: !141, line: 502, baseType: !840, size: 64, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "move_resource", scope: !768, file: !141, line: 2097, baseType: !842, size: 64, offset: 832)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!272, !776, !776, !825}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "remove_resource", scope: !768, file: !141, line: 2110, baseType: !846, size: 64, offset: 896)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!272, !776, !825}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "walk", scope: !768, file: !141, line: 2126, baseType: !850, size: 64, offset: 960)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!272, !853, !14, !825}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_walk_params", file: !141, line: 1840, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 1820, size: 384, elements: !857)
!857 = !{!858, !859, !871, !872, !873, !874}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !856, file: !141, line: 1822, baseType: !14, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !856, file: !141, line: 1828, baseType: !860, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!272, !863, !14}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_walk_resource", file: !141, line: 1818, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 1804, size: 256, elements: !866)
!866 = !{!867, !868, !869, !870}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "walk_ctx", scope: !865, file: !141, line: 1807, baseType: !20, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !865, file: !141, line: 1810, baseType: !73, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "resource", scope: !865, file: !141, line: 1813, baseType: !747, size: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !865, file: !141, line: 1816, baseType: !826, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "walk_ctx", scope: !856, file: !141, line: 1829, baseType: !20, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !856, file: !141, line: 1832, baseType: !73, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !856, file: !141, line: 1835, baseType: !747, size: 64, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lockdb", scope: !856, file: !141, line: 1838, baseType: !875, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "dav_lockdb", file: !141, line: 1340, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 1333, size: 192, elements: !878)
!878 = !{!879, !991, !992}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !877, file: !141, line: 1335, baseType: !880, size: 64)
