; ModuleID = 'samples/918.bc'
source_filename = "zipcmp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type { ptr, ptr, i64, ptr, ptr, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._ftsent = type { ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i16, i16, i64, i64, i64, i16, i16, i16, i16, ptr, [1 x i8] }
%struct.entry = type { ptr, i64, i32, i32, ptr, i16, ptr, i32 }
%struct.zip_stat = type { i64, ptr, i64, i64, i64, i64, i32, i16, i16, i32 }
%struct.zip_error = type { i32, i32, ptr }
%struct.ef = type { ptr, i16, i16, i16, ptr }

@help_head = dso_local global [54 x i8] c"zipcmp (libzip) by Dieter Baron and Thomas Klausner\0A\0A\00", align 16, !dbg !0
@help = dso_local global [338 x i8] c"\0A  -h       display this help message\0A  -i       compare names ignoring case distinctions\0A  -p       compare as many details as possible\0A  -q       be quiet\0A  -t       test zip files (compare file contents to checksum)\0A  -V       display version number\0A  -v       be verbose (print differences, default)\0A\0AReport bugs to <libzip@nih.at>.\0A\00", align 16, !dbg !67

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "help_head", scope: !2, file: !3, line: 95, type: !214, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !66, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "zipcmp.c", directory: "/local-ssd/libzip-es3wf7bj327ackexr3iovsw37h3bpw5f-build/aidengro/spack-stage-libzip-1.3.2-es3wf7bj327ackexr3iovsw37h3bpw5f/spack-src/src", checksumkind: CSK_MD5, checksum: "d089923c99e2b7d8a08ce295a3b39648")
!4 = !{!5, !8, !10, !11, !18, !21, !22, !27, !58, !60, !42, !35, !65, !39, !17}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint64_t", file: !12, line: 43, baseType: !13)
!12 = !DIFile(filename: "../lib/zipconf.h", directory: "/local-ssd/libzip-es3wf7bj327ackexr3iovsw37h3bpw5f-build/aidengro/spack-stage-libzip-1.3.2-es3wf7bj327ackexr3iovsw37h3bpw5f/spack-src/src", checksumkind: CSK_MD5, checksum: "7cb5f99232d7b54e05c9f9d3c2375652")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !14, line: 27, baseType: !15)
!14 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !16, line: 45, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!17 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint32_t", file: !12, line: 36, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !14, line: 26, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !16, line: 42, baseType: !21)
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_int64_t", file: !12, line: 39, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !24, line: 27, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !16, line: 44, baseType: !26)
!26 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "entry", file: !3, line: 77, size: 448, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !55, !56, !57}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !3, line: 78, baseType: !8, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !3, line: 79, baseType: !11, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !28, file: !3, line: 80, baseType: !18, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !28, file: !3, line: 81, baseType: !18, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "extra_fields", scope: !28, file: !3, line: 82, baseType: !35, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ef", file: !3, line: 69, size: 192, elements: !37)
!37 = !{!38, !41, !46, !47, !48}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !3, line: 70, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !3, line: 71, baseType: !42, size: 16, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint16_t", file: !12, line: 29, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !14, line: 25, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !16, line: 40, baseType: !45)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !36, file: !3, line: 72, baseType: !42, size: 16, offset: 80)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !3, line: 73, baseType: !42, size: 16, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !36, file: !3, line: 74, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint8_t", file: !12, line: 22, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !14, line: 24, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !16, line: 38, baseType: !54)
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "n_extra_fields", scope: !28, file: !3, line: 83, baseType: !42, size: 16, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !28, file: !3, line: 84, baseType: !39, size: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "comment_length", scope: !28, file: !3, line: 85, baseType: !18, size: 32, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !59, line: 70, baseType: !17)
!59 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !63, line: 122, baseType: !64)
!63 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_/linux-ubuntu22.04-zen2/clang-18.0.0/zlib-ng-2.1.4-lf6r7k4krys7xeuhd6faiwtpvvvf43ts/include/zconf.h", directory: "/local-ssd/libzip-es3wf7bj327ackexr3iovsw37h3bpw5f-build", checksumkind: CSK_MD5, checksum: "56ad34ae1afb4a00ae966a76a3620886")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !63, line: 121, baseType: !54)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !{!0, !67, !72, !77, !82, !87, !89, !91, !93, !95, !97, !99, !104, !106, !111, !116, !121, !126, !131, !136, !138, !143, !148, !153, !158, !163, !168, !173, !178, !180, !185, !190, !195, !200, !202, !207, !212}
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "help", scope: !2, file: !3, line: 98, type: !69, isLocal: false, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2704, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 338)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "version_string", scope: !2, file: !3, line: 109, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1232, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 154)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(scope: null, file: !3, line: 155, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 64, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 8)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(scope: null, file: !3, line: 175, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 320, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 40)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "prg", scope: !2, file: !3, line: 89, type: !39, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "ignore_case", scope: !2, file: !3, line: 139, type: !65, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "test_files", scope: !2, file: !3, line: 139, type: !65, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "paranoid", scope: !2, file: !3, line: 139, type: !65, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 139, type: !65, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "header_done", scope: !2, file: !3, line: 140, type: !65, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(scope: null, file: !3, line: 243, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 216, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 27)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(scope: null, file: !3, line: 244, type: !101, isLocal: true, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(scope: null, file: !3, line: 323, type: !108, isLocal: true, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 280, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 35)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !3, line: 355, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !3, line: 379, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 304, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 38)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !3, line: 276, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 16, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 2)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !3, line: 277, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 184, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 23)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !3, line: 286, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 208, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 26)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !3, line: 399, type: !118, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !3, line: 694, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 328, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 41)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !3, line: 707, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 344, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 43)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !3, line: 715, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 424, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 53)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !3, line: 719, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 408, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 51)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !3, line: 499, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 120, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 15)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !3, line: 499, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 4)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !3, line: 646, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 232, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 29)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !3, line: 647, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 88, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 11)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !3, line: 648, type: !170, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !3, line: 660, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 96, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 12)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !3, line: 595, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 200, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 25)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !3, line: 596, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 80, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 10)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !3, line: 598, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 56, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 7)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !3, line: 598, type: !123, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !3, line: 598, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 1)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !3, line: 599, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 24, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 3)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !3, line: 680, type: !160, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 432, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 54)
!217 = !{i32 7, !"Dwarf Version", i32 5}
!218 = !{i32 2, !"Debug Info Version", i32 3}
!219 = !{i32 1, !"wchar_size", i32 4}
!220 = !{i32 8, !"PIC Level", i32 2}
!221 = !{i32 7, !"PIE Level", i32 2}
!222 = !{i32 7, !"uwtable", i32 2}
!223 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!224 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 144, type: !225, scopeLine: 145, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !229)
!225 = !DISubroutineType(types: !226)
!226 = !{!65, !65, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!229 = !{!230, !231, !232}
!230 = !DILocalVariable(name: "argc", arg: 1, scope: !224, file: !3, line: 144, type: !65)
!231 = !DILocalVariable(name: "argv", arg: 2, scope: !224, file: !3, line: 144, type: !227)
!232 = !DILocalVariable(name: "c", scope: !224, file: !3, line: 146, type: !65)
!233 = !{!234, !234, i64 0}
!234 = !{!"int", !235, i64 0}
!235 = !{!"omnipotent char", !236, i64 0}
!236 = !{!"Simple C/C++ TBAA"}
!237 = !DILocation(line: 144, column: 10, scope: !224)
!238 = !{!239, !239, i64 0}
!239 = !{!"any pointer", !235, i64 0}
!240 = !DILocation(line: 144, column: 29, scope: !224)
!241 = !DILocation(line: 146, column: 5, scope: !224)
!242 = !DILocation(line: 146, column: 9, scope: !224)
!243 = !DILocation(line: 148, column: 11, scope: !224)
!244 = !DILocation(line: 148, column: 9, scope: !224)
!245 = !DILocation(line: 150, column: 17, scope: !224)
!246 = !DILocation(line: 151, column: 16, scope: !224)
!247 = !DILocation(line: 152, column: 14, scope: !224)
!248 = !DILocation(line: 153, column: 13, scope: !224)
!249 = !DILocation(line: 155, column: 5, scope: !224)
!250 = !DILocation(line: 155, column: 22, scope: !224)
!251 = !DILocation(line: 155, column: 28, scope: !224)
!252 = !DILocation(line: 155, column: 15, scope: !224)
!253 = !DILocation(line: 155, column: 14, scope: !224)
!254 = !DILocation(line: 155, column: 44, scope: !224)
!255 = !DILocation(line: 156, column: 10, scope: !256)
!256 = distinct !DILexicalBlock(scope: !224, file: !3, line: 155, column: 51)
!257 = !DILocation(line: 156, column: 2, scope: !256)
!258 = !DILocation(line: 158, column: 18, scope: !259)
!259 = distinct !DILexicalBlock(scope: !256, file: !3, line: 156, column: 13)
!260 = !DILocation(line: 159, column: 6, scope: !259)
!261 = !DILocation(line: 161, column: 15, scope: !259)
!262 = !DILocation(line: 162, column: 6, scope: !259)
!263 = !DILocation(line: 164, column: 14, scope: !259)
!264 = !DILocation(line: 165, column: 6, scope: !259)
!265 = !DILocation(line: 167, column: 17, scope: !259)
!266 = !DILocation(line: 168, column: 6, scope: !259)
!267 = !DILocation(line: 170, column: 14, scope: !259)
!268 = !DILocation(line: 171, column: 6, scope: !259)
!269 = !DILocation(line: 174, column: 23, scope: !259)
!270 = !DILocation(line: 174, column: 6, scope: !259)
!271 = !DILocation(line: 175, column: 20, scope: !259)
!272 = !DILocation(line: 175, column: 6, scope: !259)
!273 = !DILocation(line: 176, column: 18, scope: !259)
!274 = !DILocation(line: 176, column: 6, scope: !259)
!275 = !DILocation(line: 177, column: 6, scope: !259)
!276 = !DILocation(line: 179, column: 28, scope: !259)
!277 = !DILocation(line: 179, column: 6, scope: !259)
!278 = !DILocation(line: 180, column: 6, scope: !259)
!279 = !DILocation(line: 183, column: 14, scope: !259)
!280 = !DILocation(line: 183, column: 29, scope: !259)
!281 = !DILocation(line: 183, column: 6, scope: !259)
!282 = !DILocation(line: 184, column: 6, scope: !259)
!283 = distinct !{!283, !249, !284, !285}
!284 = !DILocation(line: 186, column: 5, scope: !224)
!285 = !{!"llvm.loop.mustprogress"}
!286 = !DILocation(line: 188, column: 9, scope: !287)
!287 = distinct !DILexicalBlock(scope: !224, file: !3, line: 188, column: 9)
!288 = !DILocation(line: 188, column: 17, scope: !287)
!289 = !DILocation(line: 188, column: 23, scope: !287)
!290 = !DILocation(line: 188, column: 14, scope: !287)
!291 = !DILocation(line: 188, column: 9, scope: !224)
!292 = !DILocation(line: 189, column: 10, scope: !293)
!293 = distinct !DILexicalBlock(scope: !287, file: !3, line: 188, column: 27)
!294 = !DILocation(line: 189, column: 25, scope: !293)
!295 = !DILocation(line: 189, column: 2, scope: !293)
!296 = !DILocation(line: 190, column: 2, scope: !293)
!297 = !DILocation(line: 193, column: 23, scope: !224)
!298 = !DILocation(line: 193, column: 28, scope: !224)
!299 = !DILocation(line: 193, column: 27, scope: !224)
!300 = !DILocation(line: 193, column: 11, scope: !224)
!301 = !DILocation(line: 193, column: 36, scope: !224)
!302 = !DILocation(line: 193, column: 10, scope: !224)
!303 = !DILocation(line: 193, column: 5, scope: !224)
!304 = !DISubprogram(name: "getopt", scope: !305, file: !305, line: 91, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!305 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_core.h", directory: "", checksumkind: CSK_MD5, checksum: "81ab788980ce9d5be2ba931a6ae17301")
!306 = !DISubroutineType(types: !307)
!307 = !{!65, !65, !227, !39}
!308 = !DISubprogram(name: "fputs", scope: !309, file: !309, line: 655, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!309 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!310 = !DISubroutineType(types: !311)
!311 = !{!65, !312, !313}
!312 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!313 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !316, line: 7, baseType: !317)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !318, line: 49, size: 1728, elements: !319)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !335, !337, !338, !339, !341, !342, !344, !345, !348, !350, !353, !356, !357, !358, !359, !360}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !317, file: !318, line: 51, baseType: !65, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !317, file: !318, line: 54, baseType: !8, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !317, file: !318, line: 55, baseType: !8, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !317, file: !318, line: 56, baseType: !8, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !317, file: !318, line: 57, baseType: !8, size: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !317, file: !318, line: 58, baseType: !8, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !317, file: !318, line: 59, baseType: !8, size: 64, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !317, file: !318, line: 60, baseType: !8, size: 64, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !317, file: !318, line: 61, baseType: !8, size: 64, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !317, file: !318, line: 64, baseType: !8, size: 64, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !317, file: !318, line: 65, baseType: !8, size: 64, offset: 640)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !317, file: !318, line: 66, baseType: !8, size: 64, offset: 704)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !317, file: !318, line: 68, baseType: !333, size: 64, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !318, line: 36, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !317, file: !318, line: 70, baseType: !336, size: 64, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !317, file: !318, line: 72, baseType: !65, size: 32, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !317, file: !318, line: 73, baseType: !65, size: 32, offset: 928)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !317, file: !318, line: 74, baseType: !340, size: 64, offset: 960)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 152, baseType: !26)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !317, file: !318, line: 77, baseType: !45, size: 16, offset: 1024)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !317, file: !318, line: 78, baseType: !343, size: 8, offset: 1040)
!343 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !317, file: !318, line: 79, baseType: !204, size: 8, offset: 1048)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !317, file: !318, line: 81, baseType: !346, size: 64, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !318, line: 43, baseType: null)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !317, file: !318, line: 89, baseType: !349, size: 64, offset: 1152)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 153, baseType: !26)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !317, file: !318, line: 91, baseType: !351, size: 64, offset: 1216)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !318, line: 37, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !317, file: !318, line: 92, baseType: !354, size: 64, offset: 1280)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !318, line: 38, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !317, file: !318, line: 93, baseType: !336, size: 64, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !317, file: !318, line: 94, baseType: !10, size: 64, offset: 1408)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !317, file: !318, line: 95, baseType: !58, size: 64, offset: 1472)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !317, file: !318, line: 96, baseType: !65, size: 32, offset: 1536)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !317, file: !318, line: 98, baseType: !113, size: 160, offset: 1568)
!361 = !DISubprogram(name: "printf", scope: !309, file: !309, line: 356, type: !362, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!362 = !DISubroutineType(types: !363)
!363 = !{!65, !312, null}
!364 = !DISubprogram(name: "exit", scope: !365, file: !365, line: 624, type: !366, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!365 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!366 = !DISubroutineType(types: !367)
!367 = !{null, !65}
!368 = !DISubprogram(name: "fprintf", scope: !309, file: !309, line: 350, type: !369, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!369 = !DISubroutineType(types: !370)
!370 = !{!65, !313, !312, null}
!371 = distinct !DISubprogram(name: "compare_zip", scope: !3, file: !3, line: 198, type: !372, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !374)
!372 = !DISubroutineType(types: !373)
!373 = !{!65, !227}
!374 = !{!375, !376, !390, !392, !394, !395}
!375 = !DILocalVariable(name: "zn", arg: 1, scope: !371, file: !3, line: 198, type: !227)
!376 = !DILocalVariable(name: "a", scope: !371, file: !3, line: 200, type: !377)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 768, elements: !124)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !3, line: 60, size: 384, elements: !379)
!379 = !{!380, !381, !386, !387, !388, !389}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !378, file: !3, line: 61, baseType: !39, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "za", scope: !378, file: !3, line: 62, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_t", file: !384, line: 303, baseType: !385)
!384 = !DIFile(filename: "../lib/zip.h", directory: "/local-ssd/libzip-es3wf7bj327ackexr3iovsw37h3bpw5f-build/aidengro/spack-stage-libzip-1.3.2-es3wf7bj327ackexr3iovsw37h3bpw5f/spack-src/src", checksumkind: CSK_MD5, checksum: "6758aaa3e0d08949c1a3d4b0a3aed88b")
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "zip", file: !384, line: 299, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nentry", scope: !378, file: !3, line: 63, baseType: !11, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !378, file: !3, line: 64, baseType: !27, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !378, file: !3, line: 65, baseType: !39, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "comment_length", scope: !378, file: !3, line: 66, baseType: !58, size: 64, offset: 320)
!390 = !DILocalVariable(name: "e", scope: !371, file: !3, line: 201, type: !391)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !124)
!392 = !DILocalVariable(name: "n", scope: !371, file: !3, line: 202, type: !393)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 128, elements: !124)
!394 = !DILocalVariable(name: "i", scope: !371, file: !3, line: 203, type: !65)
!395 = !DILocalVariable(name: "res", scope: !371, file: !3, line: 204, type: !65)
!396 = !DILocation(line: 198, column: 26, scope: !371)
!397 = !DILocation(line: 200, column: 5, scope: !371)
!398 = !DILocation(line: 200, column: 20, scope: !371)
!399 = !DILocation(line: 201, column: 5, scope: !371)
!400 = !DILocation(line: 201, column: 19, scope: !371)
!401 = !DILocation(line: 202, column: 5, scope: !371)
!402 = !DILocation(line: 202, column: 18, scope: !371)
!403 = !DILocation(line: 203, column: 5, scope: !371)
!404 = !DILocation(line: 203, column: 9, scope: !371)
!405 = !DILocation(line: 204, column: 5, scope: !371)
!406 = !DILocation(line: 204, column: 9, scope: !371)
!407 = !DILocation(line: 206, column: 11, scope: !408)
!408 = distinct !DILexicalBlock(scope: !371, file: !3, line: 206, column: 5)
!409 = !DILocation(line: 206, column: 10, scope: !408)
!410 = !DILocation(line: 206, column: 15, scope: !411)
!411 = distinct !DILexicalBlock(scope: !408, file: !3, line: 206, column: 5)
!412 = !DILocation(line: 206, column: 16, scope: !411)
!413 = !DILocation(line: 206, column: 5, scope: !408)
!414 = !DILocation(line: 207, column: 14, scope: !415)
!415 = distinct !DILexicalBlock(scope: !411, file: !3, line: 206, column: 25)
!416 = !DILocation(line: 207, column: 17, scope: !415)
!417 = !DILocation(line: 207, column: 4, scope: !415)
!418 = !DILocation(line: 207, column: 2, scope: !415)
!419 = !DILocation(line: 207, column: 7, scope: !415)
!420 = !DILocation(line: 207, column: 12, scope: !415)
!421 = !{!422, !239, i64 0}
!422 = !{!"archive", !239, i64 0, !239, i64 8, !423, i64 16, !239, i64 24, !239, i64 32, !423, i64 40}
!423 = !{!"long", !235, i64 0}
!424 = !DILocation(line: 208, column: 4, scope: !415)
!425 = !DILocation(line: 208, column: 2, scope: !415)
!426 = !DILocation(line: 208, column: 7, scope: !415)
!427 = !DILocation(line: 208, column: 13, scope: !415)
!428 = !{!422, !239, i64 24}
!429 = !DILocation(line: 209, column: 4, scope: !415)
!430 = !DILocation(line: 209, column: 2, scope: !415)
!431 = !DILocation(line: 209, column: 7, scope: !415)
!432 = !DILocation(line: 209, column: 14, scope: !415)
!433 = !{!422, !423, i64 16}
!434 = !DILocation(line: 210, column: 4, scope: !415)
!435 = !DILocation(line: 210, column: 2, scope: !415)
!436 = !DILocation(line: 210, column: 7, scope: !415)
!437 = !DILocation(line: 210, column: 10, scope: !415)
!438 = !{!422, !239, i64 8}
!439 = !DILocation(line: 211, column: 4, scope: !415)
!440 = !DILocation(line: 211, column: 2, scope: !415)
!441 = !DILocation(line: 211, column: 7, scope: !415)
!442 = !DILocation(line: 211, column: 15, scope: !415)
!443 = !{!422, !239, i64 32}
!444 = !DILocation(line: 212, column: 4, scope: !415)
!445 = !DILocation(line: 212, column: 2, scope: !415)
!446 = !DILocation(line: 212, column: 7, scope: !415)
!447 = !DILocation(line: 212, column: 22, scope: !415)
!448 = !{!422, !423, i64 40}
!449 = !DILocation(line: 214, column: 19, scope: !450)
!450 = distinct !DILexicalBlock(scope: !415, file: !3, line: 214, column: 6)
!451 = !DILocation(line: 214, column: 22, scope: !450)
!452 = !DILocation(line: 214, column: 6, scope: !450)
!453 = !DILocation(line: 214, column: 6, scope: !415)
!454 = !DILocation(line: 219, column: 25, scope: !455)
!455 = distinct !DILexicalBlock(scope: !456, file: !3, line: 219, column: 10)
!456 = distinct !DILexicalBlock(scope: !450, file: !3, line: 214, column: 27)
!457 = !DILocation(line: 219, column: 28, scope: !455)
!458 = !DILocation(line: 219, column: 32, scope: !455)
!459 = !DILocation(line: 219, column: 34, scope: !455)
!460 = !DILocation(line: 219, column: 33, scope: !455)
!461 = !DILocation(line: 219, column: 10, scope: !455)
!462 = !DILocation(line: 219, column: 37, scope: !455)
!463 = !DILocation(line: 219, column: 10, scope: !456)
!464 = !DILocation(line: 220, column: 3, scope: !455)
!465 = !DILocation(line: 221, column: 15, scope: !456)
!466 = !DILocation(line: 223, column: 2, scope: !456)
!467 = !DILocation(line: 225, column: 19, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !3, line: 225, column: 10)
!469 = distinct !DILexicalBlock(scope: !450, file: !3, line: 224, column: 7)
!470 = !DILocation(line: 225, column: 22, scope: !468)
!471 = !DILocation(line: 225, column: 26, scope: !468)
!472 = !DILocation(line: 225, column: 28, scope: !468)
!473 = !DILocation(line: 225, column: 27, scope: !468)
!474 = !DILocation(line: 225, column: 10, scope: !468)
!475 = !DILocation(line: 225, column: 31, scope: !468)
!476 = !DILocation(line: 225, column: 10, scope: !469)
!477 = !DILocation(line: 226, column: 3, scope: !468)
!478 = !DILocation(line: 228, column: 8, scope: !479)
!479 = distinct !DILexicalBlock(scope: !415, file: !3, line: 228, column: 6)
!480 = !DILocation(line: 228, column: 6, scope: !479)
!481 = !DILocation(line: 228, column: 11, scope: !479)
!482 = !DILocation(line: 228, column: 18, scope: !479)
!483 = !DILocation(line: 228, column: 6, scope: !415)
!484 = !DILocation(line: 229, column: 14, scope: !479)
!485 = !DILocation(line: 229, column: 12, scope: !479)
!486 = !DILocation(line: 229, column: 17, scope: !479)
!487 = !DILocation(line: 229, column: 26, scope: !479)
!488 = !DILocation(line: 229, column: 24, scope: !479)
!489 = !DILocation(line: 229, column: 29, scope: !479)
!490 = !DILocation(line: 229, column: 6, scope: !479)
!491 = !DILocation(line: 230, column: 5, scope: !415)
!492 = !DILocation(line: 206, column: 21, scope: !411)
!493 = !DILocation(line: 206, column: 5, scope: !411)
!494 = distinct !{!494, !413, !495, !285}
!495 = !DILocation(line: 230, column: 5, scope: !408)
!496 = !DILocation(line: 232, column: 17, scope: !371)
!497 = !DILocation(line: 234, column: 12, scope: !371)
!498 = !DILocation(line: 234, column: 17, scope: !371)
!499 = !DILocation(line: 234, column: 5, scope: !371)
!500 = !DILocation(line: 234, column: 10, scope: !371)
!501 = !DILocation(line: 235, column: 12, scope: !371)
!502 = !DILocation(line: 235, column: 17, scope: !371)
!503 = !DILocation(line: 235, column: 5, scope: !371)
!504 = !DILocation(line: 235, column: 10, scope: !371)
!505 = !DILocation(line: 236, column: 12, scope: !371)
!506 = !DILocation(line: 236, column: 17, scope: !371)
!507 = !DILocation(line: 236, column: 5, scope: !371)
!508 = !DILocation(line: 236, column: 10, scope: !371)
!509 = !{!423, !423, i64 0}
!510 = !DILocation(line: 237, column: 12, scope: !371)
!511 = !DILocation(line: 237, column: 17, scope: !371)
!512 = !DILocation(line: 237, column: 5, scope: !371)
!513 = !DILocation(line: 237, column: 10, scope: !371)
!514 = !DILocation(line: 238, column: 24, scope: !371)
!515 = !DILocation(line: 238, column: 43, scope: !371)
!516 = !DILocation(line: 238, column: 46, scope: !371)
!517 = !DILocation(line: 238, column: 77, scope: !371)
!518 = !DILocation(line: 238, column: 11, scope: !371)
!519 = !DILocation(line: 238, column: 9, scope: !371)
!520 = !DILocation(line: 240, column: 9, scope: !521)
!521 = distinct !DILexicalBlock(scope: !371, file: !3, line: 240, column: 9)
!522 = !DILocation(line: 240, column: 9, scope: !371)
!523 = !DILocation(line: 241, column: 22, scope: !524)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 241, column: 6)
!525 = distinct !DILexicalBlock(scope: !521, file: !3, line: 240, column: 19)
!526 = !DILocation(line: 241, column: 27, scope: !524)
!527 = !DILocation(line: 241, column: 36, scope: !524)
!528 = !DILocation(line: 241, column: 41, scope: !524)
!529 = !DILocation(line: 241, column: 57, scope: !524)
!530 = !DILocation(line: 241, column: 62, scope: !524)
!531 = !DILocation(line: 241, column: 71, scope: !524)
!532 = !DILocation(line: 241, column: 76, scope: !524)
!533 = !DILocation(line: 241, column: 6, scope: !524)
!534 = !DILocation(line: 241, column: 92, scope: !524)
!535 = !DILocation(line: 241, column: 6, scope: !525)
!536 = !DILocation(line: 242, column: 10, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !3, line: 242, column: 10)
!538 = distinct !DILexicalBlock(scope: !524, file: !3, line: 241, column: 98)
!539 = !DILocation(line: 242, column: 10, scope: !538)
!540 = !DILocation(line: 243, column: 41, scope: !541)
!541 = distinct !DILexicalBlock(scope: !537, file: !3, line: 242, column: 19)
!542 = !DILocation(line: 243, column: 46, scope: !541)
!543 = !DILocation(line: 243, column: 3, scope: !541)
!544 = !DILocation(line: 244, column: 41, scope: !541)
!545 = !DILocation(line: 244, column: 46, scope: !541)
!546 = !DILocation(line: 244, column: 3, scope: !541)
!547 = !DILocation(line: 245, column: 6, scope: !541)
!548 = !DILocation(line: 246, column: 10, scope: !538)
!549 = !DILocation(line: 247, column: 2, scope: !538)
!550 = !DILocation(line: 248, column: 5, scope: !525)
!551 = !DILocation(line: 250, column: 11, scope: !552)
!552 = distinct !DILexicalBlock(scope: !371, file: !3, line: 250, column: 5)
!553 = !DILocation(line: 250, column: 10, scope: !552)
!554 = !DILocation(line: 250, column: 15, scope: !555)
!555 = distinct !DILexicalBlock(scope: !552, file: !3, line: 250, column: 5)
!556 = !DILocation(line: 250, column: 16, scope: !555)
!557 = !DILocation(line: 250, column: 5, scope: !552)
!558 = !DILocation(line: 251, column: 8, scope: !559)
!559 = distinct !DILexicalBlock(scope: !555, file: !3, line: 251, column: 6)
!560 = !DILocation(line: 251, column: 6, scope: !559)
!561 = !DILocation(line: 251, column: 11, scope: !559)
!562 = !DILocation(line: 251, column: 6, scope: !555)
!563 = !DILocation(line: 252, column: 18, scope: !559)
!564 = !DILocation(line: 252, column: 16, scope: !559)
!565 = !DILocation(line: 252, column: 21, scope: !559)
!566 = !DILocation(line: 252, column: 6, scope: !559)
!567 = !DILocation(line: 250, column: 21, scope: !555)
!568 = !DILocation(line: 250, column: 5, scope: !555)
!569 = distinct !{!569, !557, !570, !285}
!570 = !DILocation(line: 252, column: 23, scope: !552)
!571 = !DILocation(line: 254, column: 13, scope: !371)
!572 = !DILocation(line: 254, column: 5, scope: !371)
!573 = !DILocation(line: 256, column: 2, scope: !574)
!574 = distinct !DILexicalBlock(scope: !371, file: !3, line: 254, column: 18)
!575 = !DILocation(line: 259, column: 2, scope: !574)
!576 = !DILocation(line: 262, column: 2, scope: !574)
!577 = distinct !DISubprogram(name: "is_directory", scope: !3, file: !3, line: 299, type: !578, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !580)
!578 = !DISubroutineType(types: !579)
!579 = !{!65, !39}
!580 = !{!581, !582}
!581 = !DILocalVariable(name: "name", arg: 1, scope: !577, file: !3, line: 299, type: !39)
!582 = !DILocalVariable(name: "st", scope: !577, file: !3, line: 301, type: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !584, line: 26, size: 1152, elements: !585)
!584 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!585 = !{!586, !588, !590, !592, !594, !596, !598, !599, !600, !601, !603, !605, !613, !614, !615}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !583, file: !584, line: 31, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !16, line: 145, baseType: !17)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !583, file: !584, line: 36, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !16, line: 148, baseType: !17)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !583, file: !584, line: 44, baseType: !591, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !16, line: 151, baseType: !17)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !583, file: !584, line: 45, baseType: !593, size: 32, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !16, line: 150, baseType: !21)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !583, file: !584, line: 47, baseType: !595, size: 32, offset: 224)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !16, line: 146, baseType: !21)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !583, file: !584, line: 48, baseType: !597, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !16, line: 147, baseType: !21)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !583, file: !584, line: 50, baseType: !65, size: 32, offset: 288)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !583, file: !584, line: 52, baseType: !587, size: 64, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !583, file: !584, line: 57, baseType: !340, size: 64, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !583, file: !584, line: 61, baseType: !602, size: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !16, line: 175, baseType: !26)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !583, file: !584, line: 63, baseType: !604, size: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !16, line: 180, baseType: !26)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !583, file: !584, line: 74, baseType: !606, size: 128, offset: 576)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !607, line: 11, size: 128, elements: !608)
!607 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!608 = !{!609, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !606, file: !607, line: 16, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !16, line: 160, baseType: !26)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !606, file: !607, line: 21, baseType: !612, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !16, line: 197, baseType: !26)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !583, file: !584, line: 75, baseType: !606, size: 128, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !583, file: !584, line: 76, baseType: !606, size: 128, offset: 832)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !583, file: !584, line: 89, baseType: !616, size: 192, offset: 960)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 192, elements: !210)
!617 = !DILocation(line: 299, column: 26, scope: !577)
!618 = !DILocation(line: 301, column: 5, scope: !577)
!619 = !DILocation(line: 301, column: 17, scope: !577)
!620 = !DILocation(line: 303, column: 14, scope: !621)
!621 = distinct !DILexicalBlock(scope: !577, file: !3, line: 303, column: 9)
!622 = !DILocation(line: 303, column: 9, scope: !621)
!623 = !DILocation(line: 303, column: 25, scope: !621)
!624 = !DILocation(line: 303, column: 9, scope: !577)
!625 = !DILocation(line: 304, column: 2, scope: !621)
!626 = !DILocation(line: 306, column: 12, scope: !577)
!627 = !{!628, !234, i64 24}
!628 = !{!"stat", !423, i64 0, !423, i64 8, !423, i64 16, !234, i64 24, !234, i64 28, !234, i64 32, !234, i64 36, !423, i64 40, !423, i64 48, !423, i64 56, !423, i64 64, !629, i64 72, !629, i64 88, !629, i64 104, !235, i64 120}
!629 = !{!"timespec", !423, i64 0, !423, i64 8}
!630 = !DILocation(line: 306, column: 5, scope: !577)
!631 = !DILocation(line: 307, column: 1, scope: !577)
!632 = distinct !DISubprogram(name: "list_directory", scope: !3, file: !3, line: 312, type: !633, scopeLine: 313, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !636)
!633 = !DISubroutineType(types: !634)
!634 = !{!65, !39, !635}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!636 = !{!637, !638, !639, !688, !691, !692, !693, !695}
!637 = !DILocalVariable(name: "name", arg: 1, scope: !632, file: !3, line: 312, type: !39)
!638 = !DILocalVariable(name: "a", arg: 2, scope: !632, file: !3, line: 312, type: !635)
!639 = !DILocalVariable(name: "fts", scope: !632, file: !3, line: 314, type: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !642, line: 81, baseType: !643)
!642 = !DIFile(filename: "/usr/include/fts.h", directory: "", checksumkind: CSK_MD5, checksum: "e1ffa02657848203cb8f98e7e0b7c9d9")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !642, line: 57, size: 576, elements: !644)
!644 = !{!645, !675, !676, !678, !679, !680, !681, !682, !683, !687}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !643, file: !642, line: 58, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !642, line: 98, size: 960, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !663, !665, !667, !669, !670, !671, !672, !674}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !647, file: !642, line: 99, baseType: !646, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !647, file: !642, line: 100, baseType: !646, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !647, file: !642, line: 101, baseType: !646, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !647, file: !642, line: 102, baseType: !26, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !647, file: !642, line: 103, baseType: !10, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !647, file: !642, line: 104, baseType: !8, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !647, file: !642, line: 105, baseType: !8, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !647, file: !642, line: 106, baseType: !65, size: 32, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !647, file: !642, line: 107, baseType: !65, size: 32, offset: 480)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !647, file: !642, line: 108, baseType: !45, size: 16, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !647, file: !642, line: 109, baseType: !45, size: 16, offset: 528)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fts_ino", scope: !647, file: !642, line: 111, baseType: !661, size: 64, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !662, line: 51, baseType: !589)
!662 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !647, file: !642, line: 112, baseType: !664, size: 64, offset: 640)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !662, line: 40, baseType: !587)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nlink", scope: !647, file: !642, line: 113, baseType: !666, size: 64, offset: 704)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !662, line: 64, baseType: !591)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !647, file: !642, line: 117, baseType: !668, size: 16, offset: 768)
!668 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !647, file: !642, line: 133, baseType: !45, size: 16, offset: 784)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !647, file: !642, line: 137, baseType: !45, size: 16, offset: 800)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !647, file: !642, line: 143, baseType: !45, size: 16, offset: 816)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !647, file: !642, line: 145, baseType: !673, size: 64, offset: 832)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !647, file: !642, line: 146, baseType: !204, size: 8, offset: 896)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !643, file: !642, line: 59, baseType: !646, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !643, file: !642, line: 60, baseType: !677, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !643, file: !642, line: 61, baseType: !664, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !643, file: !642, line: 62, baseType: !8, size: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !643, file: !642, line: 63, baseType: !65, size: 32, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !643, file: !642, line: 64, baseType: !65, size: 32, offset: 352)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !643, file: !642, line: 65, baseType: !65, size: 32, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !643, file: !642, line: 66, baseType: !684, size: 64, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!65, !6, !6}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !643, file: !642, line: 80, baseType: !65, size: 32, offset: 512)
!688 = !DILocalVariable(name: "ent", scope: !632, file: !3, line: 315, type: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !642, line: 147, baseType: !647)
!691 = !DILocalVariable(name: "nalloc", scope: !632, file: !3, line: 316, type: !11)
!692 = !DILocalVariable(name: "prefix_length", scope: !632, file: !3, line: 317, type: !58)
!693 = !DILocalVariable(name: "names", scope: !632, file: !3, line: 319, type: !694)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 128, elements: !124)
!695 = !DILocalVariable(name: "crc", scope: !696, file: !3, line: 331, type: !22)
!696 = distinct !DILexicalBlock(scope: !632, file: !3, line: 330, column: 35)
!697 = !DILocation(line: 312, column: 28, scope: !632)
!698 = !DILocation(line: 312, column: 50, scope: !632)
!699 = !DILocation(line: 314, column: 5, scope: !632)
!700 = !DILocation(line: 314, column: 10, scope: !632)
!701 = !DILocation(line: 315, column: 5, scope: !632)
!702 = !DILocation(line: 315, column: 13, scope: !632)
!703 = !DILocation(line: 316, column: 5, scope: !632)
!704 = !DILocation(line: 316, column: 18, scope: !632)
!705 = !DILocation(line: 317, column: 5, scope: !632)
!706 = !DILocation(line: 317, column: 12, scope: !632)
!707 = !DILocation(line: 319, column: 5, scope: !632)
!708 = !DILocation(line: 319, column: 18, scope: !632)
!709 = !DILocation(line: 319, column: 29, scope: !632)
!710 = !DILocation(line: 319, column: 39, scope: !632)
!711 = !DILocation(line: 322, column: 25, scope: !712)
!712 = distinct !DILexicalBlock(scope: !632, file: !3, line: 322, column: 9)
!713 = !DILocation(line: 322, column: 16, scope: !712)
!714 = !DILocation(line: 322, column: 14, scope: !712)
!715 = !DILocation(line: 322, column: 64, scope: !712)
!716 = !DILocation(line: 322, column: 9, scope: !632)
!717 = !DILocation(line: 323, column: 10, scope: !718)
!718 = distinct !DILexicalBlock(scope: !712, file: !3, line: 322, column: 73)
!719 = !DILocation(line: 323, column: 57, scope: !718)
!720 = !DILocation(line: 323, column: 62, scope: !718)
!721 = !DILocation(line: 323, column: 77, scope: !718)
!722 = !DILocation(line: 323, column: 68, scope: !718)
!723 = !DILocation(line: 323, column: 2, scope: !718)
!724 = !DILocation(line: 324, column: 2, scope: !718)
!725 = !DILocation(line: 326, column: 28, scope: !632)
!726 = !DILocation(line: 326, column: 21, scope: !632)
!727 = !DILocation(line: 326, column: 33, scope: !632)
!728 = !DILocation(line: 326, column: 19, scope: !632)
!729 = !DILocation(line: 328, column: 12, scope: !632)
!730 = !DILocation(line: 330, column: 5, scope: !632)
!731 = !DILocation(line: 330, column: 28, scope: !632)
!732 = !DILocation(line: 330, column: 19, scope: !632)
!733 = !DILocation(line: 330, column: 17, scope: !632)
!734 = !DILocation(line: 331, column: 2, scope: !696)
!735 = !DILocation(line: 331, column: 14, scope: !696)
!736 = !DILocation(line: 333, column: 10, scope: !696)
!737 = !DILocation(line: 333, column: 15, scope: !696)
!738 = !{!739, !740, i64 98}
!739 = !{!"_ftsent", !239, i64 0, !239, i64 8, !239, i64 16, !423, i64 24, !239, i64 32, !239, i64 40, !239, i64 48, !234, i64 56, !234, i64 60, !740, i64 64, !740, i64 66, !423, i64 72, !423, i64 80, !423, i64 88, !740, i64 96, !740, i64 98, !740, i64 100, !740, i64 102, !239, i64 104, !235, i64 112}
!740 = !{!"short", !235, i64 0}
!741 = !DILocation(line: 333, column: 2, scope: !696)
!742 = !DILocation(line: 340, column: 6, scope: !743)
!743 = distinct !DILexicalBlock(scope: !696, file: !3, line: 333, column: 25)
!744 = !DILocation(line: 348, column: 16, scope: !743)
!745 = !DILocation(line: 348, column: 6, scope: !743)
!746 = !DILocation(line: 349, column: 6, scope: !743)
!747 = !DILocation(line: 352, column: 10, scope: !748)
!748 = distinct !DILexicalBlock(scope: !743, file: !3, line: 352, column: 10)
!749 = !DILocation(line: 352, column: 13, scope: !748)
!750 = !DILocation(line: 352, column: 23, scope: !748)
!751 = !DILocation(line: 352, column: 20, scope: !748)
!752 = !DILocation(line: 352, column: 10, scope: !743)
!753 = !DILocation(line: 353, column: 10, scope: !754)
!754 = distinct !DILexicalBlock(scope: !748, file: !3, line: 352, column: 31)
!755 = !DILocation(line: 354, column: 7, scope: !756)
!756 = distinct !DILexicalBlock(scope: !754, file: !3, line: 354, column: 7)
!757 = !DILocation(line: 354, column: 14, scope: !756)
!758 = !DILocation(line: 354, column: 7, scope: !754)
!759 = !DILocation(line: 355, column: 15, scope: !760)
!760 = distinct !DILexicalBlock(scope: !756, file: !3, line: 354, column: 46)
!761 = !DILocation(line: 355, column: 47, scope: !760)
!762 = !DILocation(line: 355, column: 7, scope: !760)
!763 = !DILocation(line: 356, column: 7, scope: !760)
!764 = !DILocation(line: 358, column: 22, scope: !754)
!765 = !DILocation(line: 358, column: 25, scope: !754)
!766 = !DILocation(line: 358, column: 52, scope: !754)
!767 = !DILocation(line: 358, column: 51, scope: !754)
!768 = !DILocation(line: 358, column: 14, scope: !754)
!769 = !DILocation(line: 358, column: 3, scope: !754)
!770 = !DILocation(line: 358, column: 6, scope: !754)
!771 = !DILocation(line: 358, column: 12, scope: !754)
!772 = !DILocation(line: 359, column: 7, scope: !773)
!773 = distinct !DILexicalBlock(scope: !754, file: !3, line: 359, column: 7)
!774 = !DILocation(line: 359, column: 10, scope: !773)
!775 = !DILocation(line: 359, column: 16, scope: !773)
!776 = !DILocation(line: 359, column: 7, scope: !754)
!777 = !DILocation(line: 360, column: 15, scope: !778)
!778 = distinct !DILexicalBlock(scope: !773, file: !3, line: 359, column: 25)
!779 = !DILocation(line: 360, column: 47, scope: !778)
!780 = !DILocation(line: 360, column: 7, scope: !778)
!781 = !DILocation(line: 361, column: 7, scope: !778)
!782 = !DILocation(line: 363, column: 6, scope: !754)
!783 = !DILocation(line: 365, column: 40, scope: !743)
!784 = !DILocation(line: 365, column: 45, scope: !743)
!785 = !{!739, !239, i64 48}
!786 = !DILocation(line: 365, column: 54, scope: !743)
!787 = !DILocation(line: 365, column: 53, scope: !743)
!788 = !DILocation(line: 365, column: 33, scope: !743)
!789 = !DILocation(line: 365, column: 6, scope: !743)
!790 = !DILocation(line: 365, column: 9, scope: !743)
!791 = !DILocation(line: 365, column: 15, scope: !743)
!792 = !DILocation(line: 365, column: 18, scope: !743)
!793 = !DILocation(line: 365, column: 26, scope: !743)
!794 = !DILocation(line: 365, column: 31, scope: !743)
!795 = !{!796, !239, i64 0}
!796 = !{!"entry", !239, i64 0, !423, i64 8, !234, i64 16, !234, i64 20, !239, i64 24, !740, i64 32, !239, i64 40, !234, i64 48}
!797 = !DILocation(line: 366, column: 47, scope: !743)
!798 = !DILocation(line: 366, column: 52, scope: !743)
!799 = !{!739, !239, i64 104}
!800 = !DILocation(line: 366, column: 63, scope: !743)
!801 = !{!628, !423, i64 48}
!802 = !DILocation(line: 366, column: 6, scope: !743)
!803 = !DILocation(line: 366, column: 9, scope: !743)
!804 = !DILocation(line: 366, column: 15, scope: !743)
!805 = !DILocation(line: 366, column: 18, scope: !743)
!806 = !DILocation(line: 366, column: 26, scope: !743)
!807 = !DILocation(line: 366, column: 31, scope: !743)
!808 = !{!796, !423, i64 8}
!809 = !DILocation(line: 367, column: 29, scope: !810)
!810 = distinct !DILexicalBlock(scope: !743, file: !3, line: 367, column: 10)
!811 = !DILocation(line: 367, column: 34, scope: !810)
!812 = !{!739, !239, i64 40}
!813 = !DILocation(line: 367, column: 17, scope: !810)
!814 = !DILocation(line: 367, column: 15, scope: !810)
!815 = !DILocation(line: 367, column: 48, scope: !810)
!816 = !DILocation(line: 367, column: 10, scope: !743)
!817 = !DILocation(line: 368, column: 13, scope: !818)
!818 = distinct !DILexicalBlock(scope: !810, file: !3, line: 367, column: 53)
!819 = !DILocation(line: 368, column: 3, scope: !818)
!820 = !DILocation(line: 369, column: 3, scope: !818)
!821 = !DILocation(line: 372, column: 46, scope: !743)
!822 = !DILocation(line: 372, column: 32, scope: !743)
!823 = !DILocation(line: 372, column: 6, scope: !743)
!824 = !DILocation(line: 372, column: 9, scope: !743)
!825 = !DILocation(line: 372, column: 15, scope: !743)
!826 = !DILocation(line: 372, column: 18, scope: !743)
!827 = !DILocation(line: 372, column: 26, scope: !743)
!828 = !DILocation(line: 372, column: 30, scope: !743)
!829 = !{!796, !234, i64 16}
!830 = !DILocation(line: 373, column: 6, scope: !743)
!831 = !DILocation(line: 373, column: 9, scope: !743)
!832 = !DILocation(line: 373, column: 15, scope: !743)
!833 = !DILocation(line: 374, column: 6, scope: !743)
!834 = !DILocation(line: 376, column: 5, scope: !632)
!835 = distinct !{!835, !730, !834, !285}
!836 = !DILocation(line: 378, column: 19, scope: !837)
!837 = distinct !DILexicalBlock(scope: !632, file: !3, line: 378, column: 9)
!838 = !DILocation(line: 378, column: 9, scope: !837)
!839 = !DILocation(line: 378, column: 9, scope: !632)
!840 = !DILocation(line: 379, column: 10, scope: !841)
!841 = distinct !DILexicalBlock(scope: !837, file: !3, line: 378, column: 25)
!842 = !DILocation(line: 379, column: 60, scope: !841)
!843 = !DILocation(line: 379, column: 65, scope: !841)
!844 = !DILocation(line: 379, column: 68, scope: !841)
!845 = !DILocation(line: 379, column: 83, scope: !841)
!846 = !DILocation(line: 379, column: 74, scope: !841)
!847 = !DILocation(line: 379, column: 2, scope: !841)
!848 = !DILocation(line: 380, column: 2, scope: !841)
!849 = !DILocation(line: 383, column: 5, scope: !632)
!850 = !DILocation(line: 384, column: 1, scope: !632)
!851 = distinct !DISubprogram(name: "list_zip", scope: !3, file: !3, line: 389, type: !633, scopeLine: 390, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !852)
!852 = !{!853, !854, !855, !856, !857, !872, !873, !882}
!853 = !DILocalVariable(name: "name", arg: 1, scope: !851, file: !3, line: 389, type: !39)
!854 = !DILocalVariable(name: "a", arg: 2, scope: !851, file: !3, line: 389, type: !635)
!855 = !DILocalVariable(name: "za", scope: !851, file: !3, line: 391, type: !382)
!856 = !DILocalVariable(name: "err", scope: !851, file: !3, line: 392, type: !65)
!857 = !DILocalVariable(name: "st", scope: !851, file: !3, line: 393, type: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_stat", file: !384, line: 286, size: 512, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !868, !869, !870, !871}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !858, file: !384, line: 287, baseType: !11, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !858, file: !384, line: 288, baseType: !39, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !858, file: !384, line: 289, baseType: !11, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !858, file: !384, line: 290, baseType: !11, size: 64, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !858, file: !384, line: 291, baseType: !11, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !858, file: !384, line: 292, baseType: !866, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !867, line: 10, baseType: !610)
!867 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!868 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !858, file: !384, line: 293, baseType: !18, size: 32, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !858, file: !384, line: 294, baseType: !42, size: 16, offset: 416)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_method", scope: !858, file: !384, line: 295, baseType: !42, size: 16, offset: 432)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !858, file: !384, line: 296, baseType: !18, size: 32, offset: 448)
!872 = !DILocalVariable(name: "i", scope: !851, file: !3, line: 394, type: !21)
!873 = !DILocalVariable(name: "error", scope: !874, file: !3, line: 397, type: !876)
!874 = distinct !DILexicalBlock(scope: !875, file: !3, line: 396, column: 74)
!875 = distinct !DILexicalBlock(scope: !851, file: !3, line: 396, column: 9)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_error_t", file: !384, line: 304, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_error", file: !384, line: 270, size: 128, elements: !878)
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "zip_err", scope: !877, file: !384, line: 271, baseType: !65, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "sys_err", scope: !877, file: !384, line: 272, baseType: !65, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !877, file: !384, line: 273, baseType: !8, size: 64, offset: 64)
!882 = !DILocalVariable(name: "length", scope: !883, file: !3, line: 434, type: !65)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 433, column: 23)
!884 = distinct !DILexicalBlock(scope: !885, file: !3, line: 433, column: 13)
!885 = distinct !DILexicalBlock(scope: !886, file: !3, line: 409, column: 10)
!886 = distinct !DILexicalBlock(scope: !851, file: !3, line: 407, column: 9)
!887 = !DILocation(line: 389, column: 22, scope: !851)
!888 = !DILocation(line: 389, column: 44, scope: !851)
!889 = !DILocation(line: 391, column: 5, scope: !851)
!890 = !DILocation(line: 391, column: 12, scope: !851)
!891 = !DILocation(line: 392, column: 5, scope: !851)
!892 = !DILocation(line: 392, column: 9, scope: !851)
!893 = !DILocation(line: 393, column: 5, scope: !851)
!894 = !DILocation(line: 393, column: 21, scope: !851)
!895 = !DILocation(line: 394, column: 5, scope: !851)
!896 = !DILocation(line: 394, column: 18, scope: !851)
!897 = !DILocation(line: 396, column: 22, scope: !875)
!898 = !DILocation(line: 396, column: 28, scope: !875)
!899 = !DILocation(line: 396, column: 13, scope: !875)
!900 = !DILocation(line: 396, column: 12, scope: !875)
!901 = !DILocation(line: 396, column: 65, scope: !875)
!902 = !DILocation(line: 396, column: 9, scope: !851)
!903 = !DILocation(line: 397, column: 2, scope: !874)
!904 = !DILocation(line: 397, column: 14, scope: !874)
!905 = !DILocation(line: 398, column: 35, scope: !874)
!906 = !DILocation(line: 398, column: 2, scope: !874)
!907 = !DILocation(line: 399, column: 10, scope: !874)
!908 = !DILocation(line: 399, column: 60, scope: !874)
!909 = !DILocation(line: 399, column: 65, scope: !874)
!910 = !DILocation(line: 399, column: 71, scope: !874)
!911 = !DILocation(line: 399, column: 2, scope: !874)
!912 = !DILocation(line: 400, column: 2, scope: !874)
!913 = !DILocation(line: 401, column: 2, scope: !874)
!914 = !DILocation(line: 402, column: 5, scope: !875)
!915 = !DILocation(line: 404, column: 13, scope: !851)
!916 = !DILocation(line: 404, column: 5, scope: !851)
!917 = !DILocation(line: 404, column: 8, scope: !851)
!918 = !DILocation(line: 404, column: 11, scope: !851)
!919 = !DILocation(line: 405, column: 51, scope: !851)
!920 = !DILocation(line: 405, column: 31, scope: !851)
!921 = !DILocation(line: 405, column: 5, scope: !851)
!922 = !DILocation(line: 405, column: 8, scope: !851)
!923 = !DILocation(line: 405, column: 15, scope: !851)
!924 = !DILocation(line: 407, column: 9, scope: !886)
!925 = !DILocation(line: 407, column: 12, scope: !886)
!926 = !DILocation(line: 407, column: 19, scope: !886)
!927 = !DILocation(line: 407, column: 9, scope: !851)
!928 = !DILocation(line: 408, column: 2, scope: !886)
!929 = !DILocation(line: 408, column: 5, scope: !886)
!930 = !DILocation(line: 408, column: 11, scope: !886)
!931 = !DILocation(line: 410, column: 7, scope: !932)
!932 = distinct !DILexicalBlock(scope: !885, file: !3, line: 410, column: 6)
!933 = !DILocation(line: 410, column: 10, scope: !932)
!934 = !DILocation(line: 410, column: 17, scope: !932)
!935 = !DILocation(line: 410, column: 49, scope: !932)
!936 = !DILocation(line: 410, column: 107, scope: !932)
!937 = !DILocation(line: 410, column: 110, scope: !932)
!938 = !DILocation(line: 410, column: 105, scope: !932)
!939 = !DILocation(line: 410, column: 78, scope: !932)
!940 = !DILocation(line: 410, column: 53, scope: !932)
!941 = !DILocation(line: 410, column: 56, scope: !932)
!942 = !DILocation(line: 410, column: 61, scope: !932)
!943 = !DILocation(line: 410, column: 119, scope: !932)
!944 = !DILocation(line: 410, column: 6, scope: !885)
!945 = !DILocation(line: 411, column: 14, scope: !946)
!946 = distinct !DILexicalBlock(scope: !932, file: !3, line: 410, column: 128)
!947 = !DILocation(line: 411, column: 46, scope: !946)
!948 = !DILocation(line: 411, column: 6, scope: !946)
!949 = !DILocation(line: 412, column: 6, scope: !946)
