; ModuleID = 'samples/919.bc'
source_filename = "pfmlib_intel_ivbep_unc_r3qpi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.intel_x86_entry_t = type { ptr, ptr, ptr, i64, i32, i32, i32, i32, i32, i16, i16, ptr }
%struct.pfmlib_attr_desc_t = type { ptr, ptr, i32 }
%struct.pfmlib_pmu = type { ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, [3 x ptr], [3 x ptr], [3 x ptr], ptr, ptr, ptr, ptr }
%struct.intel_x86_umask_t = type { ptr, ptr, ptr, i64, i64, [2 x i64], i32, i16, i16, i32, i32 }

@.str = private unnamed_addr constant [34 x i8] c"Intel Ivy Bridge-EP R3QPI0 uncore\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [17 x i8] c"ivbep_unc_r3qpi0\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [15 x i8] c"uncore_r3qpi_0\00", align 1, !dbg !12

!524 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C27", value: 499)
!525 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C28", value: 500)
!526 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C29", value: 501)
!527 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C30", value: 502)
!528 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL5_L3C31", value: 503)
!529 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C16", value: 504)
!530 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C17", value: 505)
!531 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C18", value: 506)
!532 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C19", value: 507)
!533 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C20", value: 508)
!534 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C21", value: 509)
!535 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C22", value: 510)
!536 = !DIEnumerator(name: "PFM_PMU_ARM_KUNPENG_UNC_SCCL7_L3C23", value: 511)
!537 = !DIEnumerator(name: "PFM_PMU_INTEL_SPR", value: 512)
!538 = !DIEnumerator(name: "PFM_PMU_POWER10", value: 513)
!539 = !DIEnumerator(name: "PFM_PMU_AMD64_FAM19H_ZEN4", value: 514)
!540 = !DIEnumerator(name: "PFM_PMU_ARM_V1", value: 515)
!541 = !DIEnumerator(name: "PFM_PMU_ARM_V2", value: 516)
!542 = !DIEnumerator(name: "PFM_PMU_MAX", value: 517)
!543 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 647, baseType: !23, size: 32, elements: !544)
!544 = !{!545, !546, !547, !548, !549}
!545 = !DIEnumerator(name: "PFM_PMU_TYPE_UNKNOWN", value: 0)
!546 = !DIEnumerator(name: "PFM_PMU_TYPE_CORE", value: 1)
!547 = !DIEnumerator(name: "PFM_PMU_TYPE_UNCORE", value: 2)
!548 = !DIEnumerator(name: "PFM_PMU_TYPE_OS_GENERIC", value: 3)
!549 = !DIEnumerator(name: "PFM_PMU_TYPE_MAX", value: 4)
!550 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 655, baseType: !23, size: 32, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557}
!552 = !DIEnumerator(name: "PFM_ATTR_NONE", value: 0)
!553 = !DIEnumerator(name: "PFM_ATTR_UMASK", value: 1)
!554 = !DIEnumerator(name: "PFM_ATTR_MOD_BOOL", value: 2)
!555 = !DIEnumerator(name: "PFM_ATTR_MOD_INTEGER", value: 3)
!556 = !DIEnumerator(name: "PFM_ATTR_RAW_UMASK", value: 4)
!557 = !DIEnumerator(name: "PFM_ATTR_MAX", value: 5)
!558 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 669, baseType: !23, size: 32, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567}
!560 = !DIEnumerator(name: "PFM_DTYPE_UNKNOWN", value: 0)
!561 = !DIEnumerator(name: "PFM_DTYPE_UINT64", value: 1)
!562 = !DIEnumerator(name: "PFM_DTYPE_INT64", value: 2)
!563 = !DIEnumerator(name: "PFM_DTYPE_DOUBLE", value: 3)
!564 = !DIEnumerator(name: "PFM_DTYPE_FIXED", value: 4)
!565 = !DIEnumerator(name: "PFM_DTYPE_RATIO", value: 5)
!566 = !DIEnumerator(name: "PFM_DTYPE_CHAR8", value: 6)
!567 = !DIEnumerator(name: "PFM_DTYPE_MAX", value: 7)
!568 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 685, baseType: !23, size: 32, elements: !569)
!569 = !{!570, !571, !572, !573}
!570 = !DIEnumerator(name: "PFM_ATTR_CTRL_UNKNOWN", value: 0)
!571 = !DIEnumerator(name: "PFM_ATTR_CTRL_PMU", value: 1)
!572 = !DIEnumerator(name: "PFM_ATTR_CTRL_PERF_EVENT", value: 2)
!573 = !DIEnumerator(name: "PFM_ATTR_CTRL_MAX", value: 3)
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 697, baseType: !23, size: 32, elements: !575)
!575 = !{!576, !577, !578, !579}
!576 = !DIEnumerator(name: "PFM_OS_NONE", value: 0)
!577 = !DIEnumerator(name: "PFM_OS_PERF_EVENT", value: 1)
!578 = !DIEnumerator(name: "PFM_OS_PERF_EVENT_EXT", value: 2)
!579 = !DIEnumerator(name: "PFM_OS_MAX", value: 3)
!580 = !{!0, !7, !12, !581, !829, !831, !833, !835, !837, !839, !841, !843, !845, !851, !856, !858, !860, !862, !864, !866, !868, !870, !872, !877, !879, !884, !889, !894, !896, !898, !903, !905, !907, !909, !911, !916, !921, !926, !928, !930, !932, !937, !942, !944, !949, !951, !956, !958, !960, !962, !964, !966, !968, !970, !972, !974, !976, !978, !980, !982, !984, !986, !988, !990, !992, !17, !994, !999, !1004, !1009, !1014, !1016, !1021, !1026, !1031, !1034, !1039, !1042, !1047, !1071, !1073, !1076, !1078, !1080, !1082, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !1106, !1108, !1110, !1112, !1114, !1116, !1118, !1120, !1122, !1124, !1126, !1129, !1134, !1139, !1141, !1143, !1146, !1151, !1153, !1155, !1157, !1159, !1161, !1163, !1165, !1167, !1170, !1172, !1174, !1176, !1178, !1180, !1182, !1184, !1186, !1188, !1190, !1192, !1194, !1196, !1198, !1200, !1202, !1205, !1207, !1209, !1211, !1213, !1215, !1217, !1220, !1222, !1224, !1226, !1228, !1230, !1232, !1234, !1236, !1238, !1240, !1242, !1244, !1246, !1248, !1250, !1252, !1254, !1256, !1258, !1260}
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "intel_ivbep_unc_r3qpi0_support", scope: !19, file: !2, line: 63, type: !583, isLocal: false, isDefinition: true)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfmlib_pmu_t", file: !584, line: 173, baseType: !585)
!584 = !DIFile(filename: "./pfmlib_priv.h", directory: "/local-ssd/libpfm4-eymjeez6kzzocrqb5p6y26hpb2o7cj4q-build/aidengro/spack-stage-libpfm4-4.13.0-eymjeez6kzzocrqb5p6y26hpb2o7cj4q/spack-src/lib", checksumkind: CSK_MD5, checksum: "ac9ad89eb80b3c522b78dc9cc620bd5b")
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pfmlib_pmu", file: !584, line: 130, size: 2240, elements: !586)
!586 = !{!587, !590, !591, !592, !594, !596, !597, !598, !599, !600, !601, !602, !604, !607, !617, !619, !621, !626, !627, !631, !632, !636, !669, !673, !674, !678, !710, !754, !759, !761, !820, !821, !825}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !585, file: !584, line: 131, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !585, file: !584, line: 132, baseType: !588, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "perf_name", scope: !585, file: !584, line: 133, baseType: !588, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pmu", scope: !585, file: !584, line: 134, baseType: !593, size: 32, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_pmu_t", file: !22, line: 645, baseType: !21)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pme_count", scope: !585, file: !584, line: 135, baseType: !595, size: 32, offset: 224)
!595 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "max_encoding", scope: !585, file: !584, line: 136, baseType: !595, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !585, file: !584, line: 137, baseType: !595, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pmu_rev", scope: !585, file: !584, line: 138, baseType: !595, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "num_cntrs", scope: !585, file: !584, line: 139, baseType: !595, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "num_fixed_cntrs", scope: !585, file: !584, line: 140, baseType: !595, size: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "supported_plm", scope: !585, file: !584, line: 141, baseType: !595, size: 32, offset: 416)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !585, file: !584, line: 143, baseType: !603, size: 32, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_pmu_type_t", file: !22, line: 653, baseType: !543)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !585, file: !584, line: 144, baseType: !605, size: 64, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "atdesc", scope: !585, file: !584, line: 146, baseType: !608, size: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfmlib_attr_desc_t", file: !584, line: 60, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !584, line: 56, size: 192, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !584, line: 57, baseType: !588, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !611, file: !584, line: 58, baseType: !588, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !611, file: !584, line: 59, baseType: !616, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_attr_t", file: !22, line: 663, baseType: !550)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_family", scope: !585, file: !584, line: 148, baseType: !618, size: 32, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_models", scope: !585, file: !584, line: 149, baseType: !620, size: 64, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pmu_detect", scope: !585, file: !584, line: 151, baseType: !622, size: 64, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!595, !625}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pmu_init", scope: !585, file: !584, line: 152, baseType: !622, size: 64, offset: 832)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pmu_terminate", scope: !585, file: !584, line: 153, baseType: !628, size: 64, offset: 896)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !625}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_first", scope: !585, file: !584, line: 154, baseType: !622, size: 64, offset: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_next", scope: !585, file: !584, line: 155, baseType: !633, size: 64, offset: 1024)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!595, !625, !595}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_info", scope: !585, file: !584, line: 156, baseType: !637, size: 64, offset: 1088)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!595, !625, !595, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_event_info_t", file: !22, line: 768, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 751, size: 512, elements: !643)
!643 = !{!644, !645, !646, !647, !651, !656, !657, !659, !660, !661, !662}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !642, file: !22, line: 752, baseType: !588, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !642, file: !22, line: 753, baseType: !588, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "equiv", scope: !642, file: !22, line: 754, baseType: !588, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !642, file: !22, line: 755, baseType: !648, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !649, line: 70, baseType: !650)
!649 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!650 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !642, file: !22, line: 756, baseType: !652, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !653, line: 27, baseType: !654)
!653 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !655, line: 45, baseType: !650)
!655 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pmu", scope: !642, file: !22, line: 757, baseType: !593, size: 32, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !642, file: !22, line: 758, baseType: !658, size: 32, offset: 352)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_dtype_t", file: !22, line: 679, baseType: !558)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !642, file: !22, line: 759, baseType: !595, size: 32, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nattrs", scope: !642, file: !22, line: 760, baseType: !595, size: 32, offset: 416)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !642, file: !22, line: 761, baseType: !595, size: 32, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, scope: !642, file: !22, line: 762, baseType: !663, size: 32, offset: 480)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !642, file: !22, line: 762, size: 32, elements: !664)
!664 = !{!665, !666, !667, !668}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "is_precise", scope: !663, file: !22, line: 763, baseType: !23, size: 1, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "is_speculative", scope: !663, file: !22, line: 764, baseType: !23, size: 2, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "support_hw_smpl", scope: !663, file: !22, line: 765, baseType: !23, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bits", scope: !663, file: !22, line: 766, baseType: !23, size: 28, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_nattrs", scope: !585, file: !584, line: 157, baseType: !670, size: 64, offset: 1152)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!23, !625, !595}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "event_is_valid", scope: !585, file: !584, line: 158, baseType: !633, size: 64, offset: 1216)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "can_auto_encode", scope: !585, file: !584, line: 159, baseType: !675, size: 64, offset: 1280)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!595, !625, !595, !595}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_attr_info", scope: !585, file: !584, line: 161, baseType: !679, size: 64, offset: 1344)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!595, !625, !595, !595, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfmlib_event_attr_info_t", file: !584, line: 86, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !584, line: 62, size: 576, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !694, !695, !703}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !684, file: !584, line: 63, baseType: !588, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !684, file: !584, line: 64, baseType: !588, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "equiv", scope: !684, file: !584, line: 65, baseType: !588, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !684, file: !584, line: 66, baseType: !648, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !684, file: !584, line: 67, baseType: !652, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !684, file: !584, line: 68, baseType: !616, size: 32, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !684, file: !584, line: 69, baseType: !693, size: 32, offset: 352)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_attr_ctrl_t", file: !22, line: 691, baseType: !568)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !684, file: !584, line: 71, baseType: !652, size: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, scope: !684, file: !584, line: 73, baseType: !696, size: 32, offset: 448)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !684, file: !584, line: 73, size: 32, elements: !697)
!697 = !{!698, !699, !700, !701, !702}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "is_dfl", scope: !696, file: !584, line: 74, baseType: !23, size: 1, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "is_precise", scope: !696, file: !584, line: 75, baseType: !23, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "is_speculative", scope: !696, file: !584, line: 76, baseType: !23, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "support_hw_smpl", scope: !696, file: !584, line: 77, baseType: !23, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bits", scope: !696, file: !584, line: 78, baseType: !23, size: 27, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, scope: !684, file: !584, line: 80, baseType: !704, size: 64, offset: 512)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !684, file: !584, line: 80, size: 64, elements: !705)
!705 = !{!706, !707, !708, !709}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dfl_val64", scope: !704, file: !584, line: 81, baseType: !652, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dfl_str", scope: !704, file: !584, line: 82, baseType: !588, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dfl_bool", scope: !704, file: !584, line: 83, baseType: !595, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dfl_int", scope: !704, file: !584, line: 84, baseType: !595, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "get_event_encoding", scope: !585, file: !584, line: 162, baseType: !711, size: 192, offset: 1408)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 192, elements: !752)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!595, !625, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfmlib_event_desc_t", file: !584, line: 126, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !584, line: 112, size: 10880, elements: !718)
!718 = !{!719, !721, !722, !723, !724, !725, !727, !728, !742, !743, !747, !751}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pmu", scope: !717, file: !584, line: 113, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dfl_plm", scope: !717, file: !584, line: 114, baseType: !595, size: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !717, file: !584, line: 115, baseType: !595, size: 32, offset: 96)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "npattrs", scope: !717, file: !584, line: 116, baseType: !595, size: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "nattrs", scope: !717, file: !584, line: 117, baseType: !595, size: 32, offset: 160)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "osid", scope: !717, file: !584, line: 118, baseType: !726, size: 32, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfm_os_t", file: !22, line: 703, baseType: !574)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !717, file: !584, line: 119, baseType: !595, size: 32, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !717, file: !584, line: 120, baseType: !729, size: 8192, offset: 256)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 8192, elements: !740)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfmlib_attr_t", file: !584, line: 97, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !584, line: 91, size: 128, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !731, file: !584, line: 92, baseType: !595, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, scope: !731, file: !584, line: 93, baseType: !735, size: 64, offset: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !731, file: !584, line: 93, size: 64, elements: !736)
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ival", scope: !735, file: !584, line: 94, baseType: !652, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sval", scope: !735, file: !584, line: 95, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!740 = !{!741}
!741 = !DISubrange(count: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pattrs", scope: !717, file: !584, line: 122, baseType: !682, size: 64, offset: 8448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fstr", scope: !717, file: !584, line: 123, baseType: !744, size: 2048, offset: 8512)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "codes", scope: !717, file: !584, line: 124, baseType: !748, size: 256, offset: 10560)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 256, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 4)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "os_data", scope: !717, file: !584, line: 125, baseType: !625, size: 64, offset: 10816)
!752 = !{!753}
!753 = !DISubrange(count: 3)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "validate_pattrs", scope: !585, file: !584, line: 164, baseType: !755, size: 192, offset: 1600)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 192, elements: !752)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !625, !715}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "os_detect", scope: !585, file: !584, line: 165, baseType: !760, size: 192, offset: 1792)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 192, elements: !752)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "validate_table", scope: !585, file: !584, line: 166, baseType: !762, size: 64, offset: 1984)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!595, !625, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !767, line: 7, baseType: !768)
!767 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !769, line: 49, size: 1728, elements: !770)
!769 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !786, !788, !789, !790, !793, !795, !797, !801, !804, !806, !809, !812, !813, !814, !815, !816}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !768, file: !769, line: 51, baseType: !595, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !768, file: !769, line: 54, baseType: !739, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !768, file: !769, line: 55, baseType: !739, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !768, file: !769, line: 56, baseType: !739, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !768, file: !769, line: 57, baseType: !739, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !768, file: !769, line: 58, baseType: !739, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !768, file: !769, line: 59, baseType: !739, size: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !768, file: !769, line: 60, baseType: !739, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !768, file: !769, line: 61, baseType: !739, size: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !768, file: !769, line: 64, baseType: !739, size: 64, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !768, file: !769, line: 65, baseType: !739, size: 64, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !768, file: !769, line: 66, baseType: !739, size: 64, offset: 704)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !768, file: !769, line: 68, baseType: !784, size: 64, offset: 768)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !769, line: 36, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !768, file: !769, line: 70, baseType: !787, size: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !768, file: !769, line: 72, baseType: !595, size: 32, offset: 896)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !768, file: !769, line: 73, baseType: !595, size: 32, offset: 928)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !768, file: !769, line: 74, baseType: !791, size: 64, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !655, line: 152, baseType: !792)
!792 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !768, file: !769, line: 77, baseType: !794, size: 16, offset: 1024)
!794 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !768, file: !769, line: 78, baseType: !796, size: 8, offset: 1040)
!796 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !768, file: !769, line: 79, baseType: !798, size: 8, offset: 1048)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 1)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !768, file: !769, line: 81, baseType: !802, size: 64, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !769, line: 43, baseType: null)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !768, file: !769, line: 89, baseType: !805, size: 64, offset: 1152)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !655, line: 153, baseType: !792)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !768, file: !769, line: 91, baseType: !807, size: 64, offset: 1216)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !769, line: 37, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !768, file: !769, line: 92, baseType: !810, size: 64, offset: 1280)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !769, line: 38, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !768, file: !769, line: 93, baseType: !787, size: 64, offset: 1344)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !768, file: !769, line: 94, baseType: !625, size: 64, offset: 1408)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !768, file: !769, line: 95, baseType: !648, size: 64, offset: 1472)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !768, file: !769, line: 96, baseType: !595, size: 32, offset: 1536)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !768, file: !769, line: 98, baseType: !817, size: 160, offset: 1568)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 20)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "get_num_events", scope: !585, file: !584, line: 170, baseType: !622, size: 64, offset: 2048)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "display_reg", scope: !585, file: !584, line: 171, baseType: !822, size: 64, offset: 2112)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !625, !715, !625}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "match_event", scope: !585, file: !584, line: 172, baseType: !826, size: 64, offset: 2176)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!595, !625, !715, !588, !588}
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !3, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !9, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !14, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "intel_ivbep_unc_r3qpi1_support", scope: !19, file: !2, line: 64, type: !583, isLocal: false, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !3, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !9, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !14, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "intel_ivbep_unc_r3qpi2_support", scope: !19, file: !2, line: 65, type: !583, isLocal: false, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !847, line: 300, type: !848, isLocal: true, isDefinition: true)
!847 = !DIFile(filename: "./events/intel_ivbep_unc_r3qpi_events.h", directory: "/local-ssd/libpfm4-eymjeez6kzzocrqb5p6y26hpb2o7cj4q-build/aidengro/spack-stage-libpfm4-4.13.0-eymjeez6kzzocrqb5p6y26hpb2o7cj4q/spack-src/lib", checksumkind: CSK_MD5, checksum: "047c62386c441c571b6cac118e241320")
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 18)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !847, line: 301, type: !853, isLocal: true, isDefinition: true)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 26)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !847, line: 306, type: !817, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !847, line: 307, type: !848, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !847, line: 315, type: !817, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !847, line: 316, type: !848, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !847, line: 324, type: !817, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !847, line: 325, type: !848, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !847, line: 333, type: !817, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !847, line: 334, type: !848, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !847, line: 342, type: !874, isLocal: true, isDefinition: true)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 23)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !847, line: 343, type: !9, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !847, line: 348, type: !881, isLocal: true, isDefinition: true)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: 21)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !847, line: 349, type: !886, isLocal: true, isDefinition: true)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 25)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !847, line: 357, type: !891, isLocal: true, isDefinition: true)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 19)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !847, line: 358, type: !817, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !847, line: 366, type: !881, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !847, line: 367, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 30)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !847, line: 375, type: !874, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !847, line: 376, type: !891, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !847, line: 381, type: !853, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !847, line: 382, type: !900, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !847, line: 390, type: !913, isLocal: true, isDefinition: true)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 24)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !847, line: 391, type: !918, isLocal: true, isDefinition: true)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 16)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !847, line: 399, type: !923, isLocal: true, isDefinition: true)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 28)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !847, line: 400, type: !913, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !847, line: 408, type: !853, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !847, line: 409, type: !848, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !847, line: 417, type: !934, isLocal: true, isDefinition: true)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 29)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !847, line: 418, type: !939, isLocal: true, isDefinition: true)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 37)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !847, line: 423, type: !900, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !847, line: 424, type: !946, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 41)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !847, line: 429, type: !934, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !847, line: 430, type: !953, isLocal: true, isDefinition: true)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 22)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !847, line: 438, type: !934, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !847, line: 447, type: !900, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !847, line: 448, type: !913, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !847, line: 456, type: !934, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !847, line: 457, type: !953, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !847, line: 465, type: !934, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !847, line: 466, type: !953, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !847, line: 474, type: !934, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !847, line: 475, type: !953, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !847, line: 483, type: !934, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !847, line: 484, type: !953, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !847, line: 492, type: !881, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !847, line: 493, type: !913, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !847, line: 498, type: !817, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !847, line: 499, type: !900, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !847, line: 507, type: !891, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !847, line: 516, type: !853, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !847, line: 517, type: !900, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !847, line: 525, type: !913, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !847, line: 31, type: !996, isLocal: true, isDefinition: true)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 13)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !847, line: 32, type: !1001, isLocal: true, isDefinition: true)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 59)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !847, line: 35, type: !1006, isLocal: true, isDefinition: true)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !1007)
!1007 = !{!1008}
!1008 = !DISubrange(count: 12)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !847, line: 36, type: !1011, isLocal: true, isDefinition: true)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 58)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !847, line: 39, type: !1006, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !847, line: 40, type: !1018, isLocal: true, isDefinition: true)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !1019)
!1019 = !{!1020}
!1020 = !DISubrange(count: 51)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !847, line: 43, type: !1023, isLocal: true, isDefinition: true)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !1024)
!1024 = !{!1025}
!1025 = !DISubrange(count: 11)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(scope: null, file: !847, line: 44, type: !1028, isLocal: true, isDefinition: true)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 50)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !847, line: 47, type: !1033, isLocal: true, isDefinition: true)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !752)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !847, line: 48, type: !1036, isLocal: true, isDefinition: true)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 52)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !847, line: 51, type: !1041, isLocal: true, isDefinition: true)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !749)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !847, line: 52, type: !1044, isLocal: true, isDefinition: true)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !1045)
!1045 = !{!1046}
!1046 = !DISubrange(count: 60)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_ring_ad_used", scope: !19, file: !847, line: 30, type: !1049, isLocal: true, isDefinition: true)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 3456, elements: !1069)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "intel_x86_umask_t", file: !1052, line: 59, baseType: !1053)
!1052 = !DIFile(filename: "./pfmlib_intel_x86_priv.h", directory: "/local-ssd/libpfm4-eymjeez6kzzocrqb5p6y26hpb2o7cj4q-build/aidengro/spack-stage-libpfm4-4.13.0-eymjeez6kzzocrqb5p6y26hpb2o7cj4q/spack-src/lib", checksumkind: CSK_MD5, checksum: "809af466a24857bdd89f02c5468d86f0")
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1052, line: 42, size: 576, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1064, !1065, !1066, !1067, !1068}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !1053, file: !1052, line: 43, baseType: !588, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "udesc", scope: !1053, file: !1052, line: 44, baseType: !588, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "uequiv", scope: !1053, file: !1052, line: 45, baseType: !588, size: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ucntmsk", scope: !1053, file: !1052, line: 46, baseType: !652, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ucode", scope: !1053, file: !1052, line: 47, baseType: !652, size: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ufilters", scope: !1053, file: !1052, line: 53, baseType: !1061, size: 128, offset: 320)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 128, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 2)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "uflags", scope: !1053, file: !1052, line: 54, baseType: !23, size: 32, offset: 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "umodel", scope: !1053, file: !1052, line: 55, baseType: !794, size: 16, offset: 480)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "grpid", scope: !1053, file: !1052, line: 56, baseType: !794, size: 16, offset: 496)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "modhw", scope: !1053, file: !1052, line: 57, baseType: !23, size: 32, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "umodmsk_req", scope: !1053, file: !1052, line: 58, baseType: !23, size: 32, offset: 544)
!1069 = !{!1070}
!1070 = !DISubrange(count: 6)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !847, line: 66, type: !1041, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_ring_iv_used", scope: !19, file: !847, line: 57, type: !1075, isLocal: true, isDefinition: true)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 1728, elements: !752)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !847, line: 74, type: !1041, isLocal: true, isDefinition: true)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(scope: null, file: !847, line: 75, type: !848, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !847, line: 78, type: !1041, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !847, line: 79, type: !848, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !847, line: 82, type: !1041, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !847, line: 83, type: !848, isLocal: true, isDefinition: true)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_rxr_cycles_ne", scope: !19, file: !847, line: 73, type: !1075, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !847, line: 89, type: !1041, isLocal: true, isDefinition: true)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !847, line: 90, type: !848, isLocal: true, isDefinition: true)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(scope: null, file: !847, line: 97, type: !1041, isLocal: true, isDefinition: true)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(scope: null, file: !847, line: 98, type: !848, isLocal: true, isDefinition: true)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(scope: null, file: !847, line: 101, type: !1041, isLocal: true, isDefinition: true)
!1100 = !DIGlobalVariableExpression(var: !1101, expr: !DIExpression())
!1101 = distinct !DIGlobalVariable(scope: null, file: !847, line: 102, type: !848, isLocal: true, isDefinition: true)
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_rxr_inserts", scope: !19, file: !847, line: 88, type: !1049, isLocal: true, isDefinition: true)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(scope: null, file: !847, line: 117, type: !886, isLocal: true, isDefinition: true)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(scope: null, file: !847, line: 121, type: !886, isLocal: true, isDefinition: true)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(scope: null, file: !847, line: 125, type: !886, isLocal: true, isDefinition: true)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !847, line: 129, type: !886, isLocal: true, isDefinition: true)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(scope: null, file: !847, line: 133, type: !886, isLocal: true, isDefinition: true)
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(scope: null, file: !847, line: 137, type: !886, isLocal: true, isDefinition: true)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_vn0_credits_used", scope: !19, file: !847, line: 115, type: !1049, isLocal: true, isDefinition: true)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !847, line: 289, type: !1033, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !847, line: 290, type: !1006, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !847, line: 293, type: !1033, isLocal: true, isDefinition: true)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(scope: null, file: !847, line: 294, type: !1006, isLocal: true, isDefinition: true)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_vna_credits_acquired", scope: !19, file: !847, line: 288, type: !1128, isLocal: true, isDefinition: true)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 1152, elements: !1062)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(scope: null, file: !847, line: 143, type: !1131, isLocal: true, isDefinition: true)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !1132)
!1132 = !{!1133}
!1133 = !DISubrange(count: 5)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(scope: null, file: !847, line: 144, type: !1136, isLocal: true, isDefinition: true)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !1137)
!1137 = !{!1138}
!1138 = !DISubrange(count: 7)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !847, line: 147, type: !1131, isLocal: true, isDefinition: true)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !847, line: 148, type: !1136, isLocal: true, isDefinition: true)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !847, line: 151, type: !1145, isLocal: true, isDefinition: true)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !1069)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(scope: null, file: !847, line: 152, type: !1148, isLocal: true, isDefinition: true)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !1149)
!1149 = !{!1150}
!1150 = !DISubrange(count: 8)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(scope: null, file: !847, line: 155, type: !1145, isLocal: true, isDefinition: true)
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(scope: null, file: !847, line: 156, type: !1148, isLocal: true, isDefinition: true)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(scope: null, file: !847, line: 159, type: !1145, isLocal: true, isDefinition: true)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !847, line: 160, type: !1148, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !847, line: 163, type: !1145, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(scope: null, file: !847, line: 164, type: !1148, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !847, line: 167, type: !1145, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !847, line: 168, type: !996, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_c_hi_ad_credits_empty", scope: !19, file: !847, line: 142, type: !1169, isLocal: true, isDefinition: true)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 4032, elements: !1137)
!1170 = !DIGlobalVariableExpression(var: !1171, expr: !DIExpression())
!1171 = distinct !DIGlobalVariable(scope: null, file: !847, line: 174, type: !1131, isLocal: true, isDefinition: true)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(scope: null, file: !847, line: 175, type: !1136, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !847, line: 178, type: !1131, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !847, line: 179, type: !1136, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(scope: null, file: !847, line: 182, type: !1131, isLocal: true, isDefinition: true)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(scope: null, file: !847, line: 183, type: !1136, isLocal: true, isDefinition: true)
!1182 = !DIGlobalVariableExpression(var: !1183, expr: !DIExpression())
!1183 = distinct !DIGlobalVariable(scope: null, file: !847, line: 186, type: !1131, isLocal: true, isDefinition: true)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(scope: null, file: !847, line: 187, type: !1136, isLocal: true, isDefinition: true)
!1186 = !DIGlobalVariableExpression(var: !1187, expr: !DIExpression())
!1187 = distinct !DIGlobalVariable(scope: null, file: !847, line: 190, type: !1131, isLocal: true, isDefinition: true)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(scope: null, file: !847, line: 191, type: !1136, isLocal: true, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !847, line: 194, type: !1131, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !847, line: 195, type: !1136, isLocal: true, isDefinition: true)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(scope: null, file: !847, line: 198, type: !1131, isLocal: true, isDefinition: true)
!1196 = !DIGlobalVariableExpression(var: !1197, expr: !DIExpression())
!1197 = distinct !DIGlobalVariable(scope: null, file: !847, line: 199, type: !1136, isLocal: true, isDefinition: true)
!1198 = !DIGlobalVariableExpression(var: !1199, expr: !DIExpression())
!1199 = distinct !DIGlobalVariable(scope: null, file: !847, line: 202, type: !1131, isLocal: true, isDefinition: true)
!1200 = !DIGlobalVariableExpression(var: !1201, expr: !DIExpression())
!1201 = distinct !DIGlobalVariable(scope: null, file: !847, line: 203, type: !1136, isLocal: true, isDefinition: true)
!1202 = !DIGlobalVariableExpression(var: !1203, expr: !DIExpression())
!1203 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_c_lo_ad_credits_empty", scope: !19, file: !847, line: 173, type: !1204, isLocal: true, isDefinition: true)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 4608, elements: !1149)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(scope: null, file: !847, line: 209, type: !1041, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(scope: null, file: !847, line: 213, type: !1041, isLocal: true, isDefinition: true)
!1209 = !DIGlobalVariableExpression(var: !1210, expr: !DIExpression())
!1210 = distinct !DIGlobalVariable(scope: null, file: !847, line: 217, type: !1136, isLocal: true, isDefinition: true)
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(scope: null, file: !847, line: 218, type: !918, isLocal: true, isDefinition: true)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(scope: null, file: !847, line: 221, type: !1136, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !847, line: 222, type: !918, isLocal: true, isDefinition: true)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_ha_r2_bl_credits_empty", scope: !19, file: !847, line: 208, type: !1219, isLocal: true, isDefinition: true)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 2304, elements: !749)
!1220 = !DIGlobalVariableExpression(var: !1221, expr: !DIExpression())
!1221 = distinct !DIGlobalVariable(scope: null, file: !847, line: 228, type: !1041, isLocal: true, isDefinition: true)
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(scope: null, file: !847, line: 232, type: !1148, isLocal: true, isDefinition: true)
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(scope: null, file: !847, line: 233, type: !9, isLocal: true, isDefinition: true)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(scope: null, file: !847, line: 236, type: !1148, isLocal: true, isDefinition: true)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(scope: null, file: !847, line: 237, type: !9, isLocal: true, isDefinition: true)
!1230 = !DIGlobalVariableExpression(var: !1231, expr: !DIExpression())
!1231 = distinct !DIGlobalVariable(scope: null, file: !847, line: 240, type: !1148, isLocal: true, isDefinition: true)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(scope: null, file: !847, line: 241, type: !9, isLocal: true, isDefinition: true)
!1234 = !DIGlobalVariableExpression(var: !1235, expr: !DIExpression())
!1235 = distinct !DIGlobalVariable(scope: null, file: !847, line: 244, type: !1148, isLocal: true, isDefinition: true)
!1236 = !DIGlobalVariableExpression(var: !1237, expr: !DIExpression())
!1237 = distinct !DIGlobalVariable(scope: null, file: !847, line: 245, type: !9, isLocal: true, isDefinition: true)
!1238 = !DIGlobalVariableExpression(var: !1239, expr: !DIExpression())
!1239 = distinct !DIGlobalVariable(scope: null, file: !847, line: 248, type: !1148, isLocal: true, isDefinition: true)
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(scope: null, file: !847, line: 249, type: !9, isLocal: true, isDefinition: true)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(scope: null, file: !847, line: 252, type: !1148, isLocal: true, isDefinition: true)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !847, line: 253, type: !9, isLocal: true, isDefinition: true)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_qpi0_ad_credits_empty", scope: !19, file: !847, line: 227, type: !1169, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(scope: null, file: !847, line: 260, type: !3, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(scope: null, file: !847, line: 263, type: !1033, isLocal: true, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(scope: null, file: !847, line: 264, type: !853, isLocal: true, isDefinition: true)
!1254 = !DIGlobalVariableExpression(var: !1255, expr: !DIExpression())
!1255 = distinct !DIGlobalVariable(scope: null, file: !847, line: 268, type: !3, isLocal: true, isDefinition: true)
!1256 = !DIGlobalVariableExpression(var: !1257, expr: !DIExpression())
!1257 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_txr_nack_ccw", scope: !19, file: !847, line: 258, type: !1075, isLocal: true, isDefinition: true)
!1258 = !DIGlobalVariableExpression(var: !1259, expr: !DIExpression())
!1259 = distinct !DIGlobalVariable(scope: null, file: !847, line: 283, type: !853, isLocal: true, isDefinition: true)
!1260 = !DIGlobalVariableExpression(var: !1261, expr: !DIExpression())
!1261 = distinct !DIGlobalVariable(name: "ivbep_unc_r3_txr_nack_cw", scope: !19, file: !847, line: 273, type: !1075, isLocal: true, isDefinition: true)
!1262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1263, size: 14336, elements: !924)
!1263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1264)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "intel_x86_entry_t", file: !1052, line: 79, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1052, line: 66, size: 512, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1265, file: !1052, line: 67, baseType: !588, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !1265, file: !1052, line: 68, baseType: !588, size: 64, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "equiv", scope: !1265, file: !1052, line: 69, baseType: !588, size: 64, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "cntmsk", scope: !1265, file: !1052, line: 70, baseType: !652, size: 64, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1265, file: !1052, line: 71, baseType: !23, size: 32, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "numasks", scope: !1265, file: !1052, line: 72, baseType: !23, size: 32, offset: 288)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1265, file: !1052, line: 73, baseType: !23, size: 32, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "modmsk", scope: !1265, file: !1052, line: 74, baseType: !23, size: 32, offset: 352)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "modmsk_req", scope: !1265, file: !1052, line: 75, baseType: !23, size: 32, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "ngrp", scope: !1265, file: !1052, line: 76, baseType: !794, size: 16, offset: 416)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !1265, file: !1052, line: 77, baseType: !794, size: 16, offset: 432)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "umasks", scope: !1265, file: !1052, line: 78, baseType: !1279, size: 64, offset: 448)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1280 = !{i32 7, !"Dwarf Version", i32 5}
!1281 = !{i32 2, !"Debug Info Version", i32 3}
!1282 = !{i32 1, !"wchar_size", i32 4}
!1283 = !{i32 8, !"PIC Level", i32 2}
!1284 = !{i32 7, !"PIE Level", i32 2}
!1285 = !{i32 7, !"uwtable", i32 2}
!1286 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
