; ModuleID = 'samples/923.bc'
source_filename = "lj_snap.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jit_State = type { %struct.GCtrace, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i8, i8, %struct.IRType1, i8, %struct.FoldState, ptr, i32, i32, i32, i32, i32, i32, i32, [5 x %union.TValue], [3 x %union.TValue], [1 x i32], ptr, i32, i32, i32, i32, ptr, ptr, i32, i32, i8, ptr, i32, i32, i16, [100 x i16], [257 x i32], [15 x i32], [16 x ptr], [64 x %struct.HotPenalty], i32, i32, [16 x %struct.BPropEntry], i32, %struct.ScEvEntry, ptr, i32, i32, ptr, i32, i32, ptr, ptr, ptr, i64, i64, %union.TValue, ptr, i32, i32 }
%struct.GCtrace = type { %struct.GCRef, i8, i8, i16, i32, i32, %struct.GCRef, ptr, i32, i32, ptr, ptr, %struct.GCRef, %struct.MRef, i32, i32, ptr, i32, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8 }
%struct.GCRef = type { i64 }
%struct.MRef = type { i64 }
%struct.IRType1 = type { i8 }
%struct.FoldState = type { %union.IRIns, [2 x %union.IRIns], [2 x %union.IRIns] }
%union.IRIns = type { %struct.GCRef }
%struct.HotPenalty = type { %struct.MRef, i16, i16 }
%struct.BPropEntry = type { i16, i16, i32 }
%struct.ScEvEntry = type { %struct.MRef, i16, i16, i16, i16, %struct.IRType1, i8 }
%union.TValue = type { i64 }
%struct.SnapShot = type { i32, i16, i8, i8, i8, i8 }
%struct.anon = type { i16, i16, i16, i16 }

!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !231, line: 239, baseType: !5, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359}
!344 = !DIEnumerator(name: "BCMnone", value: 0)
!345 = !DIEnumerator(name: "BCMdst", value: 1)
!346 = !DIEnumerator(name: "BCMbase", value: 2)
!347 = !DIEnumerator(name: "BCMvar", value: 3)
!348 = !DIEnumerator(name: "BCMrbase", value: 4)
!349 = !DIEnumerator(name: "BCMuv", value: 5)
!350 = !DIEnumerator(name: "BCMlit", value: 6)
!351 = !DIEnumerator(name: "BCMlits", value: 7)
!352 = !DIEnumerator(name: "BCMpri", value: 8)
!353 = !DIEnumerator(name: "BCMnum", value: 9)
!354 = !DIEnumerator(name: "BCMstr", value: 10)
!355 = !DIEnumerator(name: "BCMtab", value: 11)
!356 = !DIEnumerator(name: "BCMfunc", value: 12)
!357 = !DIEnumerator(name: "BCMjump", value: 13)
!358 = !DIEnumerator(name: "BCMcdata", value: 14)
!359 = !DIEnumerator(name: "BCM_max", value: 15)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !231, line: 234, baseType: !5, size: 32, elements: !361)
!361 = !{!362, !363, !364, !365}
!362 = !DIEnumerator(name: "FORL_IDX", value: 0)
!363 = !DIEnumerator(name: "FORL_STOP", value: 1)
!364 = !DIEnumerator(name: "FORL_STEP", value: 2)
!365 = !DIEnumerator(name: "FORL_EXT", value: 3)
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !367, line: 29, baseType: !5, size: 32, elements: !368)
!367 = !DIFile(filename: "./lj_target_x86.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/LuaJIT-2.1-20190507/src", checksumkind: CSK_MD5, checksum: "6cc428797e875ed9ee8ba91423fe3dc6")
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!369 = !DIEnumerator(name: "RID_EAX", value: 0)
!370 = !DIEnumerator(name: "RID_ECX", value: 1)
!371 = !DIEnumerator(name: "RID_EDX", value: 2)
!372 = !DIEnumerator(name: "RID_EBX", value: 3)
!373 = !DIEnumerator(name: "RID_ESP", value: 4)
!374 = !DIEnumerator(name: "RID_EBP", value: 5)
!375 = !DIEnumerator(name: "RID_ESI", value: 6)
!376 = !DIEnumerator(name: "RID_EDI", value: 7)
!377 = !DIEnumerator(name: "RID_R8D", value: 8)
!378 = !DIEnumerator(name: "RID_R9D", value: 9)
!379 = !DIEnumerator(name: "RID_R10D", value: 10)
!380 = !DIEnumerator(name: "RID_R11D", value: 11)
!381 = !DIEnumerator(name: "RID_R12D", value: 12)
!382 = !DIEnumerator(name: "RID_R13D", value: 13)
!383 = !DIEnumerator(name: "RID_R14D", value: 14)
!384 = !DIEnumerator(name: "RID_R15D", value: 15)
!385 = !DIEnumerator(name: "RID_XMM0", value: 16)
!386 = !DIEnumerator(name: "RID_XMM1", value: 17)
!387 = !DIEnumerator(name: "RID_XMM2", value: 18)
!388 = !DIEnumerator(name: "RID_XMM3", value: 19)
!389 = !DIEnumerator(name: "RID_XMM4", value: 20)
!390 = !DIEnumerator(name: "RID_XMM5", value: 21)
!391 = !DIEnumerator(name: "RID_XMM6", value: 22)
!392 = !DIEnumerator(name: "RID_XMM7", value: 23)
!393 = !DIEnumerator(name: "RID_XMM8", value: 24)
!394 = !DIEnumerator(name: "RID_XMM9", value: 25)
!395 = !DIEnumerator(name: "RID_XMM10", value: 26)
!396 = !DIEnumerator(name: "RID_XMM11", value: 27)
!397 = !DIEnumerator(name: "RID_XMM12", value: 28)
!398 = !DIEnumerator(name: "RID_XMM13", value: 29)
!399 = !DIEnumerator(name: "RID_XMM14", value: 30)
!400 = !DIEnumerator(name: "RID_XMM15", value: 31)
!401 = !DIEnumerator(name: "RID_MAX", value: 32)
!402 = !DIEnumerator(name: "RID_MRM", value: 32)
!403 = !DIEnumerator(name: "RID_RIP", value: 37)
!404 = !DIEnumerator(name: "RID_SP", value: 4)
!405 = !DIEnumerator(name: "RID_RET", value: 0)
!406 = !DIEnumerator(name: "RID_FPRET", value: 16)
!407 = !DIEnumerator(name: "RID_BASE", value: 2)
!408 = !DIEnumerator(name: "RID_LPC", value: 3)
!409 = !DIEnumerator(name: "RID_DISPATCH", value: 14)
!410 = !DIEnumerator(name: "RID_MIN_GPR", value: 0)
!411 = !DIEnumerator(name: "RID_MIN_FPR", value: 16)
!412 = !DIEnumerator(name: "RID_MAX_GPR", value: 16)
!413 = !DIEnumerator(name: "RID_MAX_FPR", value: 32)
!414 = !DIEnumerator(name: "RID_NUM_GPR", value: 16)
!415 = !DIEnumerator(name: "RID_NUM_FPR", value: 16)
!416 = !{!417, !423, !440, !430, !419, !429, !434, !442, !443, !441, !446, !447, !470, !568, !479, !634, !744, !745, !460, !627, !747, !748, !749, !751, !753, !754, !755, !756, !758, !530, !759, !780, !917, !453, !918, !919, !721, !920, !921, !924, !925, !926, !464}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSize", file: !418, line: 19, baseType: !419)
!418 = !DIFile(filename: "./lj_obj.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/LuaJIT-2.1-20190507/src", checksumkind: CSK_MD5, checksum: "06795d992b420007c7090a7fd52688df")
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !420, line: 26, baseType: !421)
!420 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !422, line: 42, baseType: !5)
!422 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "SnapShot", file: !4, line: 175, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SnapShot", file: !4, line: 168, size: 96, elements: !426)
!426 = !{!427, !428, !433, !437, !438, !439}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mapofs", scope: !425, file: !4, line: 169, baseType: !419, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !425, file: !4, line: 170, baseType: !429, size: 16, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRRef1", file: !81, line: 443, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !420, line: 25, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !422, line: 40, baseType: !432)
!432 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !425, file: !4, line: 171, baseType: !434, size: 8, offset: 48)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !420, line: 24, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !422, line: 38, baseType: !436)
!436 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "topslot", scope: !425, file: !4, line: 172, baseType: !434, size: 8, offset: 56)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !425, file: !4, line: 173, baseType: !434, size: 8, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !425, file: !4, line: 174, baseType: !434, size: 8, offset: 72)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "SnapEntry", file: !4, line: 180, baseType: !419)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCReg", file: !418, line: 149, baseType: !419)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !444, line: 90, baseType: !445)
!444 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!445 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRType", file: !81, line: 338, baseType: !80)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExitState", file: !367, line: 162, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 158, size: 10240, elements: !450)
!450 = !{!451, !458, !462}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fpr", scope: !449, file: !367, line: 159, baseType: !452, size: 1024)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 1024, elements: !456)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Number", file: !454, line: 100, baseType: !455)
!454 = !DIFile(filename: "./lua.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/LuaJIT-2.1-20190507/src", checksumkind: CSK_MD5, checksum: "255fa697efe8afbe3c913e4a8fc1e62f")
!455 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!456 = !{!457}
!457 = !DISubrange(count: 16)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gpr", scope: !449, file: !367, line: 160, baseType: !459, size: 1024, offset: 1024)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 1024, elements: !456)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !444, line: 87, baseType: !461)
!461 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "spill", scope: !449, file: !367, line: 161, baseType: !463, size: 8192, offset: 2048)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 8192, elements: !468)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !465, line: 26, baseType: !466)
!465 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !422, line: 41, baseType: !467)
!467 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!468 = !{!469}
!469 = !DISubrange(count: 256)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCtrace", file: !4, line: 267, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCtrace", file: !4, line: 234, size: 960, elements: !473)
!473 = !{!474, !481, !482, !483, !484, !486, !487, !488, !543, !544, !545, !546, !547, !548, !549, !551, !552, !555, !556, !557, !558, !560, !561, !562, !563, !564, !565, !566, !567}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !472, file: !4, line: 235, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCRef", file: !418, line: 56, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCRef", file: !418, line: 50, size: 64, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "gcptr64", scope: !476, file: !418, line: 52, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !420, line: 27, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !422, line: 45, baseType: !445)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !472, file: !4, line: 235, baseType: !434, size: 8, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !472, file: !4, line: 235, baseType: !434, size: 8, offset: 72)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "nsnap", scope: !472, file: !4, line: 236, baseType: !430, size: 16, offset: 80)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nins", scope: !472, file: !4, line: 237, baseType: !485, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRRef", file: !81, line: 445, baseType: !419)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "unused_gc64", scope: !472, file: !4, line: 239, baseType: !419, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !472, file: !4, line: 241, baseType: !475, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ir", scope: !472, file: !4, line: 242, baseType: !489, size: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRIns", file: !81, line: 564, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "IRIns", file: !81, line: 540, size: 64, elements: !492)
!492 = !{!493, !501, !515, !516, !517, !522}
!493 = !DIDerivedType(tag: DW_TAG_member, scope: !491, file: !81, line: 541, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !491, file: !81, line: 541, size: 64, elements: !495)
!495 = !{!496, !497, !498, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "op1", scope: !494, file: !81, line: 542, baseType: !429, size: 16)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "op2", scope: !494, file: !81, line: 542, baseType: !429, size: 16, offset: 16)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ot", scope: !494, file: !81, line: 546, baseType: !499, size: 16, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "IROpT", file: !81, line: 438, baseType: !430)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !494, file: !81, line: 547, baseType: !429, size: 16, offset: 48)
!501 = !DIDerivedType(tag: DW_TAG_member, scope: !491, file: !81, line: 549, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !491, file: !81, line: 549, size: 64, elements: !503)
!503 = !{!504, !506, !511, !513, !514}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "op12", scope: !502, file: !81, line: 550, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRRef2", file: !81, line: 444, baseType: !419)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !502, file: !81, line: 551, baseType: !507, size: 8, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRType1", file: !81, line: 343, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IRType1", file: !81, line: 343, size: 8, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "irt", scope: !508, file: !81, line: 343, baseType: !434, size: 8)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !502, file: !81, line: 551, baseType: !512, size: 8, offset: 40)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "IROp1", file: !81, line: 160, baseType: !434)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !502, file: !81, line: 555, baseType: !434, size: 8, offset: 48)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !502, file: !81, line: 555, baseType: !434, size: 8, offset: 56)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !491, file: !81, line: 560, baseType: !464, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "gcr", scope: !491, file: !81, line: 561, baseType: !475, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !491, file: !81, line: 562, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "MRef", file: !418, line: 33, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MRef", file: !418, line: 27, size: 64, elements: !520)
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ptr64", scope: !519, file: !418, line: 29, baseType: !479, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tv", scope: !491, file: !81, line: 563, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "TValue", file: !418, line: 211, baseType: !524, align: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TValue", file: !418, line: 172, size: 64, elements: !525)
!525 = !{!526, !527, !528, !529, !532, !537, !538}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !524, file: !418, line: 173, baseType: !479, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !524, file: !418, line: 174, baseType: !453, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gcr", scope: !524, file: !418, line: 176, baseType: !475, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "it64", scope: !524, file: !418, line: 177, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !465, line: 27, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !422, line: 44, baseType: !461)
!532 = !DIDerivedType(tag: DW_TAG_member, scope: !524, file: !418, line: 178, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !524, file: !418, line: 178, size: 64, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !533, file: !418, line: 179, baseType: !464, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !533, file: !418, line: 179, baseType: !419, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ftsz", scope: !524, file: !418, line: 196, baseType: !530, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !524, file: !418, line: 210, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !524, file: !418, line: 205, size: 64, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !539, file: !418, line: 206, baseType: !419, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !539, file: !418, line: 206, baseType: !419, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !472, file: !4, line: 243, baseType: !485, size: 32, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nsnapmap", scope: !472, file: !4, line: 244, baseType: !419, size: 32, offset: 352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "snap", scope: !472, file: !4, line: 245, baseType: !423, size: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "snapmap", scope: !472, file: !4, line: 246, baseType: !440, size: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "startpt", scope: !472, file: !4, line: 247, baseType: !475, size: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !472, file: !4, line: 248, baseType: !518, size: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "startins", scope: !472, file: !4, line: 249, baseType: !550, size: 32, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCIns", file: !418, line: 147, baseType: !419)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "szmcode", scope: !472, file: !4, line: 250, baseType: !417, size: 32, offset: 672)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mcode", scope: !472, file: !4, line: 251, baseType: !553, size: 64, offset: 704)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "MCode", file: !4, line: 156, baseType: !434)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mcloop", scope: !472, file: !4, line: 252, baseType: !417, size: 32, offset: 768)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nchild", scope: !472, file: !4, line: 253, baseType: !430, size: 16, offset: 800)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "spadjust", scope: !472, file: !4, line: 254, baseType: !430, size: 16, offset: 816)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "traceno", scope: !472, file: !4, line: 255, baseType: !559, size: 16, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "TraceNo1", file: !4, line: 218, baseType: !430)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !472, file: !4, line: 256, baseType: !559, size: 16, offset: 848)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !472, file: !4, line: 257, baseType: !559, size: 16, offset: 864)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nextroot", scope: !472, file: !4, line: 258, baseType: !559, size: 16, offset: 880)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nextside", scope: !472, file: !4, line: 259, baseType: !559, size: 16, offset: 896)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sinktags", scope: !472, file: !4, line: 260, baseType: !434, size: 8, offset: 912)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "topslot", scope: !472, file: !4, line: 261, baseType: !434, size: 8, offset: 920)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "linktype", scope: !472, file: !4, line: 262, baseType: !434, size: 8, offset: 928)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "unused1", scope: !472, file: !4, line: 263, baseType: !434, size: 8, offset: 936)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCobj", file: !418, line: 723, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCobj", file: !418, line: 713, size: 832, elements: !571)
!571 = !{!572, !584, !595, !615, !637, !664, !704, !712, !731}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gch", scope: !570, file: !418, line: 714, baseType: !573, size: 320)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "GChead", file: !418, line: 697, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GChead", file: !418, line: 690, size: 320, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !574, file: !418, line: 691, baseType: !475, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !574, file: !418, line: 691, baseType: !434, size: 8, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !574, file: !418, line: 691, baseType: !434, size: 8, offset: 72)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "unused1", scope: !574, file: !418, line: 692, baseType: !434, size: 8, offset: 80)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "unused2", scope: !574, file: !418, line: 693, baseType: !434, size: 8, offset: 88)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !574, file: !418, line: 694, baseType: !475, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !574, file: !418, line: 695, baseType: !475, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !574, file: !418, line: 696, baseType: !475, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !570, file: !418, line: 715, baseType: !585, size: 192)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCstr", file: !418, line: 297, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCstr", file: !418, line: 291, size: 192, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !586, file: !418, line: 292, baseType: !475, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !586, file: !418, line: 292, baseType: !434, size: 8, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !586, file: !418, line: 292, baseType: !434, size: 8, offset: 72)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !586, file: !418, line: 293, baseType: !434, size: 8, offset: 80)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !586, file: !418, line: 294, baseType: !434, size: 8, offset: 88)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !586, file: !418, line: 295, baseType: !417, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !586, file: !418, line: 296, baseType: !417, size: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !570, file: !418, line: 716, baseType: !596, size: 384)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCupval", file: !418, line: 429, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCupval", file: !418, line: 416, size: 384, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !613, !614}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !597, file: !418, line: 417, baseType: !475, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !597, file: !418, line: 417, baseType: !434, size: 8, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !597, file: !418, line: 417, baseType: !434, size: 8, offset: 72)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !597, file: !418, line: 418, baseType: !434, size: 8, offset: 80)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "immutable", scope: !597, file: !418, line: 419, baseType: !434, size: 8, offset: 88)
!604 = !DIDerivedType(tag: DW_TAG_member, scope: !597, file: !418, line: 420, baseType: !605, size: 128, offset: 128)
!605 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !597, file: !418, line: 420, size: 128, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tv", scope: !605, file: !418, line: 421, baseType: !523, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, scope: !605, file: !418, line: 422, baseType: !609, size: 128)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !605, file: !418, line: 422, size: 128, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !609, file: !418, line: 423, baseType: !475, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !609, file: !418, line: 424, baseType: !475, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !597, file: !418, line: 427, baseType: !518, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dhash", scope: !597, file: !418, line: 428, baseType: !419, size: 32, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !570, file: !418, line: 717, baseType: !616, size: 832)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !454, line: 51, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !418, line: 650, size: 832, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !628, !629, !630, !631, !632, !633, !635, !636}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !617, file: !418, line: 651, baseType: !475, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !617, file: !418, line: 651, baseType: !434, size: 8, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !617, file: !418, line: 651, baseType: !434, size: 8, offset: 72)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_ffid", scope: !617, file: !418, line: 652, baseType: !434, size: 8, offset: 80)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !617, file: !418, line: 653, baseType: !434, size: 8, offset: 88)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "glref", scope: !617, file: !418, line: 654, baseType: !518, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !617, file: !418, line: 655, baseType: !475, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !617, file: !418, line: 656, baseType: !627, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !617, file: !418, line: 657, baseType: !627, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "maxstack", scope: !617, file: !418, line: 658, baseType: !518, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !617, file: !418, line: 659, baseType: !518, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "openupval", scope: !617, file: !418, line: 660, baseType: !475, size: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !617, file: !418, line: 661, baseType: !475, size: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cframe", scope: !617, file: !418, line: 662, baseType: !634, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !617, file: !418, line: 663, baseType: !417, size: 32, offset: 704)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "exdata", scope: !617, file: !418, line: 664, baseType: !634, size: 64, offset: 768)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !570, file: !418, line: 718, baseType: !638, size: 832)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCproto", file: !418, line: 380, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCproto", file: !418, line: 356, size: 832, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !660, !661, !662, !663}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !639, file: !418, line: 357, baseType: !475, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !639, file: !418, line: 357, baseType: !434, size: 8, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !639, file: !418, line: 357, baseType: !434, size: 8, offset: 72)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "numparams", scope: !639, file: !418, line: 358, baseType: !434, size: 8, offset: 80)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "framesize", scope: !639, file: !418, line: 359, baseType: !434, size: 8, offset: 88)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "sizebc", scope: !639, file: !418, line: 360, baseType: !417, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "unused_gc64", scope: !639, file: !418, line: 362, baseType: !419, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !639, file: !418, line: 364, baseType: !475, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !639, file: !418, line: 365, baseType: !518, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !639, file: !418, line: 366, baseType: !518, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sizekgc", scope: !639, file: !418, line: 367, baseType: !417, size: 32, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sizekn", scope: !639, file: !418, line: 368, baseType: !417, size: 32, offset: 416)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sizept", scope: !639, file: !418, line: 369, baseType: !417, size: 32, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sizeuv", scope: !639, file: !418, line: 370, baseType: !434, size: 8, offset: 480)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !639, file: !418, line: 371, baseType: !434, size: 8, offset: 488)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "trace", scope: !639, file: !418, line: 372, baseType: !430, size: 16, offset: 496)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "chunkname", scope: !639, file: !418, line: 374, baseType: !475, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "firstline", scope: !639, file: !418, line: 375, baseType: !659, size: 32, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCLine", file: !418, line: 150, baseType: !464)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "numline", scope: !639, file: !418, line: 376, baseType: !659, size: 32, offset: 608)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lineinfo", scope: !639, file: !418, line: 377, baseType: !518, size: 64, offset: 640)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "uvinfo", scope: !639, file: !418, line: 378, baseType: !518, size: 64, offset: 704)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "varinfo", scope: !639, file: !418, line: 379, baseType: !518, size: 64, offset: 768)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !570, file: !418, line: 719, baseType: !665, size: 448)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCfunc", file: !418, line: 456, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "GCfunc", file: !418, line: 453, size: 448, elements: !667)
!667 = !{!668, !690}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !666, file: !418, line: 454, baseType: !669, size: 448)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCfuncC", file: !418, line: 446, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCfuncC", file: !418, line: 442, size: 448, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !686}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !670, file: !418, line: 443, baseType: !475, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !670, file: !418, line: 443, baseType: !434, size: 8, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !670, file: !418, line: 443, baseType: !434, size: 8, offset: 72)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ffid", scope: !670, file: !418, line: 443, baseType: !434, size: 8, offset: 80)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !670, file: !418, line: 443, baseType: !434, size: 8, offset: 88)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !670, file: !418, line: 443, baseType: !475, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !670, file: !418, line: 443, baseType: !475, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !670, file: !418, line: 443, baseType: !518, size: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !670, file: !418, line: 444, baseType: !681, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_CFunction", file: !454, line: 53, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!467, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "upvalue", scope: !670, file: !418, line: 445, baseType: !687, size: 64, align: 64, offset: 384)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 64, align: 64, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 1)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !666, file: !418, line: 455, baseType: !691, size: 384)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCfuncL", file: !418, line: 451, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCfuncL", file: !418, line: 448, size: 384, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !692, file: !418, line: 449, baseType: !475, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !692, file: !418, line: 449, baseType: !434, size: 8, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !692, file: !418, line: 449, baseType: !434, size: 8, offset: 72)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ffid", scope: !692, file: !418, line: 449, baseType: !434, size: 8, offset: 80)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nupvalues", scope: !692, file: !418, line: 449, baseType: !434, size: 8, offset: 88)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !692, file: !418, line: 449, baseType: !475, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !692, file: !418, line: 449, baseType: !475, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !692, file: !418, line: 449, baseType: !518, size: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "uvptr", scope: !692, file: !418, line: 450, baseType: !703, size: 64, offset: 320)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 64, elements: !688)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !570, file: !418, line: 720, baseType: !705, size: 128)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCcdata", file: !418, line: 335, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCcdata", file: !418, line: 332, size: 128, elements: !707)
!707 = !{!708, !709, !710, !711}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !706, file: !418, line: 333, baseType: !475, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !706, file: !418, line: 333, baseType: !434, size: 8, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !706, file: !418, line: 333, baseType: !434, size: 8, offset: 72)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ctypeid", scope: !706, file: !418, line: 334, baseType: !430, size: 16, offset: 80)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !570, file: !418, line: 721, baseType: !713, size: 512)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCtab", file: !418, line: 495, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCtab", file: !418, line: 482, size: 512, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !724, !725, !726, !727, !728, !729, !730}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !714, file: !418, line: 483, baseType: !475, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !714, file: !418, line: 483, baseType: !434, size: 8, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !714, file: !418, line: 483, baseType: !434, size: 8, offset: 72)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nomm", scope: !714, file: !418, line: 484, baseType: !434, size: 8, offset: 80)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "colo", scope: !714, file: !418, line: 485, baseType: !721, size: 8, offset: 88)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !465, line: 24, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !422, line: 37, baseType: !723)
!723 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !714, file: !418, line: 486, baseType: !518, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "gclist", scope: !714, file: !418, line: 487, baseType: !475, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !714, file: !418, line: 488, baseType: !475, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !714, file: !418, line: 489, baseType: !518, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "asize", scope: !714, file: !418, line: 490, baseType: !419, size: 32, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "hmask", scope: !714, file: !418, line: 491, baseType: !419, size: 32, offset: 416)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "freetop", scope: !714, file: !418, line: 493, baseType: !518, size: 64, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !570, file: !418, line: 722, baseType: !732, size: 384)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCudata", file: !418, line: 316, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCudata", file: !418, line: 308, size: 384, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nextgc", scope: !733, file: !418, line: 309, baseType: !475, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !733, file: !418, line: 309, baseType: !434, size: 8, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "gct", scope: !733, file: !418, line: 309, baseType: !434, size: 8, offset: 72)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "udtype", scope: !733, file: !418, line: 310, baseType: !434, size: 8, offset: 80)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "unused2", scope: !733, file: !418, line: 311, baseType: !434, size: 8, offset: 88)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !733, file: !418, line: 312, baseType: !475, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !733, file: !418, line: 313, baseType: !417, size: 32, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "metatable", scope: !733, file: !418, line: 314, baseType: !475, size: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "align1", scope: !733, file: !418, line: 315, baseType: !419, size: 32, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCOp", file: !231, line: 205, baseType: !230)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !750, line: 59, baseType: !461)
!750 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCMode", file: !231, line: 243, baseType: !342)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "IROp", file: !81, line: 157, baseType: !118)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRef", file: !81, line: 480, baseType: !419)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "CTypeID", file: !757, line: 139, baseType: !419)
!757 = !DIFile(filename: "./lj_ctype.h", directory: "/local-ssd/openresty-gqh4ydyc65xmp7amyu73wgyb2hoaezxd-build/aidengro/spack-stage-openresty-1.15.8.2-gqh4ydyc65xmp7amyu73wgyb2hoaezxd/spack-src/build/LuaJIT-2.1-20190507/src", checksumkind: CSK_MD5, checksum: "f6829f23df8df6ff4e189f073a1c6e61")
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "CTState", file: !757, line: 184, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CTState", file: !757, line: 174, size: 3776, elements: !762)
!762 = !{!763, !776, !777, !778, !779, !883, !885, !886, !913}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !761, file: !757, line: 175, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "CType", file: !757, line: 149, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CType", file: !757, line: 143, size: 192, elements: !767)
!767 = !{!768, !770, !772, !774, !775}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !766, file: !757, line: 144, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "CTInfo", file: !757, line: 137, baseType: !419)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !766, file: !757, line: 145, baseType: !771, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "CTSize", file: !757, line: 138, baseType: !419)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !766, file: !757, line: 146, baseType: !773, size: 16, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "CTypeID1", file: !757, line: 140, baseType: !430)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !766, file: !757, line: 147, baseType: !773, size: 16, offset: 80)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !766, file: !757, line: 148, baseType: !475, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !761, file: !757, line: 176, baseType: !756, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sizetab", scope: !761, file: !757, line: 177, baseType: !417, size: 32, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !761, file: !757, line: 178, baseType: !685, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !761, file: !757, line: 179, baseType: !780, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_State", file: !418, line: 625, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_State", file: !418, line: 594, size: 5440, elements: !783)
!783 = !{!784, !786, !787, !788, !794, !795, !817, !819, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !843, !844, !845, !846, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "strhash", scope: !782, file: !418, line: 595, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "strmask", scope: !782, file: !418, line: 596, baseType: !417, size: 32, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "strnum", scope: !782, file: !418, line: 597, baseType: !417, size: 32, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "allocf", scope: !782, file: !418, line: 598, baseType: !789, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Alloc", file: !454, line: 67, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!634, !634, !634, !793, !793}
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !750, line: 70, baseType: !445)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "allocd", scope: !782, file: !418, line: 599, baseType: !634, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !782, file: !418, line: 600, baseType: !796, size: 768, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCState", file: !418, line: 591, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GCState", file: !418, line: 573, size: 768, elements: !798)
!798 = !{!799, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !797, file: !418, line: 574, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCSize", file: !418, line: 21, baseType: !479)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !797, file: !418, line: 575, baseType: !800, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "currentwhite", scope: !797, file: !418, line: 576, baseType: !434, size: 8, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !797, file: !418, line: 577, baseType: !434, size: 8, offset: 136)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nocdatafin", scope: !797, file: !418, line: 578, baseType: !434, size: 8, offset: 144)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "unused2", scope: !797, file: !418, line: 579, baseType: !434, size: 8, offset: 152)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sweepstr", scope: !797, file: !418, line: 580, baseType: !417, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !797, file: !418, line: 581, baseType: !475, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sweep", scope: !797, file: !418, line: 582, baseType: !518, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !797, file: !418, line: 583, baseType: !475, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "grayagain", scope: !797, file: !418, line: 584, baseType: !475, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !797, file: !418, line: 585, baseType: !475, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mmudata", scope: !797, file: !418, line: 586, baseType: !475, size: 64, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "debt", scope: !797, file: !418, line: 587, baseType: !800, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "estimate", scope: !797, file: !418, line: 588, baseType: !800, size: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "stepmul", scope: !797, file: !418, line: 589, baseType: !417, size: 32, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !797, file: !418, line: 590, baseType: !417, size: 32, offset: 736)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vmstate", scope: !782, file: !418, line: 601, baseType: !818, size: 32, offset: 1024)
!818 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !464)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tmpbuf", scope: !782, file: !418, line: 602, baseType: !820, size: 256, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBuf", file: !418, line: 161, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBuf", file: !418, line: 156, size: 256, elements: !822)
!822 = !{!823, !824, !825, !826}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !821, file: !418, line: 157, baseType: !518, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !821, file: !418, line: 158, baseType: !518, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !821, file: !418, line: 159, baseType: !518, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !821, file: !418, line: 160, baseType: !518, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "strempty", scope: !782, file: !418, line: 603, baseType: !585, size: 192, offset: 1344)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "stremptyz", scope: !782, file: !418, line: 604, baseType: !434, size: 8, offset: 1536)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "hookmask", scope: !782, file: !418, line: 605, baseType: !434, size: 8, offset: 1544)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "dispatchmode", scope: !782, file: !418, line: 606, baseType: !434, size: 8, offset: 1552)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "vmevmask", scope: !782, file: !418, line: 607, baseType: !434, size: 8, offset: 1560)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mainthref", scope: !782, file: !418, line: 608, baseType: !475, size: 64, offset: 1600)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "registrytv", scope: !782, file: !418, line: 609, baseType: !523, size: 64, align: 64, offset: 1664)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tmptv", scope: !782, file: !418, line: 610, baseType: !523, size: 64, align: 64, offset: 1728)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tmptv2", scope: !782, file: !418, line: 610, baseType: !523, size: 64, align: 64, offset: 1792)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "nilnode", scope: !782, file: !418, line: 611, baseType: !837, size: 192, offset: 1856)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !418, line: 478, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !418, line: 471, size: 192, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !838, file: !418, line: 472, baseType: !523, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !838, file: !418, line: 473, baseType: !523, size: 64, align: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !838, file: !418, line: 474, baseType: !518, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "uvhead", scope: !782, file: !418, line: 612, baseType: !596, size: 384, offset: 2048)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "hookcount", scope: !782, file: !418, line: 613, baseType: !464, size: 32, offset: 2432)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "hookcstart", scope: !782, file: !418, line: 614, baseType: !464, size: 32, offset: 2464)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "hookf", scope: !782, file: !418, line: 615, baseType: !847, size: 64, offset: 2496)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Hook", file: !454, line: 334, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !685, !851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_Debug", file: !454, line: 330, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lua_Debug", file: !454, line: 362, size: 960, elements: !854)
!854 = !{!855, !856, !859, !860, !861, !862, !863, !864, !865, !866, !870}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !853, file: !454, line: 363, baseType: !467, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !454, line: 364, baseType: !857, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "namewhat", scope: !853, file: !454, line: 365, baseType: !857, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "what", scope: !853, file: !454, line: 366, baseType: !857, size: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !853, file: !454, line: 367, baseType: !857, size: 64, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "currentline", scope: !853, file: !454, line: 368, baseType: !467, size: 32, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "nups", scope: !853, file: !454, line: 369, baseType: !467, size: 32, offset: 352)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "linedefined", scope: !853, file: !454, line: 370, baseType: !467, size: 32, offset: 384)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lastlinedefined", scope: !853, file: !454, line: 371, baseType: !467, size: 32, offset: 416)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "short_src", scope: !853, file: !454, line: 372, baseType: !867, size: 480, offset: 448)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 480, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 60)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i_ci", scope: !853, file: !454, line: 374, baseType: !467, size: 32, offset: 928)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "wrapf", scope: !782, file: !418, line: 616, baseType: !681, size: 64, offset: 2560)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !782, file: !418, line: 617, baseType: !681, size: 64, offset: 2624)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "bc_cfunc_int", scope: !782, file: !418, line: 618, baseType: !550, size: 32, offset: 2688)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bc_cfunc_ext", scope: !782, file: !418, line: 619, baseType: !550, size: 32, offset: 2720)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "cur_L", scope: !782, file: !418, line: 620, baseType: !475, size: 64, offset: 2752)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "jit_base", scope: !782, file: !418, line: 621, baseType: !518, size: 64, offset: 2816)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "saved_jit_base", scope: !782, file: !418, line: 622, baseType: !518, size: 64, offset: 2880)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_state", scope: !782, file: !418, line: 623, baseType: !518, size: 64, offset: 2944)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "gcroot", scope: !782, file: !418, line: 624, baseType: !880, size: 2432, offset: 3008)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 2432, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 38)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "finalizer", scope: !761, file: !757, line: 180, baseType: !884, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "miscmap", scope: !761, file: !757, line: 181, baseType: !884, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !761, file: !757, line: 182, baseType: !887, size: 1344, align: 64, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCallback", file: !757, line: 171, baseType: !888, align: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CCallback", file: !757, line: 162, size: 1344, elements: !889)
!889 = !{!890, !903, !905, !907, !908, !910, !911, !912}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fpr", scope: !888, file: !757, line: 163, baseType: !891, size: 512, align: 64)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 512, align: 64, elements: !901)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPRCBArg", file: !757, line: 158, baseType: !893, align: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "FPRCBArg", file: !757, line: 158, size: 64, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !893, file: !757, line: 158, baseType: !455, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !893, file: !757, line: 158, baseType: !897, size: 64)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 64, elements: !899)
!898 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!899 = !{!900}
!900 = !DISubrange(count: 2)
!901 = !{!902}
!902 = !DISubrange(count: 8)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gpr", scope: !888, file: !757, line: 164, baseType: !904, size: 512, offset: 512)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 512, elements: !901)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !888, file: !757, line: 165, baseType: !906, size: 64, offset: 1024)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mcode", scope: !888, file: !757, line: 166, baseType: !634, size: 64, offset: 1088)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "cbid", scope: !888, file: !757, line: 167, baseType: !909, size: 64, offset: 1152)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "sizeid", scope: !888, file: !757, line: 168, baseType: !417, size: 32, offset: 1216)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "topid", scope: !888, file: !757, line: 169, baseType: !417, size: 32, offset: 1248)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !888, file: !757, line: 170, baseType: !417, size: 32, offset: 1280)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !761, file: !757, line: 183, baseType: !914, size: 2048, offset: 1728)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 2048, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 128)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !465, line: 25, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !422, line: 39, baseType: !923)
!923 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!927 = !{i32 7, !"Dwarf Version", i32 5}
!928 = !{i32 2, !"Debug Info Version", i32 3}
!929 = !{i32 1, !"wchar_size", i32 4}
!930 = !{i32 8, !"PIC Level", i32 2}
!931 = !{i32 7, !"PIE Level", i32 2}
!932 = !{i32 7, !"uwtable", i32 2}
!933 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!934 = distinct !DISubprogram(name: "lj_snap_grow_buf_", scope: !1, file: !1, line: 38, type: !935, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1063)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !937, !417}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "jit_State", file: !4, line: 495, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jit_State", file: !4, line: 393, size: 24960, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !947, !948, !950, !951, !952, !953, !954, !955, !956, !957, !965, !966, !967, !969, !970, !971, !972, !973, !974, !978, !982, !984, !985, !986, !987, !988, !989, !990, !991, !992, !994, !995, !996, !998, !999, !1000, !1004, !1008, !1012, !1014, !1024, !1025, !1026, !1034, !1035, !1046, !1047, !1048, !1050, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !939, file: !4, line: 394, baseType: !471, size: 960)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "curfinal", scope: !939, file: !4, line: 395, baseType: !470, size: 64, offset: 960)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !939, file: !4, line: 397, baseType: !685, size: 64, offset: 1024)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !939, file: !4, line: 398, baseType: !751, size: 64, offset: 1088)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !939, file: !4, line: 399, baseType: !946, size: 64, offset: 1152)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !939, file: !4, line: 400, baseType: !747, size: 64, offset: 1216)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !939, file: !4, line: 401, baseType: !949, size: 64, offset: 1280)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !939, file: !4, line: 403, baseType: !419, size: 32, offset: 1344)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "maxslot", scope: !939, file: !4, line: 404, baseType: !442, size: 32, offset: 1376)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "baseslot", scope: !939, file: !4, line: 405, baseType: !442, size: 32, offset: 1408)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "mergesnap", scope: !939, file: !4, line: 407, baseType: !434, size: 8, offset: 1440)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "needsnap", scope: !939, file: !4, line: 408, baseType: !434, size: 8, offset: 1448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "guardemit", scope: !939, file: !4, line: 409, baseType: !507, size: 8, offset: 1456)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "bcskip", scope: !939, file: !4, line: 410, baseType: !434, size: 8, offset: 1464)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fold", scope: !939, file: !4, line: 412, baseType: !958, size: 320, offset: 1472)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "FoldState", file: !4, line: 390, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FoldState", file: !4, line: 386, size: 320, elements: !960)
!960 = !{!961, !962, !964}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !959, file: !4, line: 387, baseType: !490, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !959, file: !4, line: 388, baseType: !963, size: 128, offset: 64)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 128, elements: !899)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !959, file: !4, line: 389, baseType: !963, size: 128, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "bc_min", scope: !939, file: !4, line: 414, baseType: !751, size: 64, offset: 1792)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bc_extent", scope: !939, file: !4, line: 415, baseType: !417, size: 32, offset: 1856)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !939, file: !4, line: 417, baseType: !968, size: 32, offset: 1888)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "TraceState", file: !4, line: 141, baseType: !3)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "instunroll", scope: !939, file: !4, line: 419, baseType: !464, size: 32, offset: 1920)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "loopunroll", scope: !939, file: !4, line: 420, baseType: !464, size: 32, offset: 1952)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "tailcalled", scope: !939, file: !4, line: 421, baseType: !464, size: 32, offset: 1984)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "framedepth", scope: !939, file: !4, line: 422, baseType: !464, size: 32, offset: 2016)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "retdepth", scope: !939, file: !4, line: 423, baseType: !464, size: 32, offset: 2048)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ksimd", scope: !939, file: !4, line: 425, baseType: !975, size: 320, align: 64, offset: 2112)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 320, align: 64, elements: !976)
!976 = !{!977}
!977 = !DISubrange(count: 5)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "k64", scope: !939, file: !4, line: 426, baseType: !979, size: 192, align: 64, offset: 2432)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 192, align: 64, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 3)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "k32", scope: !939, file: !4, line: 427, baseType: !983, size: 32, offset: 2624)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 32, elements: !688)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "irbuf", scope: !939, file: !4, line: 429, baseType: !489, size: 64, offset: 2688)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "irtoplim", scope: !939, file: !4, line: 430, baseType: !485, size: 32, offset: 2752)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "irbotlim", scope: !939, file: !4, line: 431, baseType: !485, size: 32, offset: 2784)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "loopref", scope: !939, file: !4, line: 432, baseType: !485, size: 32, offset: 2816)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "sizesnap", scope: !939, file: !4, line: 434, baseType: !417, size: 32, offset: 2848)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "snapbuf", scope: !939, file: !4, line: 435, baseType: !423, size: 64, offset: 2880)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "snapmapbuf", scope: !939, file: !4, line: 436, baseType: !440, size: 64, offset: 2944)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "sizesnapmap", scope: !939, file: !4, line: 437, baseType: !417, size: 32, offset: 3008)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "postproc", scope: !939, file: !4, line: 439, baseType: !993, size: 32, offset: 3040)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "PostProc", file: !4, line: 152, baseType: !14)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "retryrec", scope: !939, file: !4, line: 443, baseType: !434, size: 8, offset: 3072)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "trace", scope: !939, file: !4, line: 445, baseType: !785, size: 64, offset: 3136)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "freetrace", scope: !939, file: !4, line: 446, baseType: !997, size: 32, offset: 3200)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "TraceNo", file: !4, line: 217, baseType: !419)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "sizetrace", scope: !939, file: !4, line: 447, baseType: !417, size: 32, offset: 3232)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ktrace", scope: !939, file: !4, line: 448, baseType: !429, size: 16, offset: 3264)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !939, file: !4, line: 450, baseType: !1001, size: 1600, offset: 3280)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 1600, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 100)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !939, file: !4, line: 451, baseType: !1005, size: 8224, offset: 4896)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 8224, elements: !1006)
!1006 = !{!1007}
!1007 = !DISubrange(count: 257)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !939, file: !4, line: 453, baseType: !1009, size: 480, offset: 13120)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 480, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 15)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "exitstubgroup", scope: !939, file: !4, line: 455, baseType: !1013, size: 1024, offset: 13632)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 1024, elements: !456)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "penalty", scope: !939, file: !4, line: 457, baseType: !1015, size: 8192, offset: 14656)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1016, size: 8192, elements: !1022)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "HotPenalty", file: !4, line: 288, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HotPenalty", file: !4, line: 284, size: 128, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !1017, file: !4, line: 285, baseType: !518, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1017, file: !4, line: 286, baseType: !430, size: 16, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !1017, file: !4, line: 287, baseType: !430, size: 16, offset: 80)
!1022 = !{!1023}
!1023 = !DISubrange(count: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "penaltyslot", scope: !939, file: !4, line: 458, baseType: !419, size: 32, offset: 22848)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "prngstate", scope: !939, file: !4, line: 459, baseType: !419, size: 32, offset: 22880)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "bpropcache", scope: !939, file: !4, line: 465, baseType: !1027, size: 1024, offset: 22912)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 1024, elements: !456)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPropEntry", file: !4, line: 300, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BPropEntry", file: !4, line: 296, size: 64, elements: !1030)
!1030 = !{!1031, !1032, !1033}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1029, file: !4, line: 297, baseType: !429, size: 16)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1029, file: !4, line: 298, baseType: !429, size: 16, offset: 16)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1029, file: !4, line: 299, baseType: !485, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "bpropslot", scope: !939, file: !4, line: 466, baseType: !419, size: 32, offset: 23936)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "scev", scope: !939, file: !4, line: 468, baseType: !1036, size: 192, offset: 24000)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScEvEntry", file: !4, line: 314, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScEvEntry", file: !4, line: 306, size: 192, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !1037, file: !4, line: 307, baseType: !518, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1037, file: !4, line: 308, baseType: !429, size: 16, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1037, file: !4, line: 309, baseType: !429, size: 16, offset: 80)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1037, file: !4, line: 310, baseType: !429, size: 16, offset: 96)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1037, file: !4, line: 311, baseType: !429, size: 16, offset: 112)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1037, file: !4, line: 312, baseType: !507, size: 8, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1037, file: !4, line: 313, baseType: !434, size: 8, offset: 136)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", scope: !939, file: !4, line: 470, baseType: !751, size: 64, offset: 24192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !939, file: !4, line: 471, baseType: !997, size: 32, offset: 24256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "exitno", scope: !939, file: !4, line: 472, baseType: !1049, size: 32, offset: 24288)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExitNo", file: !4, line: 214, baseType: !419)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "patchpc", scope: !939, file: !4, line: 474, baseType: !1051, size: 64, offset: 24320)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "patchins", scope: !939, file: !4, line: 475, baseType: !550, size: 32, offset: 24384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "mcprot", scope: !939, file: !4, line: 477, baseType: !467, size: 32, offset: 24416)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "mcarea", scope: !939, file: !4, line: 478, baseType: !553, size: 64, offset: 24448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "mctop", scope: !939, file: !4, line: 479, baseType: !553, size: 64, offset: 24512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "mcbot", scope: !939, file: !4, line: 480, baseType: !553, size: 64, offset: 24576)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "szmcarea", scope: !939, file: !4, line: 481, baseType: !793, size: 64, offset: 24640)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "szallmcarea", scope: !939, file: !4, line: 482, baseType: !793, size: 64, offset: 24704)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "errinfo", scope: !939, file: !4, line: 484, baseType: !523, size: 64, align: 64, offset: 24768)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "prev_pt", scope: !939, file: !4, line: 487, baseType: !747, size: 64, offset: 24832)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "prev_line", scope: !939, file: !4, line: 488, baseType: !659, size: 32, offset: 24896)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "prof_mode", scope: !939, file: !4, line: 489, baseType: !467, size: 32, offset: 24928)
!1063 = !{!1064, !1065, !1066}
!1064 = !DILocalVariable(name: "J", arg: 1, scope: !934, file: !1, line: 38, type: !937)
!1065 = !DILocalVariable(name: "need", arg: 2, scope: !934, file: !1, line: 38, type: !417)
!1066 = !DILocalVariable(name: "maxsnap", scope: !934, file: !1, line: 40, type: !417)
!1067 = !{!1068, !1068, i64 0}
!1068 = !{!"any pointer", !1069, i64 0}
!1069 = !{!"omnipotent char", !1070, i64 0}
!1070 = !{!"Simple C/C++ TBAA"}
!1071 = !DILocation(line: 38, column: 35, scope: !934)
!1072 = !{!1073, !1073, i64 0}
!1073 = !{!"int", !1069, i64 0}
!1074 = !DILocation(line: 38, column: 44, scope: !934)
!1075 = !DILocation(line: 40, column: 3, scope: !934)
!1076 = !DILocation(line: 40, column: 9, scope: !934)
!1077 = !DILocation(line: 40, column: 26, scope: !934)
!1078 = !DILocation(line: 40, column: 29, scope: !934)
!1079 = !DILocation(line: 41, column: 7, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !934, file: !1, line: 41, column: 7)
!1081 = !DILocation(line: 41, column: 14, scope: !1080)
!1082 = !DILocation(line: 41, column: 12, scope: !1080)
!1083 = !DILocation(line: 41, column: 7, scope: !934)
!1084 = !DILocation(line: 42, column: 18, scope: !1080)
!1085 = !DILocation(line: 42, column: 5, scope: !1080)
!1086 = !DILocation(line: 43, column: 3, scope: !934)
!1087 = !{!1088, !1068, i64 128}
!1088 = !{!"jit_State", !1089, i64 0, !1068, i64 120, !1068, i64 128, !1068, i64 136, !1068, i64 144, !1068, i64 152, !1068, i64 160, !1073, i64 168, !1073, i64 172, !1073, i64 176, !1069, i64 180, !1069, i64 181, !1094, i64 182, !1069, i64 183, !1095, i64 184, !1068, i64 224, !1073, i64 232, !1069, i64 236, !1073, i64 240, !1073, i64 244, !1073, i64 248, !1073, i64 252, !1073, i64 256, !1069, i64 264, !1069, i64 304, !1069, i64 328, !1068, i64 336, !1073, i64 344, !1073, i64 348, !1073, i64 352, !1073, i64 356, !1068, i64 360, !1068, i64 368, !1073, i64 376, !1069, i64 380, !1069, i64 384, !1068, i64 392, !1073, i64 400, !1073, i64 404, !1092, i64 408, !1069, i64 410, !1069, i64 612, !1069, i64 1640, !1069, i64 1704, !1069, i64 1832, !1073, i64 2856, !1073, i64 2860, !1069, i64 2864, !1073, i64 2992, !1096, i64 3000, !1068, i64 3024, !1073, i64 3032, !1073, i64 3036, !1068, i64 3040, !1073, i64 3048, !1073, i64 3052, !1068, i64 3056, !1068, i64 3064, !1068, i64 3072, !1091, i64 3080, !1091, i64 3088, !1069, i64 3096, !1068, i64 3104, !1073, i64 3112, !1073, i64 3116}
!1089 = !{!"GCtrace", !1090, i64 0, !1069, i64 8, !1069, i64 9, !1092, i64 10, !1073, i64 12, !1073, i64 16, !1090, i64 24, !1068, i64 32, !1073, i64 40, !1073, i64 44, !1068, i64 48, !1068, i64 56, !1090, i64 64, !1093, i64 72, !1073, i64 80, !1073, i64 84, !1068, i64 88, !1073, i64 96, !1092, i64 100, !1092, i64 102, !1092, i64 104, !1092, i64 106, !1092, i64 108, !1092, i64 110, !1092, i64 112, !1069, i64 114, !1069, i64 115, !1069, i64 116, !1069, i64 117}
!1090 = !{!"GCRef", !1091, i64 0}
!1091 = !{!"long", !1069, i64 0}
!1092 = !{!"short", !1069, i64 0}
!1093 = !{!"MRef", !1091, i64 0}
!1094 = !{!"IRType1", !1069, i64 0}
!1095 = !{!"FoldState", !1069, i64 0, !1069, i64 8, !1069, i64 24}
!1096 = !{!"ScEvEntry", !1093, i64 0, !1092, i64 8, !1092, i64 10, !1092, i64 12, !1092, i64 14, !1094, i64 16, !1069, i64 17}
!1097 = !{!1088, !1068, i64 360}
!1098 = !DILocation(line: 44, column: 17, scope: !934)
!1099 = !DILocation(line: 44, column: 20, scope: !934)
!1100 = !DILocation(line: 44, column: 3, scope: !934)
!1101 = !DILocation(line: 44, column: 6, scope: !934)
!1102 = !DILocation(line: 44, column: 10, scope: !934)
!1103 = !DILocation(line: 44, column: 15, scope: !934)
!1104 = !{!1088, !1068, i64 48}
!1105 = !DILocation(line: 45, column: 1, scope: !934)
!1106 = !DISubprogram(name: "lj_trace_err", scope: !42, file: !42, line: 22, type: !1107, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
