; ModuleID = 'samples/925.bc'
source_filename = "src/http/modules/ngx_http_index_module.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ngx_http_module_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.ngx_command_s = type { %struct.ngx_str_t, i64, ptr, i64, i64, ptr }
%struct.ngx_str_t = type { i64, ptr }
%struct.ngx_module_s = type { i64, i64, ptr, i64, i64, i64, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.ngx_conf_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr }
%struct.ngx_http_conf_ctx_t = type { ptr, ptr, ptr }
%struct.ngx_http_core_main_conf_t = type { %struct.ngx_array_t, %struct.ngx_http_phase_engine_t, %struct.ngx_hash_t, %struct.ngx_hash_t, %struct.ngx_array_t, %struct.ngx_array_t, i64, i64, i64, i64, i64, ptr, ptr, [11 x %struct.ngx_http_phase_t] }
%struct.ngx_http_phase_engine_t = type { ptr, i64, i64 }
%struct.ngx_hash_t = type { ptr, i64 }
%struct.ngx_array_t = type { ptr, i64, i64, i64, ptr }
%struct.ngx_http_phase_t = type { %struct.ngx_array_t }
%struct.ngx_http_index_loc_conf_t = type { ptr, i64 }
%struct.ngx_http_index_t = type { %struct.ngx_str_t, ptr, ptr }
%struct.ngx_open_file_info_t = type { i32, i64, i64, i64, i64, i64, i64, i32, ptr, i64, i64, i64, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 71, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/http/modules/ngx_http_index_module.c", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "fbd6e50423e9545c946a0be1b2f43c74")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 41)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "ngx_http_index_module_ctx", scope: !9, file: !2, line: 55, type: !2042, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !26, globals: !1997, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11}
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 107, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "986bd9deaafaed2b6d3cae2ecc572d0b")
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!15 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!16 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!17 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!18 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!19 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!20 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!21 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!22 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!23 = !DIEnumerator(name: "NGX_HTTP_PRECONTENT_PHASE", value: 8)
!24 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!25 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!26 = !{!27, !32, !33, !42, !43, !1992, !51, !56}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !28, line: 79, baseType: !29)
!28 = !DIFile(filename: "src/core/ngx_config.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "1030e66de4bc6fae79f292da1593286a")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !30, line: 90, baseType: !31)
!30 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!31 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !35, line: 21, baseType: !36)
!35 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "f0f323751ab5b63196467d991a0424cd")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 17, size: 192, elements: !37)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !36, file: !35, line: 18, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !36, file: !35, line: 19, baseType: !39, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !36, file: !35, line: 20, baseType: !39, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_len_code_pt", file: !45, line: 90, baseType: !46)
!45 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "c6267aff67e650adcd8c4290fd2f4626")
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !51}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 29, baseType: !31)
!50 = !DIFile(filename: "/usr/include/glob.h", directory: "", checksumkind: CSK_MD5, checksum: "fe493b50b1dc220fe9bcfb4d648abdef")
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_engine_t", file: !45, line: 36, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 17, size: 704, elements: !54)
!54 = !{!55, !62, !63, !77, !83, !84, !85, !86, !87, !88, !89, !90, !96}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !53, file: !45, line: 18, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !58, line: 33, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !60, line: 31, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!61 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !53, file: !45, line: 19, baseType: !56, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !53, file: !45, line: 20, baseType: !64, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !66, line: 17, baseType: !67)
!66 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "282b3527419dfe56984107919878b418")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !68, line: 37, baseType: !69)
!68 = !DIFile(filename: "src/core/ngx_string.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2f3ab61eca09df707b083ffd5eafea4f")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 28, size: 128, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !69, file: !68, line: 29, baseType: !13, size: 28, flags: DIFlagBitField, extraData: i64 0)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !69, file: !68, line: 31, baseType: !13, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !69, file: !68, line: 32, baseType: !13, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !69, file: !68, line: 33, baseType: !13, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !69, file: !68, line: 34, baseType: !13, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !69, file: !68, line: 36, baseType: !56, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !53, file: !45, line: 22, baseType: !78, size: 128, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !68, line: 19, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 16, size: 128, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !79, file: !68, line: 17, baseType: !49, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !68, line: 18, baseType: !56, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !53, file: !45, line: 23, baseType: !78, size: 128, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !53, file: !45, line: 26, baseType: !56, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !53, file: !45, line: 28, baseType: !13, size: 1, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !53, file: !45, line: 29, baseType: !13, size: 1, offset: 513, flags: DIFlagBitField, extraData: i64 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !53, file: !45, line: 30, baseType: !13, size: 1, offset: 514, flags: DIFlagBitField, extraData: i64 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "is_args", scope: !53, file: !45, line: 31, baseType: !13, size: 1, offset: 515, flags: DIFlagBitField, extraData: i64 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !53, file: !45, line: 32, baseType: !13, size: 1, offset: 516, flags: DIFlagBitField, extraData: i64 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !53, file: !45, line: 34, baseType: !91, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !28, line: 78, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !93, line: 267, baseType: !94)
!93 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !60, line: 207, baseType: !95)
!95 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !53, file: !45, line: 35, baseType: !97, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !99, line: 16, baseType: !100)
!99 = !DIFile(filename: "src/http/ngx_http.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "7164149d4c2473091a4e1c4f6baa1b7e")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !101, line: 377, size: 10624, elements: !102)
!101 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2bd9fa6c0840df2506a27db4121d9c74")
!102 = !{!103, !107, !533, !534, !535, !536, !537, !542, !543, !772, !1515, !1516, !1517, !1518, !1562, !1594, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1643, !1654, !1661, !1662, !1664, !1665, !1666, !1667, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1882, !1886, !1891, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !100, file: !101, line: 378, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !105, line: 26, baseType: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !60, line: 42, baseType: !13)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !100, file: !101, line: 380, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !110, line: 26, baseType: !111)
!110 = !DIFile(filename: "src/core/ngx_core.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "20a149d22b95b5c7a0a8830d485b97ae")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !112, line: 122, size: 1856, elements: !113)
!112 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "212f2f4879dcb10799877db6a93ee4ed")
!113 = !{!114, !115, !215, !216, !219, !227, !229, !319, !324, !399, !400, !401, !438, !439, !440, !441, !442, !457, !504, !508, !509, !510, !511, !512, !513, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !111, file: !112, line: 123, baseType: !32, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !111, file: !112, line: 124, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !110, line: 24, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !119, line: 30, size: 768, elements: !120)
!119 = !DIFile(filename: "src/event/ngx_event.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "37d7d908a1a7ebec5ff5673dd5f89a52")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !144, !149, !150, !194, !207}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !118, file: !119, line: 31, baseType: !32, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !118, file: !119, line: 33, baseType: !13, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !118, file: !119, line: 35, baseType: !13, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !118, file: !119, line: 38, baseType: !13, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !118, file: !119, line: 44, baseType: !13, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !118, file: !119, line: 46, baseType: !13, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !118, file: !119, line: 49, baseType: !13, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !118, file: !119, line: 51, baseType: !13, size: 1, offset: 70, flags: DIFlagBitField, extraData: i64 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !118, file: !119, line: 54, baseType: !13, size: 1, offset: 71, flags: DIFlagBitField, extraData: i64 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !118, file: !119, line: 56, baseType: !13, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !118, file: !119, line: 57, baseType: !13, size: 1, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !118, file: !119, line: 59, baseType: !13, size: 1, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !118, file: !119, line: 60, baseType: !13, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !118, file: !119, line: 62, baseType: !13, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !118, file: !119, line: 64, baseType: !13, size: 1, offset: 77, flags: DIFlagBitField, extraData: i64 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !118, file: !119, line: 67, baseType: !13, size: 1, offset: 78, flags: DIFlagBitField, extraData: i64 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !118, file: !119, line: 69, baseType: !13, size: 1, offset: 79, flags: DIFlagBitField, extraData: i64 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !118, file: !119, line: 71, baseType: !13, size: 1, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !118, file: !119, line: 74, baseType: !13, size: 1, offset: 81, flags: DIFlagBitField, extraData: i64 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !118, file: !119, line: 75, baseType: !13, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !118, file: !119, line: 77, baseType: !13, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !118, file: !119, line: 101, baseType: !143, size: 32, offset: 96)
!143 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !118, file: !119, line: 103, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !110, line: 33, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !116}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !118, file: !119, line: 110, baseType: !27, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !118, file: !119, line: 112, baseType: !151, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !110, line: 20, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !154, line: 50, size: 640, elements: !155)
!154 = !DIFile(filename: "src/core/ngx_log.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "81257099415bdc5e18cdef9b4461d934")
!155 = !{!156, !157, !172, !175, !179, !184, !185, !190, !191, !193}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !153, file: !154, line: 51, baseType: !27, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !153, file: !154, line: 52, baseType: !158, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !110, line: 21, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !161, line: 89, size: 320, elements: !162)
!161 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "b737d189253ca17c55f83e424debf52b")
!162 = !{!163, !166, !167, !171}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !160, file: !161, line: 90, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !165, line: 16, baseType: !143)
!165 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "5c6995d5f659dd97ea6d10eff0ad0f12")
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !161, line: 91, baseType: !78, size: 128, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !160, file: !161, line: 93, baseType: !168, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !158, !151}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !161, line: 94, baseType: !32, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !153, file: !154, line: 54, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !174, line: 48, baseType: !31)
!174 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "5d14beceab1860bcc051d3b7a146b2a2")
!175 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !153, file: !154, line: 56, baseType: !176, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !177, line: 10, baseType: !178)
!177 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !60, line: 160, baseType: !95)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !153, file: !154, line: 58, baseType: !180, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !154, line: 45, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!56, !151, !56, !49}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 59, baseType: !32, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !153, file: !154, line: 61, baseType: !186, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !154, line: 46, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !151, !27, !56, !49}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !153, file: !154, line: 62, baseType: !32, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !153, file: !154, line: 70, baseType: !192, size: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !154, line: 72, baseType: !151, size: 64, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !118, file: !119, line: 114, baseType: !195, size: 320, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !196, line: 20, baseType: !197)
!196 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3e0aca9b19636f12ab4dbc16c3f8a0a1")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !196, line: 22, size: 320, elements: !198)
!198 = !{!199, !201, !203, !204, !205, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !197, file: !196, line: 23, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !196, line: 16, baseType: !27)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !197, file: !196, line: 24, baseType: !202, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !197, file: !196, line: 25, baseType: !202, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !197, file: !196, line: 26, baseType: !202, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !197, file: !196, line: 27, baseType: !57, size: 8, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !197, file: !196, line: 28, baseType: !57, size: 8, offset: 264)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !118, file: !119, line: 117, baseType: !208, size: 128, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !209, line: 16, baseType: !210)
!209 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2c59b395537893ba5e88100999d73c03")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !209, line: 18, size: 128, elements: !211)
!211 = !{!212, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !209, line: 19, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !209, line: 20, baseType: !213, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !111, file: !112, line: 125, baseType: !116, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !111, file: !112, line: 127, baseType: !217, size: 32, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !218, line: 17, baseType: !143)
!218 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3294ca407f098b2e2906f1b2d90752a2")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !111, file: !112, line: 129, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !221, line: 19, baseType: !222)
!221 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "f9335bbb6e5d9856f7d75990ec765c0d")
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !108, !56, !49}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !58, line: 108, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !60, line: 194, baseType: !95)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !111, file: !112, line: 130, baseType: !228, size: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !221, line: 22, baseType: !222)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !111, file: !112, line: 131, baseType: !230, size: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !221, line: 20, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!225, !108, !234, !247}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !110, line: 19, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !237, line: 59, size: 128, elements: !238)
!237 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6333220b53b7706731e71ee9d0416317")
!238 = !{!239, !318}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !236, file: !237, line: 60, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !237, line: 18, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !237, line: 20, size: 640, elements: !243)
!243 = !{!244, !245, !246, !249, !250, !251, !252, !254, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !242, file: !237, line: 21, baseType: !56, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !242, file: !237, line: 22, baseType: !56, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !242, file: !237, line: 23, baseType: !247, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !58, line: 87, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !60, line: 153, baseType: !95)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !242, file: !237, line: 24, baseType: !247, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !242, file: !237, line: 26, baseType: !56, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !242, file: !237, line: 27, baseType: !56, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !242, file: !237, line: 28, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !237, line: 16, baseType: !32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !242, file: !237, line: 29, baseType: !255, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !110, line: 23, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !258, line: 16, size: 1600, elements: !259)
!258 = !DIFile(filename: "src/core/ngx_file.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "25b6ae7999feb045abc19bb7a7bd4ab8")
!259 = !{!260, !261, !262, !300, !301, !302, !303, !304}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !257, file: !258, line: 17, baseType: !164, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !257, file: !258, line: 18, baseType: !78, size: 128, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !257, file: !258, line: 19, baseType: !263, size: 1152, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !165, line: 17, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !265, line: 26, size: 1152, elements: !266)
!265 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!266 = !{!267, !269, !271, !273, !275, !277, !279, !280, !281, !283, !285, !287, !294, !295, !296}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !264, file: !265, line: 31, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !60, line: 145, baseType: !31)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !264, file: !265, line: 36, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !60, line: 148, baseType: !31)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !264, file: !265, line: 44, baseType: !272, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !60, line: 151, baseType: !31)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !264, file: !265, line: 45, baseType: !274, size: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !60, line: 150, baseType: !13)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !264, file: !265, line: 47, baseType: !276, size: 32, offset: 224)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !60, line: 146, baseType: !13)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !264, file: !265, line: 48, baseType: !278, size: 32, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !60, line: 147, baseType: !13)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !264, file: !265, line: 50, baseType: !143, size: 32, offset: 288)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !264, file: !265, line: 52, baseType: !268, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !264, file: !265, line: 57, baseType: !282, size: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !60, line: 152, baseType: !95)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !264, file: !265, line: 61, baseType: !284, size: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !60, line: 175, baseType: !95)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !264, file: !265, line: 63, baseType: !286, size: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !60, line: 180, baseType: !95)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !264, file: !265, line: 74, baseType: !288, size: 128, offset: 576)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !289, line: 11, size: 128, elements: !290)
!289 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !288, file: !289, line: 16, baseType: !178, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !288, file: !289, line: 21, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !60, line: 197, baseType: !95)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !264, file: !265, line: 75, baseType: !288, size: 128, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !264, file: !265, line: 76, baseType: !288, size: 128, offset: 832)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !264, file: !265, line: 89, baseType: !297, size: 192, offset: 960)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 192, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 3)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !257, file: !258, line: 21, baseType: !247, size: 64, offset: 1344)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !257, file: !258, line: 22, baseType: !247, size: 64, offset: 1408)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !257, file: !258, line: 24, baseType: !151, size: 64, offset: 1472)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !257, file: !258, line: 37, baseType: !13, size: 1, offset: 1536, flags: DIFlagBitField, extraData: i64 1536)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !257, file: !258, line: 38, baseType: !13, size: 1, offset: 1537, flags: DIFlagBitField, extraData: i64 1536)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !242, file: !237, line: 30, baseType: !240, size: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !242, file: !237, line: 34, baseType: !13, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !242, file: !237, line: 40, baseType: !13, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !242, file: !237, line: 43, baseType: !13, size: 1, offset: 578, flags: DIFlagBitField, extraData: i64 576)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !242, file: !237, line: 45, baseType: !13, size: 1, offset: 579, flags: DIFlagBitField, extraData: i64 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !242, file: !237, line: 46, baseType: !13, size: 1, offset: 580, flags: DIFlagBitField, extraData: i64 576)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !242, file: !237, line: 47, baseType: !13, size: 1, offset: 581, flags: DIFlagBitField, extraData: i64 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !242, file: !237, line: 48, baseType: !13, size: 1, offset: 582, flags: DIFlagBitField, extraData: i64 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !242, file: !237, line: 49, baseType: !13, size: 1, offset: 583, flags: DIFlagBitField, extraData: i64 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !242, file: !237, line: 50, baseType: !13, size: 1, offset: 584, flags: DIFlagBitField, extraData: i64 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !242, file: !237, line: 52, baseType: !13, size: 1, offset: 585, flags: DIFlagBitField, extraData: i64 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !242, file: !237, line: 53, baseType: !13, size: 1, offset: 586, flags: DIFlagBitField, extraData: i64 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !242, file: !237, line: 55, baseType: !143, size: 32, offset: 608)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !237, line: 61, baseType: !234, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !111, file: !112, line: 132, baseType: !320, size: 64, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !221, line: 23, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!234, !108, !234, !247}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !111, file: !112, line: 134, baseType: !325, size: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !112, line: 16, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !112, line: 18, size: 2368, elements: !328)
!328 = !{!329, !330, !343, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !360, !361, !362, !363, !364, !365, !366, !367, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !327, file: !112, line: 19, baseType: !217, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !327, file: !112, line: 21, baseType: !331, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !333, line: 180, size: 128, elements: !334)
!333 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!334 = !{!335, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !332, file: !333, line: 182, baseType: !336, size: 16)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !337, line: 28, baseType: !338)
!337 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!338 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !332, file: !333, line: 183, baseType: !340, size: 112, offset: 16)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 14)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !327, file: !112, line: 22, baseType: !344, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !93, line: 274, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !60, line: 210, baseType: !13)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !327, file: !112, line: 23, baseType: !49, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !327, file: !112, line: 24, baseType: !78, size: 128, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !327, file: !112, line: 26, baseType: !143, size: 32, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !327, file: !112, line: 28, baseType: !143, size: 32, offset: 416)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !327, file: !112, line: 29, baseType: !143, size: 32, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !327, file: !112, line: 30, baseType: !143, size: 32, offset: 480)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "keepidle", scope: !327, file: !112, line: 32, baseType: !143, size: 32, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "keepintvl", scope: !327, file: !112, line: 33, baseType: !143, size: 32, offset: 544)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "keepcnt", scope: !327, file: !112, line: 34, baseType: !143, size: 32, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !327, file: !112, line: 38, baseType: !356, size: 64, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !110, line: 34, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !108}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !327, file: !112, line: 40, baseType: !32, size: 64, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !327, file: !112, line: 42, baseType: !152, size: 640, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !327, file: !112, line: 43, baseType: !151, size: 64, offset: 1408)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !327, file: !112, line: 45, baseType: !49, size: 64, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !327, file: !112, line: 47, baseType: !49, size: 64, offset: 1536)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !327, file: !112, line: 49, baseType: !325, size: 64, offset: 1600)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !327, file: !112, line: 50, baseType: !108, size: 64, offset: 1664)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !327, file: !112, line: 52, baseType: !368, size: 192, offset: 1728)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !196, line: 32, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !196, line: 37, size: 192, elements: !370)
!370 = !{!371, !372, !373}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !369, file: !196, line: 38, baseType: !202, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !369, file: !196, line: 39, baseType: !202, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !369, file: !196, line: 40, baseType: !374, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !196, line: 34, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !202, !202, !202}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !327, file: !112, line: 53, baseType: !195, size: 320, offset: 1920)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !327, file: !112, line: 55, baseType: !27, size: 64, offset: 2240)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !327, file: !112, line: 57, baseType: !13, size: 1, offset: 2304, flags: DIFlagBitField, extraData: i64 2304)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !327, file: !112, line: 58, baseType: !13, size: 1, offset: 2305, flags: DIFlagBitField, extraData: i64 2304)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !327, file: !112, line: 59, baseType: !13, size: 1, offset: 2306, flags: DIFlagBitField, extraData: i64 2304)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !327, file: !112, line: 61, baseType: !13, size: 1, offset: 2307, flags: DIFlagBitField, extraData: i64 2304)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !327, file: !112, line: 62, baseType: !13, size: 1, offset: 2308, flags: DIFlagBitField, extraData: i64 2304)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !327, file: !112, line: 63, baseType: !13, size: 1, offset: 2309, flags: DIFlagBitField, extraData: i64 2304)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !327, file: !112, line: 64, baseType: !13, size: 1, offset: 2310, flags: DIFlagBitField, extraData: i64 2304)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !327, file: !112, line: 65, baseType: !13, size: 1, offset: 2311, flags: DIFlagBitField, extraData: i64 2304)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !327, file: !112, line: 66, baseType: !13, size: 1, offset: 2312, flags: DIFlagBitField, extraData: i64 2304)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !327, file: !112, line: 67, baseType: !13, size: 1, offset: 2313, flags: DIFlagBitField, extraData: i64 2304)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !327, file: !112, line: 68, baseType: !13, size: 1, offset: 2314, flags: DIFlagBitField, extraData: i64 2304)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !327, file: !112, line: 71, baseType: !13, size: 1, offset: 2315, flags: DIFlagBitField, extraData: i64 2304)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !327, file: !112, line: 73, baseType: !13, size: 1, offset: 2316, flags: DIFlagBitField, extraData: i64 2304)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !327, file: !112, line: 74, baseType: !13, size: 1, offset: 2317, flags: DIFlagBitField, extraData: i64 2304)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !327, file: !112, line: 75, baseType: !13, size: 2, offset: 2318, flags: DIFlagBitField, extraData: i64 2304)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !327, file: !112, line: 77, baseType: !13, size: 1, offset: 2320, flags: DIFlagBitField, extraData: i64 2304)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !327, file: !112, line: 78, baseType: !13, size: 1, offset: 2321, flags: DIFlagBitField, extraData: i64 2304)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !327, file: !112, line: 79, baseType: !13, size: 1, offset: 2322, flags: DIFlagBitField, extraData: i64 2304)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen", scope: !327, file: !112, line: 88, baseType: !143, size: 32, offset: 2336)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !111, file: !112, line: 136, baseType: !247, size: 64, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !111, file: !112, line: 138, baseType: !151, size: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !111, file: !112, line: 140, baseType: !402, size: 64, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !110, line: 18, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !405, line: 57, size: 640, elements: !406)
!405 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6555a54b944797708293a47c3c8684b9")
!406 = !{!407, !415, !416, !417, !418, !425, !437}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !404, file: !405, line: 58, baseType: !408, size: 256)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !405, line: 54, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 49, size: 256, elements: !410)
!410 = !{!411, !412, !413, !414}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !409, file: !405, line: 50, baseType: !56, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !409, file: !405, line: 51, baseType: !56, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !409, file: !405, line: 52, baseType: !402, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !409, file: !405, line: 53, baseType: !27, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !404, file: !405, line: 59, baseType: !49, size: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !404, file: !405, line: 60, baseType: !402, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !404, file: !405, line: 61, baseType: !234, size: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !404, file: !405, line: 62, baseType: !419, size: 64, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !405, line: 41, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !405, line: 43, size: 128, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !405, line: 44, baseType: !419, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !421, file: !405, line: 45, baseType: !32, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !404, file: !405, line: 63, baseType: !426, size: 64, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !405, line: 32, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !405, line: 34, size: 192, elements: !429)
!429 = !{!430, !435, !436}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !428, file: !405, line: 35, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !405, line: 30, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !32}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !428, file: !405, line: 36, baseType: !32, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !428, file: !405, line: 37, baseType: !426, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !404, file: !405, line: 64, baseType: !151, size: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !112, line: 142, baseType: !143, size: 32, offset: 768)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !111, file: !112, line: 144, baseType: !331, size: 64, offset: 832)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !111, file: !112, line: 145, baseType: !344, size: 32, offset: 896)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !111, file: !112, line: 146, baseType: !78, size: 128, offset: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol", scope: !111, file: !112, line: 148, baseType: !443, size: 64, offset: 1088)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_proxy_protocol_t", file: !110, line: 29, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_proxy_protocol_s", file: !446, line: 20, size: 448, elements: !447)
!446 = !DIFile(filename: "src/core/ngx_proxy_protocol.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "2f709b54741e3446706b44243689209d")
!447 = !{!448, !449, !450, !455, !456}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !445, file: !446, line: 21, baseType: !78, size: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr", scope: !445, file: !446, line: 22, baseType: !78, size: 128, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !445, file: !446, line: 23, baseType: !451, size: 16, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !452, line: 123, baseType: !453)
!452 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !105, line: 25, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !60, line: 40, baseType: !338)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !445, file: !446, line: 24, baseType: !451, size: 16, offset: 272)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tlvs", scope: !445, file: !446, line: 25, baseType: !78, size: 128, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !111, file: !112, line: 151, baseType: !458, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_connection_t", file: !110, line: 30, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_connection_s", file: !461, line: 88, size: 768, elements: !462)
!461 = !DIFile(filename: "src/event/ngx_event_openssl.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "3af21306d729871437c56397859c5d10")
!462 = !{!463, !468, !472, !473, !474, !475, !476, !481, !482, !483, !484, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !460, file: !461, line: 89, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !466, line: 187, baseType: !467)
!466 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/openssl-3.1.3-t2z4gdp5gh6gi55dbaqbl32ceazzcooa/include/openssl/types.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build", checksumkind: CSK_MD5, checksum: "b6649ae9fb159d98e26ef5156a06b00d")
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !466, line: 187, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "session_ctx", scope: !460, file: !461, line: 90, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !466, line: 188, baseType: !471)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !466, line: 188, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !460, file: !461, line: 92, baseType: !91, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !460, file: !461, line: 93, baseType: !240, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !460, file: !461, line: 94, baseType: !49, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !460, file: !461, line: 96, baseType: !356, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !460, file: !461, line: 98, baseType: !477, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !479, line: 234, baseType: !480)
!479 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_p/linux-ubuntu22.04-zen2/clang-18.0.0/openssl-3.1.3-t2z4gdp5gh6gi55dbaqbl32ceazzcooa/include/openssl/ssl.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build", checksumkind: CSK_MD5, checksum: "b3965e72168556c434721fcea95f586f")
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !479, line: 234, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "save_session", scope: !460, file: !461, line: 99, baseType: !356, size: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "saved_read_handler", scope: !460, file: !461, line: 101, baseType: !145, size: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "saved_write_handler", scope: !460, file: !461, line: 102, baseType: !145, size: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ocsp", scope: !460, file: !461, line: 104, baseType: !485, size: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_ssl_ocsp_t", file: !461, line: 78, baseType: !487)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_ssl_ocsp_s", file: !461, line: 78, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "early_buf", scope: !460, file: !461, line: 106, baseType: !57, size: 8, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "handshaked", scope: !460, file: !461, line: 108, baseType: !13, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_rejected", scope: !460, file: !461, line: 109, baseType: !13, size: 1, offset: 713, flags: DIFlagBitField, extraData: i64 712)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiation", scope: !460, file: !461, line: 110, baseType: !13, size: 1, offset: 714, flags: DIFlagBitField, extraData: i64 712)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !460, file: !461, line: 111, baseType: !13, size: 1, offset: 715, flags: DIFlagBitField, extraData: i64 712)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !460, file: !461, line: 112, baseType: !13, size: 1, offset: 716, flags: DIFlagBitField, extraData: i64 712)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "no_wait_shutdown", scope: !460, file: !461, line: 113, baseType: !13, size: 1, offset: 717, flags: DIFlagBitField, extraData: i64 712)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "no_send_shutdown", scope: !460, file: !461, line: 114, baseType: !13, size: 1, offset: 718, flags: DIFlagBitField, extraData: i64 712)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_without_free", scope: !460, file: !461, line: 115, baseType: !13, size: 1, offset: 719, flags: DIFlagBitField, extraData: i64 712)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer_set", scope: !460, file: !461, line: 116, baseType: !13, size: 1, offset: 720, flags: DIFlagBitField, extraData: i64 712)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "session_timeout_set", scope: !460, file: !461, line: 117, baseType: !13, size: 1, offset: 721, flags: DIFlagBitField, extraData: i64 712)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "try_early_data", scope: !460, file: !461, line: 118, baseType: !13, size: 1, offset: 722, flags: DIFlagBitField, extraData: i64 712)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "in_early", scope: !460, file: !461, line: 119, baseType: !13, size: 1, offset: 723, flags: DIFlagBitField, extraData: i64 712)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "in_ocsp", scope: !460, file: !461, line: 120, baseType: !13, size: 1, offset: 724, flags: DIFlagBitField, extraData: i64 712)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "early_preread", scope: !460, file: !461, line: 121, baseType: !13, size: 1, offset: 725, flags: DIFlagBitField, extraData: i64 712)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "write_blocked", scope: !460, file: !461, line: 122, baseType: !13, size: 1, offset: 726, flags: DIFlagBitField, extraData: i64 712)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !111, file: !112, line: 154, baseType: !505, size: 64, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_udp_connection_t", file: !110, line: 31, baseType: !507)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_udp_connection_s", file: !110, line: 31, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !111, file: !112, line: 156, baseType: !331, size: 64, offset: 1280)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !111, file: !112, line: 157, baseType: !344, size: 32, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !111, file: !112, line: 159, baseType: !240, size: 64, offset: 1408)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !111, file: !112, line: 161, baseType: !208, size: 128, offset: 1472)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !111, file: !112, line: 163, baseType: !173, size: 64, offset: 1600)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !111, file: !112, line: 165, baseType: !514, size: 64, offset: 1664)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !515, line: 16, baseType: !200)
!515 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "dcb54d32e6c10d0319e2777a5d39953b")
!516 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !111, file: !112, line: 166, baseType: !27, size: 64, offset: 1728)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !111, file: !112, line: 168, baseType: !13, size: 8, offset: 1792, flags: DIFlagBitField, extraData: i64 1792)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !111, file: !112, line: 170, baseType: !13, size: 3, offset: 1800, flags: DIFlagBitField, extraData: i64 1792)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !111, file: !112, line: 172, baseType: !13, size: 1, offset: 1803, flags: DIFlagBitField, extraData: i64 1792)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !111, file: !112, line: 173, baseType: !13, size: 1, offset: 1804, flags: DIFlagBitField, extraData: i64 1792)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !111, file: !112, line: 174, baseType: !13, size: 1, offset: 1805, flags: DIFlagBitField, extraData: i64 1792)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pipeline", scope: !111, file: !112, line: 175, baseType: !13, size: 1, offset: 1806, flags: DIFlagBitField, extraData: i64 1792)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !111, file: !112, line: 177, baseType: !13, size: 1, offset: 1807, flags: DIFlagBitField, extraData: i64 1792)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !111, file: !112, line: 178, baseType: !13, size: 1, offset: 1808, flags: DIFlagBitField, extraData: i64 1792)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !111, file: !112, line: 179, baseType: !13, size: 1, offset: 1809, flags: DIFlagBitField, extraData: i64 1792)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !111, file: !112, line: 180, baseType: !13, size: 1, offset: 1810, flags: DIFlagBitField, extraData: i64 1792)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !111, file: !112, line: 182, baseType: !13, size: 1, offset: 1811, flags: DIFlagBitField, extraData: i64 1792)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !111, file: !112, line: 183, baseType: !13, size: 1, offset: 1812, flags: DIFlagBitField, extraData: i64 1792)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !111, file: !112, line: 184, baseType: !13, size: 2, offset: 1813, flags: DIFlagBitField, extraData: i64 1792)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !111, file: !112, line: 185, baseType: !13, size: 2, offset: 1815, flags: DIFlagBitField, extraData: i64 1792)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !111, file: !112, line: 187, baseType: !13, size: 1, offset: 1817, flags: DIFlagBitField, extraData: i64 1792)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "need_flush_buf", scope: !111, file: !112, line: 188, baseType: !13, size: 1, offset: 1818, flags: DIFlagBitField, extraData: i64 1792)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !100, file: !101, line: 382, baseType: !39, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !100, file: !101, line: 383, baseType: !39, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !100, file: !101, line: 384, baseType: !39, size: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !100, file: !101, line: 385, baseType: !39, size: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !100, file: !101, line: 387, baseType: !538, size: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !101, line: 374, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !97}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !100, file: !101, line: 388, baseType: !538, size: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !100, file: !101, line: 391, baseType: !544, size: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !99, line: 18, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !547, line: 65, size: 4864, elements: !548)
!547 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "f29cd7dd14e04d7d4af9197bf6cdb9bb")
!548 = !{!549, !550, !560, !561, !565, !566, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !729, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !546, file: !547, line: 66, baseType: !256, size: 1600)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !546, file: !547, line: 67, baseType: !551, size: 320, offset: 1600)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !552, line: 22, baseType: !553)
!552 = !DIFile(filename: "src/core/ngx_array.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "225c765b8c2d594417b07329b35d9ae4")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 16, size: 320, elements: !554)
!554 = !{!555, !556, !557, !558, !559}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !553, file: !552, line: 17, baseType: !32, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !553, file: !552, line: 18, baseType: !27, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !553, file: !552, line: 19, baseType: !49, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !553, file: !552, line: 20, baseType: !27, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !553, file: !552, line: 21, baseType: !402, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !546, file: !547, line: 68, baseType: !104, size: 32, offset: 1920)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !546, file: !547, line: 69, baseType: !562, size: 128, offset: 1952)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 128, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 16)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !546, file: !547, line: 70, baseType: !562, size: 128, offset: 2080)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !546, file: !547, line: 72, baseType: !567, size: 64, offset: 2240)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !165, line: 18, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !58, line: 49, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !60, line: 149, baseType: !31)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !546, file: !547, line: 73, baseType: !176, size: 64, offset: 2304)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !546, file: !547, line: 74, baseType: !176, size: 64, offset: 2368)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !546, file: !547, line: 75, baseType: !176, size: 64, offset: 2432)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !546, file: !547, line: 76, baseType: !176, size: 64, offset: 2496)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !546, file: !547, line: 77, baseType: !176, size: 64, offset: 2560)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !546, file: !547, line: 79, baseType: !78, size: 128, offset: 2624)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !546, file: !547, line: 80, baseType: !78, size: 128, offset: 2752)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !546, file: !547, line: 81, baseType: !562, size: 128, offset: 2880)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !546, file: !547, line: 83, baseType: !49, size: 64, offset: 3008)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !546, file: !547, line: 84, baseType: !49, size: 64, offset: 3072)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !546, file: !547, line: 85, baseType: !49, size: 64, offset: 3136)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !546, file: !547, line: 86, baseType: !247, size: 64, offset: 3200)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !546, file: !547, line: 87, baseType: !247, size: 64, offset: 3264)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !546, file: !547, line: 89, baseType: !27, size: 64, offset: 3328)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !546, file: !547, line: 90, baseType: !27, size: 64, offset: 3392)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !546, file: !547, line: 91, baseType: !27, size: 64, offset: 3456)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !546, file: !547, line: 92, baseType: !27, size: 64, offset: 3520)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !546, file: !547, line: 94, baseType: !240, size: 64, offset: 3584)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !546, file: !547, line: 96, baseType: !589, size: 64, offset: 3648)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !99, line: 19, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !547, line: 159, size: 1152, elements: !592)
!592 = !{!593, !608, !669, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !728}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !591, file: !547, line: 160, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !547, line: 156, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !547, line: 147, size: 960, elements: !597)
!597 = !{!598, !599, !600, !601, !604, !605, !606, !607}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !596, file: !547, line: 148, baseType: !368, size: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !596, file: !547, line: 149, baseType: !195, size: 320, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !596, file: !547, line: 150, baseType: !208, size: 128, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !596, file: !547, line: 151, baseType: !602, size: 64, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !174, line: 56, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !173)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !596, file: !547, line: 152, baseType: !602, size: 64, offset: 704)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !596, file: !547, line: 153, baseType: !247, size: 64, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !596, file: !547, line: 154, baseType: !27, size: 64, offset: 832)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !596, file: !547, line: 155, baseType: !27, size: 64, offset: 896)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !591, file: !547, line: 161, baseType: !609, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !611, line: 59, baseType: !612)
!611 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "6137611cd598fa2ecc498e6967a03177")
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 34, size: 1600, elements: !613)
!613 = !{!614, !621, !622, !623, !631, !632, !633, !642, !643, !644, !645, !664, !665, !666, !667, !668}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !612, file: !611, line: 35, baseType: !615, size: 128)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !616, line: 21, baseType: !617)
!616 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "56a332e5761f46e2bb83cbdaf8b18a9f")
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 16, size: 128, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !617, file: !616, line: 17, baseType: !602, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !617, file: !616, line: 19, baseType: !602, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !612, file: !611, line: 37, baseType: !49, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !612, file: !611, line: 38, baseType: !49, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !612, file: !611, line: 40, baseType: !624, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !611, line: 16, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !611, line: 18, size: 192, elements: !627)
!627 = !{!628, !629, !630}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !626, file: !611, line: 19, baseType: !29, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !626, file: !611, line: 20, baseType: !624, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !626, file: !611, line: 21, baseType: !29, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !612, file: !611, line: 41, baseType: !624, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !612, file: !611, line: 42, baseType: !625, size: 192, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !612, file: !611, line: 44, baseType: !634, size: 64, offset: 576)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !611, line: 31, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 25, size: 256, elements: !637)
!637 = !{!638, !639, !640, !641}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !636, file: !611, line: 26, baseType: !27, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !636, file: !611, line: 27, baseType: !27, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !636, file: !611, line: 29, baseType: !27, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !636, file: !611, line: 30, baseType: !27, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !612, file: !611, line: 45, baseType: !27, size: 64, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !612, file: !611, line: 47, baseType: !56, size: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !612, file: !611, line: 48, baseType: !56, size: 64, offset: 768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !612, file: !611, line: 50, baseType: !646, size: 512, offset: 832)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !616, line: 37, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 24, size: 512, elements: !648)
!648 = !{!649, !651, !652, !653, !663}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !647, file: !616, line: 26, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !647, file: !616, line: 28, baseType: !650, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !647, file: !616, line: 29, baseType: !27, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !647, file: !616, line: 30, baseType: !654, size: 256, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !655, line: 39, baseType: !656)
!655 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !655, line: 35, size: 256, elements: !657)
!657 = !{!658, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !656, file: !655, line: 37, baseType: !659, size: 256)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !656, file: !655, line: 38, baseType: !95, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !647, file: !616, line: 36, baseType: !27, size: 64, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !612, file: !611, line: 52, baseType: !56, size: 64, offset: 1344)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !612, file: !611, line: 53, baseType: !57, size: 8, offset: 1408)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !612, file: !611, line: 55, baseType: !13, size: 1, offset: 1416, flags: DIFlagBitField, extraData: i64 1416)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !612, file: !611, line: 57, baseType: !32, size: 64, offset: 1472)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !612, file: !611, line: 58, baseType: !32, size: 64, offset: 1536)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !591, file: !547, line: 163, baseType: !670, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !258, line: 62, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !258, line: 50, size: 768, elements: !673)
!673 = !{!674, !675, !676, !678, !683, !685, !687, !688, !689}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !258, line: 51, baseType: !78, size: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !672, file: !258, line: 52, baseType: !49, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !672, file: !258, line: 53, baseType: !677, size: 192, offset: 192)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 192, elements: !298)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !672, file: !258, line: 55, baseType: !679, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !258, line: 45, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!514, !32}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !672, file: !258, line: 56, baseType: !684, size: 64, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !258, line: 46, baseType: !680)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !672, file: !258, line: 57, baseType: !686, size: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !258, line: 47, baseType: !432)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !672, file: !258, line: 58, baseType: !32, size: 64, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !672, file: !258, line: 60, baseType: !56, size: 64, offset: 640)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !672, file: !258, line: 61, baseType: !27, size: 64, offset: 704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "min_free", scope: !591, file: !547, line: 165, baseType: !247, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !591, file: !547, line: 166, baseType: !247, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !591, file: !547, line: 167, baseType: !49, size: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !591, file: !547, line: 169, baseType: !176, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !591, file: !547, line: 171, baseType: !176, size: 64, offset: 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !591, file: !547, line: 173, baseType: !27, size: 64, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !591, file: !547, line: 174, baseType: !27, size: 64, offset: 576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !591, file: !547, line: 175, baseType: !514, size: 64, offset: 640)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !591, file: !547, line: 176, baseType: !514, size: 64, offset: 704)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !591, file: !547, line: 177, baseType: !514, size: 64, offset: 768)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !591, file: !547, line: 179, baseType: !27, size: 64, offset: 832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !591, file: !547, line: 180, baseType: !514, size: 64, offset: 896)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !591, file: !547, line: 181, baseType: !514, size: 64, offset: 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !591, file: !547, line: 183, baseType: !704, size: 64, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !706, line: 25, baseType: !707)
!706 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "44a673836137b8263e2cfd875033292f")
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !706, line: 29, size: 704, elements: !708)
!708 = !{!709, !710, !720, !725, !726, !727}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !707, file: !706, line: 30, baseType: !32, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !707, file: !706, line: 31, baseType: !711, size: 384, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !712, line: 22, baseType: !713)
!712 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/local-ssd/nginx-l74zho2rdyt32j6lgmurzhbeuuhcsa7c-build/aidengro/spack-stage-nginx-1.24.0-l74zho2rdyt32j6lgmurzhbeuuhcsa7c/spack-src", checksumkind: CSK_MD5, checksum: "bf27d4781f3b25ce5eb9a764f55ea2d4")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !712, line: 16, size: 384, elements: !714)
!714 = !{!715, !716, !717, !718, !719}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !713, file: !712, line: 17, baseType: !56, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !712, line: 18, baseType: !49, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !712, line: 19, baseType: !78, size: 128, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !713, file: !712, line: 20, baseType: !151, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !713, file: !712, line: 21, baseType: !27, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !707, file: !706, line: 32, baseType: !721, size: 64, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !706, line: 27, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!91, !704, !32}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !707, file: !706, line: 33, baseType: !32, size: 64, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !707, file: !706, line: 34, baseType: !32, size: 64, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !707, file: !706, line: 35, baseType: !27, size: 64, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !591, file: !547, line: 185, baseType: !27, size: 64, offset: 1088)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !546, file: !547, line: 97, baseType: !730, size: 64, offset: 3712)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !547, line: 62, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !547, line: 39, size: 960, elements: !733)
!733 = !{!734, !735, !736, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !732, file: !547, line: 40, baseType: !195, size: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !732, file: !547, line: 41, baseType: !208, size: 128, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !732, file: !547, line: 43, baseType: !737, size: 64, offset: 448)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 64, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 8)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !732, file: !547, line: 46, baseType: !13, size: 20, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !732, file: !547, line: 47, baseType: !13, size: 10, offset: 532, flags: DIFlagBitField, extraData: i64 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !732, file: !547, line: 48, baseType: !13, size: 10, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !732, file: !547, line: 49, baseType: !13, size: 10, offset: 554, flags: DIFlagBitField, extraData: i64 544)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !732, file: !547, line: 50, baseType: !13, size: 1, offset: 564, flags: DIFlagBitField, extraData: i64 544)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !732, file: !547, line: 51, baseType: !13, size: 1, offset: 565, flags: DIFlagBitField, extraData: i64 544)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !732, file: !547, line: 52, baseType: !13, size: 1, offset: 566, flags: DIFlagBitField, extraData: i64 544)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !732, file: !547, line: 53, baseType: !13, size: 1, offset: 567, flags: DIFlagBitField, extraData: i64 544)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !732, file: !547, line: 56, baseType: !567, size: 64, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !732, file: !547, line: 57, baseType: !176, size: 64, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !732, file: !547, line: 58, baseType: !176, size: 64, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !732, file: !547, line: 59, baseType: !49, size: 64, offset: 768)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !732, file: !547, line: 60, baseType: !247, size: 64, offset: 832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !732, file: !547, line: 61, baseType: !514, size: 64, offset: 896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !546, file: !547, line: 103, baseType: !514, size: 64, offset: 3776)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !546, file: !547, line: 104, baseType: !514, size: 64, offset: 3840)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !546, file: !547, line: 105, baseType: !514, size: 64, offset: 3904)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !546, file: !547, line: 106, baseType: !514, size: 64, offset: 3968)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !546, file: !547, line: 108, baseType: !117, size: 768, offset: 4032)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !546, file: !547, line: 110, baseType: !13, size: 1, offset: 4800, flags: DIFlagBitField, extraData: i64 4800)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !546, file: !547, line: 111, baseType: !13, size: 1, offset: 4801, flags: DIFlagBitField, extraData: i64 4800)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !546, file: !547, line: 113, baseType: !13, size: 1, offset: 4802, flags: DIFlagBitField, extraData: i64 4800)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !546, file: !547, line: 114, baseType: !13, size: 1, offset: 4803, flags: DIFlagBitField, extraData: i64 4800)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !546, file: !547, line: 115, baseType: !13, size: 1, offset: 4804, flags: DIFlagBitField, extraData: i64 4800)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !546, file: !547, line: 116, baseType: !13, size: 1, offset: 4805, flags: DIFlagBitField, extraData: i64 4800)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !546, file: !547, line: 117, baseType: !13, size: 1, offset: 4806, flags: DIFlagBitField, extraData: i64 4800)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !546, file: !547, line: 118, baseType: !13, size: 1, offset: 4807, flags: DIFlagBitField, extraData: i64 4800)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !546, file: !547, line: 119, baseType: !13, size: 1, offset: 4808, flags: DIFlagBitField, extraData: i64 4800)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "update_variant", scope: !546, file: !547, line: 120, baseType: !13, size: 1, offset: 4809, flags: DIFlagBitField, extraData: i64 4800)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !546, file: !547, line: 121, baseType: !13, size: 1, offset: 4810, flags: DIFlagBitField, extraData: i64 4800)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !546, file: !547, line: 123, baseType: !13, size: 1, offset: 4811, flags: DIFlagBitField, extraData: i64 4800)
