; ModuleID = 'samples/933.bc'
source_filename = "./src/generator_packed.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@__func__.libxsmm_generator_pgemm_kernel = private unnamed_addr constant [31 x i8] c"libxsmm_generator_pgemm_kernel\00", align 1, !dbg !0
@libxsmm_ninit = external global i32, align 4
@libxsmm_verbosity = external global i32, align 4
@__func__.libxsmm_generator_getrf_kernel = private unnamed_addr constant [31 x i8] c"libxsmm_generator_getrf_kernel\00", align 1, !dbg !8
@.str = private unnamed_addr constant [4 x i8] c"skx\00", align 1, !dbg !10
@.str.1 = private unnamed_addr constant [4 x i8] c"knm\00", align 1, !dbg !15
@.str.2 = private unnamed_addr constant [4 x i8] c"knl\00", align 1, !dbg !17
@.str.3 = private unnamed_addr constant [4 x i8] c"hsw\00", align 1, !dbg !19
@.str.4 = private unnamed_addr constant [4 x i8] c"snb\00", align 1, !dbg !21
@__func__.libxsmm_generator_trsm_kernel = private unnamed_addr constant [30 x i8] c"libxsmm_generator_trsm_kernel\00", align 1, !dbg !23
@__func__.libxsmm_generator_trmm_kernel = private unnamed_addr constant [30 x i8] c"libxsmm_generator_trmm_kernel\00", align 1, !dbg !28

; Function Attrs: nounwind uwtable
define void @libxsmm_generator_pgemm_kernel(ptr noundef %io_generated_code, ptr noundef %i_packed_pgemm_desc, i32 noundef %i_arch, ...) #0 !dbg !39 {

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/generator_packed.c", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "0fbd43401f273d3293c53c867a0e9501")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !6)
!4 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !{!7}
!7 = !DISubrange(count: 31)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !3, isLocal: true, isDefinition: true)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !12, isLocal: true, isDefinition: true)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32, elements: !13)
!13 = !{!14}
!14 = !DISubrange(count: 4)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !12, isLocal: true, isDefinition: true)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !12, isLocal: true, isDefinition: true)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !12, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(scope: null, file: !2, line: 80, type: !12, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 84, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 30)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !25, isLocal: true, isDefinition: true)
!30 = distinct !DICompileUnit(language: DW_LANG_C11, file: !31, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !32, splitDebugInlining: false, nameTableKind: None)
!31 = !DIFile(filename: "src/generator_packed.c", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "0fbd43401f273d3293c53c867a0e9501")
!32 = !{!0, !8, !10, !15, !17, !19, !21, !23, !28}
!33 = !{i32 7, !"Dwarf Version", i32 5}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{i32 1, !"wchar_size", i32 4}
!36 = !{i32 8, !"PIC Level", i32 2}
!37 = !{i32 7, !"uwtable", i32 2}
!38 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!39 = distinct !DISubprogram(name: "libxsmm_generator_pgemm_kernel", scope: !2, file: !2, line: 27, type: !40, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !30, retainedNodes: !62)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42, !56, !61, null}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_generated_code", file: !44, line: 138, baseType: !45)
!44 = !DIFile(filename: "include/libxsmm_generator.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "546d2dd75eaf8cc5937953149b404b74")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_generated_code", file: !44, line: 118, size: 256, elements: !46)
!46 = !{!47, !49, !51, !52, !53, !54, !55}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "generated_code", scope: !45, file: !44, line: 119, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !45, file: !44, line: 120, baseType: !50, size: 32, offset: 64)
!50 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code_size", scope: !45, file: !44, line: 121, baseType: !50, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "code_type", scope: !45, file: !44, line: 122, baseType: !50, size: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !45, file: !44, line: 130, baseType: !50, size: 32, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !45, file: !44, line: 134, baseType: !50, size: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "sf_size", scope: !45, file: !44, line: 135, baseType: !50, size: 32, offset: 224)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "libxsmm_pgemm_descriptor", file: !59, line: 137, baseType: !60)
!59 = !DIFile(filename: "include/libxsmm_typedefs.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "6455bf141a5acf04bdbd5b62071dd37a")
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "libxsmm_pgemm_descriptor", file: !59, line: 137, flags: DIFlagFwdDecl)
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !{!63, !64, !65, !66, !69, !72, !73, !74, !75}
!63 = !DILocalVariable(name: "io_generated_code", arg: 1, scope: !39, file: !2, line: 27, type: !42)
!64 = !DILocalVariable(name: "i_packed_pgemm_desc", arg: 2, scope: !39, file: !2, line: 28, type: !56)
!65 = !DILocalVariable(name: "i_arch", arg: 3, scope: !39, file: !2, line: 29, type: !61)
!66 = !DILocalVariable(name: "cpuid", scope: !39, file: !2, line: 30, type: !67)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!69 = !DILocalVariable(name: "iunroll", scope: !70, file: !2, line: 35, type: !50)
!70 = distinct !DILexicalBlock(scope: !71, file: !2, line: 33, column: 36)
!71 = distinct !DILexicalBlock(scope: !39, file: !2, line: 33, column: 8)
!72 = !DILocalVariable(name: "junroll", scope: !70, file: !2, line: 35, type: !50)
!73 = !DILocalVariable(name: "loopi", scope: !70, file: !2, line: 35, type: !50)
!74 = !DILocalVariable(name: "loopj", scope: !70, file: !2, line: 35, type: !50)
!75 = !DILocalVariable(name: "args", scope: !70, file: !2, line: 36, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !77, line: 42, baseType: !78)
!77 = !DIFile(filename: "/usr/lib/clang/18/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "95ff2da58c2c75d7c246cff7935ff18b")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !31, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 192, elements: !86)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !80, file: !31, line: 36, baseType: !50, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !80, file: !31, line: 36, baseType: !50, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !80, file: !31, line: 36, baseType: !48, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !80, file: !31, line: 36, baseType: !48, size: 64, offset: 128)
!86 = !{!87}
!87 = !DISubrange(count: 1)
!88 = !{!89, !89, i64 0}
!89 = !{!"any pointer", !90, i64 0}
!90 = !{!"omnipotent char", !91, i64 0}
!91 = !{!"Simple C/C++ TBAA"}
!92 = !DILocation(line: 27, column: 71, scope: !39)
!93 = !DILocation(line: 28, column: 71, scope: !39)
!94 = !{!95, !95, i64 0}
!95 = !{!"int", !90, i64 0}
!96 = !DILocation(line: 29, column: 71, scope: !39)
!97 = !DILocation(line: 30, column: 3, scope: !39)
!98 = !DILocation(line: 30, column: 21, scope: !39)
!99 = !DILocation(line: 30, column: 49, scope: !39)
!100 = !DILocation(line: 30, column: 29, scope: !39)
!101 = !DILocation(line: 33, column: 27, scope: !71)
!102 = !DILocation(line: 33, column: 24, scope: !71)
!103 = !DILocation(line: 33, column: 8, scope: !39)
!104 = !DILocation(line: 35, column: 5, scope: !70)
!105 = !DILocation(line: 35, column: 18, scope: !70)
!106 = !DILocation(line: 35, column: 27, scope: !70)
!107 = !DILocation(line: 35, column: 36, scope: !70)
!108 = !DILocation(line: 35, column: 43, scope: !70)
!109 = !DILocation(line: 36, column: 5, scope: !70)
!110 = !DILocation(line: 36, column: 13, scope: !70)
!111 = !DILocation(line: 37, column: 5, scope: !70)
!112 = !DILocation(line: 38, column: 15, scope: !70)
!113 = !DILocation(line: 38, column: 13, scope: !70)
!114 = !DILocation(line: 39, column: 15, scope: !70)
!115 = !DILocation(line: 39, column: 13, scope: !70)
!116 = !DILocation(line: 40, column: 13, scope: !70)
!117 = !DILocation(line: 40, column: 11, scope: !70)
!118 = !DILocation(line: 41, column: 13, scope: !70)
!119 = !DILocation(line: 41, column: 11, scope: !70)
!120 = !DILocation(line: 42, column: 5, scope: !70)
!121 = !DILocation(line: 43, column: 54, scope: !70)
!122 = !DILocation(line: 43, column: 73, scope: !70)
!123 = !DILocation(line: 43, column: 94, scope: !70)
!124 = !DILocation(line: 43, column: 101, scope: !70)
!125 = !DILocation(line: 43, column: 110, scope: !70)
!126 = !DILocation(line: 43, column: 119, scope: !70)
!127 = !DILocation(line: 43, column: 126, scope: !70)
!128 = !DILocation(line: 43, column: 5, scope: !70)
!129 = !DILocation(line: 47, column: 3, scope: !71)
!130 = !DILocation(line: 47, column: 3, scope: !70)
!131 = !DILocation(line: 48, column: 5, scope: !132)
!132 = distinct !DILexicalBlock(scope: !71, file: !2, line: 47, column: 10)
!133 = !DILocation(line: 49, column: 5, scope: !132)
!134 = !DILocation(line: 51, column: 1, scope: !39)
!135 = !DISubprogram(name: "libxsmm_cpuid_name", scope: !136, file: !136, line: 56, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!136 = !DIFile(filename: "include/libxsmm_cpuid.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "29ec199935428b9b05a1e39a2f288cae")
!137 = !DISubroutineType(types: !138)
!138 = !{!68, !61}
!139 = !DISubprogram(name: "libxsmm_generator_packed_gemm_avx_avx512_kernel", scope: !140, file: !140, line: 19, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!140 = !DIFile(filename: "./src/generator_packed_gemm_avx_avx512.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "ed4fa1a21e18504ec69e89cf212b98a9")
!141 = !DISubroutineType(types: !142)
!142 = !{null, !42, !56, !68, !50, !50, !50, !50}
!143 = !DISubprogram(name: "libxsmm_handle_error", scope: !144, file: !144, line: 632, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!144 = !DIFile(filename: "./src/generator_common.h", directory: "/local-ssd/libxsmm-t7eg5i7tythe7won6zb52a67jlb725co-build/aidengro/spack-stage-libxsmm-1.17-t7eg5i7tythe7won6zb52a67jlb725co/spack-src", checksumkind: CSK_MD5, checksum: "a57c85608557ea9830368c91f6ffd0fa")
