; ModuleID = 'samples/946.bc'
source_filename = "util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [65 x i8] c"\0A%s : Error : freq [%d] == %g is out of range. Should be < 0.5.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [7 x i8] c"util.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [46 x i8] c"Dumping input and output data to file : %s.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [2 x i8] c"w\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [25 x i8] c"# Not created by Octave\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [15 x i8] c"# name: input\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [16 x i8] c"# type: matrix\0A\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [12 x i8] c"# rows: %d\0A\00", align 1, !dbg !37
@.str.8 = private unnamed_addr constant [14 x i8] c"# columns: 1\0A\00", align 1, !dbg !42
@.str.9 = private unnamed_addr constant [5 x i8] c"% g\0A\00", align 1, !dbg !47
@.str.10 = private unnamed_addr constant [16 x i8] c"# name: output\0A\00", align 1, !dbg !52
@.str.11 = private unnamed_addr constant [8 x i8] c"Unknown\00", align 1, !dbg !54
@get_cpu_name.buffer = internal global [512 x i8] zeroinitializer, align 16, !dbg !59

!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 12)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 14)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 5)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !34, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !2, line: 162, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 8)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "buffer", scope: !61, file: !2, line: 163, type: !176, isLocal: true, isDefinition: true)
!61 = distinct !DISubprogram(name: "get_cpu_name", scope: !2, file: !2, line: 160, type: !62, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !108)
!62 = !DISubroutineType(types: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!66 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, retainedTypes: !84, globals: !88, splitDebugInlining: false, nameTableKind: None)
!67 = !{!68}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 46, baseType: !70, size: 32, elements: !71)
!69 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!70 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!72 = !DIEnumerator(name: "_ISupper", value: 256)
!73 = !DIEnumerator(name: "_ISlower", value: 512)
!74 = !DIEnumerator(name: "_ISalpha", value: 1024)
!75 = !DIEnumerator(name: "_ISdigit", value: 2048)
!76 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!77 = !DIEnumerator(name: "_ISspace", value: 8192)
!78 = !DIEnumerator(name: "_ISprint", value: 16384)
!79 = !DIEnumerator(name: "_ISgraph", value: 32768)
!80 = !DIEnumerator(name: "_ISblank", value: 1)
!81 = !DIEnumerator(name: "_IScntrl", value: 2)
!82 = !DIEnumerator(name: "_ISpunct", value: 4)
!83 = !DIEnumerator(name: "_ISalnum", value: 8)
!84 = !{!85, !86, !87}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!88 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !54, !59, !89, !91, !93, !98, !103}
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(scope: null, file: !2, line: 168, type: !44, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(scope: null, file: !2, line: 168, type: !19, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !95, isLocal: true, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 11)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 40)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(scope: null, file: !2, line: 186, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 104, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 13)
!108 = !{!109, !110, !111, !171, !172, !175}
!109 = !DILocalVariable(name: "name", scope: !61, file: !2, line: 162, type: !64)
!110 = !DILocalVariable(name: "search", scope: !61, file: !2, line: 162, type: !64)
!111 = !DILocalVariable(name: "file", scope: !61, file: !2, line: 164, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !114, line: 7, baseType: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !116, line: 49, size: 1728, elements: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!117 = !{!118, !119, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !134, !136, !137, !138, !142, !143, !145, !149, !152, !154, !157, !160, !161, !162, !166, !167}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !115, file: !116, line: 51, baseType: !86, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !115, file: !116, line: 54, baseType: !120, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !115, file: !116, line: 55, baseType: !120, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !115, file: !116, line: 56, baseType: !120, size: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !115, file: !116, line: 57, baseType: !120, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !115, file: !116, line: 58, baseType: !120, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !115, file: !116, line: 59, baseType: !120, size: 64, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !115, file: !116, line: 60, baseType: !120, size: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !115, file: !116, line: 61, baseType: !120, size: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !115, file: !116, line: 64, baseType: !120, size: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !115, file: !116, line: 65, baseType: !120, size: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !115, file: !116, line: 66, baseType: !120, size: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !115, file: !116, line: 68, baseType: !132, size: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !116, line: 36, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !115, file: !116, line: 70, baseType: !135, size: 64, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !115, file: !116, line: 72, baseType: !86, size: 32, offset: 896)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !115, file: !116, line: 73, baseType: !86, size: 32, offset: 928)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !115, file: !116, line: 74, baseType: !139, size: 64, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !140, line: 152, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!141 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !115, file: !116, line: 77, baseType: !87, size: 16, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !115, file: !116, line: 78, baseType: !144, size: 8, offset: 1040)
!144 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !115, file: !116, line: 79, baseType: !146, size: 8, offset: 1048)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 1)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !115, file: !116, line: 81, baseType: !150, size: 64, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !116, line: 43, baseType: null)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !115, file: !116, line: 89, baseType: !153, size: 64, offset: 1152)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !140, line: 153, baseType: !141)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !115, file: !116, line: 91, baseType: !155, size: 64, offset: 1216)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !116, line: 37, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !115, file: !116, line: 92, baseType: !158, size: 64, offset: 1280)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !116, line: 38, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !115, file: !116, line: 93, baseType: !135, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !115, file: !116, line: 94, baseType: !85, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !115, file: !116, line: 95, baseType: !163, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !164, line: 70, baseType: !165)
!164 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!165 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !115, file: !116, line: 96, baseType: !86, size: 32, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !115, file: !116, line: 98, baseType: !168, size: 160, offset: 1568)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 20)
!171 = !DILocalVariable(name: "is_pipe", scope: !61, file: !2, line: 165, type: !86)
!172 = !DILocalVariable(name: "src", scope: !173, file: !2, line: 192, type: !120)
!173 = distinct !DILexicalBlock(scope: !174, file: !2, line: 192, column: 3)
!174 = distinct !DILexicalBlock(scope: !61, file: !2, line: 191, column: 7)
!175 = !DILocalVariable(name: "dest", scope: !173, file: !2, line: 192, type: !120)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4096, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 512)
!179 = !{i32 7, !"Dwarf Version", i32 5}
!180 = !{i32 2, !"Debug Info Version", i32 3}
!181 = !{i32 1, !"wchar_size", i32 4}
!182 = !{i32 8, !"PIC Level", i32 2}
!183 = !{i32 7, !"PIE Level", i32 2}
!184 = !{i32 7, !"uwtable", i32 2}
!185 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!186 = distinct !DISubprogram(name: "gen_windowed_sines", scope: !2, file: !2, line: 22, type: !187, scopeLine: 23, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !194)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !86, !189, !191, !192, !86}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203}
!195 = !DILocalVariable(name: "freq_count", arg: 1, scope: !186, file: !2, line: 22, type: !86)
!196 = !DILocalVariable(name: "freqs", arg: 2, scope: !186, file: !2, line: 22, type: !189)
!197 = !DILocalVariable(name: "max", arg: 3, scope: !186, file: !2, line: 22, type: !191)
!198 = !DILocalVariable(name: "output", arg: 4, scope: !186, file: !2, line: 22, type: !192)
!199 = !DILocalVariable(name: "output_len", arg: 5, scope: !186, file: !2, line: 22, type: !86)
!200 = !DILocalVariable(name: "k", scope: !186, file: !2, line: 23, type: !86)
!201 = !DILocalVariable(name: "freq", scope: !186, file: !2, line: 23, type: !86)
!202 = !DILocalVariable(name: "amplitude", scope: !186, file: !2, line: 24, type: !191)
!203 = !DILocalVariable(name: "phase", scope: !186, file: !2, line: 24, type: !191)
!204 = !{!205, !205, i64 0}
!205 = !{!"int", !206, i64 0}
!206 = !{!"omnipotent char", !207, i64 0}
!207 = !{!"Simple C/C++ TBAA"}
!208 = !DILocation(line: 22, column: 25, scope: !186)
!209 = !{!210, !210, i64 0}
!210 = !{!"any pointer", !206, i64 0}
!211 = !DILocation(line: 22, column: 51, scope: !186)
!212 = !{!213, !213, i64 0}
!213 = !{!"double", !206, i64 0}
!214 = !DILocation(line: 22, column: 65, scope: !186)
!215 = !DILocation(line: 22, column: 77, scope: !186)
!216 = !DILocation(line: 22, column: 89, scope: !186)
!217 = !DILocation(line: 23, column: 3, scope: !186)
!218 = !DILocation(line: 23, column: 8, scope: !186)
!219 = !DILocation(line: 23, column: 11, scope: !186)
!220 = !DILocation(line: 24, column: 2, scope: !186)
!221 = !DILocation(line: 24, column: 9, scope: !186)
!222 = !DILocation(line: 24, column: 20, scope: !186)
!223 = !DILocation(line: 26, column: 14, scope: !186)
!224 = !DILocation(line: 26, column: 20, scope: !186)
!225 = !DILocation(line: 26, column: 18, scope: !186)
!226 = !DILocation(line: 26, column: 12, scope: !186)
!227 = !DILocation(line: 28, column: 9, scope: !228)
!228 = distinct !DILexicalBlock(scope: !186, file: !2, line: 28, column: 2)
!229 = !DILocation(line: 28, column: 7, scope: !228)
!230 = !DILocation(line: 28, column: 15, scope: !231)
