; ModuleID = 'samples/948.bc'
source_filename = "src/match/dist-short.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Definedunsignedlong = type { i8, i64 }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [34 x i8] c"(*vptr) != (GtUchar) GT_SEPARATOR\00", align 1, !dbg !7
@__func__.gt_distanceofshortstringsbytearray = private unnamed_addr constant [35 x i8] c"gt_distanceofshortstringsbytearray\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [23 x i8] c"src/match/dist-short.c\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [31 x i8] c"(cc) != (GtUchar) GT_SEPARATOR\00", align 1, !dbg !23
@__func__.gt_distanceofshortstringsencseq = private unnamed_addr constant [32 x i8] c"gt_distanceofshortstringsencseq\00", align 1, !dbg !28
@.str.4 = private unnamed_addr constant [16 x i8] c"maxdistance > 0\00", align 1, !dbg !33
@__func__.gt_reversesuffixmatch = private unnamed_addr constant [22 x i8] c"gt_reversesuffixmatch\00", align 1, !dbg !38

!91 = !DILocalVariable(name: "Ph", scope: !73, file: !2, line: 78, type: !61)
!92 = !DILocalVariable(name: "Mh", scope: !73, file: !2, line: 78, type: !61)
!93 = !DILocalVariable(name: "Ebit", scope: !73, file: !2, line: 78, type: !61)
!94 = !DILocalVariable(name: "distval", scope: !73, file: !2, line: 78, type: !61)
!95 = !DILocalVariable(name: "vptr", scope: !73, file: !2, line: 79, type: !77)
!96 = !{!97, !97, i64 0}
!97 = !{!"any pointer", !98, i64 0}
!98 = !{!"omnipotent char", !99, i64 0}
!99 = !{!"Simple C/C++ TBAA"}
!100 = !DILocation(line: 71, column: 53, scope: !73)
!101 = !{!102, !102, i64 0}
!102 = !{!"int", !98, i64 0}
!103 = !DILocation(line: 72, column: 60, scope: !73)
!104 = !DILocation(line: 73, column: 62, scope: !73)
!105 = !{!106, !106, i64 0}
!106 = !{!"long", !98, i64 0}
!107 = !DILocation(line: 74, column: 55, scope: !73)
!108 = !DILocation(line: 75, column: 62, scope: !73)
!109 = !DILocation(line: 76, column: 55, scope: !73)
!110 = !DILocation(line: 78, column: 3, scope: !73)
!111 = !DILocation(line: 79, column: 3, scope: !73)
!112 = !DILocation(line: 79, column: 18, scope: !73)
!113 = !DILocation(line: 81, column: 20, scope: !73)
!114 = !DILocation(line: 81, column: 40, scope: !73)
!115 = !DILocation(line: 81, column: 30, scope: !73)
!116 = !DILocation(line: 81, column: 50, scope: !73)
!117 = !DILocation(line: 81, column: 55, scope: !73)
!118 = !DILocation(line: 81, column: 3, scope: !73)
!119 = !DILocation(line: 82, column: 15, scope: !120)
!120 = distinct !DILexicalBlock(scope: !73, file: !2, line: 82, column: 3)
!121 = !DILocation(line: 82, column: 13, scope: !120)
!122 = !DILocation(line: 82, column: 8, scope: !120)
!123 = !DILocation(line: 82, column: 21, scope: !124)
!124 = distinct !DILexicalBlock(scope: !120, file: !2, line: 82, column: 3)
!125 = !DILocation(line: 82, column: 28, scope: !124)
!126 = !DILocation(line: 82, column: 35, scope: !124)
!127 = !DILocation(line: 82, column: 33, scope: !124)
!128 = !DILocation(line: 82, column: 26, scope: !124)
!129 = !DILocation(line: 82, column: 3, scope: !120)
!130 = !DILocation(line: 84, column: 5, scope: !131)
!131 = distinct !DILexicalBlock(scope: !124, file: !2, line: 83, column: 3)
!132 = !DILocation(line: 84, column: 5, scope: !133)
!133 = distinct !DILexicalBlock(scope: !134, file: !2, line: 84, column: 5)
!134 = distinct !DILexicalBlock(scope: !131, file: !2, line: 84, column: 5)
!135 = !{!98, !98, i64 0}
!136 = !DILocation(line: 84, column: 5, scope: !134)
!137 = !DILocation(line: 84, column: 5, scope: !138)
!138 = distinct !DILexicalBlock(scope: !133, file: !2, line: 84, column: 5)
!139 = !DILocation(line: 84, column: 5, scope: !140)
!140 = distinct !DILexicalBlock(scope: !131, file: !2, line: 84, column: 5)
!141 = !DILocation(line: 84, column: 5, scope: !142)
!142 = distinct !DILexicalBlock(scope: !140, file: !2, line: 84, column: 5)
!143 = !DILocation(line: 84, column: 5, scope: !144)
!144 = distinct !DILexicalBlock(scope: !140, file: !2, line: 84, column: 5)
!145 = !DILocation(line: 84, column: 5, scope: !146)
!146 = distinct !DILexicalBlock(scope: !131, file: !2, line: 84, column: 5)
!147 = !DILocation(line: 84, column: 5, scope: !148)
!148 = distinct !DILexicalBlock(scope: !146, file: !2, line: 84, column: 5)
!149 = !DILocation(line: 84, column: 5, scope: !150)
!150 = distinct !DILexicalBlock(scope: !151, file: !2, line: 84, column: 5)
!151 = distinct !DILexicalBlock(scope: !146, file: !2, line: 84, column: 5)
!152 = !DILocation(line: 84, column: 5, scope: !151)
!153 = !DILocation(line: 84, column: 5, scope: !154)
!154 = distinct !DILexicalBlock(scope: !150, file: !2, line: 84, column: 5)
!155 = !DILocation(line: 85, column: 3, scope: !131)
!156 = !DILocation(line: 82, column: 45, scope: !124)
!157 = !DILocation(line: 82, column: 3, scope: !124)
!158 = distinct !{!158, !129, !159, !160}
!159 = !DILocation(line: 85, column: 3, scope: !120)
!160 = !{!"llvm.loop.mustprogress"}
!161 = !DILocation(line: 86, column: 10, scope: !73)
!162 = !DILocation(line: 87, column: 1, scope: !73)
!163 = !DILocation(line: 86, column: 3, scope: !73)
!164 = !DISubprogram(name: "gt_initeqsvector", scope: !165, file: !165, line: 23, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!165 = !DIFile(filename: "src/match/initeqsvec.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "388b8f66e6c5345148668ff38080cccf")
!166 = !DISubroutineType(types: !167)
!167 = !{null, !76, !61, !77, !61}
!168 = !DISubprogram(name: "fprintf", scope: !169, file: !169, line: 350, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!169 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !173, !234, null}
!172 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 7, baseType: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 49, size: 1728, elements: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!179 = !{!180, !181, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !196, !198, !199, !200, !204, !206, !208, !212, !215, !217, !220, !223, !224, !226, !229, !230}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !177, file: !178, line: 51, baseType: !172, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !177, file: !178, line: 54, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !177, file: !178, line: 55, baseType: !182, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !177, file: !178, line: 56, baseType: !182, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !177, file: !178, line: 57, baseType: !182, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !177, file: !178, line: 58, baseType: !182, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !177, file: !178, line: 59, baseType: !182, size: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !177, file: !178, line: 60, baseType: !182, size: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !177, file: !178, line: 61, baseType: !182, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !177, file: !178, line: 64, baseType: !182, size: 64, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !177, file: !178, line: 65, baseType: !182, size: 64, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !177, file: !178, line: 66, baseType: !182, size: 64, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !177, file: !178, line: 68, baseType: !194, size: 64, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !178, line: 36, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !177, file: !178, line: 70, baseType: !197, size: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !177, file: !178, line: 72, baseType: !172, size: 32, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !177, file: !178, line: 73, baseType: !172, size: 32, offset: 928)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !177, file: !178, line: 74, baseType: !201, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !202, line: 152, baseType: !203)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!203 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !177, file: !178, line: 77, baseType: !205, size: 16, offset: 1024)
!205 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !177, file: !178, line: 78, baseType: !207, size: 8, offset: 1040)
!207 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !177, file: !178, line: 79, baseType: !209, size: 8, offset: 1048)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 1)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !177, file: !178, line: 81, baseType: !213, size: 64, offset: 1088)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !178, line: 43, baseType: null)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !177, file: !178, line: 89, baseType: !216, size: 64, offset: 1152)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !202, line: 153, baseType: !203)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !177, file: !178, line: 91, baseType: !218, size: 64, offset: 1216)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !178, line: 37, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !177, file: !178, line: 92, baseType: !221, size: 64, offset: 1280)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !178, line: 38, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !177, file: !178, line: 93, baseType: !197, size: 64, offset: 1344)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !177, file: !178, line: 94, baseType: !225, size: 64, offset: 1408)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !177, file: !178, line: 95, baseType: !227, size: 64, offset: 1472)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !228, line: 70, baseType: !63)
!228 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !177, file: !178, line: 96, baseType: !172, size: 32, offset: 1536)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !177, file: !178, line: 98, baseType: !231, size: 160, offset: 1568)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 20)
!234 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!236 = !DISubprogram(name: "abort", scope: !237, file: !237, line: 598, type: !238, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!237 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!238 = !DISubroutineType(types: !239)
!239 = !{null}
!240 = distinct !DISubprogram(name: "gt_distanceofshortstringsencseq", scope: !2, file: !2, line: 89, type: !241, scopeLine: 96, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !50, retainedNodes: !248)
!241 = !DISubroutineType(types: !242)
!242 = !{!61, !76, !54, !77, !61, !243, !61, !61}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseq", file: !246, line: 48, baseType: !247)
!246 = !DIFile(filename: "src/core/encseq_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "bab4512cadee996edd2995020539d931")
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncseq", file: !246, line: 48, flags: DIFlagFwdDecl)
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266}
!249 = !DILocalVariable(name: "eqsvector", arg: 1, scope: !240, file: !2, line: 89, type: !76)
!250 = !DILocalVariable(name: "alphasize", arg: 2, scope: !240, file: !2, line: 90, type: !54)
!251 = !DILocalVariable(name: "useq", arg: 3, scope: !240, file: !2, line: 91, type: !77)
!252 = !DILocalVariable(name: "ulen", arg: 4, scope: !240, file: !2, line: 92, type: !61)
!253 = !DILocalVariable(name: "encseq", arg: 5, scope: !240, file: !2, line: 93, type: !243)
!254 = !DILocalVariable(name: "vstartpos", arg: 6, scope: !240, file: !2, line: 94, type: !61)
!255 = !DILocalVariable(name: "vlen", arg: 7, scope: !240, file: !2, line: 95, type: !61)
!256 = !DILocalVariable(name: "Pv", scope: !240, file: !2, line: 97, type: !61)
!257 = !DILocalVariable(name: "Mv", scope: !240, file: !2, line: 97, type: !61)
!258 = !DILocalVariable(name: "Eq", scope: !240, file: !2, line: 97, type: !61)
!259 = !DILocalVariable(name: "Xv", scope: !240, file: !2, line: 97, type: !61)
!260 = !DILocalVariable(name: "Xh", scope: !240, file: !2, line: 97, type: !61)
!261 = !DILocalVariable(name: "Ph", scope: !240, file: !2, line: 97, type: !61)
!262 = !DILocalVariable(name: "Mh", scope: !240, file: !2, line: 97, type: !61)
!263 = !DILocalVariable(name: "Ebit", scope: !240, file: !2, line: 97, type: !61)
!264 = !DILocalVariable(name: "distval", scope: !240, file: !2, line: 97, type: !61)
!265 = !DILocalVariable(name: "cc", scope: !240, file: !2, line: 98, type: !64)
!266 = !DILocalVariable(name: "pos", scope: !240, file: !2, line: 99, type: !61)
!267 = !DILocation(line: 89, column: 50, scope: !240)
!268 = !DILocation(line: 90, column: 57, scope: !240)
!269 = !DILocation(line: 91, column: 59, scope: !240)
!270 = !DILocation(line: 92, column: 52, scope: !240)
!271 = !DILocation(line: 93, column: 60, scope: !240)
!272 = !DILocation(line: 94, column: 52, scope: !240)
!273 = !DILocation(line: 95, column: 52, scope: !240)
!274 = !DILocation(line: 97, column: 3, scope: !240)
!275 = !DILocation(line: 98, column: 3, scope: !240)
!276 = !DILocation(line: 98, column: 11, scope: !240)
!277 = !DILocation(line: 99, column: 3, scope: !240)
!278 = !DILocation(line: 99, column: 11, scope: !240)
!279 = !DILocation(line: 101, column: 20, scope: !240)
!280 = !DILocation(line: 101, column: 40, scope: !240)
!281 = !DILocation(line: 101, column: 30, scope: !240)
!282 = !DILocation(line: 101, column: 50, scope: !240)
!283 = !DILocation(line: 101, column: 55, scope: !240)
!284 = !DILocation(line: 101, column: 3, scope: !240)
!285 = !DILocation(line: 102, column: 14, scope: !286)
!286 = distinct !DILexicalBlock(scope: !240, file: !2, line: 102, column: 3)
!287 = !DILocation(line: 102, column: 12, scope: !286)
!288 = !DILocation(line: 102, column: 8, scope: !286)
!289 = !DILocation(line: 102, column: 25, scope: !290)
!290 = distinct !DILexicalBlock(scope: !286, file: !2, line: 102, column: 3)
!291 = !DILocation(line: 102, column: 31, scope: !290)
!292 = !DILocation(line: 102, column: 43, scope: !290)
!293 = !DILocation(line: 102, column: 41, scope: !290)
!294 = !DILocation(line: 102, column: 29, scope: !290)
!295 = !DILocation(line: 102, column: 3, scope: !286)
!296 = !DILocation(line: 104, column: 37, scope: !297)
!297 = distinct !DILexicalBlock(scope: !290, file: !2, line: 103, column: 3)
!298 = !DILocation(line: 104, column: 44, scope: !297)
!299 = !DILocation(line: 104, column: 10, scope: !297)
!300 = !DILocation(line: 104, column: 8, scope: !297)
!301 = !DILocation(line: 105, column: 5, scope: !297)
!302 = !DILocation(line: 105, column: 5, scope: !303)
!303 = distinct !DILexicalBlock(scope: !304, file: !2, line: 105, column: 5)
!304 = distinct !DILexicalBlock(scope: !297, file: !2, line: 105, column: 5)
!305 = !DILocation(line: 105, column: 5, scope: !304)
!306 = !DILocation(line: 105, column: 5, scope: !307)
!307 = distinct !DILexicalBlock(scope: !303, file: !2, line: 105, column: 5)
!308 = !DILocation(line: 105, column: 5, scope: !309)
!309 = distinct !DILexicalBlock(scope: !297, file: !2, line: 105, column: 5)
!310 = !DILocation(line: 105, column: 5, scope: !311)
!311 = distinct !DILexicalBlock(scope: !309, file: !2, line: 105, column: 5)
!312 = !DILocation(line: 105, column: 5, scope: !313)
!313 = distinct !DILexicalBlock(scope: !309, file: !2, line: 105, column: 5)
!314 = !DILocation(line: 105, column: 5, scope: !315)
!315 = distinct !DILexicalBlock(scope: !297, file: !2, line: 105, column: 5)
!316 = !DILocation(line: 105, column: 5, scope: !317)
!317 = distinct !DILexicalBlock(scope: !315, file: !2, line: 105, column: 5)
!318 = !DILocation(line: 105, column: 5, scope: !319)
!319 = distinct !DILexicalBlock(scope: !320, file: !2, line: 105, column: 5)
!320 = distinct !DILexicalBlock(scope: !315, file: !2, line: 105, column: 5)
!321 = !DILocation(line: 105, column: 5, scope: !320)
!322 = !DILocation(line: 105, column: 5, scope: !323)
!323 = distinct !DILexicalBlock(scope: !319, file: !2, line: 105, column: 5)
!324 = !DILocation(line: 106, column: 3, scope: !297)
!325 = !DILocation(line: 102, column: 52, scope: !290)
!326 = !DILocation(line: 102, column: 3, scope: !290)
!327 = distinct !{!327, !295, !328, !160}
!328 = !DILocation(line: 106, column: 3, scope: !286)
!329 = !DILocation(line: 107, column: 10, scope: !240)
!330 = !DILocation(line: 108, column: 1, scope: !240)
!331 = !DILocation(line: 107, column: 3, scope: !240)
!332 = !DISubprogram(name: "gt_encseq_get_encoded_char", scope: !246, file: !246, line: 90, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!333 = !DISubroutineType(types: !334)
!334 = !{!64, !243, !61, !335}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtReadmode", file: !53, line: 32, baseType: !52)
!336 = distinct !DISubprogram(name: "gt_reversesuffixmatch", scope: !2, file: !2, line: 110, type: !337, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !50, retainedNodes: !339)
!337 = !DISubroutineType(types: !338)
!338 = !{!61, !76, !54, !77, !61, !77, !61, !61}
!339 = !{!340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!340 = !DILocalVariable(name: "eqsvector", arg: 1, scope: !336, file: !2, line: 110, type: !76)
!341 = !DILocalVariable(name: "alphasize", arg: 2, scope: !336, file: !2, line: 111, type: !54)
!342 = !DILocalVariable(name: "useq", arg: 3, scope: !336, file: !2, line: 112, type: !77)
!343 = !DILocalVariable(name: "ulen", arg: 4, scope: !336, file: !2, line: 113, type: !61)
!344 = !DILocalVariable(name: "vseq", arg: 5, scope: !336, file: !2, line: 114, type: !77)
!345 = !DILocalVariable(name: "vlen", arg: 6, scope: !336, file: !2, line: 115, type: !61)
!346 = !DILocalVariable(name: "maxdistance", arg: 7, scope: !336, file: !2, line: 116, type: !61)
!347 = !DILocalVariable(name: "Pv", scope: !336, file: !2, line: 118, type: !61)
!348 = !DILocalVariable(name: "Mv", scope: !336, file: !2, line: 118, type: !61)
!349 = !DILocalVariable(name: "Eq", scope: !336, file: !2, line: 118, type: !61)
!350 = !DILocalVariable(name: "Xv", scope: !336, file: !2, line: 118, type: !61)
!351 = !DILocalVariable(name: "Xh", scope: !336, file: !2, line: 118, type: !61)
!352 = !DILocalVariable(name: "Ph", scope: !336, file: !2, line: 118, type: !61)
!353 = !DILocalVariable(name: "Mh", scope: !336, file: !2, line: 118, type: !61)
!354 = !DILocalVariable(name: "Ebit", scope: !336, file: !2, line: 118, type: !61)
!355 = !DILocalVariable(name: "distval", scope: !336, file: !2, line: 118, type: !61)
!356 = !DILocalVariable(name: "vptr", scope: !336, file: !2, line: 119, type: !77)
!357 = !DILocation(line: 110, column: 40, scope: !336)
!358 = !DILocation(line: 111, column: 47, scope: !336)
!359 = !DILocation(line: 112, column: 49, scope: !336)
!360 = !DILocation(line: 113, column: 42, scope: !336)
!361 = !DILocation(line: 114, column: 49, scope: !336)
!362 = !DILocation(line: 115, column: 42, scope: !336)
!363 = !DILocation(line: 116, column: 42, scope: !336)
!364 = !DILocation(line: 118, column: 3, scope: !336)
!365 = !DILocation(line: 119, column: 3, scope: !336)
!366 = !DILocation(line: 119, column: 18, scope: !336)
!367 = !DILocation(line: 121, column: 23, scope: !336)
!368 = !DILocation(line: 121, column: 43, scope: !336)
!369 = !DILocation(line: 121, column: 33, scope: !336)
!370 = !DILocation(line: 121, column: 53, scope: !336)
!371 = !DILocation(line: 121, column: 58, scope: !336)
!372 = !DILocation(line: 121, column: 3, scope: !336)
!373 = !DILocation(line: 122, column: 3, scope: !336)
!374 = !DILocation(line: 122, column: 3, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !2, line: 122, column: 3)
!376 = distinct !DILexicalBlock(scope: !336, file: !2, line: 122, column: 3)
!377 = !DILocation(line: 122, column: 3, scope: !376)
!378 = !DILocation(line: 122, column: 3, scope: !379)
!379 = distinct !DILexicalBlock(scope: !375, file: !2, line: 122, column: 3)
!380 = !DILocation(line: 123, column: 15, scope: !381)
!381 = distinct !DILexicalBlock(scope: !336, file: !2, line: 123, column: 3)
!382 = !DILocation(line: 123, column: 22, scope: !381)
!383 = !DILocation(line: 123, column: 20, scope: !381)
!384 = !DILocation(line: 123, column: 27, scope: !381)
!385 = !DILocation(line: 123, column: 13, scope: !381)
!386 = !DILocation(line: 123, column: 8, scope: !381)
!387 = !DILocation(line: 123, column: 32, scope: !388)
!388 = distinct !DILexicalBlock(scope: !381, file: !2, line: 123, column: 3)
!389 = !DILocation(line: 123, column: 40, scope: !388)
!390 = !DILocation(line: 123, column: 37, scope: !388)
!391 = !DILocation(line: 123, column: 3, scope: !381)
!392 = !DILocation(line: 125, column: 5, scope: !393)
!393 = distinct !DILexicalBlock(scope: !388, file: !2, line: 124, column: 3)
!394 = !DILocation(line: 125, column: 5, scope: !395)
!395 = distinct !DILexicalBlock(scope: !396, file: !2, line: 125, column: 5)
!396 = distinct !DILexicalBlock(scope: !393, file: !2, line: 125, column: 5)
!397 = !DILocation(line: 125, column: 5, scope: !396)
!398 = !DILocation(line: 125, column: 5, scope: !399)
!399 = distinct !DILexicalBlock(scope: !395, file: !2, line: 125, column: 5)
!400 = !DILocation(line: 125, column: 5, scope: !401)
!401 = distinct !DILexicalBlock(scope: !393, file: !2, line: 125, column: 5)
!402 = !DILocation(line: 125, column: 5, scope: !403)
!403 = distinct !DILexicalBlock(scope: !401, file: !2, line: 125, column: 5)
!404 = !DILocation(line: 125, column: 5, scope: !405)
!405 = distinct !DILexicalBlock(scope: !401, file: !2, line: 125, column: 5)
!406 = !DILocation(line: 125, column: 5, scope: !407)
!407 = distinct !DILexicalBlock(scope: !393, file: !2, line: 125, column: 5)
!408 = !DILocation(line: 125, column: 5, scope: !409)
!409 = distinct !DILexicalBlock(scope: !407, file: !2, line: 125, column: 5)
!410 = !DILocation(line: 125, column: 5, scope: !411)
!411 = distinct !DILexicalBlock(scope: !412, file: !2, line: 125, column: 5)
!412 = distinct !DILexicalBlock(scope: !407, file: !2, line: 125, column: 5)
!413 = !DILocation(line: 125, column: 5, scope: !412)
!414 = !DILocation(line: 125, column: 5, scope: !415)
!415 = distinct !DILexicalBlock(scope: !411, file: !2, line: 125, column: 5)
!416 = !DILocation(line: 126, column: 9, scope: !417)
!417 = distinct !DILexicalBlock(scope: !393, file: !2, line: 126, column: 9)
!418 = !DILocation(line: 126, column: 20, scope: !417)
!419 = !DILocation(line: 126, column: 17, scope: !417)
!420 = !DILocation(line: 126, column: 9, scope: !393)
!421 = !DILocation(line: 128, column: 7, scope: !422)
!422 = distinct !DILexicalBlock(scope: !417, file: !2, line: 127, column: 5)
!423 = !DILocation(line: 130, column: 3, scope: !393)
!424 = !DILocation(line: 123, column: 50, scope: !388)
!425 = !DILocation(line: 123, column: 3, scope: !388)
!426 = distinct !{!426, !391, !427, !160}
!427 = !DILocation(line: 130, column: 3, scope: !381)
!428 = !DILocation(line: 132, column: 21, scope: !336)
!429 = !DILocation(line: 132, column: 28, scope: !336)
!430 = !DILocation(line: 132, column: 26, scope: !336)
!431 = !DILocation(line: 132, column: 35, scope: !336)
!432 = !DILocation(line: 132, column: 33, scope: !336)
!433 = !DILocation(line: 133, column: 1, scope: !336)
!434 = !DILocation(line: 132, column: 3, scope: !336)
!435 = !DISubprogram(name: "gt_initeqsvectorrev", scope: !165, file: !165, line: 28, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!436 = distinct !DISubprogram(name: "gt_forwardprefixmatch", scope: !2, file: !2, line: 135, type: !437, scopeLine: 143, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !50, retainedNodes: !446)
!437 = !DISubroutineType(types: !438)
!438 = !{!439, !243, !54, !61, !444, !76, !77, !61, !61}
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "Definedunsignedlong", file: !440, line: 28, baseType: !441)
!440 = !DIFile(filename: "src/core/defined-types.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e7a1f5519c7b299f300cac0dd118ae65")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 24, size: 128, elements: !442)
!442 = !{!443, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "defined", scope: !441, file: !440, line: 26, baseType: !444, size: 8)
!444 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "valueunsignedlong", scope: !441, file: !440, line: 27, baseType: !61, size: 64, offset: 64)
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!447 = !DILocalVariable(name: "encseq", arg: 1, scope: !436, file: !2, line: 135, type: !243)
!448 = !DILocalVariable(name: "alphasize", arg: 2, scope: !436, file: !2, line: 136, type: !54)
!449 = !DILocalVariable(name: "startpos", arg: 3, scope: !436, file: !2, line: 137, type: !61)
!450 = !DILocalVariable(name: "nowildcards", arg: 4, scope: !436, file: !2, line: 138, type: !444)
!451 = !DILocalVariable(name: "eqsvector", arg: 5, scope: !436, file: !2, line: 139, type: !76)
!452 = !DILocalVariable(name: "useq", arg: 6, scope: !436, file: !2, line: 140, type: !77)
!453 = !DILocalVariable(name: "ulen", arg: 7, scope: !436, file: !2, line: 141, type: !61)
!454 = !DILocalVariable(name: "maxdistance", arg: 8, scope: !436, file: !2, line: 142, type: !61)
!455 = !DILocalVariable(name: "Pv", scope: !436, file: !2, line: 144, type: !61)
!456 = !DILocalVariable(name: "Mv", scope: !436, file: !2, line: 144, type: !61)
!457 = !DILocalVariable(name: "Eq", scope: !436, file: !2, line: 144, type: !61)
!458 = !DILocalVariable(name: "Xv", scope: !436, file: !2, line: 144, type: !61)
!459 = !DILocalVariable(name: "Xh", scope: !436, file: !2, line: 144, type: !61)
!460 = !DILocalVariable(name: "Ph", scope: !436, file: !2, line: 144, type: !61)
!461 = !DILocalVariable(name: "Mh", scope: !436, file: !2, line: 144, type: !61)
!462 = !DILocalVariable(name: "Ebit", scope: !436, file: !2, line: 144, type: !61)
!463 = !DILocalVariable(name: "distval", scope: !436, file: !2, line: 144, type: !61)
!464 = !DILocalVariable(name: "pos", scope: !436, file: !2, line: 145, type: !61)
!465 = !DILocalVariable(name: "totallength", scope: !436, file: !2, line: 145, type: !61)
!466 = !DILocalVariable(name: "cc", scope: !436, file: !2, line: 146, type: !64)
!467 = !DILocalVariable(name: "result", scope: !436, file: !2, line: 147, type: !439)
!468 = !DILocation(line: 135, column: 59, scope: !436)
!469 = !DILocation(line: 136, column: 53, scope: !436)
!470 = !DILocation(line: 137, column: 48, scope: !436)
!471 = !{!472, !472, i64 0}
!472 = !{!"_Bool", !98, i64 0}
!473 = !DILocation(line: 138, column: 45, scope: !436)
!474 = !DILocation(line: 139, column: 49, scope: !436)
!475 = !DILocation(line: 140, column: 55, scope: !436)
!476 = !DILocation(line: 141, column: 48, scope: !436)
!477 = !DILocation(line: 142, column: 48, scope: !436)
!478 = !DILocation(line: 144, column: 3, scope: !436)
!479 = !DILocation(line: 145, column: 3, scope: !436)
!480 = !DILocation(line: 145, column: 11, scope: !436)
!481 = !DILocation(line: 145, column: 16, scope: !436)
!482 = !DILocation(line: 145, column: 53, scope: !436)
!483 = !DILocation(line: 145, column: 30, scope: !436)
!484 = !DILocation(line: 146, column: 3, scope: !436)
!485 = !DILocation(line: 146, column: 11, scope: !436)
!486 = !DILocation(line: 147, column: 23, scope: !436)
!487 = !DILocation(line: 149, column: 20, scope: !436)
!488 = !DILocation(line: 149, column: 40, scope: !436)
!489 = !DILocation(line: 149, column: 30, scope: !436)
!490 = !DILocation(line: 149, column: 50, scope: !436)
!491 = !DILocation(line: 149, column: 55, scope: !436)
!492 = !DILocation(line: 149, column: 3, scope: !436)
!493 = !DILocation(line: 150, column: 3, scope: !436)
!494 = !DILocation(line: 150, column: 3, scope: !495)
!495 = distinct !DILexicalBlock(scope: !496, file: !2, line: 150, column: 3)
!496 = distinct !DILexicalBlock(scope: !436, file: !2, line: 150, column: 3)
!497 = !DILocation(line: 150, column: 3, scope: !496)
!498 = !DILocation(line: 150, column: 3, scope: !499)
!499 = distinct !DILexicalBlock(scope: !495, file: !2, line: 150, column: 3)
!500 = !DILocation(line: 151, column: 14, scope: !501)
!501 = distinct !DILexicalBlock(scope: !436, file: !2, line: 151, column: 3)
