; ModuleID = 'samples/951.bc'
source_filename = "picture_tools_enc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.WebPPicture = type { i32, i32, i32, i32, ptr, ptr, ptr, i32, i32, ptr, i32, [2 x i32], ptr, i32, [3 x i32], ptr, ptr, i32, ptr, ptr, i32, ptr, ptr, [3 x i32], ptr, ptr, [8 x i32], ptr, ptr, [2 x ptr] }

@WebPAlphaReplace = external global ptr, align 8

; Function Attrs: nounwind uwtable
define hidden void @WebPReplaceTransparentPixels(ptr noundef %pic, i32 noundef %color) #0 !dbg !45 {
entry:
  %pic.addr = alloca ptr, align 8
  %color.addr = alloca i32, align 4
  %y = alloca i32, align 4
  %argb = alloca ptr, align 8
  store ptr %pic, ptr %pic.addr, align 8, !tbaa !156
  tail call void @llvm.dbg.declare(metadata ptr %pic.addr, metadata !150, metadata !DIExpression()), !dbg !160
  store i32 %color, ptr %color.addr, align 4, !tbaa !161
  tail call void @llvm.dbg.declare(metadata ptr %color.addr, metadata !151, metadata !DIExpression()), !dbg !163
  %0 = load ptr, ptr %pic.addr, align 8, !dbg !164, !tbaa !156
  %cmp = icmp ne ptr %0, null, !dbg !165
  br i1 %cmp, label %land.lhs.true, label %if.end, !dbg !166

land.lhs.true:                                    ; preds = %entry
  %1 = load ptr, ptr %pic.addr, align 8, !dbg !167, !tbaa !156
  %use_argb = getelementptr inbounds %struct.WebPPicture, ptr %1, i32 0, i32 0, !dbg !168

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !32, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "picture_tools_enc.c", directory: "/local-ssd/libwebp-ogk6inqjmrnmtyq4i2sug432zt64ty5a-build/aidengro/spack-stage-libwebp-1.2.4-ogk6inqjmrnmtyq4i2sug432zt64ty5a/spack-src/src/enc", checksumkind: CSK_MD5, checksum: "f6fa8b228f4a9048d9407d04be61ac40")
!2 = !{!3, !11, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WebPEncCSP", file: !4, line: 267, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "../../src/webp/encode.h", directory: "/local-ssd/libwebp-ogk6inqjmrnmtyq4i2sug432zt64ty5a-build/aidengro/spack-stage-libwebp-1.2.4-ogk6inqjmrnmtyq4i2sug432zt64ty5a/spack-src/src/enc", checksumkind: CSK_MD5, checksum: "86d494680aadc831975159afeec19bc9")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "WEBP_YUV420", value: 0)
!8 = !DIEnumerator(name: "WEBP_YUV420A", value: 4)
!9 = !DIEnumerator(name: "WEBP_CSP_UV_MASK", value: 3)
!10 = !DIEnumerator(name: "WEBP_CSP_ALPHA_BIT", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WebPEncodingError", file: !4, line: 276, baseType: !5, size: 32, elements: !12)
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!13 = !DIEnumerator(name: "VP8_ENC_OK", value: 0)
!14 = !DIEnumerator(name: "VP8_ENC_ERROR_OUT_OF_MEMORY", value: 1)
!15 = !DIEnumerator(name: "VP8_ENC_ERROR_BITSTREAM_OUT_OF_MEMORY", value: 2)
!16 = !DIEnumerator(name: "VP8_ENC_ERROR_NULL_PARAMETER", value: 3)
!17 = !DIEnumerator(name: "VP8_ENC_ERROR_INVALID_CONFIGURATION", value: 4)
!18 = !DIEnumerator(name: "VP8_ENC_ERROR_BAD_DIMENSION", value: 5)
!19 = !DIEnumerator(name: "VP8_ENC_ERROR_PARTITION0_OVERFLOW", value: 6)
!20 = !DIEnumerator(name: "VP8_ENC_ERROR_PARTITION_OVERFLOW", value: 7)
!21 = !DIEnumerator(name: "VP8_ENC_ERROR_BAD_WRITE", value: 8)
!22 = !DIEnumerator(name: "VP8_ENC_ERROR_FILE_TOO_BIG", value: 9)
!23 = !DIEnumerator(name: "VP8_ENC_ERROR_USER_ABORT", value: 10)
!24 = !DIEnumerator(name: "VP8_ENC_ERROR_LAST", value: 11)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 48, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "../../src/dsp/yuv.h", directory: "/local-ssd/libwebp-ogk6inqjmrnmtyq4i2sug432zt64ty5a-build/aidengro/spack-stage-libwebp-1.2.4-ogk6inqjmrnmtyq4i2sug432zt64ty5a/spack-src/src/enc", checksumkind: CSK_MD5, checksum: "1424f80f70d28c76091089aacc37b81e")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "YUV_FIX", value: 16)
!29 = !DIEnumerator(name: "YUV_HALF", value: 32768)
!30 = !DIEnumerator(name: "YUV_FIX2", value: 6)
!31 = !DIEnumerator(name: "YUV_MASK2", value: 16383)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !35, line: 24, baseType: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !37, line: 38, baseType: !38)
!37 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{i32 7, !"Dwarf Version", i32 5}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{i32 1, !"wchar_size", i32 4}
!42 = !{i32 8, !"PIC Level", i32 2}
!43 = !{i32 7, !"uwtable", i32 2}
!44 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!45 = distinct !DISubprogram(name: "WebPReplaceTransparentPixels", scope: !1, file: !1, line: 86, type: !46, scopeLine: 86, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !149)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !69}
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "WebPPicture", file: !4, line: 32, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WebPPicture", file: !4, line: 300, size: 2048, elements: !52)
!52 = !{!53, !55, !57, !58, !59, !61, !62, !63, !64, !65, !66, !67, !73, !75, !76, !80, !92, !93, !94, !95, !130, !132, !137, !138, !139, !140, !141, !145, !146, !147}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "use_argb", scope: !51, file: !4, line: 307, baseType: !54, size: 32)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !51, file: !4, line: 310, baseType: !56, size: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "WebPEncCSP", file: !4, line: 273, baseType: !3)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !51, file: !4, line: 311, baseType: !54, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !51, file: !4, line: 311, baseType: !54, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !51, file: !4, line: 312, baseType: !60, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !51, file: !4, line: 312, baseType: !60, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !51, file: !4, line: 312, baseType: !60, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "y_stride", scope: !51, file: !4, line: 313, baseType: !54, size: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "uv_stride", scope: !51, file: !4, line: 313, baseType: !54, size: 32, offset: 352)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !51, file: !4, line: 314, baseType: !60, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "a_stride", scope: !51, file: !4, line: 315, baseType: !54, size: 32, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !51, file: !4, line: 316, baseType: !68, size: 64, offset: 480)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !71)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !35, line: 26, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !37, line: 42, baseType: !5)
!71 = !{!72}
!72 = !DISubrange(count: 2)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "argb", scope: !51, file: !4, line: 319, baseType: !74, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "argb_stride", scope: !51, file: !4, line: 320, baseType: !54, size: 32, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !51, file: !4, line: 321, baseType: !77, size: 96, offset: 672)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 96, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 3)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !51, file: !4, line: 326, baseType: !81, size: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "WebPWriterFunction", file: !4, line: 237, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!54, !85, !87, !90}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 70, baseType: !89)
!88 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!89 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "custom_ptr", scope: !51, file: !4, line: 327, baseType: !33, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "extra_info_type", scope: !51, file: !4, line: 330, baseType: !54, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "extra_info", scope: !51, file: !4, line: 334, baseType: !60, size: 64, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !51, file: !4, line: 342, baseType: !96, size: 64, offset: 1024)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "WebPAuxStats", file: !4, line: 33, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WebPAuxStats", file: !4, line: 204, size: 1504, elements: !99)
!99 = !{!100, !101, !106, !108, !110, !114, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "coded_size", scope: !98, file: !4, line: 205, baseType: !54, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "PSNR", scope: !98, file: !4, line: 207, baseType: !102, size: 160, offset: 32)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 160, elements: !104)
!103 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!104 = !{!105}
!105 = !DISubrange(count: 5)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !98, file: !4, line: 208, baseType: !107, size: 96, offset: 192)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 96, elements: !78)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "header_bytes", scope: !98, file: !4, line: 209, baseType: !109, size: 64, offset: 288)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64, elements: !71)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "residual_bytes", scope: !98, file: !4, line: 211, baseType: !111, size: 384, offset: 352)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 384, elements: !112)
!112 = !{!79, !113}
!113 = !DISubrange(count: 4)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "segment_size", scope: !98, file: !4, line: 213, baseType: !115, size: 128, offset: 736)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !116)
!116 = !{!113}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "segment_quant", scope: !98, file: !4, line: 214, baseType: !115, size: 128, offset: 864)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "segment_level", scope: !98, file: !4, line: 215, baseType: !115, size: 128, offset: 992)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_data_size", scope: !98, file: !4, line: 217, baseType: !54, size: 32, offset: 1120)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "layer_data_size", scope: !98, file: !4, line: 218, baseType: !54, size: 32, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_features", scope: !98, file: !4, line: 221, baseType: !69, size: 32, offset: 1184)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "histogram_bits", scope: !98, file: !4, line: 223, baseType: !54, size: 32, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "transform_bits", scope: !98, file: !4, line: 224, baseType: !54, size: 32, offset: 1248)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bits", scope: !98, file: !4, line: 225, baseType: !54, size: 32, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "palette_size", scope: !98, file: !4, line: 226, baseType: !54, size: 32, offset: 1312)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_size", scope: !98, file: !4, line: 227, baseType: !54, size: 32, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_hdr_size", scope: !98, file: !4, line: 228, baseType: !54, size: 32, offset: 1376)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_data_size", scope: !98, file: !4, line: 229, baseType: !54, size: 32, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !98, file: !4, line: 231, baseType: !68, size: 64, offset: 1440)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "error_code", scope: !51, file: !4, line: 345, baseType: !131, size: 32, offset: 1088)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "WebPEncodingError", file: !4, line: 289, baseType: !11)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "progress_hook", scope: !51, file: !4, line: 348, baseType: !133, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "WebPProgressHook", file: !4, line: 264, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!54, !54, !90}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !51, file: !4, line: 350, baseType: !33, size: 64, offset: 1216)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !51, file: !4, line: 353, baseType: !77, size: 96, offset: 1280)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !51, file: !4, line: 356, baseType: !60, size: 64, offset: 1408)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !51, file: !4, line: 356, baseType: !60, size: 64, offset: 1472)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !51, file: !4, line: 357, baseType: !142, size: 256, offset: 1536)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 8)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "memory_", scope: !51, file: !4, line: 361, baseType: !33, size: 64, offset: 1792)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "memory_argb_", scope: !51, file: !4, line: 362, baseType: !33, size: 64, offset: 1856)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pad7", scope: !51, file: !4, line: 363, baseType: !148, size: 128, offset: 1920)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, elements: !71)
!149 = !{!150, !151, !152, !155}
!150 = !DILocalVariable(name: "pic", arg: 1, scope: !45, file: !1, line: 86, type: !48)
!151 = !DILocalVariable(name: "color", arg: 2, scope: !45, file: !1, line: 86, type: !69)
!152 = !DILocalVariable(name: "y", scope: !153, file: !1, line: 88, type: !54)
!153 = distinct !DILexicalBlock(scope: !154, file: !1, line: 87, column: 37)
!154 = distinct !DILexicalBlock(scope: !45, file: !1, line: 87, column: 7)
!155 = !DILocalVariable(name: "argb", scope: !153, file: !1, line: 89, type: !74)
!156 = !{!157, !157, i64 0}
!157 = !{!"any pointer", !158, i64 0}
!158 = !{!"omnipotent char", !159, i64 0}
!159 = !{!"Simple C/C++ TBAA"}
!160 = !DILocation(line: 86, column: 54, scope: !45)
!161 = !{!162, !162, i64 0}
!162 = !{!"int", !158, i64 0}
!163 = !DILocation(line: 86, column: 68, scope: !45)
!164 = !DILocation(line: 87, column: 7, scope: !154)
!165 = !DILocation(line: 87, column: 11, scope: !154)
!166 = !DILocation(line: 87, column: 19, scope: !154)
!167 = !DILocation(line: 87, column: 22, scope: !154)
!168 = !DILocation(line: 87, column: 27, scope: !154)
!169 = !{!170, !162, i64 0}
!170 = !{!"WebPPicture", !162, i64 0, !158, i64 4, !162, i64 8, !162, i64 12, !157, i64 16, !157, i64 24, !157, i64 32, !162, i64 40, !162, i64 44, !157, i64 48, !162, i64 56, !158, i64 60, !157, i64 72, !162, i64 80, !158, i64 84, !157, i64 96, !157, i64 104, !162, i64 112, !157, i64 120, !157, i64 128, !158, i64 136, !157, i64 144, !157, i64 152, !158, i64 160, !157, i64 176, !157, i64 184, !158, i64 192, !157, i64 224, !157, i64 232, !158, i64 240}
!171 = !DILocation(line: 87, column: 7, scope: !45)
!172 = !DILocation(line: 88, column: 5, scope: !153)
!173 = !DILocation(line: 88, column: 9, scope: !153)
!174 = !DILocation(line: 88, column: 13, scope: !153)
!175 = !DILocation(line: 88, column: 18, scope: !153)
!176 = !{!170, !162, i64 12}
!177 = !DILocation(line: 89, column: 5, scope: !153)
!178 = !DILocation(line: 89, column: 15, scope: !153)
!179 = !DILocation(line: 89, column: 22, scope: !153)
!180 = !DILocation(line: 89, column: 27, scope: !153)
!181 = !{!170, !157, i64 72}
!182 = !DILocation(line: 90, column: 11, scope: !153)
!183 = !DILocation(line: 91, column: 5, scope: !153)
!184 = !DILocation(line: 92, column: 5, scope: !153)
!185 = !DILocation(line: 92, column: 13, scope: !153)
!186 = !DILocation(line: 92, column: 16, scope: !153)
!187 = !DILocation(line: 93, column: 7, scope: !188)
!188 = distinct !DILexicalBlock(scope: !153, file: !1, line: 92, column: 21)
!189 = !DILocation(line: 93, column: 24, scope: !188)
!190 = !DILocation(line: 93, column: 30, scope: !188)
!191 = !DILocation(line: 93, column: 35, scope: !188)
!192 = !{!170, !162, i64 8}
!193 = !DILocation(line: 93, column: 42, scope: !188)
!194 = !DILocation(line: 94, column: 15, scope: !188)
!195 = !DILocation(line: 94, column: 20, scope: !188)
!196 = !{!170, !162, i64 80}
!197 = !DILocation(line: 94, column: 12, scope: !188)
!198 = distinct !{!198, !184, !199, !200}
!199 = !DILocation(line: 95, column: 5, scope: !153)
!200 = !{!"llvm.loop.mustprogress"}
!201 = !DILocation(line: 96, column: 3, scope: !154)
!202 = !DILocation(line: 96, column: 3, scope: !153)
!203 = !DILocation(line: 97, column: 1, scope: !45)
!204 = !DISubprogram(name: "WebPInitAlphaProcessing", scope: !205, file: !205, line: 463, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!205 = !DIFile(filename: "../../src/dsp/dsp.h", directory: "/local-ssd/libwebp-ogk6inqjmrnmtyq4i2sug432zt64ty5a-build/aidengro/spack-stage-libwebp-1.2.4-ogk6inqjmrnmtyq4i2sug432zt64ty5a/spack-src/src/enc", checksumkind: CSK_MD5, checksum: "dbe806d5b797a3b0e88178b7b50247ce")
!206 = !DISubroutineType(types: !207)
!207 = !{null}
