; ModuleID = 'samples/955.bc'
source_filename = "src/tools/gt_seqcorrect.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtSeqcorrectArguments = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr, ptr, ptr, ptr, ptr, i8, i64, i32 }

@.str = private unnamed_addr constant [26 x i8] c"src/tools/gt_seqcorrect.c\00", align 1, !dbg !0
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [10 x i8] c"arguments\00", align 1, !dbg !12
@__func__.gt_seqcorrect_option_parser_new = private unnamed_addr constant [32 x i8] c"gt_seqcorrect_option_parser_new\00", align 1, !dbg !17
@.str.3 = private unnamed_addr constant [61 x i8] c"(-ii <indexname>|-db <filenames>) -k <kmersize> [option ...]\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [33 x i8] c"K-mer based sequence correction.\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [3 x i8] c"db\00", align 1, !dbg !33

!382 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!383 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !382, line: 83, baseType: !376)
!385 = !{!0, !7, !12, !17, !23, !28, !33, !38, !43, !45, !50, !52, !57, !62, !67, !69, !74, !79, !84, !89, !91, !93, !98, !103, !105, !110, !115, !120, !125, !130, !135, !137, !142, !144, !149, !154, !159, !161, !163, !165, !167, !169, !174, !176, !181, !186, !191, !196, !201, !206, !208, !213, !215, !218, !223, !228, !230, !232, !234, !236, !238, !240, !245, !250, !252, !257, !262, !267, !269, !271, !273, !278, !283, !285, !290, !292, !297, !299, !301, !306, !308, !310, !312, !314, !316, !318, !323, !328, !330, !332, !334, !339, !342, !347, !352, !354, !356, !358, !360, !362, !364, !366, !368, !370}
!386 = !{i32 7, !"Dwarf Version", i32 5}
!387 = !{i32 2, !"Debug Info Version", i32 3}
!388 = !{i32 1, !"wchar_size", i32 4}
!389 = !{i32 8, !"PIC Level", i32 2}
!390 = !{i32 7, !"uwtable", i32 2}
!391 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!392 = distinct !DISubprogram(name: "gt_seqcorrect", scope: !2, file: !2, line: 773, type: !393, scopeLine: 774, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !372)
!393 = !DISubroutineType(types: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtTool", file: !397, line: 26, baseType: !398)
!397 = !DIFile(filename: "src/core/tool_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e867124201284063b8eb5758ec6a469a")
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtTool", file: !397, line: 26, flags: DIFlagFwdDecl)
!399 = !DILocation(line: 775, column: 10, scope: !392)
!400 = !DILocation(line: 775, column: 3, scope: !392)
!401 = !DISubprogram(name: "gt_tool_new", scope: !397, file: !397, line: 66, type: !402, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!402 = !DISubroutineType(types: !403)
!403 = !{!395, !404, !408, !412, !420, !428}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsNew", file: !397, line: 30, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!377}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsDelete", file: !397, line: 33, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !377}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolOptionParserNew", file: !397, line: 36, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!416, !377}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOptionParser", file: !418, line: 27, baseType: !419)
!418 = !DIFile(filename: "src/core/option_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "4af8e95b11f2236d309c3019659f4935")
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtOptionParser", file: !418, line: 27, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsCheck", file: !397, line: 41, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!380, !380, !377, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !426, line: 44, baseType: !427)
!426 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !426, line: 44, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolRunner", file: !397, line: 52, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!380, !380, !432, !380, !377, !424}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!434 = distinct !DISubprogram(name: "gt_seqcorrect_arguments_new", scope: !2, file: !2, line: 77, type: !406, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !372, retainedNodes: !435)
!435 = !{!436}
!436 = !DILocalVariable(name: "arguments", scope: !434, file: !2, line: 79, type: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtSeqcorrectArguments", file: !2, line: 75, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 47, size: 960, elements: !440)
!440 = !{!441, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !465, !466, !467, !471, !476, !477, !478}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "usefirstcodes", scope: !439, file: !2, line: 49, baseType: !442, size: 8)
!442 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !439, file: !2, line: 50, baseType: !442, size: 8, offset: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !439, file: !2, line: 51, baseType: !442, size: 8, offset: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "onlyaccum", scope: !439, file: !2, line: 52, baseType: !442, size: 8, offset: 24)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "onlyallrandomcodes", scope: !439, file: !2, line: 53, baseType: !442, size: 8, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "radixlarge", scope: !439, file: !2, line: 54, baseType: !442, size: 8, offset: 40)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "checksuftab", scope: !439, file: !2, line: 55, baseType: !442, size: 8, offset: 48)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "usemaxdepth", scope: !439, file: !2, line: 56, baseType: !442, size: 8, offset: 56)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "find_seldom", scope: !439, file: !2, line: 57, baseType: !442, size: 8, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "correction_kmersize", scope: !439, file: !2, line: 58, baseType: !379, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "samplingfactor", scope: !439, file: !2, line: 59, baseType: !379, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "trusted_count", scope: !439, file: !2, line: 60, baseType: !379, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "numofparts", scope: !439, file: !2, line: 61, baseType: !379, size: 32, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "radixparts", scope: !439, file: !2, line: 62, baseType: !379, size: 32, offset: 224)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "addbscache_depth", scope: !439, file: !2, line: 63, baseType: !379, size: 32, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "forcek", scope: !439, file: !2, line: 64, baseType: !379, size: 32, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !439, file: !2, line: 65, baseType: !379, size: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "maximumspace", scope: !439, file: !2, line: 66, baseType: !384, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "encseqinput", scope: !439, file: !2, line: 67, baseType: !461, size: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStr", file: !463, line: 27, baseType: !464)
!463 = !DIFile(filename: "src/core/str_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "654ceffd2f9ff17a42a8522fe21401e1")
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStr", file: !463, line: 27, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "memlimitarg", scope: !439, file: !2, line: 68, baseType: !461, size: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "indexname", scope: !439, file: !2, line: 69, baseType: !461, size: 64, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "refoptionmemlimit", scope: !439, file: !2, line: 70, baseType: !468, size: 64, offset: 640)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOption", file: !418, line: 33, baseType: !470)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtOption", file: !418, line: 33, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !439, file: !2, line: 71, baseType: !472, size: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStrArray", file: !474, line: 24, baseType: !475)
!474 = !DIFile(filename: "src/core/str_array_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "d2f5724ae7121552c301a489d5e7f125")
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStrArray", file: !474, line: 24, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "phred64", scope: !439, file: !2, line: 72, baseType: !442, size: 8, offset: 768)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "maxlow", scope: !439, file: !2, line: 73, baseType: !384, size: 64, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lowqual", scope: !439, file: !2, line: 74, baseType: !379, size: 32, offset: 896)
!479 = !DILocation(line: 79, column: 3, scope: !434)
!480 = !DILocation(line: 79, column: 26, scope: !434)
!481 = !DILocation(line: 79, column: 38, scope: !434)
!482 = !{!483, !483, i64 0}
!483 = !{!"any pointer", !484, i64 0}
!484 = !{!"omnipotent char", !485, i64 0}
!485 = !{!"Simple C/C++ TBAA"}
!486 = !DILocation(line: 80, column: 3, scope: !434)
!487 = !DILocation(line: 80, column: 14, scope: !434)
!488 = !DILocation(line: 80, column: 25, scope: !434)
!489 = !{!490, !491, i64 5}
!490 = !{!"", !491, i64 0, !491, i64 1, !491, i64 2, !491, i64 3, !491, i64 4, !491, i64 5, !491, i64 6, !491, i64 7, !491, i64 8, !492, i64 12, !492, i64 16, !492, i64 20, !492, i64 24, !492, i64 28, !492, i64 32, !492, i64 36, !492, i64 40, !493, i64 48, !483, i64 56, !483, i64 64, !483, i64 72, !483, i64 80, !483, i64 88, !491, i64 96, !493, i64 104, !492, i64 112}
!491 = !{!"_Bool", !484, i64 0}
!492 = !{!"int", !484, i64 0}
!493 = !{!"long", !484, i64 0}
!494 = !DILocation(line: 81, column: 3, scope: !434)
!495 = !DILocation(line: 81, column: 14, scope: !434)
!496 = !DILocation(line: 81, column: 25, scope: !434)
!497 = !{!490, !492, i64 24}
!498 = !DILocation(line: 82, column: 3, scope: !434)
!499 = !DILocation(line: 82, column: 14, scope: !434)
!500 = !DILocation(line: 82, column: 25, scope: !434)
!501 = !{!490, !492, i64 28}
!502 = !DILocation(line: 83, column: 28, scope: !434)
!503 = !DILocation(line: 83, column: 3, scope: !434)
!504 = !DILocation(line: 83, column: 14, scope: !434)
!505 = !DILocation(line: 83, column: 26, scope: !434)
!506 = !{!490, !483, i64 56}
!507 = !DILocation(line: 84, column: 26, scope: !434)
!508 = !DILocation(line: 84, column: 3, scope: !434)
!509 = !DILocation(line: 84, column: 14, scope: !434)
!510 = !DILocation(line: 84, column: 24, scope: !434)
!511 = !{!490, !483, i64 72}
!512 = !DILocation(line: 85, column: 28, scope: !434)
!513 = !DILocation(line: 85, column: 3, scope: !434)
!514 = !DILocation(line: 85, column: 14, scope: !434)
!515 = !DILocation(line: 85, column: 26, scope: !434)
!516 = !{!490, !483, i64 64}
!517 = !DILocation(line: 86, column: 3, scope: !434)
!518 = !DILocation(line: 86, column: 14, scope: !434)
!519 = !DILocation(line: 86, column: 27, scope: !434)
!520 = !{!490, !493, i64 48}
!521 = !DILocation(line: 87, column: 19, scope: !434)
!522 = !DILocation(line: 87, column: 3, scope: !434)
!523 = !DILocation(line: 87, column: 14, scope: !434)
!524 = !DILocation(line: 87, column: 17, scope: !434)
!525 = !{!490, !483, i64 88}
!526 = !DILocation(line: 88, column: 10, scope: !434)
!527 = !DILocation(line: 89, column: 1, scope: !434)
!528 = !DILocation(line: 88, column: 3, scope: !434)
!529 = distinct !DISubprogram(name: "gt_seqcorrect_arguments_delete", scope: !2, file: !2, line: 91, type: !410, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !372, retainedNodes: !530)
!530 = !{!531, !532}
!531 = !DILocalVariable(name: "tool_arguments", arg: 1, scope: !529, file: !2, line: 91, type: !377)
!532 = !DILocalVariable(name: "arguments", scope: !529, file: !2, line: 93, type: !437)
!533 = !DILocation(line: 91, column: 50, scope: !529)
!534 = !DILocation(line: 93, column: 3, scope: !529)
!535 = !DILocation(line: 93, column: 26, scope: !529)
!536 = !DILocation(line: 93, column: 38, scope: !529)
!537 = !DILocation(line: 94, column: 8, scope: !538)
!538 = distinct !DILexicalBlock(scope: !529, file: !2, line: 94, column: 7)
!539 = !DILocation(line: 94, column: 7, scope: !529)
!540 = !DILocation(line: 94, column: 19, scope: !538)
!541 = !DILocation(line: 95, column: 17, scope: !529)
!542 = !DILocation(line: 95, column: 28, scope: !529)
!543 = !DILocation(line: 95, column: 3, scope: !529)
!544 = !DILocation(line: 96, column: 17, scope: !529)
!545 = !DILocation(line: 96, column: 28, scope: !529)
!546 = !DILocation(line: 96, column: 3, scope: !529)
!547 = !DILocation(line: 97, column: 20, scope: !529)
!548 = !DILocation(line: 97, column: 31, scope: !529)
!549 = !{!490, !483, i64 80}
!550 = !DILocation(line: 97, column: 3, scope: !529)
!551 = !DILocation(line: 98, column: 17, scope: !529)
!552 = !DILocation(line: 98, column: 28, scope: !529)
!553 = !DILocation(line: 98, column: 3, scope: !529)
!554 = !DILocation(line: 99, column: 23, scope: !529)
!555 = !DILocation(line: 99, column: 34, scope: !529)
!556 = !DILocation(line: 99, column: 3, scope: !529)
!557 = !DILocation(line: 100, column: 3, scope: !529)
!558 = !DILocation(line: 101, column: 1, scope: !529)
!559 = distinct !DISubprogram(name: "gt_seqcorrect_option_parser_new", scope: !2, file: !2, line: 103, type: !414, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !372, retainedNodes: !560)
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!561 = !DILocalVariable(name: "tool_arguments", arg: 1, scope: !559, file: !2, line: 103, type: !377)
!562 = !DILocalVariable(name: "arguments", scope: !559, file: !2, line: 105, type: !437)
!563 = !DILocalVariable(name: "op", scope: !559, file: !2, line: 106, type: !416)
!564 = !DILocalVariable(name: "option", scope: !559, file: !2, line: 107, type: !468)
!565 = !DILocalVariable(name: "optionparts", scope: !559, file: !2, line: 107, type: !468)
!566 = !DILocalVariable(name: "optionmemlimit", scope: !559, file: !2, line: 107, type: !468)
!567 = !DILocalVariable(name: "q_option", scope: !559, file: !2, line: 107, type: !468)
!568 = !DILocalVariable(name: "v_option", scope: !559, file: !2, line: 107, type: !468)
!569 = !DILocalVariable(name: "db_option", scope: !559, file: !2, line: 108, type: !468)
!570 = !DILocalVariable(name: "maxlow_option", scope: !559, file: !2, line: 108, type: !468)
!571 = !DILocation(line: 103, column: 62, scope: !559)
!572 = !DILocation(line: 105, column: 3, scope: !559)
!573 = !DILocation(line: 105, column: 26, scope: !559)
!574 = !DILocation(line: 105, column: 38, scope: !559)
!575 = !DILocation(line: 106, column: 3, scope: !559)
!576 = !DILocation(line: 106, column: 19, scope: !559)
!577 = !DILocation(line: 107, column: 3, scope: !559)
!578 = !DILocation(line: 107, column: 13, scope: !559)
!579 = !DILocation(line: 107, column: 22, scope: !559)
!580 = !DILocation(line: 107, column: 36, scope: !559)
!581 = !DILocation(line: 107, column: 53, scope: !559)
!582 = !DILocation(line: 107, column: 64, scope: !559)
!583 = !DILocation(line: 108, column: 13, scope: !559)
!584 = !DILocation(line: 108, column: 25, scope: !559)
!585 = !DILocation(line: 110, column: 3, scope: !559)
!586 = !DILocation(line: 110, column: 3, scope: !587)
!587 = distinct !DILexicalBlock(scope: !588, file: !2, line: 110, column: 3)
!588 = distinct !DILexicalBlock(scope: !559, file: !2, line: 110, column: 3)
!589 = !DILocation(line: 110, column: 3, scope: !588)
!590 = !DILocation(line: 110, column: 3, scope: !591)
!591 = distinct !DILexicalBlock(scope: !587, file: !2, line: 110, column: 3)
!592 = !DILocation(line: 113, column: 8, scope: !559)
!593 = !DILocation(line: 113, column: 6, scope: !559)
!594 = !DILocation(line: 118, column: 40, scope: !559)
!595 = !DILocation(line: 118, column: 51, scope: !559)
!596 = !DILocation(line: 117, column: 15, scope: !559)
!597 = !DILocation(line: 117, column: 13, scope: !559)
!598 = !DILocation(line: 119, column: 26, scope: !559)
!599 = !DILocation(line: 119, column: 3, scope: !559)
!600 = !DILocation(line: 120, column: 31, scope: !559)
!601 = !DILocation(line: 120, column: 35, scope: !559)
!602 = !DILocation(line: 120, column: 3, scope: !559)
!603 = !DILocation(line: 125, column: 7, scope: !559)
!604 = !DILocation(line: 125, column: 18, scope: !559)
!605 = !DILocation(line: 123, column: 12, scope: !559)
!606 = !DILocation(line: 123, column: 10, scope: !559)
!607 = !DILocation(line: 126, column: 26, scope: !559)
!608 = !DILocation(line: 126, column: 3, scope: !559)
!609 = !DILocation(line: 127, column: 31, scope: !559)
!610 = !DILocation(line: 127, column: 35, scope: !559)
!611 = !DILocation(line: 127, column: 3, scope: !559)
!612 = !DILocation(line: 131, column: 33, scope: !559)
!613 = !DILocation(line: 131, column: 44, scope: !559)
!614 = !DILocation(line: 130, column: 12, scope: !559)
!615 = !DILocation(line: 130, column: 10, scope: !559)
!616 = !DILocation(line: 132, column: 33, scope: !559)
!617 = !DILocation(line: 132, column: 41, scope: !559)
!618 = !DILocation(line: 132, column: 3, scope: !559)
!619 = !DILocation(line: 133, column: 21, scope: !559)
!620 = !DILocation(line: 133, column: 29, scope: !559)
!621 = !DILocation(line: 133, column: 3, scope: !559)
!622 = !DILocation(line: 134, column: 31, scope: !559)
!623 = !DILocation(line: 134, column: 35, scope: !559)
!624 = !DILocation(line: 134, column: 3, scope: !559)
!625 = !DILocation(line: 138, column: 32, scope: !559)
!626 = !DILocation(line: 138, column: 43, scope: !559)
!627 = !DILocation(line: 137, column: 12, scope: !559)
!628 = !DILocation(line: 137, column: 10, scope: !559)
!629 = !DILocation(line: 139, column: 31, scope: !559)
!630 = !DILocation(line: 139, column: 35, scope: !559)
!631 = !DILocation(line: 139, column: 3, scope: !559)
!632 = !DILocation(line: 140, column: 26, scope: !559)
!633 = !DILocation(line: 140, column: 3, scope: !559)
!634 = !DILocation(line: 144, column: 8, scope: !559)
!635 = !DILocation(line: 144, column: 19, scope: !559)
!636 = !DILocation(line: 143, column: 12, scope: !559)
!637 = !DILocation(line: 143, column: 10, scope: !559)
!638 = !DILocation(line: 145, column: 31, scope: !559)
!639 = !DILocation(line: 145, column: 35, scope: !559)
!640 = !DILocation(line: 145, column: 3, scope: !559)
!641 = !DILocation(line: 150, column: 8, scope: !559)
!642 = !DILocation(line: 150, column: 19, scope: !559)
!643 = !DILocation(line: 148, column: 12, scope: !559)
!644 = !DILocation(line: 148, column: 10, scope: !559)
!645 = !DILocation(line: 151, column: 31, scope: !559)
!646 = !DILocation(line: 151, column: 35, scope: !559)
!647 = !DILocation(line: 151, column: 3, scope: !559)
!648 = !DILocation(line: 155, column: 8, scope: !559)
!649 = !DILocation(line: 155, column: 19, scope: !559)
!650 = !DILocation(line: 154, column: 12, scope: !559)
!651 = !DILocation(line: 154, column: 10, scope: !559)
!652 = !DILocation(line: 156, column: 31, scope: !559)
!653 = !DILocation(line: 156, column: 35, scope: !559)
!654 = !DILocation(line: 156, column: 3, scope: !559)
!655 = !DILocation(line: 160, column: 36, scope: !559)
!656 = !DILocation(line: 160, column: 47, scope: !559)
!657 = !DILocation(line: 159, column: 12, scope: !559)
!658 = !DILocation(line: 159, column: 10, scope: !559)
!659 = !DILocation(line: 161, column: 31, scope: !559)
!660 = !DILocation(line: 161, column: 35, scope: !559)
!661 = !DILocation(line: 161, column: 3, scope: !559)
!662 = !DILocation(line: 162, column: 35, scope: !559)
!663 = !DILocation(line: 162, column: 3, scope: !559)
!664 = !DILocation(line: 166, column: 36, scope: !559)
!665 = !DILocation(line: 166, column: 47, scope: !559)
!666 = !DILocation(line: 165, column: 17, scope: !559)
!667 = !DILocation(line: 165, column: 15, scope: !559)
!668 = !DILocation(line: 167, column: 31, scope: !559)
!669 = !DILocation(line: 167, column: 35, scope: !559)
!670 = !DILocation(line: 167, column: 3, scope: !559)
!671 = !DILocation(line: 174, column: 24, scope: !559)
!672 = !DILocation(line: 174, column: 35, scope: !559)
!673 = !DILocation(line: 170, column: 20, scope: !559)
!674 = !DILocation(line: 170, column: 18, scope: !559)
!675 = !DILocation(line: 175, column: 31, scope: !559)
!676 = !DILocation(line: 175, column: 35, scope: !559)
!677 = !DILocation(line: 175, column: 3, scope: !559)
!678 = !DILocation(line: 176, column: 21, scope: !559)
!679 = !DILocation(line: 176, column: 37, scope: !559)
!680 = !DILocation(line: 176, column: 3, scope: !559)
!681 = !DILocation(line: 177, column: 48, scope: !559)
!682 = !DILocation(line: 177, column: 34, scope: !559)
!683 = !DILocation(line: 177, column: 3, scope: !559)
!684 = !DILocation(line: 177, column: 14, scope: !559)
!685 = !DILocation(line: 177, column: 32, scope: !559)
!686 = !DILocation(line: 181, column: 16, scope: !559)
!687 = !DILocation(line: 181, column: 27, scope: !559)
!688 = !DILocation(line: 180, column: 12, scope: !559)
!689 = !DILocation(line: 180, column: 10, scope: !559)
!690 = !DILocation(line: 182, column: 35, scope: !559)
!691 = !DILocation(line: 182, column: 3, scope: !559)
!692 = !DILocation(line: 183, column: 31, scope: !559)
!693 = !DILocation(line: 183, column: 35, scope: !559)
!694 = !DILocation(line: 183, column: 3, scope: !559)
!695 = !DILocation(line: 187, column: 32, scope: !559)
!696 = !DILocation(line: 187, column: 43, scope: !559)
!697 = !DILocation(line: 186, column: 12, scope: !559)
!698 = !DILocation(line: 186, column: 10, scope: !559)
!699 = !DILocation(line: 188, column: 31, scope: !559)
!700 = !DILocation(line: 188, column: 35, scope: !559)
!701 = !DILocation(line: 188, column: 3, scope: !559)
!702 = !DILocation(line: 189, column: 35, scope: !559)
!703 = !DILocation(line: 189, column: 3, scope: !559)
!704 = !DILocation(line: 192, column: 37, scope: !559)
!705 = !DILocation(line: 192, column: 48, scope: !559)
!706 = !DILocation(line: 192, column: 14, scope: !559)
!707 = !DILocation(line: 192, column: 12, scope: !559)
!708 = !DILocation(line: 193, column: 31, scope: !559)
!709 = !DILocation(line: 193, column: 35, scope: !559)
!710 = !DILocation(line: 193, column: 3, scope: !559)
!711 = !DILocation(line: 198, column: 8, scope: !559)
!712 = !DILocation(line: 198, column: 19, scope: !559)
!713 = !DILocation(line: 196, column: 14, scope: !559)
!714 = !DILocation(line: 196, column: 12, scope: !559)
!715 = !DILocation(line: 199, column: 21, scope: !559)
!716 = !DILocation(line: 199, column: 31, scope: !559)
!717 = !DILocation(line: 199, column: 3, scope: !559)
!718 = !DILocation(line: 200, column: 31, scope: !559)
!719 = !DILocation(line: 200, column: 35, scope: !559)
!720 = !DILocation(line: 200, column: 3, scope: !559)
!721 = !DILocation(line: 206, column: 8, scope: !559)
!722 = !DILocation(line: 206, column: 19, scope: !559)
!723 = !DILocation(line: 203, column: 19, scope: !559)
!724 = !DILocation(line: 203, column: 17, scope: !559)
!725 = !DILocation(line: 207, column: 26, scope: !559)
!726 = !DILocation(line: 207, column: 3, scope: !559)
!727 = !DILocation(line: 208, column: 32, scope: !559)
!728 = !DILocation(line: 208, column: 3, scope: !559)
!729 = !DILocation(line: 209, column: 31, scope: !559)
!730 = !DILocation(line: 209, column: 35, scope: !559)
!731 = !DILocation(line: 209, column: 3, scope: !559)
!732 = !DILocation(line: 214, column: 8, scope: !559)
!733 = !DILocation(line: 214, column: 19, scope: !559)
!734 = !DILocation(line: 212, column: 12, scope: !559)
!735 = !DILocation(line: 212, column: 10, scope: !559)
!736 = !DILocation(line: 215, column: 32, scope: !559)
!737 = !DILocation(line: 215, column: 3, scope: !559)
!738 = !DILocation(line: 216, column: 19, scope: !559)
!739 = !DILocation(line: 216, column: 27, scope: !559)
!740 = !DILocation(line: 216, column: 3, scope: !559)
!741 = !DILocation(line: 217, column: 31, scope: !559)
!742 = !DILocation(line: 217, column: 35, scope: !559)
!743 = !DILocation(line: 217, column: 3, scope: !559)
!744 = !DILocation(line: 221, column: 8, scope: !559)
!745 = !DILocation(line: 221, column: 19, scope: !559)
!746 = !DILocation(line: 220, column: 12, scope: !559)
!747 = !DILocation(line: 220, column: 10, scope: !559)
!748 = !DILocation(line: 222, column: 32, scope: !559)
!749 = !DILocation(line: 222, column: 3, scope: !559)
!750 = !DILocation(line: 223, column: 31, scope: !559)
!751 = !DILocation(line: 223, column: 35, scope: !559)
!752 = !DILocation(line: 223, column: 3, scope: !559)
!753 = !DILocation(line: 227, column: 31, scope: !559)
!754 = !DILocation(line: 227, column: 42, scope: !559)
!755 = !DILocation(line: 226, column: 12, scope: !559)
!756 = !DILocation(line: 226, column: 10, scope: !559)
!757 = !DILocation(line: 228, column: 31, scope: !559)
!758 = !DILocation(line: 228, column: 35, scope: !559)
!759 = !DILocation(line: 228, column: 3, scope: !559)
!760 = !DILocation(line: 229, column: 35, scope: !559)
!761 = !DILocation(line: 229, column: 3, scope: !559)
!762 = !DILocation(line: 233, column: 31, scope: !559)
!763 = !DILocation(line: 233, column: 42, scope: !559)
!764 = !DILocation(line: 232, column: 12, scope: !559)
!765 = !DILocation(line: 232, column: 10, scope: !559)
!766 = !DILocation(line: 234, column: 31, scope: !559)
!767 = !DILocation(line: 234, column: 35, scope: !559)
!768 = !DILocation(line: 234, column: 3, scope: !559)
!769 = !DILocation(line: 235, column: 35, scope: !559)
!770 = !DILocation(line: 235, column: 3, scope: !559)
!771 = !DILocation(line: 239, column: 31, scope: !559)
!772 = !DILocation(line: 239, column: 42, scope: !559)
!773 = !DILocation(line: 238, column: 12, scope: !559)
!774 = !DILocation(line: 238, column: 10, scope: !559)
!775 = !DILocation(line: 240, column: 31, scope: !559)
!776 = !DILocation(line: 240, column: 35, scope: !559)
!777 = !DILocation(line: 240, column: 3, scope: !559)
!778 = !DILocation(line: 241, column: 35, scope: !559)
!779 = !DILocation(line: 241, column: 3, scope: !559)
!780 = !DILocation(line: 245, column: 32, scope: !559)
!781 = !DILocation(line: 245, column: 43, scope: !559)
!782 = !DILocation(line: 244, column: 12, scope: !559)
!783 = !DILocation(line: 244, column: 10, scope: !559)
!784 = !DILocation(line: 246, column: 31, scope: !559)
!785 = !DILocation(line: 246, column: 35, scope: !559)
!786 = !DILocation(line: 246, column: 3, scope: !559)
!787 = !DILocation(line: 247, column: 35, scope: !559)
!788 = !DILocation(line: 247, column: 3, scope: !559)
!789 = !DILocation(line: 251, column: 32, scope: !559)
!790 = !DILocation(line: 251, column: 43, scope: !559)
!791 = !DILocation(line: 250, column: 12, scope: !559)
!792 = !DILocation(line: 250, column: 10, scope: !559)
!793 = !DILocation(line: 252, column: 31, scope: !559)
!794 = !DILocation(line: 252, column: 35, scope: !559)
!795 = !DILocation(line: 252, column: 3, scope: !559)
!796 = !DILocation(line: 253, column: 35, scope: !559)
!797 = !DILocation(line: 253, column: 3, scope: !559)
!798 = !DILocation(line: 257, column: 32, scope: !559)
!799 = !DILocation(line: 257, column: 43, scope: !559)
!800 = !DILocation(line: 256, column: 12, scope: !559)
!801 = !DILocation(line: 256, column: 10, scope: !559)
!802 = !DILocation(line: 258, column: 31, scope: !559)
!803 = !DILocation(line: 258, column: 35, scope: !559)
!804 = !DILocation(line: 258, column: 3, scope: !559)
!805 = !DILocation(line: 259, column: 35, scope: !559)
!806 = !DILocation(line: 259, column: 3, scope: !559)
!807 = !DILocation(line: 264, column: 32, scope: !559)
!808 = !DILocation(line: 264, column: 43, scope: !559)
!809 = !DILocation(line: 262, column: 12, scope: !559)
!810 = !DILocation(line: 262, column: 10, scope: !559)
!811 = !DILocation(line: 265, column: 31, scope: !559)
!812 = !DILocation(line: 265, column: 35, scope: !559)
!813 = !DILocation(line: 265, column: 3, scope: !559)
!814 = !DILocation(line: 266, column: 35, scope: !559)
!815 = !DILocation(line: 266, column: 3, scope: !559)
!816 = !DILocation(line: 268, column: 33, scope: !559)
!817 = !DILocation(line: 268, column: 3, scope: !559)
!818 = !DILocation(line: 270, column: 10, scope: !559)
!819 = !DILocation(line: 271, column: 1, scope: !559)
!820 = !DILocation(line: 270, column: 3, scope: !559)
!821 = distinct !DISubprogram(name: "gt_seqcorrect_arguments_check", scope: !2, file: !2, line: 306, type: !422, scopeLine: 309, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !372, retainedNodes: !822)
!822 = !{!823, !824, !825, !826, !827}
!823 = !DILocalVariable(name: "rest_argc", arg: 1, scope: !821, file: !2, line: 306, type: !380)
!824 = !DILocalVariable(name: "tool_arguments", arg: 2, scope: !821, file: !2, line: 307, type: !377)
!825 = !DILocalVariable(name: "err", arg: 3, scope: !821, file: !2, line: 308, type: !424)
!826 = !DILocalVariable(name: "arguments", scope: !821, file: !2, line: 310, type: !437)
!827 = !DILocalVariable(name: "haserr", scope: !821, file: !2, line: 311, type: !442)
!828 = !{!492, !492, i64 0}
!829 = !DILocation(line: 306, column: 56, scope: !821)
!830 = !DILocation(line: 307, column: 48, scope: !821)
!831 = !DILocation(line: 308, column: 51, scope: !821)
!832 = !DILocation(line: 310, column: 3, scope: !821)
!833 = !DILocation(line: 310, column: 26, scope: !821)
!834 = !DILocation(line: 310, column: 38, scope: !821)
!835 = !DILocation(line: 311, column: 3, scope: !821)
!836 = !DILocation(line: 311, column: 8, scope: !821)
!837 = !{!491, !491, i64 0}
!838 = !DILocation(line: 313, column: 3, scope: !821)
!839 = !DILocation(line: 313, column: 3, scope: !840)
!840 = distinct !DILexicalBlock(scope: !841, file: !2, line: 313, column: 3)
!841 = distinct !DILexicalBlock(scope: !821, file: !2, line: 313, column: 3)
!842 = !DILocation(line: 313, column: 3, scope: !841)
!843 = !DILocation(line: 313, column: 3, scope: !844)
!844 = distinct !DILexicalBlock(scope: !840, file: !2, line: 313, column: 3)
!845 = !DILocation(line: 314, column: 8, scope: !846)
!846 = distinct !DILexicalBlock(scope: !821, file: !2, line: 314, column: 7)
!847 = !{i8 0, i8 2}
!848 = !{}
!849 = !DILocation(line: 314, column: 15, scope: !846)
!850 = !DILocation(line: 314, column: 35, scope: !846)
!851 = !DILocation(line: 314, column: 46, scope: !846)
!852 = !DILocation(line: 314, column: 18, scope: !846)
!853 = !DILocation(line: 314, column: 7, scope: !821)
!854 = !DILocation(line: 316, column: 36, scope: !855)
!855 = distinct !DILexicalBlock(scope: !856, file: !2, line: 316, column: 9)
!856 = distinct !DILexicalBlock(scope: !846, file: !2, line: 315, column: 3)
!857 = !DILocation(line: 316, column: 47, scope: !855)
!858 = !DILocation(line: 318, column: 35, scope: !855)
!859 = !DILocation(line: 318, column: 46, scope: !855)
!860 = !DILocation(line: 319, column: 35, scope: !855)
!861 = !DILocation(line: 316, column: 9, scope: !855)
!862 = !DILocation(line: 319, column: 40, scope: !855)
!863 = !DILocation(line: 316, column: 9, scope: !856)
!864 = !DILocation(line: 321, column: 14, scope: !865)
!865 = distinct !DILexicalBlock(scope: !855, file: !2, line: 320, column: 5)
!866 = !DILocation(line: 322, column: 5, scope: !865)
!867 = !DILocation(line: 323, column: 3, scope: !856)
!868 = !DILocation(line: 324, column: 8, scope: !869)
!869 = distinct !DILexicalBlock(scope: !821, file: !2, line: 324, column: 7)
!870 = !DILocation(line: 324, column: 7, scope: !821)
!871 = !DILocation(line: 325, column: 9, scope: !872)
!872 = distinct !DILexicalBlock(scope: !873, file: !2, line: 325, column: 9)
!873 = distinct !DILexicalBlock(scope: !869, file: !2, line: 324, column: 16)
!874 = !DILocation(line: 325, column: 20, scope: !872)
!875 = !{!490, !491, i64 8}
!876 = !DILocation(line: 325, column: 32, scope: !872)
!877 = !DILocation(line: 325, column: 35, scope: !872)
!878 = !DILocation(line: 325, column: 46, scope: !872)
!879 = !{!490, !492, i64 40}
!880 = !DILocation(line: 325, column: 57, scope: !872)
!881 = !DILocation(line: 325, column: 9, scope: !873)
!882 = !DILocation(line: 327, column: 20, scope: !883)
!883 = distinct !DILexicalBlock(scope: !872, file: !2, line: 326, column: 5)
!884 = !DILocation(line: 327, column: 7, scope: !883)
!885 = !DILocation(line: 328, column: 14, scope: !883)
!886 = !DILocation(line: 329, column: 5, scope: !883)
!887 = !DILocation(line: 330, column: 3, scope: !873)
!888 = !DILocation(line: 331, column: 10, scope: !821)
!889 = !DILocation(line: 332, column: 1, scope: !821)
!890 = !DILocation(line: 331, column: 3, scope: !821)
!891 = distinct !DISubprogram(name: "gt_seqcorrect_runner", scope: !2, file: !2, line: 684, type: !430, scopeLine: 689, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !372, retainedNodes: !892)
!892 = !{!893, !894, !895, !896, !897, !898, !899, !904, !908, !913, !918, !919, !920}
!893 = !DILocalVariable(name: "argc", arg: 1, scope: !891, file: !2, line: 684, type: !380)
!894 = !DILocalVariable(name: "argv", arg: 2, scope: !891, file: !2, line: 685, type: !432)
!895 = !DILocalVariable(name: "parsed_args", arg: 3, scope: !891, file: !2, line: 686, type: !380)
!896 = !DILocalVariable(name: "tool_arguments", arg: 4, scope: !891, file: !2, line: 687, type: !377)
!897 = !DILocalVariable(name: "err", arg: 5, scope: !891, file: !2, line: 688, type: !424)
!898 = !DILocalVariable(name: "arguments", scope: !891, file: !2, line: 690, type: !437)
!899 = !DILocalVariable(name: "el", scope: !891, file: !2, line: 691, type: !900)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseqLoader", file: !902, line: 57, baseType: !903)
!902 = !DIFile(filename: "src/core/encseq_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "bab4512cadee996edd2995020539d931")
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncseqLoader", file: !902, line: 57, flags: DIFlagFwdDecl)
!904 = !DILocalVariable(name: "encseq", scope: !891, file: !2, line: 692, type: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseq", file: !902, line: 48, baseType: !907)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncseq", file: !902, line: 48, flags: DIFlagFwdDecl)
!908 = !DILocalVariable(name: "timer", scope: !891, file: !2, line: 693, type: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtTimer", file: !911, line: 29, baseType: !912)
!911 = !DIFile(filename: "src/core/timer_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "852c50f033e5ef05505f9a97667e02e4")
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtTimer", file: !911, line: 29, flags: DIFlagFwdDecl)
!913 = !DILocalVariable(name: "default_logger", scope: !891, file: !2, line: 694, type: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtLogger", file: !916, line: 26, baseType: !917)
!916 = !DIFile(filename: "src/core/logger_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "076ebb09feb7de7a97ee09fc11eb7134")
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtLogger", file: !916, line: 26, flags: DIFlagFwdDecl)
!918 = !DILocalVariable(name: "verbose_logger", scope: !891, file: !2, line: 694, type: !914)
!919 = !DILocalVariable(name: "haserr", scope: !891, file: !2, line: 695, type: !442)
!920 = !DILocalVariable(name: "md5path", scope: !921, file: !2, line: 742, type: !461)
!921 = distinct !DILexicalBlock(scope: !922, file: !2, line: 741, column: 7)
!922 = distinct !DILexicalBlock(scope: !923, file: !2, line: 740, column: 11)
!923 = distinct !DILexicalBlock(scope: !924, file: !2, line: 735, column: 5)
!924 = distinct !DILexicalBlock(scope: !925, file: !2, line: 734, column: 9)
!925 = distinct !DILexicalBlock(scope: !926, file: !2, line: 724, column: 3)
!926 = distinct !DILexicalBlock(scope: !891, file: !2, line: 723, column: 7)
!927 = !DILocation(line: 684, column: 47, scope: !891)
!928 = !DILocation(line: 685, column: 28, scope: !891)
!929 = !DILocation(line: 686, column: 19, scope: !891)
!930 = !DILocation(line: 687, column: 11, scope: !891)
!931 = !DILocation(line: 688, column: 14, scope: !891)
!932 = !DILocation(line: 690, column: 3, scope: !891)
!933 = !DILocation(line: 690, column: 26, scope: !891)
!934 = !DILocation(line: 690, column: 38, scope: !891)
!935 = !DILocation(line: 691, column: 3, scope: !891)
!936 = !DILocation(line: 691, column: 19, scope: !891)
!937 = !DILocation(line: 692, column: 3, scope: !891)
!938 = !DILocation(line: 692, column: 13, scope: !891)
!939 = !DILocation(line: 693, column: 3, scope: !891)
!940 = !DILocation(line: 693, column: 12, scope: !891)
!941 = !DILocation(line: 694, column: 3, scope: !891)
!942 = !DILocation(line: 694, column: 13, scope: !891)
!943 = !DILocation(line: 694, column: 30, scope: !891)
!944 = !DILocation(line: 695, column: 3, scope: !891)
!945 = !DILocation(line: 695, column: 8, scope: !891)
!946 = !DILocation(line: 697, column: 3, scope: !891)
!947 = !DILocation(line: 697, column: 3, scope: !948)
!948 = distinct !DILexicalBlock(scope: !949, file: !2, line: 697, column: 3)
!949 = distinct !DILexicalBlock(scope: !891, file: !2, line: 697, column: 3)
!950 = !DILocation(line: 697, column: 3, scope: !949)
!951 = !DILocation(line: 697, column: 3, scope: !952)
!952 = distinct !DILexicalBlock(scope: !948, file: !2, line: 697, column: 3)
!953 = !DILocation(line: 698, column: 3, scope: !891)
!954 = !DILocation(line: 698, column: 3, scope: !955)
!955 = distinct !DILexicalBlock(scope: !956, file: !2, line: 698, column: 3)
!956 = distinct !DILexicalBlock(scope: !891, file: !2, line: 698, column: 3)
!957 = !DILocation(line: 698, column: 3, scope: !956)
!958 = !DILocation(line: 698, column: 3, scope: !959)
!959 = distinct !DILexicalBlock(scope: !955, file: !2, line: 698, column: 3)
!960 = !DILocation(line: 700, column: 7, scope: !961)
!961 = distinct !DILexicalBlock(scope: !891, file: !2, line: 700, column: 7)
!962 = !DILocation(line: 700, column: 7, scope: !891)
!963 = !DILocation(line: 702, column: 13, scope: !964)
!964 = distinct !DILexicalBlock(scope: !961, file: !2, line: 701, column: 3)
!965 = !DILocation(line: 702, column: 11, scope: !964)
!966 = !DILocation(line: 703, column: 40, scope: !964)
!967 = !DILocation(line: 703, column: 5, scope: !964)
!968 = !DILocation(line: 704, column: 20, scope: !964)
!969 = !DILocation(line: 704, column: 5, scope: !964)
!970 = !DILocation(line: 705, column: 3, scope: !964)
!971 = !DILocation(line: 707, column: 20, scope: !891)
!972 = !DILocation(line: 707, column: 31, scope: !891)
!973 = !{!490, !491, i64 2}
!974 = !DILocation(line: 707, column: 19, scope: !891)
!975 = !DILocation(line: 707, column: 62, scope: !891)
!976 = !DILocation(line: 707, column: 5, scope: !891)
!977 = !DILocation(line: 706, column: 18, scope: !891)
!978 = !DILocation(line: 708, column: 17, scope: !891)
!979 = !DILocation(line: 708, column: 3, scope: !891)
!980 = !DILocation(line: 710, column: 19, scope: !891)
!981 = !DILocation(line: 710, column: 30, scope: !891)
!982 = !{!490, !491, i64 1}
!983 = !DILocation(line: 710, column: 63, scope: !891)
!984 = !DILocation(line: 710, column: 5, scope: !891)
!985 = !DILocation(line: 709, column: 18, scope: !891)
!986 = !DILocation(line: 711, column: 17, scope: !891)
!987 = !DILocation(line: 711, column: 3, scope: !891)
!988 = !DILocation(line: 713, column: 25, scope: !989)
!989 = distinct !DILexicalBlock(scope: !891, file: !2, line: 713, column: 7)
!990 = !DILocation(line: 713, column: 36, scope: !989)
!991 = !DILocation(line: 713, column: 7, scope: !989)
!992 = !DILocation(line: 713, column: 40, scope: !989)
!993 = !DILocation(line: 713, column: 7, scope: !891)
!994 = !DILocation(line: 716, column: 28, scope: !995)
!995 = distinct !DILexicalBlock(scope: !989, file: !2, line: 714, column: 3)
!996 = !DILocation(line: 716, column: 39, scope: !995)
!997 = !DILocation(line: 716, column: 55, scope: !995)
!998 = !DILocation(line: 716, column: 71, scope: !995)
!999 = !DILocation(line: 716, column: 7, scope: !995)
!1000 = !DILocation(line: 715, column: 12, scope: !995)
!1001 = !DILocation(line: 717, column: 3, scope: !995)
!1002 = !DILocation(line: 720, column: 19, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !989, file: !2, line: 719, column: 3)
!1004 = !DILocation(line: 721, column: 20, scope: !1003)
!1005 = !DILocation(line: 721, column: 31, scope: !1003)
!1006 = !DILocation(line: 721, column: 9, scope: !1003)
!1007 = !DILocation(line: 720, column: 5, scope: !1003)
!1008 = !DILocation(line: 723, column: 8, scope: !926)
!1009 = !DILocation(line: 723, column: 7, scope: !891)
!1010 = !DILocation(line: 725, column: 10, scope: !925)
!1011 = !DILocation(line: 725, column: 8, scope: !925)
!1012 = !DILocation(line: 726, column: 47, scope: !925)
!1013 = !DILocation(line: 726, column: 5, scope: !925)
!1014 = !DILocation(line: 727, column: 42, scope: !925)
!1015 = !DILocation(line: 727, column: 5, scope: !925)
!1016 = !DILocation(line: 728, column: 36, scope: !925)
!1017 = !DILocation(line: 728, column: 51, scope: !925)
!1018 = !DILocation(line: 728, column: 62, scope: !925)
!1019 = !DILocation(line: 728, column: 40, scope: !925)
!1020 = !DILocation(line: 729, column: 9, scope: !925)
!1021 = !DILocation(line: 728, column: 14, scope: !925)
!1022 = !DILocation(line: 728, column: 12, scope: !925)
!1023 = !DILocation(line: 730, column: 9, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !925, file: !2, line: 730, column: 9)
!1025 = !DILocation(line: 730, column: 16, scope: !1024)
!1026 = !DILocation(line: 730, column: 9, scope: !925)
!1027 = !DILocation(line: 732, column: 14, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1024, file: !2, line: 731, column: 5)
!1029 = !DILocation(line: 733, column: 5, scope: !1028)
!1030 = !DILocation(line: 734, column: 10, scope: !924)
!1031 = !DILocation(line: 734, column: 9, scope: !925)
!1032 = !DILocation(line: 736, column: 28, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !923, file: !2, line: 736, column: 11)
!1034 = !DILocation(line: 736, column: 36, scope: !1033)
!1035 = !DILocation(line: 736, column: 11, scope: !1033)
!1036 = !DILocation(line: 736, column: 41, scope: !1033)
!1037 = !DILocation(line: 736, column: 11, scope: !923)
!1038 = !DILocation(line: 738, column: 16, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1033, file: !2, line: 737, column: 7)
!1040 = !DILocation(line: 739, column: 7, scope: !1039)
!1041 = !DILocation(line: 740, column: 12, scope: !922)
!1042 = !DILocation(line: 740, column: 19, scope: !922)
!1043 = !DILocation(line: 740, column: 48, scope: !922)
!1044 = !DILocation(line: 740, column: 22, scope: !922)
!1045 = !DILocation(line: 740, column: 11, scope: !923)
!1046 = !DILocation(line: 742, column: 9, scope: !921)
!1047 = !DILocation(line: 742, column: 16, scope: !921)
!1048 = !DILocation(line: 742, column: 39, scope: !921)
!1049 = !DILocation(line: 742, column: 50, scope: !921)
!1050 = !DILocation(line: 742, column: 26, scope: !921)
!1051 = !DILocation(line: 743, column: 28, scope: !921)
!1052 = !DILocation(line: 743, column: 9, scope: !921)
!1053 = !DILocation(line: 744, column: 31, scope: !921)
!1054 = !DILocation(line: 744, column: 20, scope: !921)
!1055 = !DILocation(line: 744, column: 9, scope: !921)
!1056 = !DILocation(line: 747, column: 46, scope: !921)
!1057 = !DILocation(line: 747, column: 57, scope: !921)
!1058 = !DILocation(line: 747, column: 35, scope: !921)
!1059 = !DILocation(line: 745, column: 9, scope: !921)
!1060 = !DILocation(line: 748, column: 23, scope: !921)
!1061 = !DILocation(line: 748, column: 9, scope: !921)
!1062 = !DILocation(line: 749, column: 7, scope: !922)
!1063 = !DILocation(line: 749, column: 7, scope: !921)
!1064 = !DILocation(line: 750, column: 5, scope: !923)
!1065 = !DILocation(line: 751, column: 3, scope: !925)
!1066 = !DILocation(line: 752, column: 8, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !891, file: !2, line: 752, column: 7)
!1068 = !DILocation(line: 752, column: 7, scope: !891)
!1069 = !DILocation(line: 754, column: 10, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !2, line: 754, column: 9)
!1071 = distinct !DILexicalBlock(scope: !1067, file: !2, line: 753, column: 3)
!1072 = !DILocation(line: 754, column: 21, scope: !1070)
!1073 = !DILocation(line: 754, column: 9, scope: !1071)
!1074 = !DILocation(line: 755, column: 38, scope: !1070)
!1075 = !DILocation(line: 755, column: 49, scope: !1070)
!1076 = !DILocation(line: 755, column: 57, scope: !1070)
!1077 = !DILocation(line: 755, column: 73, scope: !1070)
!1078 = !DILocation(line: 756, column: 11, scope: !1070)
!1079 = !DILocation(line: 755, column: 16, scope: !1070)
!1080 = !DILocation(line: 755, column: 14, scope: !1070)
!1081 = !DILocation(line: 755, column: 7, scope: !1070)
!1082 = !DILocation(line: 758, column: 42, scope: !1070)
!1083 = !DILocation(line: 758, column: 53, scope: !1070)
!1084 = !DILocation(line: 758, column: 61, scope: !1070)
!1085 = !DILocation(line: 759, column: 11, scope: !1070)
!1086 = !DILocation(line: 759, column: 18, scope: !1070)
!1087 = !DILocation(line: 758, column: 16, scope: !1070)
!1088 = !DILocation(line: 758, column: 14, scope: !1070)
!1089 = !DILocation(line: 760, column: 3, scope: !1071)
!1090 = !DILocation(line: 761, column: 20, scope: !891)
!1091 = !DILocation(line: 761, column: 3, scope: !891)
!1092 = !DILocation(line: 762, column: 27, scope: !891)
!1093 = !DILocation(line: 762, column: 3, scope: !891)
!1094 = !DILocation(line: 763, column: 7, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !891, file: !2, line: 763, column: 7)
!1096 = !DILocation(line: 763, column: 13, scope: !1095)
!1097 = !DILocation(line: 763, column: 7, scope: !891)
!1098 = !DILocation(line: 765, column: 34, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1095, file: !2, line: 764, column: 3)
!1100 = !DILocation(line: 765, column: 41, scope: !1099)
!1101 = !DILocation(line: 765, column: 5, scope: !1099)
!1102 = !DILocation(line: 766, column: 21, scope: !1099)
!1103 = !DILocation(line: 766, column: 5, scope: !1099)
!1104 = !DILocation(line: 767, column: 3, scope: !1099)
!1105 = !DILocation(line: 768, column: 20, scope: !891)
!1106 = !DILocation(line: 768, column: 3, scope: !891)
!1107 = !DILocation(line: 769, column: 20, scope: !891)
!1108 = !DILocation(line: 769, column: 3, scope: !891)
!1109 = !DILocation(line: 770, column: 10, scope: !891)
!1110 = !DILocation(line: 771, column: 1, scope: !891)
!1111 = !DILocation(line: 770, column: 3, scope: !891)
!1112 = !DISubprogram(name: "gt_calloc_mem", scope: !1113, file: !1113, line: 62, type: !1114, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1113 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!377, !1116, !1116, !433, !380}
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1117, line: 70, baseType: !376)
!1117 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!1118 = !DISubprogram(name: "gt_str_new", scope: !463, file: !463, line: 30, type: !1119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!461}
!1121 = !DISubprogram(name: "gt_str_array_new", scope: !474, file: !474, line: 27, type: !1122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!472}
!1124 = !DISubprogram(name: "gt_str_delete", scope: !463, file: !463, line: 90, type: !1125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{null, !461}
!1127 = !DISubprogram(name: "gt_option_delete", scope: !418, file: !418, line: 371, type: !1128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{null, !468}
!1130 = !DISubprogram(name: "gt_str_array_delete", scope: !474, file: !474, line: 56, type: !1131, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{null, !472}
!1133 = !DISubprogram(name: "gt_free_mem", scope: !1113, file: !1113, line: 75, type: !1134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !377, !433, !380}
!1136 = !DISubprogram(name: "fprintf", scope: !1137, file: !1137, line: 350, type: !1138, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1137 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!380, !1140, !1195, null}
!1140 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1141)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1143, line: 7, baseType: !1144)
!1143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1145, line: 49, size: 1728, elements: !1146)
!1145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1146 = !{!1147, !1148, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1163, !1165, !1166, !1167, !1171, !1173, !1175, !1179, !1182, !1184, !1187, !1190, !1191, !1192, !1193, !1194}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1144, file: !1145, line: 51, baseType: !380, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1144, file: !1145, line: 54, baseType: !1149, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1144, file: !1145, line: 55, baseType: !1149, size: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1144, file: !1145, line: 56, baseType: !1149, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1144, file: !1145, line: 57, baseType: !1149, size: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1144, file: !1145, line: 58, baseType: !1149, size: 64, offset: 320)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1144, file: !1145, line: 59, baseType: !1149, size: 64, offset: 384)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1144, file: !1145, line: 60, baseType: !1149, size: 64, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1144, file: !1145, line: 61, baseType: !1149, size: 64, offset: 512)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1144, file: !1145, line: 64, baseType: !1149, size: 64, offset: 576)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1144, file: !1145, line: 65, baseType: !1149, size: 64, offset: 640)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1144, file: !1145, line: 66, baseType: !1149, size: 64, offset: 704)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1144, file: !1145, line: 68, baseType: !1161, size: 64, offset: 768)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1145, line: 36, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1144, file: !1145, line: 70, baseType: !1164, size: 64, offset: 832)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1144, file: !1145, line: 72, baseType: !380, size: 32, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1144, file: !1145, line: 73, baseType: !380, size: 32, offset: 928)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1144, file: !1145, line: 74, baseType: !1168, size: 64, offset: 960)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1169, line: 152, baseType: !1170)
!1169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!1170 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1144, file: !1145, line: 77, baseType: !1172, size: 16, offset: 1024)
!1172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1144, file: !1145, line: 78, baseType: !1174, size: 8, offset: 1040)
!1174 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1144, file: !1145, line: 79, baseType: !1176, size: 8, offset: 1048)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !1177)
!1177 = !{!1178}
!1178 = !DISubrange(count: 1)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1144, file: !1145, line: 81, baseType: !1180, size: 64, offset: 1088)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1145, line: 43, baseType: null)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1144, file: !1145, line: 89, baseType: !1183, size: 64, offset: 1152)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1169, line: 153, baseType: !1170)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1144, file: !1145, line: 91, baseType: !1185, size: 64, offset: 1216)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1145, line: 37, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1144, file: !1145, line: 92, baseType: !1188, size: 64, offset: 1280)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1145, line: 38, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1144, file: !1145, line: 93, baseType: !1164, size: 64, offset: 1344)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1144, file: !1145, line: 94, baseType: !377, size: 64, offset: 1408)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1144, file: !1145, line: 95, baseType: !1116, size: 64, offset: 1472)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1144, file: !1145, line: 96, baseType: !380, size: 32, offset: 1536)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1144, file: !1145, line: 98, baseType: !254, size: 160, offset: 1568)
!1195 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !433)
!1196 = !DISubprogram(name: "abort", scope: !1197, file: !1197, line: 598, type: !1198, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!1197 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1198 = !DISubroutineType(types: !1199)
!1199 = !{null}
!1200 = !DISubprogram(name: "gt_option_parser_new", scope: !418, file: !418, line: 63, type: !1201, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!416, !433, !433}
!1203 = !DISubprogram(name: "gt_option_new_filename_array", scope: !418, file: !418, line: 314, type: !1204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!468, !433, !433, !472}
!1206 = !DISubprogram(name: "gt_option_hide_default", scope: !418, file: !418, line: 365, type: !1128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1207 = !DISubprogram(name: "gt_option_parser_add_option", scope: !418, file: !418, line: 66, type: !1208, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{null, !416, !468}
!1210 = !DISubprogram(name: "gt_option_new_string", scope: !418, file: !418, line: 291, type: !1211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!468, !433, !433, !461, !433}
!1213 = !DISubprogram(name: "gt_option_is_mandatory_either", scope: !418, file: !418, line: 334, type: !1214, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{null, !468, !1216}
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!1218 = !DISubprogram(name: "gt_option_exclude", scope: !418, file: !418, line: 363, type: !1219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{null, !468, !468}
!1221 = !DISubprogram(name: "gt_option_new_uint_min", scope: !418, file: !418, line: 197, type: !1222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!468, !433, !433, !1224, !379, !379}
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!1225 = !DISubprogram(name: "gt_option_is_mandatory", scope: !418, file: !418, line: 332, type: !1128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1226 = !DISubprogram(name: "gt_option_new_bool", scope: !418, file: !418, line: 130, type: !1227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!468, !433, !433, !1229, !442}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!1230 = !DISubprogram(name: "gt_option_is_development_option", scope: !418, file: !418, line: 350, type: !1128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1231 = !DISubprogram(name: "gt_option_new_uint", scope: !418, file: !418, line: 190, type: !1232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!468, !433, !433, !1224, !379}
!1234 = !DISubprogram(name: "gt_option_ref", scope: !418, file: !418, line: 328, type: !1235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!468, !468}
!1237 = !DISubprogram(name: "gt_option_new_verbose", scope: !418, file: !418, line: 322, type: !1238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!468, !1229}
!1240 = !DISubprogram(name: "gt_option_new_uword", scope: !418, file: !418, line: 227, type: !1241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1241 = !DISubroutineType(types: !1242)
