; ModuleID = 'samples/959.bc'
source_filename = "src/hook.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.malloc_mutex_s = type { %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { %struct.mutex_prof_data_t, %union.pthread_mutex_t, %struct.atomic_b_t }
%struct.mutex_prof_data_t = type { %struct.nstime_t, %struct.nstime_t, i64, i64, i32, %struct.atomic_u32_t, i64, ptr, i64 }
%struct.nstime_t = type { i64 }
%struct.atomic_u32_t = type { i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.atomic_b_t = type { i8 }
%struct.atomic_u_t = type { i32 }
%struct.seq_hooks_t = type { %struct.atomic_zu_t, [5 x %struct.atomic_zu_t] }
%struct.atomic_zu_t = type { i64 }
%struct.tsd_s = type { %struct.atomic_u8_t, i8, i8, i8, i32, i64, i64, i64, i64, ptr, %struct.rtree_ctx_s, ptr, ptr, ptr, %struct.tsd_binshards_s, %struct.tcache_s, %struct.witness_tsd_s }
%struct.atomic_u8_t = type { i8 }
%struct.rtree_ctx_s = type { [16 x %struct.rtree_ctx_cache_elm_s], [8 x %struct.rtree_ctx_cache_elm_s] }
%struct.rtree_ctx_cache_elm_s = type { i64, ptr }
%struct.tsd_binshards_s = type { [39 x i8] }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !54, globals: !267, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/hook.c", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "bab9498619553dedcf114388a17026fc")
!4 = !{!5, !11, !23, !30, !35, !43}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 9, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/jemalloc/internal/mutex.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "917cce942e4a6b564502cd3d8e486d0c")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "malloc_mutex_rank_exclusive", value: 0)
!10 = !DIEnumerator(name: "malloc_mutex_address_ordered", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hook_alloc_e", file: !12, line: 51, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "include/jemalloc/internal/hook.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "cba63ef3cb81715a9e481d9adc3b20e5")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22}
!14 = !DIEnumerator(name: "hook_alloc_malloc", value: 0)
!15 = !DIEnumerator(name: "hook_alloc_posix_memalign", value: 1)
!16 = !DIEnumerator(name: "hook_alloc_aligned_alloc", value: 2)
!17 = !DIEnumerator(name: "hook_alloc_calloc", value: 3)
!18 = !DIEnumerator(name: "hook_alloc_memalign", value: 4)
!19 = !DIEnumerator(name: "hook_alloc_valloc", value: 5)
!20 = !DIEnumerator(name: "hook_alloc_mallocx", value: 6)
!21 = !DIEnumerator(name: "hook_alloc_realloc", value: 7)
!22 = !DIEnumerator(name: "hook_alloc_rallocx", value: 8)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hook_dalloc_e", file: !12, line: 70, baseType: !7, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28, !29}
!25 = !DIEnumerator(name: "hook_dalloc_free", value: 0)
!26 = !DIEnumerator(name: "hook_dalloc_dallocx", value: 1)
!27 = !DIEnumerator(name: "hook_dalloc_sdallocx", value: 2)
!28 = !DIEnumerator(name: "hook_dalloc_realloc", value: 3)
!29 = !DIEnumerator(name: "hook_dalloc_rallocx", value: 4)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hook_expand_e", file: !12, line: 85, baseType: !7, size: 32, elements: !31)
!31 = !{!32, !33, !34}
!32 = !DIEnumerator(name: "hook_expand_realloc", value: 0)
!33 = !DIEnumerator(name: "hook_expand_rallocx", value: 1)
!34 = !DIEnumerator(name: "hook_expand_xallocx", value: 2)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 8, baseType: !7, size: 32, elements: !37)
!36 = !DIFile(filename: "include/jemalloc/internal/atomic_gcc_atomic.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "08b4de137309508f556f5697e2840f8f")
!37 = !{!38, !39, !40, !41, !42}
!38 = !DIEnumerator(name: "atomic_memory_order_relaxed", value: 0)
!39 = !DIEnumerator(name: "atomic_memory_order_acquire", value: 1)
!40 = !DIEnumerator(name: "atomic_memory_order_release", value: 2)
!41 = !DIEnumerator(name: "atomic_memory_order_acq_rel", value: 3)
!42 = !DIEnumerator(name: "atomic_memory_order_seq_cst", value: 4)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 125, baseType: !7, size: 32, elements: !45)
!44 = !DIFile(filename: "include/jemalloc/internal/tsd.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9f081fe8da1112924f8bffbbaecc948d")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53}
!46 = !DIEnumerator(name: "tsd_state_nominal", value: 0)
!47 = !DIEnumerator(name: "tsd_state_nominal_slow", value: 1)
!48 = !DIEnumerator(name: "tsd_state_nominal_recompute", value: 2)
!49 = !DIEnumerator(name: "tsd_state_nominal_max", value: 2)
!50 = !DIEnumerator(name: "tsd_state_minimal_initialized", value: 3)
!51 = !DIEnumerator(name: "tsd_state_purgatory", value: 4)
!52 = !DIEnumerator(name: "tsd_state_reincarnated", value: 5)
!53 = !DIEnumerator(name: "tsd_state_uninitialized", value: 6)
!54 = !{!55, !56, !73, !113, !119, !235}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_hooks_t", file: !3, line: 15, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 15, size: 384, elements: !59)
!59 = !{!60, !69}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !58, file: !3, line: 15, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_zu_t", file: !62, line: 72, baseType: !63)
!62 = !DIFile(filename: "include/jemalloc/internal/atomic.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "f4ec326d3284c13a241314e27e68ccae")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 72, size: 64, elements: !64)
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !63, file: !62, line: 72, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 70, baseType: !68)
!67 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!68 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !3, line: 15, baseType: !70, size: 320, offset: 64)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 320, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 5)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_tsdn_t", file: !75, line: 119, baseType: !76)
!75 = !DIFile(filename: "include/jemalloc/internal/witness.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "fb8675f0725894e4a6abb6181efc1d0a")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_tsdn_s", file: !75, line: 120, size: 128, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "witness_tsd", scope: !76, file: !75, line: 121, baseType: !79, size: 128)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_tsd_t", file: !75, line: 107, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_tsd_s", file: !75, line: 108, size: 128, elements: !81)
!81 = !{!82, !111}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "witnesses", scope: !80, file: !75, line: 109, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_list_t", file: !75, line: 76, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 76, size: 64, elements: !85)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "qlh_first", scope: !84, file: !75, line: 76, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_t", file: !75, line: 74, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "witness_s", file: !75, line: 80, size: 384, elements: !90)
!90 = !{!91, !95, !97, !105, !106}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !75, line: 82, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !89, file: !75, line: 88, baseType: !96, size: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_rank_t", file: !75, line: 75, baseType: !7)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !89, file: !75, line: 95, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "witness_comp_t", file: !75, line: 77, baseType: !100)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !103, !55, !103, !55}
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !89, file: !75, line: 98, baseType: !55, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !89, file: !75, line: 101, baseType: !107, size: 128, offset: 256)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !89, file: !75, line: 101, size: 128, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !107, file: !75, line: 101, baseType: !87, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !107, file: !75, line: 101, baseType: !87, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "forking", scope: !80, file: !75, line: 110, baseType: !112, size: 8, offset: 64)
!112 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !115, line: 24, baseType: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !117, line: 38, baseType: !118)
!117 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsdn_t", file: !121, line: 7, baseType: !122)
!121 = !DIFile(filename: "include/jemalloc/internal/tsd_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "d541d97bbf6e4823e1bac63f2add6f7d")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsdn_s", file: !44, line: 219, size: 50368, elements: !123)
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tsd", scope: !122, file: !44, line: 220, baseType: !125, size: 50368)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_t", file: !121, line: 6, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsd_s", file: !44, line: 185, size: 50368, elements: !127)
!127 = !{!128, !133, !134, !135, !140, !143, !146, !147, !148, !152, !157, !180, !185, !186, !190, !199, !266}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !126, file: !44, line: 196, baseType: !129, size: 8)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u8_t", file: !62, line: 76, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 76, size: 8, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !130, file: !62, line: 76, baseType: !114, size: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache_enabled", scope: !126, file: !44, line: 199, baseType: !112, size: 8, offset: 8)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arenas_tdata_bypass", scope: !126, file: !44, line: 199, baseType: !112, size: 8, offset: 16)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_reentrancy_level", scope: !126, file: !44, line: 199, baseType: !136, size: 8, offset: 24)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !137, line: 24, baseType: !138)
!137 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !117, line: 37, baseType: !139)
!139 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_narenas_tdata", scope: !126, file: !44, line: 199, baseType: !141, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !115, line: 26, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !117, line: 42, baseType: !7)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_offset_state", scope: !126, file: !44, line: 199, baseType: !144, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !115, line: 27, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !117, line: 45, baseType: !68)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_allocated", scope: !126, file: !44, line: 199, baseType: !144, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_thread_deallocated", scope: !126, file: !44, line: 199, baseType: !144, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_bytes_until_sample", scope: !126, file: !44, line: 199, baseType: !149, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !137, line: 27, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !117, line: 44, baseType: !151)
!151 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_prof_tdata", scope: !126, file: !44, line: 199, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "prof_tdata_t", file: !155, line: 9, baseType: !156)
!155 = !DIFile(filename: "include/jemalloc/internal/prof_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "893bb7e5be32d3ed1d6a52ee080689bf")
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "prof_tdata_s", file: !155, line: 9, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_rtree_ctx", scope: !126, file: !44, line: 199, baseType: !158, size: 3072, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_ctx_t", file: !159, line: 40, baseType: !160)
!159 = !DIFile(filename: "include/jemalloc/internal/rtree_tsd.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "e327e8ed7b8fd5299eed4833d6c507b8")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_ctx_s", file: !159, line: 41, size: 3072, elements: !161)
!161 = !{!162, !176}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !160, file: !159, line: 43, baseType: !163, size: 2048)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 2048, elements: !174)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_ctx_cache_elm_t", file: !159, line: 34, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_ctx_cache_elm_s", file: !159, line: 35, size: 128, elements: !166)
!166 = !{!167, !170}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "leafkey", scope: !165, file: !159, line: 36, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !169, line: 90, baseType: !68)
!169 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !165, file: !159, line: 37, baseType: !171, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtree_leaf_elm_t", file: !159, line: 32, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtree_leaf_elm_s", file: !159, line: 32, flags: DIFlagFwdDecl)
!174 = !{!175}
!175 = !DISubrange(count: 16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "l2_cache", scope: !160, file: !159, line: 45, baseType: !177, size: 1024, offset: 2048)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 1024, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_iarena", scope: !126, file: !44, line: 199, baseType: !181, size: 64, offset: 3456)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_t", file: !183, line: 18, baseType: !184)
!183 = !DIFile(filename: "include/jemalloc/internal/arena_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "1e2faaf6aaaed7809a70484596be6198")
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "arena_s", file: !183, line: 18, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arena", scope: !126, file: !44, line: 199, baseType: !181, size: 64, offset: 3520)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_arenas_tdata", scope: !126, file: !44, line: 199, baseType: !187, size: 64, offset: 3584)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "arena_tdata_t", file: !183, line: 19, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "arena_tdata_s", file: !183, line: 19, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_binshards", scope: !126, file: !44, line: 199, baseType: !191, size: 312, offset: 3648)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsd_binshards_t", file: !192, line: 12, baseType: !193)
!192 = !DIFile(filename: "include/jemalloc/internal/bin_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "900f45601acc6d8c9838905f3ff9fe5c")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsd_binshards_s", file: !192, line: 13, size: 312, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "binshard", scope: !193, file: !192, line: 14, baseType: !196, size: 312)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 312, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 39)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_tcache", scope: !126, file: !44, line: 199, baseType: !200, size: 46272, offset: 3968)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcache_t", file: !201, line: 6, baseType: !202)
!201 = !DIFile(filename: "include/jemalloc/internal/tcache_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9b2852fa8ffe77d9fa097e3d9e569fb0")
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcache_s", file: !203, line: 13, size: 46272, elements: !204)
!203 = !DIFile(filename: "include/jemalloc/internal/tcache_structs.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "639b312cb1f4b9dc92d248ca33e2878d")
!204 = !{!205, !206, !215, !231, !237, !243, !244, !257, !258, !261, !262}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prof_accumbytes", scope: !202, file: !203, line: 20, baseType: !144, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "gc_ticker", scope: !202, file: !203, line: 22, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ticker_t", file: !208, line: 17, baseType: !209)
!208 = !DIFile(filename: "include/jemalloc/internal/ticker.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "2982b928838e20f58cc0968805d8a2fd")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !208, line: 14, size: 64, elements: !210)
!210 = !{!211, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tick", scope: !209, file: !208, line: 15, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !137, line: 26, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !117, line: 41, baseType: !102)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nticks", scope: !209, file: !208, line: 16, baseType: !212, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bins_small", scope: !202, file: !203, line: 28, baseType: !216, size: 7488, offset: 128)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 7488, elements: !197)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_t", file: !218, line: 43, baseType: !219)
!218 = !DIFile(filename: "include/jemalloc/internal/cache_bin.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9d448b7baf024f90644dd6d3180d79e7")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_s", file: !218, line: 44, size: 192, elements: !220)
!220 = !{!221, !223, !224, !229}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "low_water", scope: !219, file: !218, line: 46, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_sz_t", file: !218, line: 22, baseType: !212)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ncached", scope: !219, file: !218, line: 48, baseType: !222, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tstats", scope: !219, file: !218, line: 54, baseType: !225, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_stats_t", file: !218, line: 24, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_stats_s", file: !218, line: 25, size: 64, elements: !227)
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !226, file: !218, line: 30, baseType: !144, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !219, file: !218, line: 64, baseType: !230, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !202, file: !203, line: 35, baseType: !232, size: 128, offset: 7616)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !202, file: !203, line: 35, size: 128, elements: !233)
!233 = !{!234, !236}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !232, file: !203, line: 35, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !232, file: !203, line: 35, baseType: !235, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tsd_link", scope: !202, file: !203, line: 38, baseType: !238, size: 128, offset: 7744)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !202, file: !203, line: 38, size: 128, elements: !239)
!239 = !{!240, !242}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !238, file: !203, line: 38, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !238, file: !203, line: 38, baseType: !241, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "in_hook", scope: !202, file: !203, line: 39, baseType: !112, size: 8, offset: 7872)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cache_bin_array_descriptor", scope: !202, file: !203, line: 46, baseType: !245, size: 256, offset: 7936)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_bin_array_descriptor_t", file: !218, line: 67, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_bin_array_descriptor_s", file: !218, line: 68, size: 256, elements: !247)
!247 = !{!248, !254, !256}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !246, file: !218, line: 73, baseType: !249, size: 128)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !246, file: !218, line: 73, size: 128, elements: !250)
!250 = !{!251, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "qre_next", scope: !249, file: !218, line: 73, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "qre_prev", scope: !249, file: !218, line: 73, baseType: !252, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "bins_small", scope: !246, file: !218, line: 75, baseType: !255, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bins_large", scope: !246, file: !218, line: 76, baseType: !255, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !202, file: !203, line: 49, baseType: !181, size: 64, offset: 8192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next_gc_bin", scope: !202, file: !203, line: 51, baseType: !259, size: 32, offset: 8256)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "szind_t", file: !260, line: 10, baseType: !7)
!260 = !DIFile(filename: "include/jemalloc/internal/jemalloc_internal_types.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "9fabb1c7fca697e7a645839e73a4d9d5")
!261 = !DIDerivedType(tag: DW_TAG_member, name: "lg_fill_div", scope: !202, file: !203, line: 53, baseType: !196, size: 312, offset: 8288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bins_large", scope: !202, file: !203, line: 59, baseType: !263, size: 37632, offset: 8640)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 37632, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 196)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cant_access_tsd_items_directly_use_a_getter_or_setter_witness_tsd", scope: !126, file: !44, line: 199, baseType: !79, size: 128, offset: 50240)
!267 = !{!268, !273, !0, !278, !284}
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !3, line: 23, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 48, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 6)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "hooks", scope: !2, file: !3, line: 18, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1536, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 4)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "nhooks", scope: !2, file: !3, line: 17, type: !280, isLocal: true, isDefinition: true)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u_t", file: !62, line: 70, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 70, size: 32, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !281, file: !62, line: 70, baseType: !7, size: 32)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "in_hook_global", scope: !286, file: !3, line: 131, type: !112, isLocal: true, isDefinition: true)
!286 = distinct !DISubprogram(name: "hook_reentrantp", scope: !3, file: !3, line: 103, type: !287, scopeLine: 103, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !290)
!287 = !DISubroutineType(types: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!290 = !{!291, !292}
!291 = !DILocalVariable(name: "tsdn", scope: !286, file: !3, line: 132, type: !119)
!292 = !DILocalVariable(name: "tcache", scope: !286, file: !3, line: 133, type: !235)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_t", file: !6, line: 19, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "malloc_mutex_s", file: !6, line: 20, size: 896, elements: !295)
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, scope: !294, file: !6, line: 21, baseType: !297, size: 896)
!297 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !294, file: !6, line: 21, size: 896, elements: !298)
!298 = !{!299, !360, !361}
!299 = !DIDerivedType(tag: DW_TAG_member, scope: !297, file: !6, line: 22, baseType: !300, size: 896)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !297, file: !6, line: 22, size: 896, elements: !301)
!301 = !{!302, !325, !355}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prof_data", scope: !300, file: !6, line: 31, baseType: !303, size: 512)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_prof_data_t", file: !304, line: 106, baseType: !305)
!304 = !DIFile(filename: "include/jemalloc/internal/mutex_prof.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "4a1798f9510ae9d91f888a30d80fb7cc")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 76, size: 512, elements: !306)
!306 = !{!307, !313, !314, !315, !316, !317, !322, !323, !324}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tot_wait_time", scope: !305, file: !304, line: 82, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "nstime_t", file: !309, line: 10, baseType: !310)
!309 = !DIFile(filename: "include/jemalloc/internal/nstime.h", directory: "/local-ssd/redis-zaggizygmons7rsmaxi2xan4oijpzazf-build/aidengro/spack-stage-redis-7.0.5-zaggizygmons7rsmaxi2xan4oijpzazf/spack-src/deps/jemalloc", checksumkind: CSK_MD5, checksum: "3b54840f5e61842f175755b038667aab")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 8, size: 64, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !310, file: !309, line: 9, baseType: !144, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "max_wait_time", scope: !305, file: !304, line: 84, baseType: !308, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "n_wait_times", scope: !305, file: !304, line: 86, baseType: !144, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "n_spin_acquired", scope: !305, file: !304, line: 88, baseType: !144, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "max_n_thds", scope: !305, file: !304, line: 90, baseType: !141, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "n_waiting_thds", scope: !305, file: !304, line: 92, baseType: !318, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_u32_t", file: !62, line: 78, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 78, size: 32, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !319, file: !62, line: 78, baseType: !141, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "n_owner_switches", scope: !305, file: !304, line: 101, baseType: !144, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "prev_owner", scope: !305, file: !304, line: 103, baseType: !119, size: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "n_lock_ops", scope: !305, file: !304, line: 105, baseType: !144, size: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !300, file: !6, line: 44, baseType: !326, size: 320, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !327, line: 72, baseType: !328)
!327 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 67, size: 320, elements: !329)
!329 = !{!330, !350, !354}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !328, file: !327, line: 69, baseType: !331, size: 320)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !332, line: 22, size: 320, elements: !333)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!333 = !{!334, !335, !336, !337, !338, !339, !341, !342}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !331, file: !332, line: 24, baseType: !102, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !331, file: !332, line: 25, baseType: !7, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !331, file: !332, line: 26, baseType: !102, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !331, file: !332, line: 28, baseType: !7, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !331, file: !332, line: 32, baseType: !102, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !331, file: !332, line: 34, baseType: !340, size: 16, offset: 160)
!340 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !331, file: !332, line: 35, baseType: !340, size: 16, offset: 176)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !331, file: !332, line: 36, baseType: !343, size: 128, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !344, line: 55, baseType: !345)
!344 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !344, line: 51, size: 128, elements: !346)
!346 = !{!347, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !345, file: !344, line: 53, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !345, file: !344, line: 54, baseType: !348, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !328, file: !327, line: 70, baseType: !351, size: 320)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 320, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 40)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !328, file: !327, line: 71, baseType: !151, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !300, file: !6, line: 50, baseType: !356, size: 8, offset: 832)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_b_t", file: !62, line: 68, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 68, size: 8, elements: !358)
!358 = !{!359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !357, file: !62, line: 68, baseType: !112, size: 8)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "witness", scope: !297, file: !6, line: 59, baseType: !88, size: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "lock_order", scope: !297, file: !6, line: 60, baseType: !362, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "malloc_mutex_lock_order_t", file: !6, line: 17, baseType: !5)
!363 = !{i32 7, !"Dwarf Version", i32 5}
!364 = !{i32 2, !"Debug Info Version", i32 3}
!365 = !{i32 1, !"wchar_size", i32 4}
!366 = !{i32 8, !"PIC Level", i32 2}
!367 = !{i32 7, !"PIE Level", i32 2}
!368 = !{i32 7, !"uwtable", i32 2}
!369 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!370 = distinct !DISubprogram(name: "hook_boot", scope: !3, file: !3, line: 22, type: !371, scopeLine: 22, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!371 = !DISubroutineType(types: !372)
!372 = !{!112}
!373 = !DILocation(line: 23, column: 9, scope: !370)
!374 = !DILocation(line: 23, column: 2, scope: !370)
!375 = !DISubprogram(name: "malloc_mutex_init", scope: !6, file: !6, line: 143, type: !376, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!376 = !DISubroutineType(types: !377)
!377 = !{!112, !378, !92, !96, !362}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!379 = distinct !DISubprogram(name: "hook_install", scope: !3, file: !3, line: 48, type: !380, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !406)
!380 = !DISubroutineType(types: !381)
!381 = !{!55, !119, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "hooks_t", file: !12, line: 103, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hooks_s", file: !12, line: 104, size: 256, elements: !385)
!385 = !{!386, !393, !399, !405}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_hook", scope: !384, file: !12, line: 105, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_alloc", file: !12, line: 92, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !55, !391, !55, !168, !392}
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_alloc_t", file: !12, line: 68, baseType: !11)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "dalloc_hook", scope: !384, file: !12, line: 106, baseType: !394, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_dalloc", file: !12, line: 96, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !55, !398, !55, !392}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_dalloc_t", file: !12, line: 82, baseType: !23)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "expand_hook", scope: !384, file: !12, line: 107, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_expand", file: !12, line: 99, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !55, !404, !55, !66, !66, !168, !392}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "hook_expand_t", file: !12, line: 90, baseType: !30)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !384, file: !12, line: 108, baseType: !55, size: 64, offset: 192)
!406 = !{!407, !408, !409}
!407 = !DILocalVariable(name: "tsdn", arg: 1, scope: !379, file: !3, line: 48, type: !119)
!408 = !DILocalVariable(name: "to_install", arg: 2, scope: !379, file: !3, line: 48, type: !382)
!409 = !DILocalVariable(name: "ret", scope: !379, file: !3, line: 50, type: !55)
!410 = !{!411, !411, i64 0}
!411 = !{!"any pointer", !412, i64 0}
!412 = !{!"omnipotent char", !413, i64 0}
!413 = !{!"Simple C/C++ TBAA"}
!414 = !DILocation(line: 48, column: 22, scope: !379)
!415 = !DILocation(line: 48, column: 37, scope: !379)
!416 = !DILocation(line: 49, column: 20, scope: !379)
!417 = !DILocation(line: 49, column: 2, scope: !379)
!418 = !DILocation(line: 50, column: 2, scope: !379)
!419 = !DILocation(line: 50, column: 8, scope: !379)
!420 = !DILocation(line: 50, column: 34, scope: !379)
!421 = !DILocation(line: 50, column: 14, scope: !379)
!422 = !DILocation(line: 51, column: 6, scope: !423)
!423 = distinct !DILexicalBlock(scope: !379, file: !3, line: 51, column: 6)
!424 = !DILocation(line: 51, column: 10, scope: !423)
!425 = !DILocation(line: 51, column: 6, scope: !379)
!426 = !DILocation(line: 52, column: 23, scope: !427)
!427 = distinct !DILexicalBlock(scope: !423, file: !3, line: 51, column: 19)
!428 = !DILocation(line: 52, column: 3, scope: !427)
!429 = !DILocation(line: 53, column: 2, scope: !427)
!430 = !DILocation(line: 54, column: 22, scope: !379)
!431 = !DILocation(line: 54, column: 2, scope: !379)
!432 = !DILocation(line: 55, column: 9, scope: !379)
!433 = !DILocation(line: 56, column: 1, scope: !379)
!434 = !DILocation(line: 55, column: 2, scope: !379)
!435 = distinct !DISubprogram(name: "malloc_mutex_lock", scope: !6, file: !6, line: 217, type: !436, scopeLine: 217, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !438)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !119, !378}
!438 = !{!439, !440}
!439 = !DILocalVariable(name: "tsdn", arg: 1, scope: !435, file: !6, line: 217, type: !119)
!440 = !DILocalVariable(name: "mutex", arg: 2, scope: !435, file: !6, line: 217, type: !378)
!441 = !DILocation(line: 217, column: 27, scope: !435)
!442 = !DILocation(line: 217, column: 49, scope: !435)
!443 = !DILocation(line: 218, column: 49, scope: !435)
!444 = !DILocation(line: 218, column: 27, scope: !435)
!445 = !DILocation(line: 218, column: 57, scope: !435)
!446 = !DILocation(line: 218, column: 64, scope: !435)
!447 = !DILocation(line: 218, column: 2, scope: !435)
!448 = !DILocation(line: 220, column: 34, scope: !449)
!449 = distinct !DILexicalBlock(scope: !450, file: !6, line: 220, column: 7)
!450 = distinct !DILexicalBlock(scope: !451, file: !6, line: 219, column: 18)
!451 = distinct !DILexicalBlock(scope: !435, file: !6, line: 219, column: 6)
!452 = !DILocation(line: 220, column: 7, scope: !449)
!453 = !DILocation(line: 220, column: 7, scope: !450)
!454 = !DILocation(line: 221, column: 27, scope: !455)
!455 = distinct !DILexicalBlock(scope: !449, file: !6, line: 220, column: 42)
!456 = !DILocation(line: 221, column: 4, scope: !455)
!457 = !DILocation(line: 222, column: 20, scope: !455)
!458 = !DILocation(line: 222, column: 27, scope: !455)
!459 = !DILocation(line: 222, column: 4, scope: !455)
!460 = !DILocation(line: 223, column: 3, scope: !455)
!461 = !DILocation(line: 224, column: 28, scope: !450)
!462 = !DILocation(line: 224, column: 34, scope: !450)
!463 = !DILocation(line: 224, column: 3, scope: !450)
!464 = !DILocation(line: 226, column: 37, scope: !435)
!465 = !DILocation(line: 226, column: 15, scope: !435)
!466 = !DILocation(line: 226, column: 45, scope: !435)
!467 = !DILocation(line: 226, column: 52, scope: !435)
!468 = !DILocation(line: 226, column: 2, scope: !435)
!469 = !DILocation(line: 227, column: 1, scope: !435)
!470 = distinct !DISubprogram(name: "hook_install_locked", scope: !3, file: !3, line: 28, type: !471, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !473)
!471 = !DISubroutineType(types: !472)
!472 = !{!55, !382}
!473 = !{!474, !475, !481, !483}
!474 = !DILocalVariable(name: "to_install", arg: 1, scope: !470, file: !3, line: 28, type: !382)
!475 = !DILocalVariable(name: "hooks_internal", scope: !470, file: !3, line: 29, type: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "hooks_internal_t", file: !3, line: 9, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hooks_internal_s", file: !3, line: 10, size: 320, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !477, file: !3, line: 11, baseType: !383, size: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !477, file: !3, line: 12, baseType: !112, size: 8, offset: 256)
!481 = !DILocalVariable(name: "i", scope: !482, file: !3, line: 30, type: !102)
!482 = distinct !DILexicalBlock(scope: !470, file: !3, line: 30, column: 2)
!483 = !DILocalVariable(name: "success", scope: !484, file: !3, line: 31, type: !112)
!484 = distinct !DILexicalBlock(scope: !485, file: !3, line: 30, column: 37)
!485 = distinct !DILexicalBlock(scope: !482, file: !3, line: 30, column: 2)
!486 = !DILocation(line: 28, column: 30, scope: !470)
!487 = !DILocation(line: 29, column: 2, scope: !470)
!488 = !DILocation(line: 29, column: 19, scope: !470)
!489 = !DILocation(line: 30, column: 7, scope: !482)
!490 = !DILocation(line: 30, column: 11, scope: !482)
!491 = !{!492, !492, i64 0}
!492 = !{!"int", !412, i64 0}
!493 = !DILocation(line: 30, column: 18, scope: !485)
!494 = !DILocation(line: 30, column: 20, scope: !485)
!495 = !DILocation(line: 30, column: 2, scope: !482)
!496 = !DILocation(line: 31, column: 3, scope: !484)
!497 = !DILocation(line: 31, column: 8, scope: !484)
!498 = !DILocation(line: 31, column: 61, scope: !484)
!499 = !DILocation(line: 31, column: 55, scope: !484)
!500 = !DILocation(line: 31, column: 18, scope: !484)
!501 = !{!502, !502, i64 0}
!502 = !{!"_Bool", !412, i64 0}
!503 = !DILocation(line: 33, column: 3, scope: !484)
!504 = !DILocation(line: 33, column: 3, scope: !505)
!505 = distinct !DILexicalBlock(scope: !484, file: !3, line: 33, column: 3)
!506 = !DILocation(line: 34, column: 23, scope: !507)
!507 = distinct !DILexicalBlock(scope: !484, file: !3, line: 34, column: 7)
!508 = !{!509, !502, i64 32}
!509 = !{!"hooks_internal_s", !510, i64 0, !502, i64 32}
!510 = !{!"hooks_s", !411, i64 0, !411, i64 8, !411, i64 16, !411, i64 24}
!511 = !{i8 0, i8 2}
!512 = !{}
!513 = !DILocation(line: 34, column: 7, scope: !484)
!514 = !DILocation(line: 35, column: 19, scope: !515)
!515 = distinct !DILexicalBlock(scope: !507, file: !3, line: 34, column: 31)
!516 = !DILocation(line: 35, column: 28, scope: !515)
!517 = !DILocation(line: 35, column: 27, scope: !515)
!518 = !{i64 0, i64 8, !410, i64 8, i64 8, !410, i64 16, i64 8, !410, i64 24, i64 8, !410}
!519 = !DILocation(line: 36, column: 19, scope: !515)
!520 = !DILocation(line: 36, column: 26, scope: !515)
!521 = !DILocation(line: 37, column: 27, scope: !515)
!522 = !DILocation(line: 37, column: 21, scope: !515)
!523 = !DILocation(line: 37, column: 4, scope: !515)
!524 = !DILocation(line: 39, column: 8, scope: !515)
!525 = !DILocation(line: 39, column: 47, scope: !515)
!526 = !DILocation(line: 38, column: 4, scope: !515)
!527 = !DILocation(line: 41, column: 18, scope: !515)
!528 = !DILocation(line: 41, column: 12, scope: !515)
!529 = !DILocation(line: 41, column: 4, scope: !515)
!530 = !DILocation(line: 43, column: 2, scope: !485)
!531 = !DILocation(line: 43, column: 2, scope: !484)
!532 = !DILocation(line: 30, column: 33, scope: !485)
!533 = !DILocation(line: 30, column: 2, scope: !485)
!534 = distinct !{!534, !495, !535}
!535 = !DILocation(line: 43, column: 2, scope: !482)
!536 = !DILocation(line: 44, column: 2, scope: !470)
!537 = !DILocation(line: 45, column: 1, scope: !470)
!538 = !DISubprogram(name: "tsd_global_slow_inc", scope: !44, file: !44, line: 121, type: !539, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !119}
!541 = distinct !DISubprogram(name: "malloc_mutex_unlock", scope: !6, file: !6, line: 230, type: !436, scopeLine: 230, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !542)
!542 = !{!543, !544}
!543 = !DILocalVariable(name: "tsdn", arg: 1, scope: !541, file: !6, line: 230, type: !119)
!544 = !DILocalVariable(name: "mutex", arg: 2, scope: !541, file: !6, line: 230, type: !378)
!545 = !DILocation(line: 230, column: 29, scope: !541)
!546 = !DILocation(line: 230, column: 51, scope: !541)
