; ModuleID = 'samples/963.bc'
source_filename = "src/tools/gt_encseq_sample.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtEncseqSampleArguments = type { i8, ptr, ptr, %struct.GtRange, ptr, i32, ptr, i64 }
%struct.GtRange = type { i64, i64 }
%struct.GtEncseqSampleOutputInfo = type { i64, ptr }

@.str = private unnamed_addr constant [29 x i8] c"src/tools/gt_encseq_sample.c\00", align 1, !dbg !0
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [10 x i8] c"arguments\00", align 1, !dbg !12
@__func__.gt_encseq_sample_option_parser_new = private unnamed_addr constant [35 x i8] c"gt_encseq_sample_option_parser_new\00", align 1, !dbg !17
@gt_encseq_sample_option_parser_new.modes = internal global [3 x ptr] [ptr @.str.3, ptr @.str.4, ptr null], align 16, !dbg !23
@.str.3 = private unnamed_addr constant [6 x i8] c"fasta\00", align 1, !dbg !79
@.str.4 = private unnamed_addr constant [7 x i8] c"concat\00", align 1, !dbg !84

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 56, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/tools/gt_encseq_sample.c", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "46ad4e3eafd5e06498dde20453c92427")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 29)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2376, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 297)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 10)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 280, elements: !21)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!21 = !{!22}
!22 = !DISubrange(count: 35)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "modes", scope: !25, file: !2, line: 86, type: !235, isLocal: true, isDefinition: true)
!25 = distinct !DISubprogram(name: "gt_encseq_sample_option_parser_new", scope: !2, file: !2, line: 76, type: !26, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !223)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !32}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOptionParser", file: !30, line: 27, baseType: !31)
!30 = !DIFile(filename: "src/core/option_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "4af8e95b11f2236d309c3019659f4935")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtOptionParser", file: !30, line: 27, flags: DIFlagFwdDecl)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !34, retainedTypes: !43, globals: !78, splitDebugInlining: false, nameTableKind: None)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GtReadmode", file: !36, line: 23, baseType: !37, size: 32, elements: !38)
!36 = !DIFile(filename: "src/core/readmode_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "1b062e226e296972a431b9bfcad13aa9")
!37 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!38 = !{!39, !40, !41, !42}
!39 = !DIEnumerator(name: "GT_READMODE_FORWARD", value: 0)
!40 = !DIEnumerator(name: "GT_READMODE_REVERSE", value: 1)
!41 = !DIEnumerator(name: "GT_READMODE_COMPL", value: 2)
!42 = !DIEnumerator(name: "GT_READMODE_REVCOMPL", value: 3)
!43 = !{!44, !32, !47, !74, !77}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 70, baseType: !46)
!45 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!46 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseqSampleArguments", file: !2, line: 47, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 38, size: 576, elements: !50)
!50 = !{!51, !53, !58, !59, !68, !73, !75, !76}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "singlechars", scope: !49, file: !2, line: 39, baseType: !52, size: 8)
!52 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !49, file: !2, line: 40, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStr", file: !56, line: 27, baseType: !57)
!56 = !DIFile(filename: "src/core/str_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "654ceffd2f9ff17a42a8522fe21401e1")
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStr", file: !56, line: 27, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sepchar", scope: !49, file: !2, line: 41, baseType: !54, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "seqrng", scope: !49, file: !2, line: 42, baseType: !60, size: 128, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtRange", file: !61, line: 29, baseType: !62)
!61 = !DIFile(filename: "src/core/range_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "05971597f0a8f239b91be35d4168fb4b")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtRange", file: !61, line: 31, size: 128, elements: !63)
!63 = !{!64, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !62, file: !61, line: 32, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtUword", file: !66, line: 83, baseType: !46)
!66 = !DIFile(filename: "src/core/types_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "c1165644814b09ecabcfbfd3bda28077")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !62, file: !61, line: 33, baseType: !65, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "eopts", scope: !49, file: !2, line: 43, baseType: !69, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseqOptions", file: !71, line: 25, baseType: !72)
!71 = !DIFile(filename: "src/core/encseq_options.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "8490d5e75d47919b4324640a83a415af")
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncseqOptions", file: !71, line: 25, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !49, file: !2, line: 44, baseType: !74, size: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtReadmode", file: !36, line: 32, baseType: !35)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !49, file: !2, line: 45, baseType: !54, size: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, file: !2, line: 46, baseType: !65, size: 64, offset: 512)
!77 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!78 = !{!0, !7, !12, !17, !79, !84, !23, !89, !94, !99, !104, !109, !111, !116, !121, !126, !128, !133, !138, !143, !148, !153, !158, !163, !168, !173, !178, !180, !182, !187, !189, !194, !199, !204, !209, !214, !219, !221}
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 6)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 7)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !91, isLocal: true, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 26)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 51)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(scope: null, file: !2, line: 98, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 12)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(scope: null, file: !2, line: 99, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 592, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 74)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !86, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 31)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 9)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 39)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 121, type: !86, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 49)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !2, line: 130, type: !135, isLocal: true, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 8)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 43)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !2, line: 132, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 2)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 30)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 264, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 33)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 149, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 5)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 25)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !2, line: 351, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 192, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 24)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 318, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 224, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 28)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 319, type: !135, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !2, line: 328, type: !140, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 40)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !2, line: 251, type: !86, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !2, line: 251, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 272, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 34)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 38)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 58)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !2, line: 269, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 696, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 87)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 285, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 55)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !2, line: 203, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 13)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !2, line: 207, type: !160, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 207, type: !170, isLocal: true, isDefinition: true)
!223 = !{!224, !225, !226, !227, !231, !232, !233, !234}
!224 = !DILocalVariable(name: "tool_arguments", arg: 1, scope: !25, file: !2, line: 76, type: !32)
!225 = !DILocalVariable(name: "arguments", scope: !25, file: !2, line: 78, type: !47)
!226 = !DILocalVariable(name: "op", scope: !25, file: !2, line: 79, type: !28)
!227 = !DILocalVariable(name: "option", scope: !25, file: !2, line: 80, type: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtOption", file: !30, line: 33, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtOption", file: !30, line: 33, flags: DIFlagFwdDecl)
!231 = !DILocalVariable(name: "optionsep", scope: !25, file: !2, line: 81, type: !228)
!232 = !DILocalVariable(name: "optionlen", scope: !25, file: !2, line: 82, type: !228)
!233 = !DILocalVariable(name: "optionseqrange", scope: !25, file: !2, line: 83, type: !228)
!234 = !DILocalVariable(name: "optionmode", scope: !25, file: !2, line: 84, type: !228)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 192, elements: !237)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!237 = !{!238}
!238 = !DISubrange(count: 3)
!239 = !{i32 7, !"Dwarf Version", i32 5}
!240 = !{i32 2, !"Debug Info Version", i32 3}
!241 = !{i32 1, !"wchar_size", i32 4}
!242 = !{i32 8, !"PIC Level", i32 2}
!243 = !{i32 7, !"uwtable", i32 2}
!244 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!245 = distinct !DISubprogram(name: "gt_encseq_sample", scope: !2, file: !2, line: 364, type: !246, scopeLine: 365, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !33)
!246 = !DISubroutineType(types: !247)
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtTool", file: !250, line: 26, baseType: !251)
!250 = !DIFile(filename: "src/core/tool_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "e867124201284063b8eb5758ec6a469a")
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtTool", file: !250, line: 26, flags: DIFlagFwdDecl)
!252 = !DILocation(line: 366, column: 10, scope: !245)
!253 = !DILocation(line: 366, column: 3, scope: !245)
!254 = !DISubprogram(name: "gt_tool_new", scope: !250, file: !250, line: 66, type: !255, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!255 = !DISubroutineType(types: !256)
!256 = !{!248, !257, !261, !265, !267, !276}
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsNew", file: !250, line: 30, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!32}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsDelete", file: !250, line: 33, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !32}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolOptionParserNew", file: !250, line: 36, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolArgumentsCheck", file: !250, line: 41, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !271, !32, !272}
!271 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !274, line: 44, baseType: !275)
!274 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !274, line: 44, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtToolRunner", file: !250, line: 52, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!271, !271, !280, !271, !32, !272}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!281 = distinct !DISubprogram(name: "gt_encseq_sample_arguments_new", scope: !2, file: !2, line: 54, type: !259, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !282)
!282 = !{!283}
!283 = !DILocalVariable(name: "arguments", scope: !281, file: !2, line: 56, type: !47)
!284 = !DILocation(line: 56, column: 3, scope: !281)
!285 = !DILocation(line: 56, column: 28, scope: !281)
!286 = !DILocation(line: 56, column: 40, scope: !281)
!287 = !{!288, !288, i64 0}
!288 = !{!"any pointer", !289, i64 0}
!289 = !{!"omnipotent char", !290, i64 0}
!290 = !{!"Simple C/C++ TBAA"}
!291 = !DILocation(line: 57, column: 21, scope: !281)
!292 = !DILocation(line: 57, column: 3, scope: !281)
!293 = !DILocation(line: 57, column: 14, scope: !281)
!294 = !DILocation(line: 57, column: 19, scope: !281)
!295 = !{!296, !288, i64 8}
!296 = !{!"", !297, i64 0, !288, i64 8, !288, i64 16, !298, i64 24, !288, i64 40, !289, i64 48, !288, i64 56, !299, i64 64}
!297 = !{!"_Bool", !289, i64 0}
!298 = !{!"GtRange", !299, i64 0, !299, i64 8}
!299 = !{!"long", !289, i64 0}
!300 = !DILocation(line: 58, column: 24, scope: !281)
!301 = !DILocation(line: 58, column: 3, scope: !281)
!302 = !DILocation(line: 58, column: 14, scope: !281)
!303 = !DILocation(line: 58, column: 22, scope: !281)
!304 = !{!296, !288, i64 16}
!305 = !DILocation(line: 59, column: 20, scope: !281)
!306 = !DILocation(line: 59, column: 3, scope: !281)
!307 = !DILocation(line: 59, column: 14, scope: !281)
!308 = !DILocation(line: 59, column: 18, scope: !281)
!309 = !{!296, !288, i64 56}
!310 = !DILocation(line: 60, column: 29, scope: !281)
!311 = !DILocation(line: 60, column: 40, scope: !281)
!312 = !DILocation(line: 60, column: 47, scope: !281)
!313 = !DILocation(line: 60, column: 51, scope: !281)
!314 = !{!296, !299, i64 32}
!315 = !DILocation(line: 60, column: 3, scope: !281)
!316 = !DILocation(line: 60, column: 14, scope: !281)
!317 = !DILocation(line: 60, column: 21, scope: !281)
!318 = !DILocation(line: 60, column: 27, scope: !281)
!319 = !{!296, !299, i64 24}
!320 = !DILocation(line: 61, column: 10, scope: !281)
!321 = !DILocation(line: 62, column: 1, scope: !281)
!322 = !DILocation(line: 61, column: 3, scope: !281)
!323 = distinct !DISubprogram(name: "gt_encseq_sample_arguments_delete", scope: !2, file: !2, line: 64, type: !263, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !324)
!324 = !{!325, !326}
!325 = !DILocalVariable(name: "tool_arguments", arg: 1, scope: !323, file: !2, line: 64, type: !32)
!326 = !DILocalVariable(name: "arguments", scope: !323, file: !2, line: 66, type: !47)
!327 = !DILocation(line: 64, column: 53, scope: !323)
!328 = !DILocation(line: 66, column: 3, scope: !323)
!329 = !DILocation(line: 66, column: 28, scope: !323)
!330 = !DILocation(line: 66, column: 40, scope: !323)
!331 = !DILocation(line: 67, column: 7, scope: !332)
!332 = distinct !DILexicalBlock(scope: !323, file: !2, line: 67, column: 7)
!333 = !DILocation(line: 67, column: 17, scope: !332)
!334 = !DILocation(line: 67, column: 7, scope: !323)
!335 = !DILocation(line: 68, column: 19, scope: !336)
!336 = distinct !DILexicalBlock(scope: !332, file: !2, line: 67, column: 26)
!337 = !DILocation(line: 68, column: 30, scope: !336)
!338 = !DILocation(line: 68, column: 5, scope: !336)
!339 = !DILocation(line: 69, column: 19, scope: !336)
!340 = !DILocation(line: 69, column: 30, scope: !336)
!341 = !DILocation(line: 69, column: 5, scope: !336)
!342 = !DILocation(line: 70, column: 19, scope: !336)
!343 = !DILocation(line: 70, column: 30, scope: !336)
!344 = !DILocation(line: 70, column: 5, scope: !336)
!345 = !DILocation(line: 71, column: 30, scope: !336)
!346 = !DILocation(line: 71, column: 41, scope: !336)
!347 = !{!296, !288, i64 40}
!348 = !DILocation(line: 71, column: 5, scope: !336)
!349 = !DILocation(line: 72, column: 5, scope: !336)
!350 = !DILocation(line: 73, column: 3, scope: !336)
!351 = !DILocation(line: 74, column: 1, scope: !323)
!352 = !DILocation(line: 76, column: 65, scope: !25)
!353 = !DILocation(line: 78, column: 3, scope: !25)
!354 = !DILocation(line: 78, column: 28, scope: !25)
!355 = !DILocation(line: 78, column: 66, scope: !25)
!356 = !DILocation(line: 79, column: 3, scope: !25)
!357 = !DILocation(line: 79, column: 19, scope: !25)
!358 = !DILocation(line: 80, column: 3, scope: !25)
!359 = !DILocation(line: 80, column: 13, scope: !25)
!360 = !DILocation(line: 81, column: 13, scope: !25)
!361 = !DILocation(line: 82, column: 13, scope: !25)
!362 = !DILocation(line: 83, column: 13, scope: !25)
!363 = !DILocation(line: 84, column: 13, scope: !25)
!364 = !DILocation(line: 85, column: 3, scope: !25)
!365 = !DILocation(line: 85, column: 3, scope: !366)
!366 = distinct !DILexicalBlock(scope: !367, file: !2, line: 85, column: 3)
!367 = distinct !DILexicalBlock(scope: !25, file: !2, line: 85, column: 3)
!368 = !DILocation(line: 85, column: 3, scope: !367)
!369 = !DILocation(line: 85, column: 3, scope: !370)
!370 = distinct !DILexicalBlock(scope: !366, file: !2, line: 85, column: 3)
!371 = !DILocation(line: 89, column: 8, scope: !25)
!372 = !DILocation(line: 89, column: 6, scope: !25)
!373 = !DILocation(line: 94, column: 57, scope: !25)
!374 = !DILocation(line: 94, column: 22, scope: !25)
!375 = !DILocation(line: 94, column: 3, scope: !25)
!376 = !DILocation(line: 94, column: 14, scope: !25)
!377 = !DILocation(line: 94, column: 20, scope: !25)
!378 = !DILocation(line: 95, column: 41, scope: !25)
!379 = !DILocation(line: 95, column: 45, scope: !25)
!380 = !DILocation(line: 95, column: 56, scope: !25)
!381 = !DILocation(line: 95, column: 3, scope: !25)
!382 = !DILocation(line: 101, column: 32, scope: !25)
!383 = !DILocation(line: 101, column: 43, scope: !25)
!384 = !DILocation(line: 98, column: 12, scope: !25)
!385 = !DILocation(line: 98, column: 10, scope: !25)
!386 = !DILocation(line: 103, column: 32, scope: !25)
!387 = !DILocation(line: 103, column: 3, scope: !25)
!388 = !DILocation(line: 104, column: 31, scope: !25)
!389 = !DILocation(line: 104, column: 35, scope: !25)
!390 = !DILocation(line: 104, column: 3, scope: !25)
!391 = !DILocation(line: 109, column: 36, scope: !25)
!392 = !DILocation(line: 109, column: 47, scope: !25)
!393 = !DILocation(line: 107, column: 15, scope: !25)
!394 = !DILocation(line: 107, column: 13, scope: !25)
!395 = !DILocation(line: 111, column: 31, scope: !25)
!396 = !DILocation(line: 111, column: 35, scope: !25)
!397 = !DILocation(line: 111, column: 3, scope: !25)
!398 = !DILocation(line: 116, column: 41, scope: !25)
!399 = !DILocation(line: 116, column: 52, scope: !25)
!400 = !DILocation(line: 114, column: 20, scope: !25)
!401 = !DILocation(line: 114, column: 18, scope: !25)
!402 = !DILocation(line: 118, column: 31, scope: !25)
!403 = !DILocation(line: 118, column: 35, scope: !25)
!404 = !DILocation(line: 118, column: 3, scope: !25)
!405 = !DILocation(line: 124, column: 37, scope: !25)
!406 = !DILocation(line: 124, column: 48, scope: !25)
!407 = !DILocation(line: 125, column: 37, scope: !25)
!408 = !DILocation(line: 121, column: 16, scope: !25)
!409 = !DILocation(line: 121, column: 14, scope: !25)
!410 = !DILocation(line: 127, column: 31, scope: !25)
!411 = !DILocation(line: 127, column: 35, scope: !25)
!412 = !DILocation(line: 127, column: 3, scope: !25)
!413 = !DILocation(line: 132, column: 36, scope: !25)
!414 = !DILocation(line: 132, column: 47, scope: !25)
!415 = !DILocation(line: 130, column: 15, scope: !25)
!416 = !DILocation(line: 130, column: 13, scope: !25)
!417 = !DILocation(line: 133, column: 31, scope: !25)
!418 = !DILocation(line: 133, column: 35, scope: !25)
!419 = !DILocation(line: 133, column: 3, scope: !25)
!420 = !DILocation(line: 134, column: 19, scope: !25)
!421 = !DILocation(line: 134, column: 30, scope: !25)
!422 = !DILocation(line: 134, column: 3, scope: !25)
!423 = !DILocation(line: 136, column: 37, scope: !25)
!424 = !DILocation(line: 136, column: 3, scope: !25)
!425 = !DILocation(line: 138, column: 10, scope: !25)
!426 = !DILocation(line: 139, column: 1, scope: !25)
!427 = !DILocation(line: 138, column: 3, scope: !25)
!428 = distinct !DISubprogram(name: "gt_encseq_sample_arguments_check", scope: !2, file: !2, line: 141, type: !269, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !429)
!429 = !{!430, !431, !432, !433, !434, !435}
!430 = !DILocalVariable(name: "rest_argc", arg: 1, scope: !428, file: !2, line: 141, type: !271)
!431 = !DILocalVariable(name: "tool_arguments", arg: 2, scope: !428, file: !2, line: 142, type: !32)
!432 = !DILocalVariable(name: "err", arg: 3, scope: !428, file: !2, line: 143, type: !272)
!433 = !DILocalVariable(name: "args", scope: !428, file: !2, line: 145, type: !47)
!434 = !DILocalVariable(name: "rval", scope: !428, file: !2, line: 146, type: !271)
!435 = !DILocalVariable(name: "had_err", scope: !428, file: !2, line: 147, type: !271)
!436 = !{!437, !437, i64 0}
!437 = !{!"int", !289, i64 0}
!438 = !DILocation(line: 141, column: 59, scope: !428)
!439 = !DILocation(line: 142, column: 46, scope: !428)
!440 = !DILocation(line: 143, column: 59, scope: !428)
!441 = !DILocation(line: 145, column: 3, scope: !428)
!442 = !DILocation(line: 145, column: 28, scope: !428)
!443 = !DILocation(line: 145, column: 63, scope: !428)
!444 = !DILocation(line: 146, column: 3, scope: !428)
!445 = !DILocation(line: 146, column: 7, scope: !428)
!446 = !DILocation(line: 147, column: 3, scope: !428)
!447 = !DILocation(line: 147, column: 7, scope: !428)
!448 = !DILocation(line: 148, column: 3, scope: !428)
!449 = !DILocation(line: 148, column: 3, scope: !450)
!450 = distinct !DILexicalBlock(scope: !451, file: !2, line: 148, column: 3)
!451 = distinct !DILexicalBlock(scope: !428, file: !2, line: 148, column: 3)
!452 = !DILocation(line: 148, column: 3, scope: !451)
!453 = !DILocation(line: 148, column: 3, scope: !454)
!454 = distinct !DILexicalBlock(scope: !450, file: !2, line: 148, column: 3)
!455 = !DILocation(line: 149, column: 3, scope: !428)
!456 = !DILocation(line: 149, column: 3, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !2, line: 149, column: 3)
!458 = distinct !DILexicalBlock(scope: !428, file: !2, line: 149, column: 3)
!459 = !DILocation(line: 149, column: 3, scope: !458)
!460 = !DILocation(line: 149, column: 3, scope: !461)
!461 = distinct !DILexicalBlock(scope: !457, file: !2, line: 149, column: 3)
!462 = !DILocation(line: 151, column: 21, scope: !463)
!463 = distinct !DILexicalBlock(scope: !428, file: !2, line: 151, column: 7)
!464 = !DILocation(line: 151, column: 27, scope: !463)
!465 = !DILocation(line: 151, column: 7, scope: !463)
!466 = !DILocation(line: 151, column: 32, scope: !463)
!467 = !DILocation(line: 151, column: 7, scope: !428)
!468 = !DILocation(line: 152, column: 41, scope: !469)
!469 = distinct !DILexicalBlock(scope: !463, file: !2, line: 151, column: 37)
!470 = !DILocation(line: 152, column: 47, scope: !469)
!471 = !DILocation(line: 152, column: 30, scope: !469)
!472 = !DILocation(line: 152, column: 53, scope: !469)
!473 = !DILocation(line: 152, column: 12, scope: !469)
!474 = !DILocation(line: 152, column: 10, scope: !469)
!475 = !DILocation(line: 153, column: 9, scope: !476)
!476 = distinct !DILexicalBlock(scope: !469, file: !2, line: 153, column: 9)
!477 = !DILocation(line: 153, column: 14, scope: !476)
!478 = !DILocation(line: 153, column: 9, scope: !469)
!479 = !DILocation(line: 154, column: 15, scope: !476)
!480 = !DILocation(line: 154, column: 7, scope: !476)
!481 = !DILocation(line: 156, column: 31, scope: !476)
!482 = !DILocation(line: 156, column: 7, scope: !476)
!483 = !DILocation(line: 156, column: 13, scope: !476)
!484 = !DILocation(line: 156, column: 16, scope: !476)
!485 = !{!296, !289, i64 48}
!486 = !DILocation(line: 157, column: 3, scope: !469)
!487 = !DILocation(line: 158, column: 7, scope: !488)
!488 = distinct !DILexicalBlock(scope: !428, file: !2, line: 158, column: 7)
!489 = !DILocation(line: 158, column: 13, scope: !488)
!490 = !{!296, !299, i64 64}
!491 = !DILocation(line: 158, column: 17, scope: !488)
!492 = !DILocation(line: 158, column: 7, scope: !428)
!493 = !DILocation(line: 159, column: 18, scope: !494)
!494 = distinct !DILexicalBlock(scope: !488, file: !2, line: 158, column: 36)
!495 = !DILocation(line: 159, column: 5, scope: !494)
!496 = !DILocation(line: 160, column: 5, scope: !494)
!497 = !DILocation(line: 162, column: 10, scope: !428)
!498 = !DILocation(line: 162, column: 3, scope: !428)
!499 = !DILocation(line: 163, column: 1, scope: !428)
!500 = distinct !DISubprogram(name: "gt_encseq_sample_runner", scope: !2, file: !2, line: 344, type: !278, scopeLine: 347, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !512, !522}
!502 = !DILocalVariable(name: "argc", arg: 1, scope: !500, file: !2, line: 344, type: !271)
!503 = !DILocalVariable(name: "argv", arg: 2, scope: !500, file: !2, line: 344, type: !280)
!504 = !DILocalVariable(name: "parsed_args", arg: 3, scope: !500, file: !2, line: 345, type: !271)
!505 = !DILocalVariable(name: "tool_arguments", arg: 4, scope: !500, file: !2, line: 345, type: !32)
!506 = !DILocalVariable(name: "err", arg: 5, scope: !500, file: !2, line: 346, type: !272)
!507 = !DILocalVariable(name: "encseq", scope: !500, file: !2, line: 348, type: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseq", file: !510, line: 48, baseType: !511)
!510 = !DIFile(filename: "src/core/encseq_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "bab4512cadee996edd2995020539d931")
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtEncseq", file: !510, line: 48, flags: DIFlagFwdDecl)
!512 = !DILocalVariable(name: "output", scope: !500, file: !2, line: 349, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtEncseqSampleOutputInfo", file: !2, line: 52, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 49, size: 128, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !514, file: !2, line: 50, baseType: !65, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !514, file: !2, line: 51, baseType: !518, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtBittab", file: !520, line: 26, baseType: !521)
!520 = !DIFile(filename: "src/core/bittab_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "f860891bf3c2458e3eaa7c6ba3953bc8")
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtBittab", file: !520, line: 26, flags: DIFlagFwdDecl)
!522 = !DILocalVariable(name: "had_err", scope: !500, file: !2, line: 350, type: !271)
!523 = !DILocation(line: 344, column: 50, scope: !500)
!524 = !DILocation(line: 344, column: 69, scope: !500)
!525 = !DILocation(line: 345, column: 40, scope: !500)
!526 = !DILocation(line: 345, column: 59, scope: !500)
!527 = !DILocation(line: 346, column: 55, scope: !500)
!528 = !DILocation(line: 348, column: 3, scope: !500)
!529 = !DILocation(line: 348, column: 13, scope: !500)
!530 = !DILocation(line: 349, column: 3, scope: !500)
!531 = !DILocation(line: 349, column: 28, scope: !500)
!532 = !DILocation(line: 350, column: 3, scope: !500)
!533 = !DILocation(line: 350, column: 7, scope: !500)
!534 = !DILocation(line: 351, column: 3, scope: !500)
!535 = !DILocation(line: 351, column: 3, scope: !536)
!536 = distinct !DILexicalBlock(scope: !537, file: !2, line: 351, column: 3)
!537 = distinct !DILexicalBlock(scope: !500, file: !2, line: 351, column: 3)
!538 = !DILocation(line: 351, column: 3, scope: !537)
!539 = !DILocation(line: 351, column: 3, scope: !540)
!540 = distinct !DILexicalBlock(scope: !536, file: !2, line: 351, column: 3)
!541 = !DILocation(line: 352, column: 40, scope: !500)
!542 = !DILocation(line: 352, column: 45, scope: !500)
!543 = !DILocation(line: 352, column: 59, scope: !500)
!544 = !DILocation(line: 352, column: 75, scope: !500)
!545 = !DILocation(line: 352, column: 12, scope: !500)
!546 = !DILocation(line: 352, column: 10, scope: !500)
!547 = !DILocation(line: 353, column: 7, scope: !548)
!548 = distinct !DILexicalBlock(scope: !500, file: !2, line: 353, column: 7)
!549 = !DILocation(line: 353, column: 14, scope: !548)
!550 = !DILocation(line: 353, column: 7, scope: !500)
!551 = !DILocation(line: 354, column: 49, scope: !548)
!552 = !DILocation(line: 354, column: 57, scope: !548)
!553 = !DILocation(line: 354, column: 73, scope: !548)
!554 = !DILocation(line: 354, column: 15, scope: !548)
!555 = !DILocation(line: 354, column: 13, scope: !548)
!556 = !DILocation(line: 354, column: 5, scope: !548)
!557 = !DILocation(line: 357, column: 13, scope: !548)
!558 = !DILocation(line: 358, column: 8, scope: !559)
!559 = distinct !DILexicalBlock(scope: !500, file: !2, line: 358, column: 7)
!560 = !DILocation(line: 358, column: 7, scope: !500)
!561 = !DILocation(line: 359, column: 39, scope: !559)
!562 = !DILocation(line: 359, column: 47, scope: !559)
!563 = !DILocation(line: 359, column: 15, scope: !559)
!564 = !DILocation(line: 359, column: 13, scope: !559)
!565 = !DILocation(line: 359, column: 5, scope: !559)
!566 = !DILocation(line: 360, column: 20, scope: !500)
!567 = !DILocation(line: 360, column: 3, scope: !500)
!568 = !DILocation(line: 361, column: 10, scope: !500)
!569 = !DILocation(line: 362, column: 1, scope: !500)
!570 = !DILocation(line: 361, column: 3, scope: !500)
!571 = !DISubprogram(name: "gt_calloc_mem", scope: !572, file: !572, line: 62, type: !573, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!572 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!573 = !DISubroutineType(types: !574)
!574 = !{!32, !44, !44, !236, !271}
!575 = !DISubprogram(name: "gt_str_new", scope: !56, file: !56, line: 30, type: !576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!576 = !DISubroutineType(types: !577)
!577 = !{!54}
!578 = !DISubprogram(name: "gt_str_delete", scope: !56, file: !56, line: 90, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !54}
!581 = !DISubprogram(name: "gt_encseq_options_delete", scope: !71, file: !71, line: 50, type: !582, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !69}
!584 = !DISubprogram(name: "gt_free_mem", scope: !572, file: !572, line: 75, type: !585, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !32, !236, !271}
!587 = !DISubprogram(name: "fprintf", scope: !588, file: !588, line: 350, type: !589, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!588 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!589 = !DISubroutineType(types: !590)
!590 = !{!271, !591, !649, null}
!591 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !594, line: 7, baseType: !595)
!594 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !596, line: 49, size: 1728, elements: !597)
!596 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!597 = !{!598, !599, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !614, !616, !617, !618, !622, !624, !626, !630, !633, !635, !638, !641, !642, !643, !644, !645}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !595, file: !596, line: 51, baseType: !271, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !595, file: !596, line: 54, baseType: !600, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !595, file: !596, line: 55, baseType: !600, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !595, file: !596, line: 56, baseType: !600, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !595, file: !596, line: 57, baseType: !600, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !595, file: !596, line: 58, baseType: !600, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !595, file: !596, line: 59, baseType: !600, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !595, file: !596, line: 60, baseType: !600, size: 64, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !595, file: !596, line: 61, baseType: !600, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !595, file: !596, line: 64, baseType: !600, size: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !595, file: !596, line: 65, baseType: !600, size: 64, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !595, file: !596, line: 66, baseType: !600, size: 64, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !595, file: !596, line: 68, baseType: !612, size: 64, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !596, line: 36, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !595, file: !596, line: 70, baseType: !615, size: 64, offset: 832)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !595, file: !596, line: 72, baseType: !271, size: 32, offset: 896)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !595, file: !596, line: 73, baseType: !271, size: 32, offset: 928)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !595, file: !596, line: 74, baseType: !619, size: 64, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !620, line: 152, baseType: !621)
!620 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!621 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !595, file: !596, line: 77, baseType: !623, size: 16, offset: 1024)
!623 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !595, file: !596, line: 78, baseType: !625, size: 8, offset: 1040)
!625 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !595, file: !596, line: 79, baseType: !627, size: 8, offset: 1048)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 1)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !595, file: !596, line: 81, baseType: !631, size: 64, offset: 1088)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !596, line: 43, baseType: null)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !595, file: !596, line: 89, baseType: !634, size: 64, offset: 1152)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !620, line: 153, baseType: !621)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !595, file: !596, line: 91, baseType: !636, size: 64, offset: 1216)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !596, line: 37, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !595, file: !596, line: 92, baseType: !639, size: 64, offset: 1280)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !596, line: 38, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !595, file: !596, line: 93, baseType: !615, size: 64, offset: 1344)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !595, file: !596, line: 94, baseType: !32, size: 64, offset: 1408)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !595, file: !596, line: 95, baseType: !44, size: 64, offset: 1472)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !595, file: !596, line: 96, baseType: !271, size: 32, offset: 1536)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !595, file: !596, line: 98, baseType: !646, size: 160, offset: 1568)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 20)
!649 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !236)
!650 = !DISubprogram(name: "abort", scope: !651, file: !651, line: 598, type: !652, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!651 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!652 = !DISubroutineType(types: !653)
!653 = !{null}
!654 = !DISubprogram(name: "gt_option_parser_new", scope: !30, file: !30, line: 63, type: !655, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!655 = !DISubroutineType(types: !656)
!656 = !{!28, !236, !236}
!657 = !DISubprogram(name: "gt_encseq_options_register_loading", scope: !71, file: !71, line: 47, type: !658, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!658 = !DISubroutineType(types: !659)
!659 = !{!69, !28, !54}
!660 = !DISubprogram(name: "gt_encseq_options_add_readmode_option", scope: !71, file: !71, line: 39, type: !661, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !28, !54}
!663 = !DISubprogram(name: "gt_option_new_bool", scope: !30, file: !30, line: 130, type: !664, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!664 = !DISubroutineType(types: !665)
!665 = !{!228, !236, !236, !666, !52}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!667 = !DISubprogram(name: "gt_option_is_extended_option", scope: !30, file: !30, line: 348, type: !668, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !228}
!670 = !DISubprogram(name: "gt_option_parser_add_option", scope: !30, file: !30, line: 66, type: !671, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !28, !228}
!673 = !DISubprogram(name: "gt_option_new_uword", scope: !30, file: !30, line: 227, type: !674, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!674 = !DISubroutineType(types: !675)
!675 = !{!228, !236, !236, !676, !65}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!677 = !DISubprogram(name: "gt_option_new_range", scope: !30, file: !30, line: 275, type: !678, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!678 = !DISubroutineType(types: !679)
!679 = !{!228, !236, !236, !680, !680}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!681 = !DISubprogram(name: "gt_option_new_choice", scope: !30, file: !30, line: 302, type: !682, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!682 = !DISubroutineType(types: !683)
!683 = !{!228, !236, !236, !54, !236, !280}
!684 = !DISubprogram(name: "gt_option_new_string", scope: !30, file: !30, line: 291, type: !685, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!685 = !DISubroutineType(types: !686)
!686 = !{!228, !236, !236, !54, !236}
!687 = !DISubprogram(name: "gt_option_imply", scope: !30, file: !30, line: 352, type: !688, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !228, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!692 = !DISubprogram(name: "gt_option_parser_set_min_max_args", scope: !30, file: !30, line: 109, type: !693, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !28, !37, !37}
!695 = !DISubprogram(name: "gt_error_is_set", scope: !274, file: !274, line: 64, type: !696, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!696 = !DISubroutineType(types: !697)
!697 = !{!52, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
