; ModuleID = 'samples/977.bc'
source_filename = "modules/dbgfmts/codeview/cv-symline.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.yasm_bytecode_callback = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32 }
%struct.cv_line_info = type { ptr, ptr, ptr, ptr, ptr, i32, %struct.cv8_lineinfo_head, ptr, ptr }
%struct.cv8_lineinfo_head = type { ptr, ptr }
%struct.yasm_object = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, %struct.yasm_sectionhead, ptr, ptr, ptr }
%struct.yasm_sectionhead = type { ptr, ptr }
%struct.yasm_dbgfmt_cv = type { %struct.yasm_dbgfmt_base, ptr, i64, i64, i32 }
%struct.yasm_dbgfmt_base = type { ptr }
%struct.cv_filename = type { ptr, ptr, i64, i64, [16 x i8] }
%struct.yasm_bytecode = type { %struct.anon, ptr, ptr, ptr, i64, i64, i64, i64, i64, ptr, ptr }
%struct.anon = type { ptr }
%struct.cv8_lineinfo = type { %struct.anon.0, ptr, ptr, ptr, i64, i32, %struct.cv8_lineset_head }
%struct.anon.0 = type { ptr }
%struct.cv8_lineset_head = type { ptr, ptr }
%struct.cv8_symhead = type { i32, ptr, ptr, i32 }
%struct.yasm_datavalhead = type { ptr, ptr }
%struct.cv8_fileinfo = type { ptr }
%struct.cv_sym = type { i32, ptr, [10 x %union.anon] }
%union.anon = type { i64 }
%struct.yasm_arch_base = type { ptr }
%struct.yasm_arch_module = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32 }

!128 = !DIEnumerator(name: "YASM_ARCH_SEGREG", value: 3)
!129 = !DIEnumerator(name: "YASM_ARCH_TARGETMOD", value: 4)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cv_symtype", file: !2, line: 43, baseType: !23, size: 32, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!132 = !DIEnumerator(name: "CV_S_COMPILE", value: 1)
!133 = !DIEnumerator(name: "CV_S_REGISTER", value: 2)
!134 = !DIEnumerator(name: "CV_S_CONSTANT", value: 3)
!135 = !DIEnumerator(name: "CV_S_UDT", value: 4)
!136 = !DIEnumerator(name: "CV_S_SSEARCH", value: 5)
!137 = !DIEnumerator(name: "CV_S_END", value: 6)
!138 = !DIEnumerator(name: "CV_S_SKIP", value: 7)
!139 = !DIEnumerator(name: "CV_S_OBJNAME", value: 9)
!140 = !DIEnumerator(name: "CV_S_ENDARG", value: 10)
!141 = !DIEnumerator(name: "CV_S_COBOLUDT", value: 11)
!142 = !DIEnumerator(name: "CV_S_MANYREG", value: 12)
!143 = !DIEnumerator(name: "CV_S_RETURN", value: 13)
!144 = !DIEnumerator(name: "CV_S_ENTRYTHIS", value: 14)
!145 = !DIEnumerator(name: "CV_S_BPREL16", value: 256)
!146 = !DIEnumerator(name: "CV_S_LDATA16", value: 257)
!147 = !DIEnumerator(name: "CV_S_GDATA16", value: 258)
!148 = !DIEnumerator(name: "CV_S_PUB16", value: 259)
!149 = !DIEnumerator(name: "CV_S_LPROC16", value: 260)
!150 = !DIEnumerator(name: "CV_S_GPROC16", value: 261)
!151 = !DIEnumerator(name: "CV_S_THUNK16", value: 262)
!152 = !DIEnumerator(name: "CV_S_BLOCK16", value: 263)
!153 = !DIEnumerator(name: "CV_S_WITH16", value: 264)
!154 = !DIEnumerator(name: "CV_S_LABEL16", value: 265)
!155 = !DIEnumerator(name: "CV_S_CEXMODEL16", value: 272)
!156 = !DIEnumerator(name: "CV_S_VFTPATH16", value: 267)
!157 = !DIEnumerator(name: "CV_S_REGREL16", value: 268)
!158 = !DIEnumerator(name: "CV_S_BPREL32", value: 512)
!159 = !DIEnumerator(name: "CV_S_LDATA32", value: 513)
!160 = !DIEnumerator(name: "CV_S_GDATA32", value: 514)
!161 = !DIEnumerator(name: "CV_S_PUB32", value: 515)
!162 = !DIEnumerator(name: "CV_S_LPROC32", value: 516)
!163 = !DIEnumerator(name: "CV_S_GPROC32", value: 517)
!164 = !DIEnumerator(name: "CV_S_THUNK32", value: 518)
!165 = !DIEnumerator(name: "CV_S_BLOCK32", value: 519)
!166 = !DIEnumerator(name: "CV_S_WITH32", value: 520)
!167 = !DIEnumerator(name: "CV_S_LABEL32", value: 521)
!168 = !DIEnumerator(name: "CV_S_CEXMODEL32", value: 528)
!169 = !DIEnumerator(name: "CV_S_VFTPATH32", value: 523)
!170 = !DIEnumerator(name: "CV_S_REGREL32", value: 524)
!171 = !DIEnumerator(name: "CV_S_LTHREAD32", value: 525)
!172 = !DIEnumerator(name: "CV_S_GTHREAD32", value: 526)
!173 = !DIEnumerator(name: "CV_S_LPROCMIPS", value: 768)
!174 = !DIEnumerator(name: "CV_S_GPROCMIPS", value: 769)
!175 = !DIEnumerator(name: "CV8_S_OBJNAME", value: 4353)
!176 = !DIEnumerator(name: "CV8_S_LABEL32", value: 4357)
!177 = !DIEnumerator(name: "CV8_S_LDATA32", value: 4364)
!178 = !DIEnumerator(name: "CV8_S_GDATA32", value: 4365)
!179 = !DIEnumerator(name: "CV8_S_LPROC32", value: 4368)
!180 = !DIEnumerator(name: "CV8_S_COMPILE", value: 4374)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yasm_sym_vis", file: !182, line: 52, baseType: !23, size: 32, elements: !183)
!182 = !DIFile(filename: "./libyasm/symrec.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "dfb116438a620dd87f0db3310d44d920")
!183 = !{!184, !185, !186, !187, !188}
!184 = !DIEnumerator(name: "YASM_SYM_LOCAL", value: 0)
!185 = !DIEnumerator(name: "YASM_SYM_GLOBAL", value: 1)
!186 = !DIEnumerator(name: "YASM_SYM_COMMON", value: 2)
!187 = !DIEnumerator(name: "YASM_SYM_EXTERN", value: 4)
!188 = !DIEnumerator(name: "YASM_SYM_DLOCAL", value: 8)
!189 = !{!190, !505, !321, !288, !429, !506, !560, !430, !565, !690, !406, !227, !206, !704, !712}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_dbgfmt_cv", file: !192, line: 47, baseType: !193)
!192 = !DIFile(filename: "modules/dbgfmts/codeview/cv-dbgfmt.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "04455f70d3eb64c8b7a7af7a168aa366")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_dbgfmt_cv", file: !192, line: 39, size: 320, elements: !194)
!194 = !{!195, !489, !502, !503, !504}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dbgfmt", scope: !193, file: !192, line: 40, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_dbgfmt_base", file: !197, line: 40, baseType: !198)
!197 = !DIFile(filename: "./libyasm/dbgfmt.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "7a63e9e5d68a274fccf929049b351cb9")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_dbgfmt_base", file: !197, line: 37, size: 64, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !198, file: !197, line: 39, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_dbgfmt_module", file: !197, line: 44, size: 384, elements: !204)
!204 = !{!205, !208, !209, !471, !475, !479}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !197, line: 46, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "keyword", scope: !203, file: !197, line: 49, baseType: !206, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "directives", scope: !203, file: !197, line: 52, baseType: !210, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_directive", file: !29, line: 205, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_directive", file: !22, line: 69, size: 256, elements: !214)
!214 = !{!215, !216, !217, !470}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !22, line: 74, baseType: !206, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !213, file: !22, line: 76, baseType: !206, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !213, file: !22, line: 84, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !221, !261, !261, !288}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_object", file: !29, line: 96, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_object", file: !224, line: 49, size: 768, elements: !225)
!224 = !DIFile(filename: "./libyasm/section.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "ba239fc7317ff7164be158d14b67c691")
!225 = !{!226, !228, !229, !233, !237, !241, !245, !249, !256, !259, !260}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "src_filename", scope: !223, file: !224, line: 50, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "obj_filename", scope: !223, file: !224, line: 51, baseType: !227, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !223, file: !224, line: 53, baseType: !230, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_symtab", file: !29, line: 102, baseType: !232)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_symtab", file: !29, line: 102, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !223, file: !224, line: 54, baseType: !234, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch", file: !29, line: 38, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_arch", file: !29, line: 38, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "objfmt", scope: !223, file: !224, line: 55, baseType: !238, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_objfmt", file: !29, line: 44, baseType: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_objfmt", file: !29, line: 44, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "dbgfmt", scope: !223, file: !224, line: 56, baseType: !242, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_dbgfmt", file: !29, line: 46, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_dbgfmt", file: !29, line: 46, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cur_section", scope: !223, file: !224, line: 61, baseType: !246, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_section", file: !29, line: 99, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_section", file: !29, line: 99, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sections", scope: !223, file: !224, line: 64, baseType: !250, size: 128, offset: 448)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_sectionhead", file: !224, line: 64, size: 128, elements: !251)
!251 = !{!252, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !250, file: !224, line: 64, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !250, file: !224, line: 64, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "directives", scope: !223, file: !224, line: 69, baseType: !257, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "HAMT", file: !224, line: 69, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "global_prefix", scope: !223, file: !224, line: 72, baseType: !227, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "global_suffix", scope: !223, file: !224, line: 75, baseType: !227, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_valparamhead", file: !29, line: 201, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_valparamhead", file: !22, line: 66, size: 128, elements: !264)
!264 = !{!265, !468}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !263, file: !22, line: 66, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_valparam", file: !22, line: 38, size: 320, elements: !268)
!268 = !{!269, !273, !274, !275, !467}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !267, file: !22, line: 39, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !267, file: !22, line: 39, size: 64, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !270, file: !22, line: 39, baseType: !266, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !267, file: !22, line: 40, baseType: !227, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !22, line: 47, baseType: !21, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !267, file: !22, line: 54, baseType: !276, size: 64, offset: 192)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yasm_param", file: !22, line: 50, size: 64, elements: !277)
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !276, file: !22, line: 51, baseType: !227, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !276, file: !22, line: 52, baseType: !227, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !276, file: !22, line: 53, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_expr", file: !29, line: 108, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_expr", file: !65, line: 70, size: 448, elements: !284)
!284 = !{!285, !287, !289, !291}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !283, file: !65, line: 71, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_expr_op", file: !29, line: 253, baseType: !28)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !283, file: !65, line: 72, baseType: !288, size: 64, offset: 64)
!288 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "numterms", scope: !283, file: !65, line: 73, baseType: !290, size: 32, offset: 128)
!290 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "terms", scope: !283, file: !65, line: 79, baseType: !292, size: 256, offset: 192)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 256, elements: !465)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_expr__item", file: !65, line: 67, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_expr__item", file: !65, line: 54, size: 128, elements: !295)
!295 = !{!296, !298}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !294, file: !65, line: 55, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_expr__type", file: !65, line: 51, baseType: !64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !65, line: 66, baseType: !299, size: 64, offset: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !294, file: !65, line: 58, size: 64, elements: !300)
!300 = !{!301, !451, !452, !453, !457, !461, !464}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "precbc", scope: !299, file: !65, line: 59, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_bytecode", file: !29, line: 93, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_bytecode", file: !76, line: 183, size: 704, elements: !305)
!305 = !{!306, !311, !441, !442, !443, !444, !445, !446, !447, !448, !450}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !304, file: !76, line: 187, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !304, file: !76, line: 187, size: 64, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !307, file: !76, line: 187, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !304, file: !76, line: 192, baseType: !312, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_bytecode_callback", file: !76, line: 180, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_bytecode_callback", file: !76, line: 63, size: 512, elements: !316)
!316 = !{!317, !322, !383, !387, !391, !419, !424, !440}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !315, file: !76, line: 68, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !315, file: !76, line: 76, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !326, !328, !290}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !330, line: 7, baseType: !331)
!330 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !332, line: 49, size: 1728, elements: !333)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !349, !351, !352, !353, !357, !359, !361, !362, !365, !367, !370, !373, !374, !375, !378, !379}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !331, file: !332, line: 51, baseType: !290, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !331, file: !332, line: 54, baseType: !227, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !331, file: !332, line: 55, baseType: !227, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !331, file: !332, line: 56, baseType: !227, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !331, file: !332, line: 57, baseType: !227, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !331, file: !332, line: 58, baseType: !227, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !331, file: !332, line: 59, baseType: !227, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !331, file: !332, line: 60, baseType: !227, size: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !331, file: !332, line: 61, baseType: !227, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !331, file: !332, line: 64, baseType: !227, size: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !331, file: !332, line: 65, baseType: !227, size: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !331, file: !332, line: 66, baseType: !227, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !331, file: !332, line: 68, baseType: !347, size: 64, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !332, line: 36, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !331, file: !332, line: 70, baseType: !350, size: 64, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !331, file: !332, line: 72, baseType: !290, size: 32, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !331, file: !332, line: 73, baseType: !290, size: 32, offset: 928)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !331, file: !332, line: 74, baseType: !354, size: 64, offset: 960)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !355, line: 152, baseType: !356)
!355 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!356 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !331, file: !332, line: 77, baseType: !358, size: 16, offset: 1024)
!358 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !331, file: !332, line: 78, baseType: !360, size: 8, offset: 1040)
!360 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !331, file: !332, line: 79, baseType: !9, size: 8, offset: 1048)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !331, file: !332, line: 81, baseType: !363, size: 64, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !332, line: 43, baseType: null)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !331, file: !332, line: 89, baseType: !366, size: 64, offset: 1152)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !355, line: 153, baseType: !356)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !331, file: !332, line: 91, baseType: !368, size: 64, offset: 1216)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !332, line: 37, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !331, file: !332, line: 92, baseType: !371, size: 64, offset: 1280)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !332, line: 38, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !331, file: !332, line: 93, baseType: !350, size: 64, offset: 1344)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !331, file: !332, line: 94, baseType: !321, size: 64, offset: 1408)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !331, file: !332, line: 95, baseType: !376, size: 64, offset: 1472)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !377, line: 70, baseType: !288)
!377 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !331, file: !332, line: 96, baseType: !290, size: 32, offset: 1536)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !331, file: !332, line: 98, baseType: !380, size: 160, offset: 1568)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 20)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !315, file: !76, line: 83, baseType: !384, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !302, !302}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !315, file: !76, line: 91, baseType: !388, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!290, !302}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "calc_len", scope: !315, file: !76, line: 108, baseType: !392, size: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!290, !302, !395, !321}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_bc_add_span_func", file: !76, line: 55, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !321, !302, !290, !399, !356, !356}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_value", file: !29, line: 184, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_value", file: !29, line: 121, size: 256, elements: !403)
!403 = !{!404, !405, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !402, file: !29, line: 126, baseType: !281, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !402, file: !29, line: 131, baseType: !406, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_symrec", file: !29, line: 105, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_symrec", file: !29, line: 105, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "wrt", scope: !402, file: !29, line: 134, baseType: !406, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "seg_of", scope: !402, file: !29, line: 139, baseType: !23, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rshift", scope: !402, file: !29, line: 145, baseType: !23, size: 7, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "curpos_rel", scope: !402, file: !29, line: 152, baseType: !23, size: 1, offset: 200, flags: DIFlagBitField, extraData: i64 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ip_rel", scope: !402, file: !29, line: 158, baseType: !23, size: 1, offset: 201, flags: DIFlagBitField, extraData: i64 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "jump_target", scope: !402, file: !29, line: 164, baseType: !23, size: 1, offset: 202, flags: DIFlagBitField, extraData: i64 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "section_rel", scope: !402, file: !29, line: 172, baseType: !23, size: 1, offset: 203, flags: DIFlagBitField, extraData: i64 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "no_warn", scope: !402, file: !29, line: 175, baseType: !23, size: 1, offset: 204, flags: DIFlagBitField, extraData: i64 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !402, file: !29, line: 180, baseType: !23, size: 1, offset: 205, flags: DIFlagBitField, extraData: i64 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !402, file: !29, line: 183, baseType: !23, size: 8, offset: 206, flags: DIFlagBitField, extraData: i64 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "expand", scope: !315, file: !76, line: 132, baseType: !420, size: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!290, !302, !290, !356, !356, !423, !423}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tobytes", scope: !315, file: !76, line: 159, baseType: !425, size: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!290, !302, !428, !429, !321, !431, !436}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_output_value_func", file: !29, line: 273, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!290, !435, !429, !23, !288, !302, !290, !321}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_output_reloc_func", file: !29, line: 294, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!290, !406, !302, !429, !23, !23, !290, !321}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "special", scope: !315, file: !76, line: 179, baseType: !75, size: 32, offset: 448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !304, file: !76, line: 197, baseType: !246, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "multiple", scope: !304, file: !76, line: 202, baseType: !281, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !304, file: !76, line: 205, baseType: !288, size: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mult_int", scope: !304, file: !76, line: 208, baseType: !356, size: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !304, file: !76, line: 211, baseType: !288, size: 64, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !304, file: !76, line: 216, baseType: !288, size: 64, offset: 448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "bc_index", scope: !304, file: !76, line: 219, baseType: !288, size: 64, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "symrecs", scope: !304, file: !76, line: 224, baseType: !449, size: 64, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !304, file: !76, line: 227, baseType: !321, size: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !299, file: !65, line: 60, baseType: !406, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "expn", scope: !299, file: !65, line: 61, baseType: !281, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "intn", scope: !299, file: !65, line: 62, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_intnum", file: !29, line: 110, baseType: !456)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_intnum", file: !29, line: 110, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flt", scope: !299, file: !65, line: 63, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_floatnum", file: !29, line: 114, baseType: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_floatnum", file: !29, line: 114, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !299, file: !65, line: 64, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !463, line: 90, baseType: !288)
!463 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "subst", scope: !299, file: !65, line: 65, baseType: !23, size: 32)
!465 = !{!466}
!466 = !DISubrange(count: 2)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "id_prefix", scope: !267, file: !22, line: 62, baseType: !4, size: 8, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !263, file: !22, line: 66, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !213, file: !22, line: 92, baseType: !82, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !203, file: !197, line: 60, baseType: !472, size: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!242, !221}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !203, file: !197, line: 65, baseType: !476, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !242}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "generate", scope: !203, file: !197, line: 70, baseType: !480, size: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !221, !483, !486}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_linemap", file: !29, line: 192, baseType: !485)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_linemap", file: !29, line: 192, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_errwarns", file: !29, line: 90, baseType: !488)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_errwarns", file: !29, line: 90, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "filenames", scope: !193, file: !192, line: 42, baseType: !490, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv_filename", file: !192, line: 36, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 30, size: 384, elements: !493)
!493 = !{!494, !495, !496, !497, !498}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !492, file: !192, line: 31, baseType: !227, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !492, file: !192, line: 32, baseType: !227, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "str_off", scope: !492, file: !192, line: 33, baseType: !288, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "info_off", scope: !492, file: !192, line: 34, baseType: !288, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !492, file: !192, line: 35, baseType: !499, size: 128, offset: 256)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 128, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 16)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "filenames_size", scope: !193, file: !192, line: 43, baseType: !376, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "filenames_allocated", scope: !193, file: !192, line: 44, baseType: !376, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !193, file: !192, line: 46, baseType: !290, size: 32, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv_line_info", file: !2, line: 427, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv_line_info", file: !2, line: 417, size: 640, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !559, !562}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "debug_symline", scope: !508, file: !2, line: 418, baseType: !246, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !508, file: !2, line: 419, baseType: !221, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dbgfmt_cv", scope: !508, file: !2, line: 420, baseType: !190, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "linemap", scope: !508, file: !2, line: 421, baseType: !483, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "errwarns", scope: !508, file: !2, line: 422, baseType: !486, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "num_lineinfos", scope: !508, file: !2, line: 423, baseType: !23, size: 32, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "cv8_lineinfos", scope: !508, file: !2, line: 424, baseType: !517, size: 128, offset: 384)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv8_lineinfo_head", file: !2, line: 424, size: 128, elements: !518)
!518 = !{!519, !557}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !517, file: !2, line: 424, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv8_lineinfo", file: !2, line: 132, size: 512, elements: !522)
!522 = !{!523, !527, !530, !531, !532, !533, !534}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !521, file: !2, line: 133, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !521, file: !2, line: 133, size: 64, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !524, file: !2, line: 133, baseType: !520, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !521, file: !2, line: 134, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !521, file: !2, line: 135, baseType: !246, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "sectsym", scope: !521, file: !2, line: 136, baseType: !406, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "num_linenums", scope: !521, file: !2, line: 137, baseType: !288, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "first_in_sect", scope: !521, file: !2, line: 138, baseType: !290, size: 32, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "linesets", scope: !521, file: !2, line: 139, baseType: !535, size: 128, offset: 384)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv8_lineset_head", file: !2, line: 139, size: 128, elements: !536)
!536 = !{!537, !555}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !535, file: !2, line: 139, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv8_lineset", file: !2, line: 124, size: 16256, elements: !540)
!540 = !{!541, !545, !554}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !539, file: !2, line: 125, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !539, file: !2, line: 125, size: 64, elements: !543)
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !542, file: !2, line: 125, baseType: !538, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pairs", scope: !539, file: !2, line: 126, baseType: !546, size: 16128, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 16128, elements: !552)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv8_linepair", file: !2, line: 121, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv8_linepair", file: !2, line: 118, size: 128, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !548, file: !2, line: 119, baseType: !288, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !548, file: !2, line: 120, baseType: !288, size: 64, offset: 64)
!552 = !{!553}
!553 = !DISubrange(count: 126)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "num_pairs", scope: !539, file: !2, line: 127, baseType: !376, size: 64, offset: 16192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !535, file: !2, line: 139, baseType: !556, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !517, file: !2, line: 424, baseType: !558, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cv8_cur_li", scope: !508, file: !2, line: 425, baseType: !560, size: 64, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv8_lineinfo", file: !2, line: 140, baseType: !521)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cv8_cur_ls", scope: !508, file: !2, line: 426, baseType: !563, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv8_lineset", file: !2, line: 128, baseType: !539)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch_base", file: !113, line: 65, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_arch_base", file: !113, line: 62, size: 64, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !567, file: !113, line: 64, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_arch_module", file: !113, line: 88, size: 1536, elements: !573)
!573 = !{!574, !575, !576, !577, !583, !587, !593, !597, !601, !608, !613, !620, !626, !634, !638, !642, !646, !647, !665, !669, !675, !679, !687, !688, !689}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !572, file: !113, line: 92, baseType: !206, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "keyword", scope: !572, file: !113, line: 97, baseType: !206, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "directives", scope: !572, file: !113, line: 100, baseType: !210, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !572, file: !113, line: 106, baseType: !578, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!234, !206, !206, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch_create_error", file: !113, line: 38, baseType: !112)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !572, file: !113, line: 112, baseType: !584, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !234}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "get_machine", scope: !572, file: !113, line: 117, baseType: !588, size: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!206, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "get_address_size", scope: !572, file: !113, line: 122, baseType: !594, size: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!23, !591}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "set_var", scope: !572, file: !113, line: 127, baseType: !598, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!290, !234, !206, !288}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "parse_check_insnprefix", scope: !572, file: !113, line: 132, baseType: !602, size: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !234, !206, !376, !288, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch_insnprefix", file: !113, line: 45, baseType: !118)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "parse_check_regtmod", scope: !572, file: !113, line: 139, baseType: !609, size: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!612, !234, !206, !376, !607}
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch_regtmod", file: !113, line: 56, baseType: !123)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "get_fill", scope: !572, file: !113, line: 146, baseType: !614, size: 64, offset: 640)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!617, !591}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "floatnum_tobytes", scope: !572, file: !113, line: 151, baseType: !621, size: 64, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!290, !234, !624, !429, !376, !376, !376, !290}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "intnum_tobytes", scope: !572, file: !113, line: 158, baseType: !627, size: 64, offset: 768)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!290, !234, !630, !429, !376, !376, !290, !632, !290}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "get_reg_size", scope: !572, file: !113, line: 166, baseType: !635, size: 64, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!23, !234, !462}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reggroup_get_reg", scope: !572, file: !113, line: 171, baseType: !639, size: 64, offset: 896)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!462, !234, !462, !288}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reg_print", scope: !572, file: !113, line: 177, baseType: !643, size: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !234, !462, !328}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "segreg_print", scope: !572, file: !113, line: 182, baseType: !643, size: 64, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ea_create", scope: !572, file: !113, line: 187, baseType: !648, size: 64, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!651, !234, !281}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_effaddr", file: !29, line: 210, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_effaddr", file: !654, line: 41, size: 384, elements: !655)
!654 = !DIFile(filename: "./libyasm/insn.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "7177eb936f3e998e7f2eb2f048a35e75")
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !653, file: !654, line: 42, baseType: !401, size: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "segreg", scope: !653, file: !654, line: 45, baseType: !462, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "need_nonzero_len", scope: !653, file: !654, line: 48, baseType: !23, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "need_disp", scope: !653, file: !654, line: 51, baseType: !23, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nosplit", scope: !653, file: !654, line: 59, baseType: !23, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !653, file: !654, line: 66, baseType: !23, size: 1, offset: 323, flags: DIFlagBitField, extraData: i64 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pc_rel", scope: !653, file: !654, line: 69, baseType: !23, size: 1, offset: 324, flags: DIFlagBitField, extraData: i64 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "not_pc_rel", scope: !653, file: !654, line: 72, baseType: !23, size: 1, offset: 325, flags: DIFlagBitField, extraData: i64 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !653, file: !654, line: 75, baseType: !23, size: 32, offset: 352)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ea_destroy", scope: !572, file: !113, line: 192, baseType: !666, size: 64, offset: 1152)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !651}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ea_print", scope: !572, file: !113, line: 197, baseType: !670, size: 64, offset: 1216)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !673, !328, !290}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "create_empty_insn", scope: !572, file: !113, line: 202, baseType: !676, size: 64, offset: 1280)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!302, !234, !288}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "machines", scope: !572, file: !113, line: 209, baseType: !680, size: 64, offset: 1344)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_arch_machine", file: !113, line: 80, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_arch_machine", file: !113, line: 74, size: 128, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !683, file: !113, line: 76, baseType: !206, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "keyword", scope: !683, file: !113, line: 79, baseType: !206, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "default_machine_keyword", scope: !572, file: !113, line: 215, baseType: !206, size: 64, offset: 1408)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "wordsize", scope: !572, file: !113, line: 221, baseType: !23, size: 32, offset: 1472)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "min_insn_len", scope: !572, file: !113, line: 227, baseType: !23, size: 32, offset: 1504)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv_sym", file: !2, line: 159, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv_sym", file: !2, line: 152, size: 768, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !692, file: !2, line: 153, baseType: !130, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !692, file: !2, line: 154, baseType: !206, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !692, file: !2, line: 158, baseType: !697, size: 640, offset: 128)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 640, elements: !702)
!698 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !692, file: !2, line: 155, size: 64, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !698, file: !2, line: 156, baseType: !288, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !698, file: !2, line: 157, baseType: !321, size: 64)
!702 = !{!703}
!703 = !DISubrange(count: 10)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv8_symhead", file: !2, line: 111, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv8_symhead", file: !2, line: 106, size: 256, elements: !707)
!707 = !{!708, !709, !710, !711}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !706, file: !2, line: 107, baseType: !87, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "start_prevbc", scope: !706, file: !2, line: 108, baseType: !302, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "end_prevbc", scope: !706, file: !2, line: 109, baseType: !302, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !706, file: !2, line: 110, baseType: !290, size: 32, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "cv8_fileinfo", file: !2, line: 115, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv8_fileinfo", file: !2, line: 113, size: 64, elements: !715)
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !714, file: !2, line: 114, baseType: !528, size: 64)
!717 = !{!0, !7, !12, !718, !721, !724, !729, !734, !739, !744, !749, !17, !754, !759, !761, !763, !768, !773, !778, !783, !788, !790, !792, !794, !796, !801, !803}
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !2, line: 635, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !500)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !2, line: 637, type: !723, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !702)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !2, line: 640, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 11)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !2, line: 376, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 3)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !2, line: 378, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 37)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !2, line: 457, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 38)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !2, line: 457, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 33)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !2, line: 468, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 6)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 860, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 47)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !731, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "cv_sym_bc_callback", scope: !19, file: !2, line: 235, type: !313, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1002, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 29)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1020, type: !770, isLocal: true, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 42)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1093, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 30)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !2, line: 279, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 7)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !2, line: 283, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 4)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !751, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !2, line: 308, type: !785, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !785, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "cv8_symhead_bc_callback", scope: !19, file: !2, line: 202, type: !313, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(scope: null, file: !2, line: 718, type: !798, isLocal: true, isDefinition: true)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 46)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "cv8_fileinfo_bc_callback", scope: !19, file: !2, line: 213, type: !313, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !2, line: 792, type: !756, isLocal: true, isDefinition: true)
!805 = !{i32 7, !"Dwarf Version", i32 5}
!806 = !{i32 2, !"Debug Info Version", i32 3}
!807 = !{i32 1, !"wchar_size", i32 4}
!808 = !{i32 8, !"PIC Level", i32 2}
!809 = !{i32 7, !"PIE Level", i32 2}
!810 = !{i32 7, !"uwtable", i32 2}
!811 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!812 = distinct !DISubprogram(name: "yasm_cv__generate_symline", scope: !2, file: !2, line: 543, type: !813, scopeLine: 545, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !815)
!813 = !DISubroutineType(types: !814)
!814 = !{!246, !221, !483, !486}
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826}
!816 = !DILocalVariable(name: "object", arg: 1, scope: !812, file: !2, line: 543, type: !221)
!817 = !DILocalVariable(name: "linemap", arg: 2, scope: !812, file: !2, line: 543, type: !483)
!818 = !DILocalVariable(name: "errwarns", arg: 3, scope: !812, file: !2, line: 544, type: !486)
!819 = !DILocalVariable(name: "dbgfmt_cv", scope: !812, file: !2, line: 546, type: !190)
!820 = !DILocalVariable(name: "info", scope: !812, file: !2, line: 547, type: !507)
!821 = !DILocalVariable(name: "new", scope: !812, file: !2, line: 548, type: !290)
!822 = !DILocalVariable(name: "i", scope: !812, file: !2, line: 549, type: !376)
!823 = !DILocalVariable(name: "head", scope: !812, file: !2, line: 550, type: !704)
!824 = !DILocalVariable(name: "li", scope: !812, file: !2, line: 551, type: !560)
!825 = !DILocalVariable(name: "bc", scope: !812, file: !2, line: 552, type: !302)
!826 = !DILocalVariable(name: "off", scope: !812, file: !2, line: 553, type: !288)
!827 = !{!828, !828, i64 0}
!828 = !{!"any pointer", !829, i64 0}
!829 = !{!"omnipotent char", !830, i64 0}
!830 = !{!"Simple C/C++ TBAA"}
!831 = !DILocation(line: 543, column: 40, scope: !812)
!832 = !DILocation(line: 543, column: 62, scope: !812)
!833 = !DILocation(line: 544, column: 42, scope: !812)
!834 = !DILocation(line: 546, column: 5, scope: !812)
!835 = !DILocation(line: 546, column: 21, scope: !812)
!836 = !DILocation(line: 546, column: 51, scope: !812)
!837 = !DILocation(line: 546, column: 59, scope: !812)
!838 = !{!839, !828, i64 40}
!839 = !{!"yasm_object", !828, i64 0, !828, i64 8, !828, i64 16, !828, i64 24, !828, i64 32, !828, i64 40, !828, i64 48, !840, i64 56, !828, i64 72, !828, i64 80, !828, i64 88}
!840 = !{!"yasm_sectionhead", !828, i64 0, !828, i64 8}
!841 = !DILocation(line: 547, column: 5, scope: !812)
!842 = !DILocation(line: 547, column: 18, scope: !812)
!843 = !DILocation(line: 548, column: 5, scope: !812)
!844 = !DILocation(line: 548, column: 9, scope: !812)
!845 = !DILocation(line: 549, column: 5, scope: !812)
!846 = !DILocation(line: 549, column: 12, scope: !812)
!847 = !DILocation(line: 550, column: 5, scope: !812)
!848 = !DILocation(line: 550, column: 18, scope: !812)
!849 = !DILocation(line: 551, column: 5, scope: !812)
!850 = !DILocation(line: 551, column: 19, scope: !812)
!851 = !DILocation(line: 552, column: 5, scope: !812)
!852 = !DILocation(line: 552, column: 20, scope: !812)
!853 = !DILocation(line: 553, column: 5, scope: !812)
!854 = !DILocation(line: 553, column: 19, scope: !812)
!855 = !DILocation(line: 556, column: 37, scope: !812)
!856 = !DILocation(line: 556, column: 46, scope: !812)
!857 = !DILocation(line: 556, column: 5, scope: !812)
!858 = !DILocation(line: 559, column: 19, scope: !812)
!859 = !DILocation(line: 559, column: 10, scope: !812)
!860 = !DILocation(line: 559, column: 17, scope: !812)
!861 = !{!862, !828, i64 8}
!862 = !{!"cv_line_info", !828, i64 0, !828, i64 8, !828, i64 16, !828, i64 24, !828, i64 32, !863, i64 40, !864, i64 48, !828, i64 64, !828, i64 72}
!863 = !{!"int", !829, i64 0}
!864 = !{!"cv8_lineinfo_head", !828, i64 0, !828, i64 8}
!865 = !DILocation(line: 560, column: 22, scope: !812)
!866 = !DILocation(line: 560, column: 10, scope: !812)
!867 = !DILocation(line: 560, column: 20, scope: !812)
!868 = !{!862, !828, i64 16}
!869 = !DILocation(line: 561, column: 20, scope: !812)
!870 = !DILocation(line: 561, column: 10, scope: !812)
!871 = !DILocation(line: 561, column: 18, scope: !812)
!872 = !{!862, !828, i64 24}
!873 = !DILocation(line: 562, column: 21, scope: !812)
!874 = !DILocation(line: 562, column: 10, scope: !812)
!875 = !DILocation(line: 562, column: 19, scope: !812)
!876 = !{!862, !828, i64 32}
!877 = !DILocation(line: 564, column: 33, scope: !812)
!878 = !DILocation(line: 564, column: 9, scope: !812)
!879 = !DILocation(line: 563, column: 10, scope: !812)
!880 = !DILocation(line: 563, column: 24, scope: !812)
!881 = !{!862, !828, i64 0}
!882 = !DILocation(line: 565, column: 10, scope: !812)
!883 = !DILocation(line: 565, column: 24, scope: !812)
!884 = !{!862, !863, i64 40}
!885 = !DILocation(line: 566, column: 5, scope: !812)
!886 = !DILocation(line: 566, column: 5, scope: !887)
!887 = distinct !DILexicalBlock(scope: !812, file: !2, line: 566, column: 5)
!888 = !{!862, !828, i64 48}
!889 = !{!862, !828, i64 56}
!890 = !DILocation(line: 567, column: 10, scope: !812)
!891 = !DILocation(line: 567, column: 21, scope: !812)
!892 = !{!862, !828, i64 64}
!893 = !DILocation(line: 568, column: 10, scope: !812)
!894 = !DILocation(line: 568, column: 21, scope: !812)
!895 = !{!862, !828, i64 72}
!896 = !DILocation(line: 571, column: 33, scope: !812)
!897 = !DILocation(line: 571, column: 12, scope: !812)
!898 = !DILocation(line: 571, column: 10, scope: !812)
!899 = !DILocation(line: 572, column: 24, scope: !812)
!900 = !DILocation(line: 572, column: 5, scope: !812)
!901 = !DILocation(line: 573, column: 9, scope: !812)
!902 = !{!903, !903, i64 0}
!903 = !{!"long", !829, i64 0}
!904 = !DILocation(line: 574, column: 11, scope: !905)
!905 = distinct !DILexicalBlock(scope: !812, file: !2, line: 574, column: 5)
!906 = !DILocation(line: 574, column: 10, scope: !905)
!907 = !DILocation(line: 574, column: 15, scope: !908)
!908 = distinct !DILexicalBlock(scope: !905, file: !2, line: 574, column: 5)
!909 = !DILocation(line: 574, column: 17, scope: !908)
!910 = !DILocation(line: 574, column: 28, scope: !908)
!911 = !{!912, !903, i64 16}
!912 = !{!"yasm_dbgfmt_cv", !913, i64 0, !828, i64 8, !903, i64 16, !903, i64 24, !863, i64 32}
!913 = !{!"yasm_dbgfmt_base", !828, i64 0}
!914 = !DILocation(line: 574, column: 16, scope: !908)
!915 = !DILocation(line: 574, column: 5, scope: !905)
!916 = !DILocation(line: 575, column: 14, scope: !917)
!917 = distinct !DILexicalBlock(scope: !918, file: !2, line: 575, column: 13)
!918 = distinct !DILexicalBlock(scope: !908, file: !2, line: 574, column: 49)
!919 = !DILocation(line: 575, column: 25, scope: !917)
!920 = !{!912, !828, i64 8}
!921 = !DILocation(line: 575, column: 35, scope: !917)
!922 = !DILocation(line: 575, column: 38, scope: !917)
!923 = !{!924, !828, i64 0}
!924 = !{!"", !828, i64 0, !828, i64 8, !903, i64 16, !903, i64 24, !829, i64 32}
!925 = !DILocation(line: 575, column: 13, scope: !918)
!926 = !DILocation(line: 577, column: 70, scope: !927)
!927 = distinct !DILexicalBlock(scope: !917, file: !2, line: 575, column: 48)
!928 = !DILocation(line: 577, column: 71, scope: !927)
!929 = !DILocation(line: 576, column: 13, scope: !927)
!930 = !DILocation(line: 578, column: 36, scope: !927)
!931 = !DILocation(line: 578, column: 13, scope: !927)
!932 = !DILocation(line: 579, column: 13, scope: !927)
!933 = !DILocation(line: 581, column: 33, scope: !918)
!934 = !DILocation(line: 582, column: 28, scope: !918)
!935 = !DILocation(line: 582, column: 39, scope: !918)
!936 = !DILocation(line: 582, column: 49, scope: !918)
!937 = !DILocation(line: 582, column: 52, scope: !918)
!938 = !DILocation(line: 581, column: 14, scope: !918)
!939 = !DILocation(line: 581, column: 12, scope: !918)
!940 = !DILocation(line: 583, column: 43, scope: !918)
!941 = !DILocation(line: 583, column: 9, scope: !918)
!942 = !DILocation(line: 583, column: 20, scope: !918)
!943 = !DILocation(line: 583, column: 30, scope: !918)
!944 = !DILocation(line: 583, column: 33, scope: !918)
!945 = !DILocation(line: 583, column: 41, scope: !918)
!946 = !{!924, !903, i64 16}
!947 = !DILocation(line: 584, column: 16, scope: !918)
!948 = !DILocation(line: 584, column: 20, scope: !918)
!949 = !{!950, !903, i64 32}
!950 = !{!"yasm_bytecode", !951, i64 0, !828, i64 8, !828, i64 16, !828, i64 24, !903, i64 32, !903, i64 40, !903, i64 48, !903, i64 56, !903, i64 64, !828, i64 72, !828, i64 80}
!951 = !{!"", !828, i64 0}
!952 = !DILocation(line: 584, column: 13, scope: !918)
!953 = !DILocation(line: 585, column: 5, scope: !918)
!954 = !DILocation(line: 574, column: 45, scope: !908)
!955 = !DILocation(line: 574, column: 5, scope: !908)
!956 = distinct !{!956, !915, !957, !958}
!957 = !DILocation(line: 585, column: 5, scope: !905)
!958 = !{!"llvm.loop.mustprogress"}
!959 = !DILocation(line: 586, column: 25, scope: !812)
!960 = !DILocation(line: 586, column: 58, scope: !812)
!961 = !DILocation(line: 586, column: 31, scope: !812)
!962 = !DILocation(line: 586, column: 5, scope: !812)
!963 = !DILocation(line: 590, column: 10, scope: !812)
!964 = !DILocation(line: 589, column: 10, scope: !812)
!965 = !DILocation(line: 589, column: 8, scope: !812)
!966 = !DILocation(line: 592, column: 22, scope: !812)
!967 = !DILocation(line: 592, column: 50, scope: !812)
!968 = !DILocation(line: 592, column: 65, scope: !812)
!969 = !DILocation(line: 592, column: 26, scope: !812)
!970 = !DILocation(line: 592, column: 5, scope: !812)
!971 = !DILocation(line: 593, column: 22, scope: !812)
!972 = !DILocation(line: 593, column: 5, scope: !812)
!973 = !DILocation(line: 596, column: 33, scope: !812)
!974 = !DILocation(line: 596, column: 12, scope: !812)
!975 = !DILocation(line: 596, column: 10, scope: !812)
!976 = !DILocation(line: 597, column: 9, scope: !812)
!977 = !DILocation(line: 598, column: 11, scope: !978)
!978 = distinct !DILexicalBlock(scope: !812, file: !2, line: 598, column: 5)
!979 = !DILocation(line: 598, column: 10, scope: !978)
!980 = !DILocation(line: 598, column: 15, scope: !981)
!981 = distinct !DILexicalBlock(scope: !978, file: !2, line: 598, column: 5)
!982 = !DILocation(line: 598, column: 17, scope: !981)
!983 = !DILocation(line: 598, column: 28, scope: !981)
!984 = !DILocation(line: 598, column: 16, scope: !981)
!985 = !DILocation(line: 598, column: 5, scope: !978)
!986 = !DILocation(line: 599, column: 14, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !2, line: 599, column: 13)
!988 = distinct !DILexicalBlock(scope: !981, file: !2, line: 598, column: 49)
!989 = !DILocation(line: 599, column: 25, scope: !987)
!990 = !DILocation(line: 599, column: 35, scope: !987)
!991 = !DILocation(line: 599, column: 38, scope: !987)
!992 = !DILocation(line: 599, column: 13, scope: !988)
!993 = !DILocation(line: 600, column: 13, scope: !987)
!994 = !DILocation(line: 601, column: 36, scope: !988)
!995 = !DILocation(line: 601, column: 52, scope: !988)
!996 = !DILocation(line: 601, column: 63, scope: !988)
!997 = !DILocation(line: 601, column: 73, scope: !988)
!998 = !DILocation(line: 601, column: 14, scope: !988)
!999 = !DILocation(line: 601, column: 12, scope: !988)
!1000 = !DILocation(line: 602, column: 44, scope: !988)
!1001 = !DILocation(line: 602, column: 9, scope: !988)
!1002 = !DILocation(line: 602, column: 20, scope: !988)
!1003 = !DILocation(line: 602, column: 30, scope: !988)
!1004 = !DILocation(line: 602, column: 33, scope: !988)
!1005 = !DILocation(line: 602, column: 42, scope: !988)
!1006 = !{!924, !903, i64 24}
!1007 = !DILocation(line: 603, column: 16, scope: !988)
!1008 = !DILocation(line: 603, column: 20, scope: !988)
!1009 = !DILocation(line: 603, column: 13, scope: !988)
!1010 = !DILocation(line: 604, column: 5, scope: !988)
!1011 = !DILocation(line: 598, column: 45, scope: !981)
!1012 = !DILocation(line: 598, column: 5, scope: !981)
!1013 = distinct !{!1013, !985, !1014, !958}
!1014 = !DILocation(line: 604, column: 5, scope: !978)
!1015 = !DILocation(line: 605, column: 25, scope: !812)
!1016 = !DILocation(line: 605, column: 58, scope: !812)
!1017 = !DILocation(line: 605, column: 31, scope: !812)
!1018 = !DILocation(line: 605, column: 5, scope: !812)
!1019 = !DILocation(line: 610, column: 35, scope: !812)
!1020 = !DILocation(line: 610, column: 5, scope: !812)
!1021 = !DILocation(line: 614, column: 10, scope: !812)
!1022 = !DILocation(line: 615, column: 5, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !812, file: !2, line: 615, column: 5)
!1024 = !DILocation(line: 615, column: 5, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1023, file: !2, line: 615, column: 5)
!1026 = !DILocation(line: 616, column: 13, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !2, line: 616, column: 13)
!1028 = distinct !DILexicalBlock(scope: !1025, file: !2, line: 615, column: 51)
!1029 = !DILocation(line: 616, column: 17, scope: !1027)
!1030 = !{!1031, !863, i64 40}
!1031 = !{!"cv8_lineinfo", !951, i64 0, !828, i64 8, !828, i64 16, !828, i64 24, !903, i64 32, !863, i64 40, !1032, i64 48}
!1032 = !{!"cv8_lineset_head", !828, i64 0, !828, i64 8}
!1033 = !DILocation(line: 616, column: 13, scope: !1028)
!1034 = !DILocation(line: 617, column: 17, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !2, line: 617, column: 17)
!1036 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 616, column: 32)
!1037 = !DILocation(line: 617, column: 17, scope: !1036)
!1038 = !DILocation(line: 618, column: 37, scope: !1035)
!1039 = !DILocation(line: 618, column: 70, scope: !1035)
!1040 = !DILocation(line: 618, column: 43, scope: !1035)
!1041 = !DILocation(line: 618, column: 17, scope: !1035)
!1042 = !DILocation(line: 619, column: 41, scope: !1036)
!1043 = !DILocation(line: 619, column: 20, scope: !1036)
!1044 = !DILocation(line: 619, column: 18, scope: !1036)
!1045 = !DILocation(line: 620, column: 9, scope: !1036)
!1046 = !DILocation(line: 621, column: 63, scope: !1028)
!1047 = !DILocation(line: 621, column: 14, scope: !1028)
!1048 = !DILocation(line: 621, column: 12, scope: !1028)
!1049 = !DILocation(line: 622, column: 20, scope: !1028)
!1050 = !DILocation(line: 622, column: 24, scope: !1028)
!1051 = !DILocation(line: 622, column: 19, scope: !1028)
!1052 = !DILocation(line: 622, column: 51, scope: !1028)
!1053 = !DILocation(line: 622, column: 55, scope: !1028)
!1054 = !{!1031, !903, i64 32}
!1055 = !DILocation(line: 622, column: 67, scope: !1028)
!1056 = !DILocation(line: 622, column: 49, scope: !1028)
!1057 = !DILocation(line: 622, column: 9, scope: !1028)
!1058 = !DILocation(line: 622, column: 13, scope: !1028)
!1059 = !DILocation(line: 622, column: 17, scope: !1028)
!1060 = !DILocation(line: 623, column: 33, scope: !1028)
!1061 = !DILocation(line: 623, column: 48, scope: !1028)
!1062 = !DILocation(line: 623, column: 9, scope: !1028)
!1063 = !DILocation(line: 624, column: 5, scope: !1028)
!1064 = !{!1031, !828, i64 0}
!1065 = distinct !{!1065, !1022, !1066, !958}
!1066 = !DILocation(line: 624, column: 5, scope: !1023)
!1067 = !DILocation(line: 625, column: 9, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !812, file: !2, line: 625, column: 9)
!1069 = !DILocation(line: 625, column: 9, scope: !812)
!1070 = !DILocation(line: 626, column: 29, scope: !1068)
!1071 = !DILocation(line: 626, column: 62, scope: !1068)
!1072 = !DILocation(line: 626, column: 35, scope: !1068)
!1073 = !DILocation(line: 626, column: 9, scope: !1068)
!1074 = !DILocation(line: 631, column: 33, scope: !812)
!1075 = !DILocation(line: 631, column: 12, scope: !812)
!1076 = !DILocation(line: 631, column: 10, scope: !812)
!1077 = !DILocation(line: 633, column: 30, scope: !812)
!1078 = !DILocation(line: 634, column: 39, scope: !812)
!1079 = !DILocation(line: 634, column: 47, scope: !812)
!1080 = !{!839, !828, i64 8}
!1081 = !DILocation(line: 634, column: 25, scope: !812)
!1082 = !DILocation(line: 633, column: 5, scope: !812)
!1083 = !DILocation(line: 635, column: 9, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !812, file: !2, line: 635, column: 9)
!1085 = !DILocation(line: 635, column: 9, scope: !812)
!1086 = !DILocation(line: 636, column: 29, scope: !1084)
!1087 = !DILocation(line: 636, column: 42, scope: !1084)
!1088 = !DILocation(line: 637, column: 29, scope: !1084)
!1089 = !DILocation(line: 636, column: 9, scope: !1084)
!1090 = !DILocation(line: 639, column: 29, scope: !1084)
!1091 = !DILocation(line: 639, column: 42, scope: !1084)
!1092 = !DILocation(line: 640, column: 29, scope: !1084)
!1093 = !DILocation(line: 639, column: 9, scope: !1084)
!1094 = !DILocation(line: 642, column: 26, scope: !812)
!1095 = !DILocation(line: 642, column: 34, scope: !812)
!1096 = !{!839, !828, i64 16}
!1097 = !DILocation(line: 642, column: 5, scope: !812)
!1098 = !DILocation(line: 643, column: 25, scope: !812)
!1099 = !DILocation(line: 643, column: 58, scope: !812)
!1100 = !DILocation(line: 643, column: 31, scope: !812)
!1101 = !DILocation(line: 643, column: 5, scope: !812)
!1102 = !DILocation(line: 647, column: 10, scope: !812)
!1103 = !DILocation(line: 646, column: 10, scope: !812)
!1104 = !DILocation(line: 646, column: 8, scope: !812)
!1105 = !DILocation(line: 649, column: 22, scope: !812)
!1106 = !DILocation(line: 649, column: 50, scope: !812)
!1107 = !DILocation(line: 649, column: 65, scope: !812)
!1108 = !DILocation(line: 649, column: 26, scope: !812)
!1109 = !DILocation(line: 649, column: 5, scope: !812)
!1110 = !DILocation(line: 650, column: 22, scope: !812)
!1111 = !DILocation(line: 650, column: 5, scope: !812)
!1112 = !DILocation(line: 652, column: 17, scope: !812)
!1113 = !DILocation(line: 653, column: 1, scope: !812)
!1114 = !DILocation(line: 652, column: 5, scope: !812)
!1115 = !DISubprogram(name: "yasm_linemap_traverse_filenames", scope: !1116, file: !1116, line: 137, type: !1117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1116 = !DIFile(filename: "./libyasm/linemap.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "581487d92d5c987fb0442b799c055e60")
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!290, !483, !321, !1119}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!290, !206, !321}
!1122 = distinct !DISubprogram(name: "cv_generate_filename", scope: !2, file: !2, line: 513, type: !1120, scopeLine: 514, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !1123)
!1123 = !{!1124, !1125}
!1124 = !DILocalVariable(name: "filename", arg: 1, scope: !1122, file: !2, line: 513, type: !206)
!1125 = !DILocalVariable(name: "d", arg: 2, scope: !1122, file: !2, line: 513, type: !321)
!1126 = !DILocation(line: 513, column: 34, scope: !1122)
!1127 = !DILocation(line: 513, column: 50, scope: !1122)
!1128 = !DILocation(line: 515, column: 42, scope: !1122)
!1129 = !DILocation(line: 515, column: 48, scope: !1122)
!1130 = !DILocation(line: 515, column: 5, scope: !1122)
!1131 = !DILocation(line: 516, column: 5, scope: !1122)
!1132 = !DISubprogram(name: "yasm_object_get_general", scope: !224, file: !224, line: 110, type: !1133, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!246, !221, !206, !288, !290, !290, !1135, !288}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!1136 = distinct !DISubprogram(name: "cv8_add_symhead", scope: !2, file: !2, line: 675, type: !1137, scopeLine: 676, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !1139)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!704, !246, !288, !290}
!1139 = !{!1140, !1141, !1142, !1143, !1144}
!1140 = !DILocalVariable(name: "sect", arg: 1, scope: !1136, file: !2, line: 675, type: !246)
!1141 = !DILocalVariable(name: "type", arg: 2, scope: !1136, file: !2, line: 675, type: !288)
!1142 = !DILocalVariable(name: "first", arg: 3, scope: !1136, file: !2, line: 675, type: !290)
!1143 = !DILocalVariable(name: "head", scope: !1136, file: !2, line: 677, type: !704)
!1144 = !DILocalVariable(name: "bc", scope: !1136, file: !2, line: 678, type: !302)
!1145 = !DILocation(line: 675, column: 31, scope: !1136)
!1146 = !DILocation(line: 675, column: 51, scope: !1136)
!1147 = !{!863, !863, i64 0}
!1148 = !DILocation(line: 675, column: 61, scope: !1136)
!1149 = !DILocation(line: 677, column: 5, scope: !1136)
!1150 = !DILocation(line: 677, column: 18, scope: !1136)
!1151 = !DILocation(line: 678, column: 5, scope: !1136)
!1152 = !DILocation(line: 678, column: 20, scope: !1136)
!1153 = !DILocation(line: 680, column: 12, scope: !1136)
!1154 = !DILocation(line: 680, column: 10, scope: !1136)
!1155 = !DILocation(line: 681, column: 18, scope: !1136)
!1156 = !DILocation(line: 681, column: 5, scope: !1136)
!1157 = !DILocation(line: 681, column: 11, scope: !1136)
!1158 = !DILocation(line: 681, column: 16, scope: !1136)
!1159 = !{!1160, !829, i64 0}
!1160 = !{!"cv8_symhead", !829, i64 0, !828, i64 8, !828, i64 16, !863, i64 24}
!1161 = !DILocation(line: 682, column: 19, scope: !1136)
!1162 = !DILocation(line: 682, column: 5, scope: !1136)
!1163 = !DILocation(line: 682, column: 11, scope: !1136)
!1164 = !DILocation(line: 682, column: 17, scope: !1136)
!1165 = !{!1160, !863, i64 24}
!1166 = !DILocation(line: 683, column: 48, scope: !1136)
!1167 = !DILocation(line: 683, column: 26, scope: !1136)
!1168 = !DILocation(line: 683, column: 5, scope: !1136)
!1169 = !DILocation(line: 683, column: 11, scope: !1136)
!1170 = !DILocation(line: 683, column: 24, scope: !1136)
!1171 = !{!1160, !828, i64 8}
!1172 = !DILocation(line: 685, column: 58, scope: !1136)
!1173 = !DILocation(line: 685, column: 10, scope: !1136)
!1174 = !DILocation(line: 685, column: 8, scope: !1136)
!1175 = !DILocation(line: 686, column: 9, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 686, column: 9)
!1177 = !DILocation(line: 686, column: 9, scope: !1136)
!1178 = !DILocation(line: 687, column: 9, scope: !1176)
!1179 = !DILocation(line: 687, column: 13, scope: !1176)
!1180 = !DILocation(line: 687, column: 17, scope: !1176)
!1181 = !DILocation(line: 689, column: 9, scope: !1176)
!1182 = !DILocation(line: 689, column: 13, scope: !1176)
!1183 = !DILocation(line: 689, column: 17, scope: !1176)
!1184 = !DILocation(line: 691, column: 24, scope: !1136)
!1185 = !DILocation(line: 691, column: 5, scope: !1136)
!1186 = !DILocation(line: 691, column: 11, scope: !1136)
!1187 = !DILocation(line: 691, column: 22, scope: !1136)
!1188 = !{!1160, !828, i64 16}
!1189 = !DILocation(line: 692, column: 24, scope: !1136)
!1190 = !DILocation(line: 692, column: 30, scope: !1136)
!1191 = !DILocation(line: 692, column: 5, scope: !1136)
!1192 = !DILocation(line: 693, column: 12, scope: !1136)
!1193 = !DILocation(line: 694, column: 1, scope: !1136)
!1194 = !DILocation(line: 693, column: 5, scope: !1136)
!1195 = distinct !DISubprogram(name: "cv_append_str", scope: !2, file: !2, line: 403, type: !1196, scopeLine: 404, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !1198)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!302, !246, !206}
!1198 = !{!1199, !1200, !1201, !1210}
!1199 = !DILocalVariable(name: "sect", arg: 1, scope: !1195, file: !2, line: 403, type: !246)
!1200 = !DILocalVariable(name: "str", arg: 2, scope: !1195, file: !2, line: 403, type: !206)
!1201 = !DILocalVariable(name: "dvs", scope: !1195, file: !2, line: 405, type: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_datavalhead", file: !76, line: 40, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_datavalhead", file: !76, line: 43, size: 128, elements: !1204)
!1204 = !{!1205, !1208}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !1203, file: !76, line: 43, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "yasm_dataval", file: !76, line: 38, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !1203, file: !76, line: 43, baseType: !1209, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1210 = !DILocalVariable(name: "bc", scope: !1195, file: !2, line: 406, type: !302)
!1211 = !DILocation(line: 403, column: 29, scope: !1195)
!1212 = !DILocation(line: 403, column: 47, scope: !1195)
!1213 = !DILocation(line: 405, column: 5, scope: !1195)
!1214 = !DILocation(line: 405, column: 22, scope: !1195)
!1215 = !DILocation(line: 406, column: 5, scope: !1195)
!1216 = !DILocation(line: 406, column: 20, scope: !1195)
!1217 = !DILocation(line: 408, column: 5, scope: !1195)
!1218 = !DILocation(line: 408, column: 5, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1195, file: !2, line: 408, column: 5)
!1220 = !{!1221, !828, i64 0}
!1221 = !{!"yasm_datavalhead", !828, i64 0, !828, i64 8}
!1222 = !{!1221, !828, i64 8}
!1223 = !DILocation(line: 409, column: 27, scope: !1195)
!1224 = !DILocation(line: 409, column: 5, scope: !1195)
!1225 = !DILocation(line: 411, column: 10, scope: !1195)
!1226 = !DILocation(line: 411, column: 8, scope: !1195)
!1227 = !DILocation(line: 412, column: 22, scope: !1195)
!1228 = !DILocation(line: 412, column: 45, scope: !1195)
!1229 = !DILocation(line: 412, column: 51, scope: !1195)
!1230 = !DILocation(line: 412, column: 26, scope: !1195)
!1231 = !DILocation(line: 412, column: 5, scope: !1195)
!1232 = !DILocation(line: 413, column: 22, scope: !1195)
!1233 = !DILocation(line: 413, column: 5, scope: !1195)
!1234 = !DILocation(line: 414, column: 12, scope: !1195)
!1235 = !DILocation(line: 415, column: 1, scope: !1195)
!1236 = !DILocation(line: 414, column: 5, scope: !1195)
!1237 = !DISubprogram(name: "yasm_error_set", scope: !94, file: !94, line: 162, type: !1238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{null, !1240, !206, null}
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "yasm_error_class", file: !94, line: 68, baseType: !93)
!1241 = !DISubprogram(name: "yasm_errwarn_propagate", scope: !94, file: !94, line: 289, type: !1242, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{null, !486, !288}
!1244 = distinct !DISubprogram(name: "cv8_set_symhead_end", scope: !2, file: !2, line: 697, type: !1245, scopeLine: 698, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !1247)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{null, !704, !302}
!1247 = !{!1248, !1249}
!1248 = !DILocalVariable(name: "head", arg: 1, scope: !1244, file: !2, line: 697, type: !704)
!1249 = !DILocalVariable(name: "end_prevbc", arg: 2, scope: !1244, file: !2, line: 697, type: !302)
!1250 = !DILocation(line: 697, column: 34, scope: !1244)
!1251 = !DILocation(line: 697, column: 55, scope: !1244)
!1252 = !DILocation(line: 699, column: 24, scope: !1244)
!1253 = !DILocation(line: 699, column: 5, scope: !1244)
!1254 = !DILocation(line: 699, column: 11, scope: !1244)
!1255 = !DILocation(line: 699, column: 22, scope: !1244)
!1256 = !DILocation(line: 700, column: 1, scope: !1244)
!1257 = !DISubprogram(name: "yasm_section_bcs_last", scope: !224, file: !224, line: 319, type: !1258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!302, !246}
!1260 = !DISubprogram(name: "yasm_bc_create_align", scope: !76, file: !76, line: 374, type: !1261, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!302, !281, !281, !281, !617, !288}
!1263 = !DISubprogram(name: "yasm_expr_create", scope: !65, file: !65, line: 90, type: !1264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!281, !286, !505, !505, !288}
!1266 = !DISubprogram(name: "yasm_expr_int", scope: !65, file: !65, line: 120, type: !1267, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!505, !454}
!1269 = !DISubprogram(name: "yasm_intnum_create_uint", scope: !1270, file: !1270, line: 96, type: !1271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1270 = !DIFile(filename: "./libyasm/intnum.h", directory: "/local-ssd/yasm-var6ybwismbdorzdng2zz5wpojwdcx5r-build/aidengro/spack-stage-yasm-1.3.0-var6ybwismbdorzdng2zz5wpojwdcx5r/spack-src", checksumkind: CSK_MD5, checksum: "42af26c6ae684cef89aa66e5164f3d8f")
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!454, !288}
!1273 = !DISubprogram(name: "yasm_bc_finalize", scope: !76, file: !76, line: 426, type: !385, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1274 = !DISubprogram(name: "yasm_cv__append_bc", scope: !192, file: !192, line: 49, type: !1275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!302, !246, !302}
!1277 = !DISubprogram(name: "yasm_bc_calc_len", scope: !76, file: !76, line: 470, type: !393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1278 = distinct !DISubprogram(name: "cv8_add_fileinfo", scope: !2, file: !2, line: 761, type: !1279, scopeLine: 762, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !1281)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!302, !246, !528}
!1281 = !{!1282, !1283, !1284, !1285}
!1282 = !DILocalVariable(name: "sect", arg: 1, scope: !1278, file: !2, line: 761, type: !246)
!1283 = !DILocalVariable(name: "fn", arg: 2, scope: !1278, file: !2, line: 761, type: !528)
!1284 = !DILocalVariable(name: "fi", scope: !1278, file: !2, line: 763, type: !712)
!1285 = !DILocalVariable(name: "bc", scope: !1278, file: !2, line: 764, type: !302)
!1286 = !DILocation(line: 761, column: 32, scope: !1278)
!1287 = !DILocation(line: 761, column: 57, scope: !1278)
!1288 = !DILocation(line: 763, column: 5, scope: !1278)
!1289 = !DILocation(line: 763, column: 19, scope: !1278)
!1290 = !DILocation(line: 764, column: 5, scope: !1278)
!1291 = !DILocation(line: 764, column: 20, scope: !1278)
!1292 = !DILocation(line: 766, column: 10, scope: !1278)
!1293 = !DILocation(line: 766, column: 8, scope: !1278)
!1294 = !DILocation(line: 767, column: 14, scope: !1278)
!1295 = !DILocation(line: 767, column: 5, scope: !1278)
!1296 = !DILocation(line: 767, column: 9, scope: !1278)
!1297 = !DILocation(line: 767, column: 12, scope: !1278)
!1298 = !{!1299, !828, i64 0}
!1299 = !{!"cv8_fileinfo", !828, i64 0}
!1300 = !DILocation(line: 769, column: 59, scope: !1278)
!1301 = !DILocation(line: 769, column: 10, scope: !1278)
!1302 = !DILocation(line: 769, column: 8, scope: !1278)
!1303 = !DILocation(line: 770, column: 5, scope: !1278)
!1304 = !DILocation(line: 770, column: 9, scope: !1278)
!1305 = !DILocation(line: 770, column: 13, scope: !1278)
!1306 = !DILocation(line: 772, column: 24, scope: !1278)
!1307 = !DILocation(line: 772, column: 30, scope: !1278)
!1308 = !DILocation(line: 772, column: 5, scope: !1278)
!1309 = !DILocation(line: 773, column: 12, scope: !1278)
!1310 = !DILocation(line: 774, column: 1, scope: !1278)
!1311 = !DILocation(line: 773, column: 5, scope: !1278)
!1312 = !DISubprogram(name: "yasm_object_sections_traverse", scope: !224, file: !224, line: 161, type: !1313, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!290, !221, !321, !1315}
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!290, !246, !321}
!1318 = distinct !DISubprogram(name: "cv_generate_line_section", scope: !2, file: !2, line: 497, type: !1316, scopeLine: 498, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !1319)
!1319 = !{!1320, !1321, !1322}
!1320 = !DILocalVariable(name: "sect", arg: 1, scope: !1318, file: !2, line: 497, type: !246)
!1321 = !DILocalVariable(name: "d", arg: 2, scope: !1318, file: !2, line: 497, type: !321)
!1322 = !DILocalVariable(name: "info", scope: !1318, file: !2, line: 499, type: !506)
!1323 = !DILocation(line: 497, column: 40, scope: !1318)
!1324 = !DILocation(line: 497, column: 63, scope: !1318)
!1325 = !DILocation(line: 499, column: 5, scope: !1318)
!1326 = !DILocation(line: 499, column: 19, scope: !1318)
!1327 = !DILocation(line: 499, column: 42, scope: !1318)
!1328 = !DILocation(line: 501, column: 31, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1318, file: !2, line: 501, column: 9)
!1330 = !DILocation(line: 501, column: 10, scope: !1329)
!1331 = !DILocation(line: 501, column: 9, scope: !1318)
!1332 = !DILocation(line: 502, column: 9, scope: !1329)
!1333 = !DILocation(line: 504, column: 5, scope: !1318)
!1334 = !DILocation(line: 504, column: 11, scope: !1318)
!1335 = !DILocation(line: 504, column: 22, scope: !1318)
!1336 = !DILocation(line: 505, column: 5, scope: !1318)
!1337 = !DILocation(line: 505, column: 11, scope: !1318)
!1338 = !DILocation(line: 505, column: 22, scope: !1318)
!1339 = !DILocation(line: 507, column: 31, scope: !1318)
!1340 = !DILocation(line: 507, column: 37, scope: !1318)
!1341 = !DILocation(line: 507, column: 43, scope: !1318)
!1342 = !DILocation(line: 507, column: 53, scope: !1318)
!1343 = !DILocation(line: 507, column: 5, scope: !1318)
!1344 = !DILocation(line: 509, column: 5, scope: !1318)
!1345 = !DILocation(line: 510, column: 1, scope: !1318)
!1346 = !DISubprogram(name: "yasm_bc_create_common", scope: !76, file: !76, line: 238, type: !1347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!302, !312, !321, !288}
!1349 = distinct !DISubprogram(name: "cv8_add_sym_objname", scope: !2, file: !2, line: 257, type: !1350, scopeLine: 258, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !1352)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!690, !246, !227}
!1352 = !{!1353, !1354, !1355, !1356}
!1353 = !DILocalVariable(name: "sect", arg: 1, scope: !1349, file: !2, line: 257, type: !246)
!1354 = !DILocalVariable(name: "objname", arg: 2, scope: !1349, file: !2, line: 257, type: !227)
!1355 = !DILocalVariable(name: "bc", scope: !1349, file: !2, line: 259, type: !302)
!1356 = !DILocalVariable(name: "cvs", scope: !1349, file: !2, line: 260, type: !690)
!1357 = !DILocation(line: 257, column: 35, scope: !1349)
!1358 = !DILocation(line: 257, column: 58, scope: !1349)
!1359 = !DILocation(line: 259, column: 5, scope: !1349)
!1360 = !DILocation(line: 259, column: 20, scope: !1349)
!1361 = !DILocation(line: 260, column: 5, scope: !1349)
!1362 = !DILocation(line: 260, column: 13, scope: !1349)
!1363 = !DILocation(line: 260, column: 19, scope: !1349)
!1364 = !DILocation(line: 261, column: 5, scope: !1349)
!1365 = !DILocation(line: 261, column: 10, scope: !1349)
!1366 = !DILocation(line: 261, column: 15, scope: !1349)
!1367 = !{!1368, !829, i64 0}
!1368 = !{!"cv_sym", !829, i64 0, !828, i64 8, !829, i64 16}
!1369 = !DILocation(line: 262, column: 5, scope: !1349)
!1370 = !DILocation(line: 262, column: 10, scope: !1349)
!1371 = !DILocation(line: 262, column: 17, scope: !1349)
!1372 = !{!1368, !828, i64 8}
!1373 = !DILocation(line: 263, column: 5, scope: !1349)
!1374 = !DILocation(line: 263, column: 10, scope: !1349)
!1375 = !DILocation(line: 263, column: 20, scope: !1349)
!1376 = !{!829, !829, i64 0}
!1377 = !DILocation(line: 264, column: 22, scope: !1349)
!1378 = !DILocation(line: 264, column: 5, scope: !1349)
!1379 = !DILocation(line: 264, column: 10, scope: !1349)
!1380 = !DILocation(line: 264, column: 20, scope: !1349)
!1381 = !DILocation(line: 266, column: 53, scope: !1349)
!1382 = !DILocation(line: 266, column: 10, scope: !1349)
!1383 = !DILocation(line: 266, column: 8, scope: !1349)
!1384 = !DILocation(line: 267, column: 27, scope: !1349)
!1385 = !DILocation(line: 267, column: 15, scope: !1349)
