; ModuleID = 'samples/987.bc'
source_filename = "src/extended/mapping.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GtMapping = type { ptr, ptr, i32, ptr, i8 }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [297 x i8] c"Assertion failed: (%s), function %s, file %s, line %d.\0AThis is a bug, please report it at\0Ahttps://github.com/genometools/genometools/issues\0APlease make sure you are running the latest release which can be found at\0Ahttp://genometools.org/pub/\0AYou can check your version number with `gt -version`.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"!err || !gt_error_is_set(err)\00", align 1, !dbg !7
@__func__.gt_mapping_new = private unnamed_addr constant [15 x i8] c"gt_mapping_new\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [23 x i8] c"src/extended/mapping.c\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [28 x i8] c"mapping_file && global_name\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [44 x i8] c"out of memory (cannot create new Lua state)\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [18 x i8] c"!lua_gettop(m->L)\00", align 1, !dbg !33
@.str.6 = private unnamed_addr constant [20 x i8] c"cannot run file: %s\00", align 1, !dbg !38

!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 96, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 12)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(scope: null, file: !2, line: 199, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 11)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !70, isLocal: true, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 832, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 104)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 80, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 10)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(scope: null, file: !2, line: 116, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 32)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(scope: null, file: !2, line: 125, type: !85, isLocal: true, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 41)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(scope: null, file: !2, line: 135, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 43)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !95, isLocal: true, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 104, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 13)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 26)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(scope: null, file: !2, line: 172, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 53)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !110, isLocal: true, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 56)
!113 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, globals: !121, splitDebugInlining: false, nameTableKind: None)
!114 = !{!115}
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 23, baseType: !117, size: 32, elements: !118)
!116 = !DIFile(filename: "src/extended/mapping.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "b5889530e052018888749c4342a65650")
!117 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!118 = !{!119, !120}
!119 = !DIEnumerator(name: "GT_MAPPINGTYPE_STRING", value: 0)
!120 = !DIEnumerator(name: "GT_MAPPINGTYPE_INTEGER", value: 1)
!121 = !{!0, !7, !12, !18, !23, !28, !33, !38, !43, !45, !50, !55, !58, !63, !68, !73, !78, !83, !88, !93, !98, !103, !108}
!122 = !{i32 7, !"Dwarf Version", i32 5}
!123 = !{i32 2, !"Debug Info Version", i32 3}
!124 = !{i32 1, !"wchar_size", i32 4}
!125 = !{i32 8, !"PIC Level", i32 2}
!126 = !{i32 7, !"uwtable", i32 2}
!127 = !{!"clang version 18.0.0 (https://github.com/llvm-ml/llvm-project b452eb491a2ae09c12cc88b715f003377cec543b)"}
!128 = distinct !DISubprogram(name: "gt_mapping_new", scope: !2, file: !2, line: 34, type: !129, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !156)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !136, !151, !143, !152}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtMapping", file: !116, line: 29, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GtMapping", file: !2, line: 26, size: 320, elements: !134)
!134 = !{!135, !140, !142, !144, !149}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mapping_file", scope: !133, file: !2, line: 27, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtStr", file: !138, line: 27, baseType: !139)
!138 = !DIFile(filename: "src/core/str_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "654ceffd2f9ff17a42a8522fe21401e1")
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtStr", file: !138, line: 27, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !133, file: !2, line: 28, baseType: !141, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !2, line: 29, baseType: !143, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtMappingType", file: !116, line: 26, baseType: !115)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !133, file: !2, line: 30, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "lua_State", file: !147, line: 51, baseType: !148)
!147 = !DIFile(filename: "src/external/lua-5.1.5/src/lua.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "2408a5fa419905bcba8aacae60bcacdf")
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "lua_State", file: !147, line: 51, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "is_table", scope: !133, file: !2, line: 31, baseType: !150, size: 8, offset: 256)
!150 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtError", file: !154, line: 44, baseType: !155)
!154 = !DIFile(filename: "src/core/error_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "0ad6f2e2c3b3d359d3ae1d5a6962bc56")
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "GtError", file: !154, line: 44, flags: DIFlagFwdDecl)
!156 = !{!157, !158, !159, !160, !161, !162}
!157 = !DILocalVariable(name: "mapping_file", arg: 1, scope: !128, file: !2, line: 34, type: !136)
!158 = !DILocalVariable(name: "global_name", arg: 2, scope: !128, file: !2, line: 34, type: !151)
!159 = !DILocalVariable(name: "type", arg: 3, scope: !128, file: !2, line: 35, type: !143)
!160 = !DILocalVariable(name: "err", arg: 4, scope: !128, file: !2, line: 35, type: !152)
!161 = !DILocalVariable(name: "m", scope: !128, file: !2, line: 37, type: !131)
!162 = !DILocalVariable(name: "had_err", scope: !128, file: !2, line: 38, type: !163)
!163 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!164 = !{!165, !165, i64 0}
!165 = !{!"any pointer", !166, i64 0}
!166 = !{!"omnipotent char", !167, i64 0}
!167 = !{!"Simple C/C++ TBAA"}
!168 = !DILocation(line: 34, column: 34, scope: !128)
!169 = !DILocation(line: 34, column: 60, scope: !128)
!170 = !{!166, !166, i64 0}
!171 = !DILocation(line: 35, column: 41, scope: !128)
!172 = !DILocation(line: 35, column: 56, scope: !128)
!173 = !DILocation(line: 37, column: 3, scope: !128)
!174 = !DILocation(line: 37, column: 14, scope: !128)
!175 = !DILocation(line: 38, column: 3, scope: !128)
!176 = !DILocation(line: 38, column: 7, scope: !128)
!177 = !{!178, !178, i64 0}
!178 = !{!"int", !166, i64 0}
!179 = !DILocation(line: 39, column: 3, scope: !128)
!180 = !DILocation(line: 39, column: 3, scope: !181)
!181 = distinct !DILexicalBlock(scope: !182, file: !2, line: 39, column: 3)
!182 = distinct !DILexicalBlock(scope: !128, file: !2, line: 39, column: 3)
!183 = !DILocation(line: 39, column: 3, scope: !182)
!184 = !DILocation(line: 39, column: 3, scope: !185)
!185 = distinct !DILexicalBlock(scope: !181, file: !2, line: 39, column: 3)
!186 = !DILocation(line: 40, column: 3, scope: !128)
!187 = !DILocation(line: 40, column: 3, scope: !188)
!188 = distinct !DILexicalBlock(scope: !189, file: !2, line: 40, column: 3)
!189 = distinct !DILexicalBlock(scope: !128, file: !2, line: 40, column: 3)
!190 = !DILocation(line: 40, column: 3, scope: !189)
!191 = !DILocation(line: 40, column: 3, scope: !192)
!192 = distinct !DILexicalBlock(scope: !188, file: !2, line: 40, column: 3)
!193 = !DILocation(line: 42, column: 7, scope: !128)
!194 = !DILocation(line: 42, column: 5, scope: !128)
!195 = !DILocation(line: 43, column: 32, scope: !128)
!196 = !DILocation(line: 43, column: 21, scope: !128)
!197 = !DILocation(line: 43, column: 3, scope: !128)
!198 = !DILocation(line: 43, column: 6, scope: !128)
!199 = !DILocation(line: 43, column: 19, scope: !128)
!200 = !{!201, !165, i64 0}
!201 = !{!"GtMapping", !165, i64 0, !165, i64 8, !166, i64 16, !165, i64 24, !202, i64 32}
!202 = !{!"_Bool", !166, i64 0}
!203 = !DILocation(line: 44, column: 27, scope: !128)
!204 = !DILocation(line: 44, column: 15, scope: !128)
!205 = !DILocation(line: 44, column: 3, scope: !128)
!206 = !DILocation(line: 44, column: 6, scope: !128)
!207 = !DILocation(line: 44, column: 13, scope: !128)
!208 = !{!201, !165, i64 8}
!209 = !DILocation(line: 45, column: 13, scope: !128)
!210 = !DILocation(line: 45, column: 3, scope: !128)
!211 = !DILocation(line: 45, column: 6, scope: !128)
!212 = !DILocation(line: 45, column: 11, scope: !128)
!213 = !{!201, !166, i64 16}
!214 = !DILocation(line: 47, column: 10, scope: !128)
!215 = !DILocation(line: 47, column: 3, scope: !128)
!216 = !DILocation(line: 47, column: 6, scope: !128)
!217 = !DILocation(line: 47, column: 8, scope: !128)
!218 = !{!201, !165, i64 24}
!219 = !DILocation(line: 48, column: 8, scope: !220)
!220 = distinct !DILexicalBlock(scope: !128, file: !2, line: 48, column: 7)
!221 = !DILocation(line: 48, column: 11, scope: !220)
!222 = !DILocation(line: 48, column: 7, scope: !128)
!223 = !DILocation(line: 49, column: 18, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !2, line: 48, column: 14)
!225 = !DILocation(line: 49, column: 5, scope: !224)
!226 = !DILocation(line: 50, column: 13, scope: !224)
!227 = !DILocation(line: 51, column: 3, scope: !224)
!228 = !DILocation(line: 53, column: 8, scope: !229)
!229 = distinct !DILexicalBlock(scope: !128, file: !2, line: 53, column: 7)
!230 = !DILocation(line: 53, column: 7, scope: !128)
!231 = !DILocation(line: 54, column: 19, scope: !232)
!232 = distinct !DILexicalBlock(scope: !229, file: !2, line: 53, column: 17)
!233 = !DILocation(line: 54, column: 22, scope: !232)
!234 = !DILocation(line: 54, column: 5, scope: !232)
!235 = !DILocation(line: 55, column: 5, scope: !232)
!236 = !DILocation(line: 55, column: 5, scope: !237)
!237 = distinct !DILexicalBlock(scope: !238, file: !2, line: 55, column: 5)
!238 = distinct !DILexicalBlock(scope: !232, file: !2, line: 55, column: 5)
!239 = !DILocation(line: 55, column: 5, scope: !238)
!240 = !DILocation(line: 55, column: 5, scope: !241)
!241 = distinct !DILexicalBlock(scope: !237, file: !2, line: 55, column: 5)
!242 = !DILocation(line: 56, column: 3, scope: !232)
!243 = !DILocation(line: 58, column: 8, scope: !244)
!244 = distinct !DILexicalBlock(scope: !128, file: !2, line: 58, column: 7)
!245 = !DILocation(line: 58, column: 7, scope: !128)
!246 = !DILocation(line: 59, column: 23, scope: !247)
!247 = distinct !DILexicalBlock(scope: !248, file: !2, line: 59, column: 9)
!248 = distinct !DILexicalBlock(scope: !244, file: !2, line: 58, column: 17)
!249 = !DILocation(line: 59, column: 26, scope: !247)
!250 = !DILocation(line: 59, column: 40, scope: !247)
!251 = !DILocation(line: 59, column: 29, scope: !247)
!252 = !DILocation(line: 59, column: 9, scope: !247)
!253 = !DILocation(line: 59, column: 55, scope: !247)
!254 = !DILocation(line: 60, column: 19, scope: !247)
!255 = !DILocation(line: 60, column: 22, scope: !247)
!256 = !DILocation(line: 60, column: 9, scope: !247)
!257 = !DILocation(line: 59, column: 9, scope: !248)
!258 = !DILocation(line: 61, column: 20, scope: !259)
!259 = distinct !DILexicalBlock(scope: !247, file: !2, line: 60, column: 35)
!260 = !DILocation(line: 61, column: 48, scope: !259)
!261 = !DILocation(line: 61, column: 7, scope: !259)
!262 = !DILocation(line: 62, column: 15, scope: !259)
!263 = !DILocation(line: 63, column: 7, scope: !259)
!264 = !DILocation(line: 64, column: 5, scope: !259)
!265 = !DILocation(line: 65, column: 3, scope: !248)
!266 = !DILocation(line: 67, column: 8, scope: !267)
!267 = distinct !DILexicalBlock(scope: !128, file: !2, line: 67, column: 7)
!268 = !DILocation(line: 67, column: 7, scope: !128)
!269 = !DILocation(line: 68, column: 5, scope: !270)
!270 = distinct !DILexicalBlock(scope: !267, file: !2, line: 67, column: 17)
!271 = !DILocation(line: 69, column: 9, scope: !272)
!272 = distinct !DILexicalBlock(scope: !270, file: !2, line: 69, column: 9)
!273 = !DILocation(line: 69, column: 9, scope: !270)
!274 = !DILocation(line: 70, column: 20, scope: !275)
!275 = distinct !DILexicalBlock(scope: !272, file: !2, line: 69, column: 30)
!276 = !DILocation(line: 70, column: 58, scope: !275)
!277 = !DILocation(line: 71, column: 28, scope: !275)
!278 = !DILocation(line: 71, column: 17, scope: !275)
!279 = !DILocation(line: 70, column: 7, scope: !275)
!280 = !DILocation(line: 72, column: 15, scope: !275)
!281 = !DILocation(line: 73, column: 7, scope: !275)
!282 = !DILocation(line: 74, column: 5, scope: !275)
!283 = !DILocation(line: 75, column: 3, scope: !270)
!284 = !DILocation(line: 77, column: 8, scope: !285)
!285 = distinct !DILexicalBlock(scope: !128, file: !2, line: 77, column: 7)
!286 = !DILocation(line: 77, column: 7, scope: !128)
!287 = !DILocation(line: 78, column: 11, scope: !288)
!288 = distinct !DILexicalBlock(scope: !289, file: !2, line: 78, column: 9)
!289 = distinct !DILexicalBlock(scope: !285, file: !2, line: 77, column: 17)
!290 = !DILocation(line: 78, column: 33, scope: !288)
!291 = !DILocation(line: 78, column: 36, scope: !288)
!292 = !DILocation(line: 78, column: 9, scope: !289)
!293 = !DILocation(line: 79, column: 20, scope: !294)
!294 = distinct !DILexicalBlock(scope: !288, file: !2, line: 78, column: 63)
!295 = !DILocation(line: 80, column: 36, scope: !294)
!296 = !DILocation(line: 80, column: 60, scope: !294)
!297 = !DILocation(line: 80, column: 49, scope: !294)
!298 = !DILocation(line: 79, column: 7, scope: !294)
!299 = !DILocation(line: 81, column: 15, scope: !294)
!300 = !DILocation(line: 82, column: 7, scope: !294)
!301 = !DILocation(line: 83, column: 5, scope: !294)
!302 = !DILocation(line: 84, column: 3, scope: !289)
!303 = !DILocation(line: 86, column: 8, scope: !304)
!304 = distinct !DILexicalBlock(scope: !128, file: !2, line: 86, column: 7)
!305 = !DILocation(line: 86, column: 7, scope: !128)
!306 = !DILocation(line: 87, column: 9, scope: !307)
!307 = distinct !DILexicalBlock(scope: !308, file: !2, line: 87, column: 9)
!308 = distinct !DILexicalBlock(scope: !304, file: !2, line: 86, column: 17)
!309 = !DILocation(line: 87, column: 9, scope: !308)
!310 = !DILocation(line: 88, column: 7, scope: !307)
!311 = !DILocation(line: 88, column: 10, scope: !307)
!312 = !DILocation(line: 88, column: 19, scope: !307)
!313 = !{!201, !202, i64 32}
!314 = !DILocation(line: 90, column: 7, scope: !307)
!315 = !DILocation(line: 90, column: 10, scope: !307)
!316 = !DILocation(line: 90, column: 19, scope: !307)
!317 = !DILocation(line: 91, column: 5, scope: !308)
!318 = !DILocation(line: 92, column: 3, scope: !308)
!319 = !DILocation(line: 94, column: 3, scope: !128)
!320 = !DILocation(line: 94, column: 3, scope: !321)
!321 = distinct !DILexicalBlock(scope: !322, file: !2, line: 94, column: 3)
!322 = distinct !DILexicalBlock(scope: !128, file: !2, line: 94, column: 3)
!323 = !DILocation(line: 94, column: 3, scope: !322)
!324 = !DILocation(line: 94, column: 3, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !2, line: 94, column: 3)
!326 = !DILocation(line: 95, column: 7, scope: !327)
!327 = distinct !DILexicalBlock(scope: !128, file: !2, line: 95, column: 7)
!328 = !DILocation(line: 95, column: 7, scope: !128)
!329 = !DILocation(line: 96, column: 23, scope: !330)
!330 = distinct !DILexicalBlock(scope: !327, file: !2, line: 95, column: 16)
!331 = !DILocation(line: 96, column: 5, scope: !330)
!332 = !DILocation(line: 97, column: 5, scope: !330)
!333 = !DILocation(line: 99, column: 10, scope: !128)
!334 = !DILocation(line: 99, column: 3, scope: !128)
!335 = !DILocation(line: 100, column: 1, scope: !128)
!336 = !DISubprogram(name: "gt_error_is_set", scope: !154, file: !154, line: 64, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!337 = !DISubroutineType(types: !338)
!338 = !{!150, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!341 = !DISubprogram(name: "fprintf", scope: !342, file: !342, line: 350, type: !343, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!342 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!343 = !DISubroutineType(types: !344)
!344 = !{!163, !345, !403, null}
!345 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !348, line: 7, baseType: !349)
!348 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !350, line: 49, size: 1728, elements: !351)
!350 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!351 = !{!352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !367, !369, !370, !371, !375, !377, !379, !383, !386, !388, !391, !394, !395, !397, !401, !402}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !349, file: !350, line: 51, baseType: !163, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !349, file: !350, line: 54, baseType: !141, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !349, file: !350, line: 55, baseType: !141, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !349, file: !350, line: 56, baseType: !141, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !349, file: !350, line: 57, baseType: !141, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !349, file: !350, line: 58, baseType: !141, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !349, file: !350, line: 59, baseType: !141, size: 64, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !349, file: !350, line: 60, baseType: !141, size: 64, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !349, file: !350, line: 61, baseType: !141, size: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !349, file: !350, line: 64, baseType: !141, size: 64, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !349, file: !350, line: 65, baseType: !141, size: 64, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !349, file: !350, line: 66, baseType: !141, size: 64, offset: 704)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !349, file: !350, line: 68, baseType: !365, size: 64, offset: 768)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !350, line: 36, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !349, file: !350, line: 70, baseType: !368, size: 64, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !349, file: !350, line: 72, baseType: !163, size: 32, offset: 896)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !349, file: !350, line: 73, baseType: !163, size: 32, offset: 928)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !349, file: !350, line: 74, baseType: !372, size: 64, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !373, line: 152, baseType: !374)
!373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!374 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !349, file: !350, line: 77, baseType: !376, size: 16, offset: 1024)
!376 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !349, file: !350, line: 78, baseType: !378, size: 8, offset: 1040)
!378 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !349, file: !350, line: 79, baseType: !380, size: 8, offset: 1048)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 1)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !349, file: !350, line: 81, baseType: !384, size: 64, offset: 1088)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !350, line: 43, baseType: null)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !349, file: !350, line: 89, baseType: !387, size: 64, offset: 1152)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !373, line: 153, baseType: !374)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !349, file: !350, line: 91, baseType: !389, size: 64, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !350, line: 37, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !349, file: !350, line: 92, baseType: !392, size: 64, offset: 1280)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !350, line: 38, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !349, file: !350, line: 93, baseType: !368, size: 64, offset: 1344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !349, file: !350, line: 94, baseType: !396, size: 64, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !349, file: !350, line: 95, baseType: !398, size: 64, offset: 1472)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !399, line: 70, baseType: !400)
!399 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!400 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !349, file: !350, line: 96, baseType: !163, size: 32, offset: 1536)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !349, file: !350, line: 98, baseType: !40, size: 160, offset: 1568)
!403 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !151)
!404 = !DISubprogram(name: "abort", scope: !405, file: !405, line: 598, type: !406, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!405 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!406 = !DISubroutineType(types: !407)
!407 = !{null}
!408 = !DISubprogram(name: "gt_malloc_mem", scope: !409, file: !409, line: 56, type: !410, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!409 = !DIFile(filename: "src/core/ma_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "7471aa5449adf19e6d72bdf5eac6e908")
!410 = !DISubroutineType(types: !411)
!411 = !{!396, !398, !151, !163}
!412 = !DISubprogram(name: "gt_str_ref", scope: !138, file: !138, line: 37, type: !413, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DISubroutineType(types: !414)
!414 = !{!136, !136}
!415 = !DISubprogram(name: "gt_cstr_dup", scope: !416, file: !416, line: 29, type: !417, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!416 = !DIFile(filename: "src/core/cstr_api.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "fd09ef1c089bfd450bf6a9b92876658b")
!417 = !DISubroutineType(types: !418)
!418 = !{!141, !151}
!419 = !DISubprogram(name: "luaL_newstate", scope: !420, file: !420, line: 82, type: !421, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!420 = !DIFile(filename: "src/external/lua-5.1.5/src/lauxlib.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "9ee455010892bdf666d56ba254ef06e5")
!421 = !DISubroutineType(types: !422)
!422 = !{!145}
!423 = !DISubprogram(name: "gt_error_set", scope: !154, file: !154, line: 56, type: !424, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !152, !151, null}
!426 = !DISubprogram(name: "luaL_openlibs", scope: !427, file: !427, line: 44, type: !428, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!427 = !DIFile(filename: "src/external/lua-5.1.5/src/lualib.h", directory: "/local-ssd/genometools-ynxcpryk4pr3tj74ztzu43niu5ovck4y-build/aidengro/spack-stage-genometools-1.6.2-ynxcpryk4pr3tj74ztzu43niu5ovck4y/spack-src", checksumkind: CSK_MD5, checksum: "03b9f9c3f7a82bee2f7eab03315eae7d")
!428 = !DISubroutineType(types: !429)
!429 = !{null, !145}
!430 = !DISubprogram(name: "lua_gettop", scope: !147, file: !147, line: 121, type: !431, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!431 = !DISubroutineType(types: !432)
!432 = !{!163, !145}
!433 = !DISubprogram(name: "luaL_loadfile", scope: !420, file: !420, line: 77, type: !434, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DISubroutineType(types: !435)
!435 = !{!163, !145, !151}
!436 = !DISubprogram(name: "gt_str_get", scope: !138, file: !138, line: 40, type: !437, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!437 = !DISubroutineType(types: !438)
!438 = !{!141, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!441 = !DISubprogram(name: "lua_pcall", scope: !147, file: !147, line: 203, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!163, !145, !163, !163, !163}
!444 = !DISubprogram(name: "lua_tolstring", scope: !147, file: !147, line: 150, type: !445, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
