; ModuleID = 'samples/994.bc'
source_filename = "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build/aidengro/spack-stage-py-cython-3.0.4-dy46r2wwmuglnne2coy4h6brykhora2n/spack-src/Cython/Runtime/refnanny.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.PyModuleDef_Base = type { %struct._object, ptr, i64, ptr }
%struct._object = type { i64, ptr }
%struct.PyMethodDef = type { ptr, ptr, i32, ptr }
%struct.PyModuleDef_Slot = type { i32, ptr }
%struct._typeobject = type { %struct.PyVarObject, ptr, i64, i64, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr }
%struct.PyVarObject = type { %struct._object, i64 }
%struct.__pyx_t_6Cython_7Runtime_8refnanny_RefNannyAPIStruct = type { ptr, ptr, ptr, ptr, ptr, ptr }
%struct.__pyx_mstate = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.__Pyx_CachedCFunction = type { ptr, ptr, ptr, ptr, i32 }

!3 = !DIFile(filename: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build/aidengro/spack-stage-py-cython-3.0.4-dy46r2wwmuglnne2coy4h6brykhora2n/spack-src/Cython/Runtime/refnanny.c", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build/aidengro/spack-stage-py-cython-3.0.4-dy46r2wwmuglnne2coy4h6brykhora2n/spack-src", checksumkind: CSK_MD5, checksum: "d88f6d061f2225d82143d7ff355528bd")
!4 = !{!5, !12, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 676, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/object.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "059c0d359e891772b7814c88f6fa55ff")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PYGEN_RETURN", value: 0)
!10 = !DIEnumerator(name: "PYGEN_ERROR", value: -1)
!11 = !DIEnumerator(name: "PYGEN_NEXT", value: 1)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !13, line: 304, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/unicodeobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "f386b2e1a1c191e8bf459eb4bae7acee")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!17 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!18 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!19 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__Pyx_ImportType_CheckSize_3_0_4", file: !21, line: 2156, baseType: !14, size: 32, elements: !22)
!21 = !DIFile(filename: "Cython/Runtime/refnanny.c", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build/aidengro/spack-stage-py-cython-3.0.4-dy46r2wwmuglnne2coy4h6brykhora2n/spack-src", checksumkind: CSK_MD5, checksum: "d88f6d061f2225d82143d7ff355528bd")
!22 = !{!23, !24, !25}
!23 = !DIEnumerator(name: "__Pyx_ImportType_CheckSize_Error_3_0_4", value: 0)
!24 = !DIEnumerator(name: "__Pyx_ImportType_CheckSize_Warn_3_0_4", value: 1)
!25 = !DIEnumerator(name: "__Pyx_ImportType_CheckSize_Ignore_3_0_4", value: 2)
!26 = !{!27, !28, !70, !343, !353, !7, !42, !361, !374, !378, !386, !405, !34, !423, !427, !435, !446, !445, !452, !451, !457, !458, !341, !459, !470, !475, !40, !238, !483, !490, !491, !482, !364, !501, !502, !515}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !30, line: 18, baseType: !31)
!30 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/pytypedefs.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "38482a77e5b3188ef0e82980904fb142")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 100, size: 128, elements: !32)
!32 = !{!33, !41}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !31, file: !6, line: 102, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !35, line: 131, baseType: !36)
!35 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/pyport.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "a198b01de4c7067d893cd27dc3108f8a")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !37, line: 108, baseType: !38)
!37 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !39, line: 194, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!40 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !31, file: !6, line: 103, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !30, line: 20, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !45, line: 148, size: 3264, elements: !46)
!45 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/object.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "5cecebbdf3585641a3ef3ab354ac3a06")
!46 = !{!47, !53, !57, !58, !59, !64, !65, !71, !76, !95, !97, !150, !181, !193, !199, !200, !201, !203, !205, !237, !239, !240, !249, !250, !255, !256, !258, !260, !271, !282, !301, !302, !303, !305, !307, !308, !310, !315, !320, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !44, file: !45, line: 149, baseType: !48, size: 192)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 112, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 109, size: 192, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !49, file: !6, line: 110, baseType: !29, size: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !49, file: !6, line: 111, baseType: !34, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !44, file: !45, line: 150, baseType: !54, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !44, file: !45, line: 151, baseType: !34, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !44, file: !45, line: 151, baseType: !34, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !44, file: !45, line: 155, baseType: !60, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 213, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !28}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall_offset", scope: !44, file: !45, line: 156, baseType: !34, size: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !44, file: !45, line: 157, baseType: !66, size: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 214, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!28, !28, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !44, file: !45, line: 158, baseType: !72, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 216, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!7, !28, !70, !28}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_async", scope: !44, file: !45, line: 159, baseType: !77, size: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyAsyncMethods", file: !45, line: 135, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 130, size: 256, elements: !80)
!80 = !{!81, !86, !87, !88}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "am_await", scope: !79, file: !45, line: 131, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 196, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!28, !28}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "am_aiter", scope: !79, file: !45, line: 132, baseType: !82, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "am_anext", scope: !79, file: !45, line: 133, baseType: !82, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "am_send", scope: !79, file: !45, line: 134, baseType: !89, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfunc", file: !45, line: 128, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !28, !28, !94}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySendResult", file: !6, line: 680, baseType: !5)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !44, file: !45, line: 161, baseType: !96, size: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 218, baseType: !83)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !44, file: !45, line: 165, baseType: !98, size: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !45, line: 106, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 61, size: 2304, elements: !101)
!101 = !{!102, !107, !108, !109, !110, !111, !116, !117, !118, !119, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !100, file: !45, line: 66, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 197, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!28, !28, !28}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !100, file: !45, line: 67, baseType: !103, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !100, file: !45, line: 68, baseType: !103, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !100, file: !45, line: 69, baseType: !103, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !100, file: !45, line: 70, baseType: !103, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !100, file: !45, line: 71, baseType: !112, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 198, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!28, !28, !28, !28}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !100, file: !45, line: 72, baseType: !82, size: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !100, file: !45, line: 73, baseType: !82, size: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !100, file: !45, line: 74, baseType: !82, size: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !100, file: !45, line: 75, baseType: !120, size: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 199, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!7, !28}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !100, file: !45, line: 76, baseType: !82, size: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !100, file: !45, line: 77, baseType: !103, size: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !100, file: !45, line: 78, baseType: !103, size: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !100, file: !45, line: 79, baseType: !103, size: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !100, file: !45, line: 80, baseType: !103, size: 64, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !100, file: !45, line: 81, baseType: !103, size: 64, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !100, file: !45, line: 82, baseType: !82, size: 64, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !100, file: !45, line: 83, baseType: !27, size: 64, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !100, file: !45, line: 84, baseType: !82, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !100, file: !45, line: 86, baseType: !103, size: 64, offset: 1216)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !100, file: !45, line: 87, baseType: !103, size: 64, offset: 1280)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !100, file: !45, line: 88, baseType: !103, size: 64, offset: 1344)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !100, file: !45, line: 89, baseType: !103, size: 64, offset: 1408)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !100, file: !45, line: 90, baseType: !112, size: 64, offset: 1472)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !100, file: !45, line: 91, baseType: !103, size: 64, offset: 1536)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !100, file: !45, line: 92, baseType: !103, size: 64, offset: 1600)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !100, file: !45, line: 93, baseType: !103, size: 64, offset: 1664)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !100, file: !45, line: 94, baseType: !103, size: 64, offset: 1728)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !100, file: !45, line: 95, baseType: !103, size: 64, offset: 1792)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !100, file: !45, line: 97, baseType: !103, size: 64, offset: 1856)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !100, file: !45, line: 98, baseType: !103, size: 64, offset: 1920)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !100, file: !45, line: 99, baseType: !103, size: 64, offset: 1984)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !100, file: !45, line: 100, baseType: !103, size: 64, offset: 2048)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !100, file: !45, line: 102, baseType: !82, size: 64, offset: 2112)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_matrix_multiply", scope: !100, file: !45, line: 104, baseType: !103, size: 64, offset: 2176)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_matrix_multiply", scope: !100, file: !45, line: 105, baseType: !103, size: 64, offset: 2240)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !44, file: !45, line: 166, baseType: !151, size: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !45, line: 120, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 108, size: 640, elements: !154)
!154 = !{!155, !160, !161, !166, !167, !168, !173, !174, !179, !180}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !153, file: !45, line: 109, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 200, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!34, !28}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !153, file: !45, line: 110, baseType: !103, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !153, file: !45, line: 111, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 201, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!28, !28, !34}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !153, file: !45, line: 112, baseType: !162, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !153, file: !45, line: 113, baseType: !27, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !153, file: !45, line: 114, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 203, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!7, !28, !34, !28}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !153, file: !45, line: 115, baseType: !27, size: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !153, file: !45, line: 116, baseType: !175, size: 64, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 207, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!7, !28, !28}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !153, file: !45, line: 118, baseType: !103, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !153, file: !45, line: 119, baseType: !162, size: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !44, file: !45, line: 167, baseType: !182, size: 64, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !45, line: 126, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 122, size: 192, elements: !185)
!185 = !{!186, !187, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !184, file: !45, line: 123, baseType: !156, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !184, file: !45, line: 124, baseType: !103, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !184, file: !45, line: 125, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 205, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!7, !28, !28, !28}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !44, file: !45, line: 171, baseType: !194, size: 64, offset: 960)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 219, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !28}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !35, line: 145, baseType: !34)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !44, file: !45, line: 172, baseType: !112, size: 64, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !44, file: !45, line: 173, baseType: !96, size: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !44, file: !45, line: 174, baseType: !202, size: 64, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 215, baseType: !104)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !44, file: !45, line: 175, baseType: !204, size: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 217, baseType: !190)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !44, file: !45, line: 178, baseType: !206, size: 64, offset: 1280)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !45, line: 140, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 137, size: 128, elements: !209)
!209 = !{!210, !232}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !208, file: !45, line: 138, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !45, line: 54, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!7, !28, !215, !7}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !217, line: 33, baseType: !218)
!217 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/pybuffer.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "b062a75218ff363c388d03c953e9be96")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 20, size: 640, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !229, !230, !231}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !218, file: !217, line: 21, baseType: !27, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !218, file: !217, line: 22, baseType: !28, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !218, file: !217, line: 23, baseType: !34, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !218, file: !217, line: 24, baseType: !34, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !218, file: !217, line: 26, baseType: !7, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !218, file: !217, line: 27, baseType: !7, size: 32, offset: 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !218, file: !217, line: 28, baseType: !70, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !218, file: !217, line: 29, baseType: !228, size: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !218, file: !217, line: 30, baseType: !228, size: 64, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !218, file: !217, line: 31, baseType: !228, size: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !218, file: !217, line: 32, baseType: !27, size: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !208, file: !45, line: 139, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !45, line: 55, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !28, !215}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !44, file: !45, line: 181, baseType: !238, size: 64, offset: 1344)
!238 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !44, file: !45, line: 183, baseType: !54, size: 64, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !44, file: !45, line: 187, baseType: !241, size: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 209, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!7, !28, !245, !27}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 208, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!7, !28, !27}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !44, file: !45, line: 190, baseType: !120, size: 64, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !44, file: !45, line: 194, baseType: !251, size: 64, offset: 1600)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 220, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!28, !28, !28, !7}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !44, file: !45, line: 197, baseType: !34, size: 64, offset: 1664)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !44, file: !45, line: 200, baseType: !257, size: 64, offset: 1728)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 221, baseType: !83)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !44, file: !45, line: 201, baseType: !259, size: 64, offset: 1792)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 222, baseType: !83)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !44, file: !45, line: 204, baseType: !261, size: 64, offset: 1856)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !30, line: 14, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !264, line: 54, size: 256, elements: !265)
!264 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/methodobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "d16253797aba078267dcb5d0afce23bc")
!265 = !{!266, !267, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !263, file: !264, line: 55, baseType: !54, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !263, file: !264, line: 56, baseType: !268, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !264, line: 19, baseType: !104)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !263, file: !264, line: 57, baseType: !7, size: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !263, file: !264, line: 59, baseType: !54, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !44, file: !45, line: 205, baseType: !272, size: 64, offset: 1920)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !30, line: 16, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !275, line: 18, size: 320, elements: !276)
!275 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/structmember.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "7454eedd17059aa65fa47c9e0f3b5384")
!276 = !{!277, !278, !279, !280, !281}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !275, line: 19, baseType: !54, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !274, file: !275, line: 20, baseType: !7, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !274, file: !275, line: 21, baseType: !34, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !275, line: 22, baseType: !7, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !274, file: !275, line: 23, baseType: !54, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !44, file: !45, line: 206, baseType: !283, size: 64, offset: 1984)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !30, line: 15, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !286, line: 11, size: 320, elements: !287)
!286 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/descrobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "242ee4d5fc45bad34457db881bf071ca")
!287 = !{!288, !289, !294, !299, !300}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !285, file: !286, line: 12, baseType: !54, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !285, file: !286, line: 13, baseType: !290, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !286, line: 8, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!28, !28, !27}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !285, file: !286, line: 14, baseType: !295, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !286, line: 9, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!7, !28, !28, !27}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !285, file: !286, line: 15, baseType: !54, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !285, file: !286, line: 16, baseType: !27, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !44, file: !45, line: 208, baseType: !42, size: 64, offset: 2048)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !44, file: !45, line: 209, baseType: !28, size: 64, offset: 2112)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !44, file: !45, line: 210, baseType: !304, size: 64, offset: 2176)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 223, baseType: !113)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !44, file: !45, line: 211, baseType: !306, size: 64, offset: 2240)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 224, baseType: !190)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !44, file: !45, line: 212, baseType: !34, size: 64, offset: 2304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !44, file: !45, line: 213, baseType: !309, size: 64, offset: 2368)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 225, baseType: !190)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !44, file: !45, line: 214, baseType: !311, size: 64, offset: 2432)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 227, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!28, !42, !34}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !44, file: !45, line: 215, baseType: !316, size: 64, offset: 2496)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 226, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!28, !42, !28, !28}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !44, file: !45, line: 216, baseType: !321, size: 64, offset: 2560)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 212, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !27}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !44, file: !45, line: 217, baseType: !120, size: 64, offset: 2624)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !44, file: !45, line: 218, baseType: !28, size: 64, offset: 2688)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !44, file: !45, line: 219, baseType: !28, size: 64, offset: 2752)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !44, file: !45, line: 220, baseType: !28, size: 64, offset: 2816)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !44, file: !45, line: 221, baseType: !28, size: 64, offset: 2880)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !44, file: !45, line: 222, baseType: !28, size: 64, offset: 2944)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !44, file: !45, line: 223, baseType: !60, size: 64, offset: 3008)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !44, file: !45, line: 226, baseType: !14, size: 32, offset: 3072)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !44, file: !45, line: 228, baseType: !60, size: 64, offset: 3136)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_vectorcall", scope: !44, file: !45, line: 229, baseType: !335, size: 64, offset: 3200)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "vectorcallfunc", file: !45, line: 57, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!28, !28, !339, !341, !28}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !342, line: 70, baseType: !238)
!342 = !DIFile(filename: "/usr/lib/clang/18/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "592de6c0120e294e25519119517dd24e")
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !345, line: 11, baseType: !346)
!345 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/tupleobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "dc5125d9874a31c3ab3d1fe314ca89bb")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 5, size: 256, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !346, file: !345, line: 6, baseType: !48, size: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !346, file: !345, line: 10, baseType: !350, size: 64, offset: 192)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 1)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !355, line: 22, baseType: !356)
!355 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/listobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "fb4fd95f673a2d5fdee5b26f4d68bde2")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !355, line: 5, size: 320, elements: !357)
!357 = !{!358, !359, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !356, file: !355, line: 6, baseType: !48, size: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !356, file: !355, line: 8, baseType: !94, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !356, file: !355, line: 21, baseType: !34, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!28, !364, !28, !34, !7}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_obj_6Cython_7Runtime_8refnanny_Context", file: !21, line: 1510, size: 512, elements: !366)
!366 = !{!367, !368, !381, !382, !383, !384, !385}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !365, file: !21, line: 1511, baseType: !29, size: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_vtab", scope: !365, file: !21, line: 1512, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pyx_vtabstruct_6Cython_7Runtime_8refnanny_Context", file: !21, line: 1522, size: 192, elements: !371)
!371 = !{!372, !373, !377}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "regref", scope: !370, file: !21, line: 1523, baseType: !361, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "delref", scope: !370, file: !21, line: 1524, baseType: !374, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!7, !364, !28, !34, !7}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !370, file: !21, line: 1525, baseType: !378, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!28, !364}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !365, file: !21, line: 1513, baseType: !28, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !365, file: !21, line: 1514, baseType: !28, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !365, file: !21, line: 1515, baseType: !28, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !365, file: !21, line: 1516, baseType: !28, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !365, file: !21, line: 1517, baseType: !34, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !388, line: 29, baseType: !389)
!388 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/dictobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "ca445c2681ff34d200fbf38fa4280db0")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 11, size: 384, elements: !390)
!390 = !{!391, !392, !393, !397, !401}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !389, file: !388, line: 12, baseType: !29, size: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !389, file: !388, line: 15, baseType: !34, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ma_version_tag", scope: !389, file: !388, line: 19, baseType: !394, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !395, line: 27, baseType: !396)
!395 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !39, line: 45, baseType: !238)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !389, file: !388, line: 21, baseType: !398, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !388, line: 5, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !45, line: 254, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !389, file: !388, line: 28, baseType: !402, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictValues", file: !388, line: 6, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictvalues", file: !388, line: 6, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !13, line: 206, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 72, size: 384, elements: !408)
!408 = !{!409, !410, !411, !412, !420}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !407, file: !13, line: 146, baseType: !29, size: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !407, file: !13, line: 147, baseType: !34, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !407, file: !13, line: 148, baseType: !198, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !407, file: !13, line: 204, baseType: !413, size: 32, offset: 256)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !13, line: 149, size: 32, elements: !414)
!414 = !{!415, !416, !417, !418, !419}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !413, file: !13, line: 158, baseType: !14, size: 2, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !413, file: !13, line: 186, baseType: !14, size: 3, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !413, file: !13, line: 191, baseType: !14, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !413, file: !13, line: 195, baseType: !14, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !413, file: !13, line: 200, baseType: !14, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !407, file: !13, line: 205, baseType: !421, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !342, line: 96, baseType: !7)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !424, line: 102, baseType: !425)
!424 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/unicodeobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "0cca020c29e2c9bcb16b6fcf0d642f7b")
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !395, line: 26, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !39, line: 42, baseType: !14)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !13, line: 218, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 211, size: 576, elements: !430)
!430 = !{!431, !432, !433, !434}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !429, file: !13, line: 212, baseType: !406, size: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !429, file: !13, line: 213, baseType: !34, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !429, file: !13, line: 215, baseType: !70, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !429, file: !13, line: 216, baseType: !34, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !13, line: 231, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 223, size: 640, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !437, file: !13, line: 224, baseType: !428, size: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !13, line: 230, baseType: !441, size: 64, offset: 576)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !437, file: !13, line: 225, size: 64, elements: !442)
!442 = !{!443, !444, !450, !456}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !441, file: !13, line: 226, baseType: !27, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !441, file: !13, line: 227, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !424, line: 104, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !395, line: 24, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !39, line: 38, baseType: !449)
!449 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !441, file: !13, line: 228, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !424, line: 103, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !395, line: 25, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !39, line: 40, baseType: !455)
!455 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !441, file: !13, line: 229, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !461, line: 14, baseType: !462)
!461 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/methodobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "de162f3f7705d370de4a5b2391985004")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !461, line: 7, size: 448, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !462, file: !461, line: 8, baseType: !29, size: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !462, file: !461, line: 9, baseType: !261, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !462, file: !461, line: 10, baseType: !28, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !462, file: !461, line: 11, baseType: !28, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "m_weakreflist", scope: !462, file: !461, line: 12, baseType: !28, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !462, file: !461, line: 13, baseType: !335, size: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "sdigit", file: !471, line: 44, baseType: !472)
!471 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/longintrepr.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "8513e3439a1d73970093054a9381adac")
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !473, line: 26, baseType: !474)
!473 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !39, line: 41, baseType: !7)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !30, line: 19, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !471, line: 82, size: 256, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !477, file: !471, line: 83, baseType: !48, size: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !477, file: !471, line: 84, baseType: !481, size: 32, offset: 192)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 32, elements: !351)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !471, line: 43, baseType: !425)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !485, line: 8, baseType: !486)
!485 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/floatobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "0127bed5b76fd86b83262b685d601e4b")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 5, size: 192, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !486, file: !485, line: 6, baseType: !29, size: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !486, file: !485, line: 7, baseType: !490, size: 64, offset: 128)
!490 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodObject", file: !493, line: 18, baseType: !494)
!493 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/classobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "f84d2b52de3a2730fbf0010ddbe9b14d")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 12, size: 384, elements: !495)
!495 = !{!496, !497, !498, !499, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !494, file: !493, line: 13, baseType: !29, size: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "im_func", scope: !494, file: !493, line: 14, baseType: !28, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "im_self", scope: !494, file: !493, line: 15, baseType: !28, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "im_weakreflist", scope: !494, file: !493, line: 16, baseType: !28, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vectorcall", scope: !494, file: !493, line: 17, baseType: !335, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !504, line: 15, baseType: !505)
!504 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/pyerrors.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "2f3eb284fb3e39b9b78ca1d783b6f62c")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !504, line: 13, size: 576, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !505, file: !504, line: 14, baseType: !29, size: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !505, file: !504, line: 14, baseType: !28, size: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !505, file: !504, line: 14, baseType: !28, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !505, file: !504, line: 14, baseType: !28, size: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !505, file: !504, line: 14, baseType: !28, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !505, file: !504, line: 14, baseType: !28, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !505, file: !504, line: 14, baseType: !28, size: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !505, file: !504, line: 14, baseType: !56, size: 8, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CodeObjectCacheEntry", file: !21, line: 2176, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 2173, size: 128, elements: !518)
!518 = !{!519, !556}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "code_object", scope: !517, file: !21, line: 2174, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !30, line: 21, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyCodeObject", file: !523, line: 103, size: 1536, elements: !524)
!523 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/cpython/code.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "0b18b017cf6ecc9860048f5ec02e4f52")
!524 = !{!525, !526, !527, !528, !529, !530, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !522, file: !523, line: 103, baseType: !48, size: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "co_exceptiontable", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "co_warmup", scope: !522, file: !523, line: 103, baseType: !531, size: 16, offset: 416)
!531 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_co_linearray_entry_size", scope: !522, file: !523, line: 103, baseType: !531, size: 16, offset: 432)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "co_posonlyargcount", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 480)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 544)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocalsplus", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 608)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "co_nplaincellvars", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 672)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "co_ncellvars", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "co_nfreevars", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 736)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "co_localsplusnames", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "co_localspluskinds", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "co_qualname", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "co_linetable", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 1088)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 1152)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_co_code", scope: !522, file: !523, line: 103, baseType: !28, size: 64, offset: 1216)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_co_linearray", scope: !522, file: !523, line: 103, baseType: !70, size: 64, offset: 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_co_firsttraceable", scope: !522, file: !523, line: 103, baseType: !7, size: 32, offset: 1344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "co_extra", scope: !522, file: !523, line: 103, baseType: !27, size: 64, offset: 1408)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "co_code_adaptive", scope: !522, file: !523, line: 103, baseType: !555, size: 8, offset: 1472)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, elements: !351)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "code_line", scope: !517, file: !21, line: 2175, baseType: !7, size: 32, offset: 64)
!557 = !{!0, !558, !563, !593, !596, !601, !606, !611, !616, !618, !620, !622, !627, !632, !634, !643, !648, !650, !655, !657, !662, !667, !669, !674, !679, !745, !747, !752, !757, !762, !767, !769, !771, !781, !784, !789, !791, !794, !797, !802, !805, !808, !813, !818, !821, !824, !826, !828, !830, !832, !834, !839, !841, !843, !845, !847, !849, !851, !853, !855, !857, !862, !864, !866, !871, !876, !878, !880, !882, !884, !886, !888, !890, !895, !898, !900, !905, !907, !912, !914, !916, !918, !920, !922, !924, !929, !931, !933, !935, !937, !968, !970, !975, !977, !980, !985, !987, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1023, !1028, !1033, !1036, !1038, !1043, !1078, !1080, !1082, !1087, !1089, !1094, !1099, !1104, !1109, !1111, !1113, !1115, !1117, !1119, !1121, !1124, !1127, !1129, !1132, !1137, !1139, !1144, !1149, !1151, !1154, !1156, !1161, !1164, !1166, !1171, !1176, !1178, !1180, !1183, !1188, !1193, !1198, !1200, !1202, !1204, !1206, !1226, !1228, !1230, !1232, !1237, !1239, !1241, !1246, !1248, !1250, !1255, !1419, !1421, !1428, !1430, !1435}
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6353, type: !560, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 72, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 9)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "__pyx_moduledef", scope: !2, file: !21, line: 6349, type: !565, isLocal: true, isDefinition: true)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !566, line: 74, size: 832, elements: !567)
!566 = !DIFile(filename: "spack-installs/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spack_path_placeholder__/__spa/linux-ubuntu22.04-zen2/clang-18.0.0/python-3.11.6-6oftvkex3mj55vzhbivz73ixugpsaanv/include/python3.11/moduleobject.h", directory: "/local-ssd/py-cython-dy46r2wwmuglnne2coy4h6brykhora2n-build", checksumkind: CSK_MD5, checksum: "daa9b768501fad61bad25a7caf4dc4db")
!567 = !{!568, !579, !580, !581, !582, !583, !590, !591, !592}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !565, file: !566, line: 75, baseType: !569, size: 320)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !566, line: 49, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !566, line: 44, size: 320, elements: !571)
!571 = !{!572, !573, !577, !578}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !570, file: !566, line: 45, baseType: !29, size: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !570, file: !566, line: 46, baseType: !574, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!28}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !570, file: !566, line: 47, baseType: !34, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !570, file: !566, line: 48, baseType: !28, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !565, file: !566, line: 76, baseType: !54, size: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !565, file: !566, line: 77, baseType: !54, size: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !565, file: !566, line: 78, baseType: !34, size: 64, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !565, file: !566, line: 79, baseType: !261, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "m_slots", scope: !565, file: !566, line: 80, baseType: !584, size: 64, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Slot", file: !30, line: 13, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Slot", file: !566, line: 60, size: 128, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !586, file: !566, line: 61, baseType: !7, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !586, file: !566, line: 62, baseType: !27, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !565, file: !566, line: 81, baseType: !241, size: 64, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !565, file: !566, line: 82, baseType: !120, size: 64, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !565, file: !566, line: 83, baseType: !321, size: 64, offset: 768)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "__pyx_methods", scope: !2, file: !21, line: 6096, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 256, elements: !351)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "__pyx_moduledef_slots", scope: !2, file: !21, line: 6338, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 384, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 3)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6464, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 40, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 5)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6475, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 56, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 7)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6475, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 88, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 11)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6476, type: !608, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6476, type: !560, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6477, type: !608, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6477, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 96, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 12)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6478, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 216, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 27)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6478, type: !560, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "main_interpreter_id", scope: !636, file: !21, line: 6412, type: !641, isLocal: true, isDefinition: true)
!636 = distinct !DISubprogram(name: "__Pyx_check_single_interpreter", scope: !21, file: !21, line: 6410, type: !637, scopeLine: 6410, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!7}
!639 = !{!640}
!640 = !DILocalVariable(name: "current_id", scope: !636, file: !21, line: 6413, type: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !473, line: 27, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !39, line: 44, baseType: !40)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6428, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 760, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 95)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "__pyx_m", scope: !2, file: !21, line: 1446, type: !28, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6507, type: !652, isLocal: true, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 648, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 81)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6537, type: !560, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6539, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 120, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 15)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6541, type: !664, isLocal: true, isDefinition: true)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 104, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 13)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6557, type: !555, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6595, type: !671, isLocal: true, isDefinition: true)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 192, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 24)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !21, line: 6772, type: !676, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 232, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 29)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "__pyx_mstate_global", scope: !2, file: !21, line: 2470, type: !681, isLocal: true, isDefinition: true)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pyx_mstate", file: !21, line: 2447, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 2345, size: 3840, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_d", scope: !683, file: !21, line: 2346, baseType: !28, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_b", scope: !683, file: !21, line: 2347, baseType: !28, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_cython_runtime", scope: !683, file: !21, line: 2348, baseType: !28, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_tuple", scope: !683, file: !21, line: 2349, baseType: !28, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_bytes", scope: !683, file: !21, line: 2350, baseType: !28, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_empty_unicode", scope: !683, file: !21, line: 2351, baseType: !28, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_7cpython_4type_type", scope: !683, file: !21, line: 2378, baseType: !42, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_ptype_6Cython_7Runtime_8refnanny_Context", scope: !683, file: !21, line: 2394, baseType: !42, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_", scope: !683, file: !21, line: 2395, baseType: !28, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_Context", scope: !683, file: !21, line: 2396, baseType: !28, size: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_LOG_ALL", scope: !683, file: !21, line: 2397, baseType: !28, size: 64, offset: 640)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_LOG_NONE", scope: !683, file: !21, line: 2398, baseType: !28, size: 64, offset: 704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_NULL", scope: !683, file: !21, line: 2399, baseType: !28, size: 64, offset: 768)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_NULL_argument_on_line", scope: !683, file: !21, line: 2400, baseType: !28, size: 64, offset: 832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_REFNANNY", scope: !683, file: !21, line: 2401, baseType: !28, size: 64, offset: 896)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_RefNannyAPI", scope: !683, file: !21, line: 2402, baseType: !28, size: 64, offset: 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_References_leaked", scope: !683, file: !21, line: 2403, baseType: !28, size: 64, offset: 1024)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_Too_many_decrefs_on_line", scope: !683, file: !21, line: 2404, baseType: !28, size: 64, offset: 1088)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u__2", scope: !683, file: !21, line: 2405, baseType: !28, size: 64, offset: 1152)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u__3", scope: !683, file: !21, line: 2406, baseType: !28, size: 64, offset: 1216)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s__4", scope: !683, file: !21, line: 2407, baseType: !28, size: 64, offset: 1280)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u__5", scope: !683, file: !21, line: 2408, baseType: !28, size: 64, offset: 1344)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u__6", scope: !683, file: !21, line: 2409, baseType: !28, size: 64, offset: 1408)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u__7", scope: !683, file: !21, line: 2410, baseType: !28, size: 64, offset: 1472)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s__9", scope: !683, file: !21, line: 2411, baseType: !28, size: 64, offset: 1536)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_acquired_on_lines", scope: !683, file: !21, line: 2412, baseType: !28, size: 64, offset: 1600)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_append", scope: !683, file: !21, line: 2413, baseType: !28, size: 64, offset: 1664)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_cline_in_traceback", scope: !683, file: !21, line: 2414, baseType: !28, size: 64, offset: 1728)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_decode", scope: !683, file: !21, line: 2415, baseType: !28, size: 64, offset: 1792)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_u_delref", scope: !683, file: !21, line: 2416, baseType: !28, size: 64, offset: 1856)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_disable", scope: !683, file: !21, line: 2417, baseType: !28, size: 64, offset: 1920)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_enable", scope: !683, file: !21, line: 2418, baseType: !28, size: 64, offset: 1984)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_exc_info", scope: !683, file: !21, line: 2419, baseType: !28, size: 64, offset: 2048)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_filename", scope: !683, file: !21, line: 2420, baseType: !28, size: 64, offset: 2112)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_gc", scope: !683, file: !21, line: 2421, baseType: !28, size: 64, offset: 2176)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_get", scope: !683, file: !21, line: 2422, baseType: !28, size: 64, offset: 2240)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_id", scope: !683, file: !21, line: 2423, baseType: !28, size: 64, offset: 2304)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_import", scope: !683, file: !21, line: 2424, baseType: !28, size: 64, offset: 2368)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_initializing", scope: !683, file: !21, line: 2425, baseType: !28, size: 64, offset: 2432)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_isenabled", scope: !683, file: !21, line: 2426, baseType: !28, size: 64, offset: 2496)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_itervalues", scope: !683, file: !21, line: 2427, baseType: !28, size: 64, offset: 2560)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_u_latin1", scope: !683, file: !21, line: 2428, baseType: !28, size: 64, offset: 2624)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_line", scope: !683, file: !21, line: 2429, baseType: !28, size: 64, offset: 2688)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_loglevel", scope: !683, file: !21, line: 2430, baseType: !28, size: 64, offset: 2752)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_main", scope: !683, file: !21, line: 2431, baseType: !28, size: 64, offset: 2816)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_name", scope: !683, file: !21, line: 2432, baseType: !28, size: 64, offset: 2880)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_name_2", scope: !683, file: !21, line: 2433, baseType: !28, size: 64, offset: 2944)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_print", scope: !683, file: !21, line: 2434, baseType: !28, size: 64, offset: 3008)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_pyx_vtable", scope: !683, file: !21, line: 2435, baseType: !28, size: 64, offset: 3072)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_range", scope: !683, file: !21, line: 2436, baseType: !28, size: 64, offset: 3136)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_reference_acquired_on_lines", scope: !683, file: !21, line: 2437, baseType: !28, size: 64, offset: 3200)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_reflog", scope: !683, file: !21, line: 2438, baseType: !28, size: 64, offset: 3264)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_kp_u_refnanny_raised_an_exception_fro", scope: !683, file: !21, line: 2439, baseType: !28, size: 64, offset: 3328)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_u_regref", scope: !683, file: !21, line: 2440, baseType: !28, size: 64, offset: 3392)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_spec", scope: !683, file: !21, line: 2441, baseType: !28, size: 64, offset: 3456)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_n_s_sys", scope: !683, file: !21, line: 2442, baseType: !28, size: 64, offset: 3520)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_int_0", scope: !683, file: !21, line: 2443, baseType: !28, size: 64, offset: 3584)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_int_1", scope: !683, file: !21, line: 2444, baseType: !28, size: 64, offset: 3648)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_int_2", scope: !683, file: !21, line: 2445, baseType: !28, size: 64, offset: 3712)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__pyx_tuple__8", scope: !683, file: !21, line: 2446, baseType: !28, size: 64, offset: 3776)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "__pyx_mstate_global_static", scope: !2, file: !21, line: 2464, type: !682, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !21, line: 1456, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 224, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 28)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !21, line: 1457, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 264, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 33)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "__pyx_f", scope: !2, file: !21, line: 1455, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 2)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !21, line: 11022, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 624, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 78)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !21, line: 11028, type: !659, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !21, line: 11028, type: !659, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "__pyx_umethod_PyDict_Type_get", scope: !2, file: !21, line: 2342, type: !773, isLocal: true, isDefinition: true)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "__Pyx_CachedCFunction", file: !21, line: 1901, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 1895, size: 320, elements: !775)
!775 = !{!776, !777, !778, !779, !780}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !774, file: !21, line: 1896, baseType: !28, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "method_name", scope: !774, file: !21, line: 1897, baseType: !94, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !774, file: !21, line: 1898, baseType: !268, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !774, file: !21, line: 1899, baseType: !28, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !774, file: !21, line: 1900, baseType: !7, size: 32, offset: 256)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "__pyx_k_", scope: !2, file: !21, line: 2286, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 40, elements: !604)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "__pyx_k_Context", scope: !2, file: !21, line: 2314, type: !786, isLocal: true, isDefinition: true)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 8)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "__pyx_k_LOG_ALL", scope: !2, file: !21, line: 2315, type: !786, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "__pyx_k_LOG_NONE", scope: !2, file: !21, line: 2317, type: !793, isLocal: true, isDefinition: true)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 72, elements: !561)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "__pyx_k_NULL", scope: !2, file: !21, line: 2298, type: !796, isLocal: true, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 56, elements: !609)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "__pyx_k_NULL_argument_on_line", scope: !2, file: !21, line: 2330, type: !799, isLocal: true, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 184, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 23)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "__pyx_k_REFNANNY", scope: !2, file: !21, line: 2318, type: !804, isLocal: true, isDefinition: true)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 88, elements: !614)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "__pyx_k_RefNannyAPI", scope: !2, file: !21, line: 2325, type: !807, isLocal: true, isDefinition: true)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 96, elements: !625)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "__pyx_k_References_leaked", scope: !2, file: !21, line: 2327, type: !810, isLocal: true, isDefinition: true)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 152, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 19)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "__pyx_k_Too_many_decrefs_on_line", scope: !2, file: !21, line: 2331, type: !815, isLocal: true, isDefinition: true)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 208, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 26)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "__pyx_k__2", scope: !2, file: !21, line: 2287, type: !820, isLocal: true, isDefinition: true)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 24, elements: !599)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "__pyx_k__3", scope: !2, file: !21, line: 2288, type: !823, isLocal: true, isDefinition: true)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 16, elements: !760)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "__pyx_k__4", scope: !2, file: !21, line: 2289, type: !823, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "__pyx_k__5", scope: !2, file: !21, line: 2290, type: !823, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "__pyx_k__6", scope: !2, file: !21, line: 2291, type: !820, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "__pyx_k__7", scope: !2, file: !21, line: 2292, type: !820, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "__pyx_k__9", scope: !2, file: !21, line: 2293, type: !823, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "__pyx_k_acquired_on_lines", scope: !2, file: !21, line: 2328, type: !836, isLocal: true, isDefinition: true)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 176, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 22)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "__pyx_k_append", scope: !2, file: !21, line: 2305, type: !796, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "__pyx_k_cline_in_traceback", scope: !2, file: !21, line: 2329, type: !810, isLocal: true, isDefinition: true)
